{"name": "Phoenix", "description": ["Referred to as \"LA without the Pacific,\" Phoenix combines high-end shopping, a flourishing restaurant scene and resort life in the Sonoran Desert. Instead of golden beaches and palm trees, you'll encounter vibrant red mountains and cacti-lined boulevards. Phoenix's setting is so attractive that the one-time ranch town has morphed into the fifth most populated city in the U.S. And with the development of palatial resorts, hundreds of golf courses, a burgeoning bar scene and attractive room rates, you'll see why this city has become a popular refuge for snowbirds, families and 20-somethings alike.", "While world-renowned spas and shopping centers draw elite clientele with money to spare, \"The Valley of the Sun,\" also lures adventurous travelers with its unique desert landscape and numerous hiking trails. Spring, winter and fall visitors spend most of their time outdoors, soaking in the rays on the links, on the mountains, on the tennis courts or in the pools. The diversity of the suburbs (Scottsdale, Mesa, Tempe and Glendale to name a few) means there's an assortment of hotels and activities for every budget. What's more, Phoenix is a convenient jumping-off point for some of the best Arizona tours, including exciting all-terrain vehicle rides through the desert. Phoenix may not have the glitz and the seaside boardwalk of Los Angeles, but you'll find yourself hardly wanting those elements when you relax poolside before your afternoon hike or massage.", "The best time to visit Phoenix is November through April, when you'll see blue skies with highs in the upper 60s, 70s and low 80s. But whenever you visit, keep in mind this desert city's seasons are hard to determine. The leaves don't change colors in fall, nor will flowers blossom in the spring. You will notice differences in temperature, however, particularly in the toasty summers when highs average above 100 degrees Fahrenheit. If you can bear this dry, formidable heat, you can take find great deals at luxury resorts.", "Day trips are key Phoenix is in the center of Arizona, which makes it a great home base for day trips to popular places like Sedona and the Grand Canyon. Signing up for one of the best Arizona tours is a great way to enjoy a day trip with the expert guidance of a local.", "Cars do burn You'll be racing to your car to turn on the AC in the scorching summer. But keep in mind, if it's 110 degrees outside, your door handle is at a temperature well above that.", "Be prepared to hike If you're planning to conquer Camelback Mountain, come prepared with sturdy hiking shoes, lots of water and plenty of sunscreen. The City of Phoenix offers helpful reminders on its website for those thinking of tackling this strenuous hike.", "Consider summer vacations The climate is difficult for most to handle, but you'll be amazed at the savings on hotel rooms, restaurants and even rental cars. Do as the Phoenicians do: Go outside only in the mornings and evenings, and choose a car with quality air conditioning.", "Consider bringing your own supplies Resort life is already expensive, but petty rental fees for tennis rackets and golf clubs can bust your budget. Bring your own equipment. Bringing your own car isn't a bad idea either.", "Consider where you shop Phoenix has some amazing shopping venues – indoors and outdoors. Various parts of town host different shops with different prices. Popular Scottsdale will be on the high-end.", "With hundreds of restaurants serving cuisine from all over the world, Phoenix is a great destination for foodies. However, the city is best known for its Mexican eateries; sitting only a few hours north of the border, it's difficult to resist the enticing aromas that pour out of Phoenix's popular Mexican restaurants. Whether your taste buds are craving traditional breakfast burritos or Mexican sushi, you'll find it in the Valley of the Sun. If you're looking for an elevated take on traditional Mexican, you can't go wrong at Barrio Cafe Gran Reserva, according to recent diners. For a more casual meal, try Joyride Taco House or Tee Pee Mexican Food – a family-owned eatery that's hosted visiting celebrities and politicians alike. Phoenix's numerous cowboy-style steakhouses are also not to be missed. These family-friendly eateries offer generous portions along with live entertainment in a Wild West atmosphere.", "If you're looking for fine dining, you're also in luck – the area hosts many renowned restaurants that serve a variety of cuisines, including Tratto (Italian), FnB (farm-to-table) and Kai (Native American), among many, many others. More than a few Phoenix-area chefs have earned James Beard awards. Some such chefs include Beau MacMillan, executive chef of elements restaurant in Scottsdale; Chris Bianco, owner of Pizzeria Bianco; and Vincent Guerithault, head chef and owner of Vincent on Camelback. ", "Although you can find great dining throughout the city, many top-notch restaurants are located along the Camelback Corridor in Scottsdale. No matter which restaurant you choose, it's best to make reservations in advance – especially during the winter months – to avoid long waits. ", "Phoenix is a relatively new and constantly expanding metropolis. Although crime rates are not excessively high, you should still take extra precautions. Make sure to always lock your car doors, and keep valuables hidden from plain sight. ", "There's a reason why it's called the Valley of the Sun: The Phoenix Metropolitan Area sees more than 300 days of sunshine every year, and its desert climate means the air is hot and dry. Visitors unaccustomed to this type of weather often suffer from heat stroke and dehydration, the symptoms of which include nausea, fatigue, headache and dizziness. To avoid heat stroke, drink plenty of water and wear a hat to shade your face. If you're hiking or biking in the mountains, take regular breaks. You should also apply sunscreen on a regular basis to avoid getting burned. Always carry sunglasses, especially when you are driving around sunrise or sunset: Wearing them will help improve your visibility and prevent an accident.", "The desert is home to some creepy-crawlies for whom you should keep an eye out, particularly rattlesnakes and scorpions. It's unlikely you'll encounter these creatures within the city — or that you'll have problems if you do — but it's still wise to be extra cautious when out on the trails. If you're bitten or stung, seek medical attention immediately.", "The best way to get around Phoenix is by car, especially as this ever-expanding metropolis rests neatly on a grid. A car is a necessity to reach the spread-out attractions, your hotel and restaurants – not to mention the Phoenix Sky Harbor International Airport (PHX). A car will also come in handy if you're planning to take daytrips to nearby hot spots, such as Sedona. Plus, there are plenty of scenic drives within a short distance of downtown, such as Doobins Lookout and the Piestewa Freeway.", "Walking outside for more than a few blocks is an easy way to be identified as a tourist. Smaller public shuttles, such as the Scottsdale Trolley and Downtown Area Shuttle, however, are useful to traverse those specific areas."]}