{"name": "The Finger Lakes", "description": ["According to Native American legend, the 11 glacial lakes that comprise this region in central New York are evidence of the Great Spirit leaving his handprint as a blessing on the area. Thus, the region's freshwater lakes carry Native American names like Skaneateles, Keuka, Cayuga and Seneca. Today, this 9,000-square-mile area is a year-round outdoor playground and home to a burgeoning wine country that's been compared to Napa Valley. ", "In addition to an abundance of boating, fishing and water sports, the Finger Lakes offer challenging hikes through stunning state parks that boast dramatic rocky gorges and cascading waterfalls. But the region also provides plenty of opportunities for relaxation, with scenic drives through wine and farm country. If it's culture you're after, the area has you covered there, too: It's home to the Corning Museum of Glass, The Strong International Museum of Play and the George Eastman Museum.", "The best time to visit the Finger Lakes region is from May to September, when there are plenty of opportunities to take advantage of the area's outdoor pursuits. Expect higher accommodation rates in the peak months of June to August and longer lines at attractions and wineries. Fall foliage also draws crowds, so try to visit on weekdays. Even in the summer, temperatures vary through the day with cool mornings and evenings and daytime highs in the 70s and 80s. You'll want to layer with some long-sleeved shirts, light sweaters and jackets, and pack comfortable shoes. If you're planning to visit the Finger Lakes in the winter (which makes for a cozy escape), a travel insurance policy is recommended as this region is known for its lake-effect snow.", "Get a designated driver To fully enjoy a day of wine tasting, plan to sign up for a tour that provides transportation so you don't have to worry about getting behind the wheel.", "Book accommodations in advance During popular seasons like summer and fall, the area's small inns and bed-and-breakfasts fill up quickly, so plan to book as much as a year in advance.", "In addition to its many wineries, the Finger Lakes region is home to a vast array of farms, making it a great place for farm stands and farmers markets. The Ithaca Farmers Market offers five weekly markets during growing season (June to October), the largest at Steamboat Landing and additional markets at Dewitt Park and East Hill Plaza. Visitors can pick up fresh food for a picnic to enjoy at the many lakes and parks. ", "Ithaca also claims to be the birthplace of the ice cream sundae – created in 1892 by the local reverend and the pharmacy owner after a church service (thus the name \"sundae\"). Visitors can enjoy versions of this local favorite at several local ice cream shops, including Purity Ice Cream and the Cornell Dairy Bar.", "Other iconic regional dishes include salt potatoes (it's exactly as it sounds) and Dinosaur Bar-B-Que in Syracuse, Cornell chicken (a vinegar-based barbecue poultry version invented by a former Cornell professor) at Jim's BBQ in Candor and spiedie sandwiches filled with grilled pork cubes at Sharkey's in Binghamton. And with the abundance of water in the region, you'll want to try a local fish fry: Doug's is a local hot spot with locations in both Cortland and Skaneateles.", "If it's farm-to-table cuisine you're after, try restaurants like the Hazelnut Kitchen in Trumansburg or Veraisons at the Glenora Wine Cellars in Dundee, who work with local purveyors.", "The best way to get around the large Finger Lakes region – a 9,000-square-mile area that encompasses 14 counties – is by car. Although cities like Rochester, Syracuse, Ithaca and Seneca offer public transportation, there isn't a system that serves the entire rural region. Major cities are accessible by bus lines (such as Greyhound), train and air. The three international airports in Buffalo, Syracuse and Rochester are all served by several major airlines and the regional airports in Ithaca and Elmira welcome flights from Allegiant, Delta Air Lines, United Airlines and American Airlines. "]}