{"name": "Rehoboth Beach", "description": ["This quaint, 1-square-mile city is a popular getaway for those stationed along the Mid-Atlantic coast. Home to about 1,500 permanent residents, Rehoboth Beach swells in the peak summer season to a population of more than 25,000. The town was originally settled as a religious camp in the 1870s, with the boardwalk taking shape around 1879. Then came a railroad and paved highway, and beginning in the 1920s, the area became a retreat for the elite of Washington, D.C., earning it the nickname the \"Nation's Summer Capital.\"", "While the area's main attractions – the clean shoreline and the mile-long boardwalk – are the same as when politicians and diplomats first descended on the area decades ago, this small city now attracts just about everyone: from families on summer vacation to a large and thriving LGBT community, as well as vacationers just looking for a laid-back locale to soak up some sun.  ", "The best time to visit Rehoboth Beach is between May and August. The area bills itself as a year-round destination, but it shines the brightest in the summer months when visitors and locals alike can take full advantage of the beach and boardwalk. Summer sees the largest crowds and hottest temperatures (hovering in the mid- to upper 80s), but it also welcomes a rain shower or two. After Labor Day, travelers will find fewer crowds and fairly pleasant fall temperatures, ranging from the upper 50s to the upper 70s. Although visitors will likely score lower room rates, some attractions, including, Funland and Jungle Jim's, will be closed or operate on more limited hours after the summer season. Delaware sees mild winters, with temps dipping to the low 30s. ", "A large part of Rehoboth Beach's culture is tied to the LGBT community, and has been since the 1970s. Today, many businesses along the boardwalk are owned and operated by members of the LGBT community. In fact, many travelers and experts consider it one of America's best gay-friendly beaches. Though certain areas of the beach are known to be more popular with certain groups (North Shore primarily sees lesbians, while Poodle Beach, just south of the boardwalk, is popular with young gay men), members of all genders and sexual orientations are welcome everywhere. The same goes for nightlife establishments: though many cater specifically to the LGBT crowd, all are welcome and treated with respect. ", "Most restaurants are concentrated along Rehoboth Avenue and the boardwalk. Cuisine ranges from seafood (you are at the beach, after all) to pub food (think burgers and fries). If you're looking for more upscale menus, check out the new American creations and farm-to-table specialties at establishments like Shorebreak Lodge, Blue Moon and The Pig & Fish. Another standout spot on Rehoboth Avenue: a brewpub location of the nationally known Dogfish Head Brewery. You'll find it just about a mile from the beach.", "If it's seafood you're after, consider grabbing a table at Henlopen City Oyster House or FINS Fish House & Raw Bar. Those traveling with children (or anyone with a picky appetite) should head to Louie's for pizza, Frank & Louie's Italian Specialties or Grandpa Mac for, you guessed it, macaroni and cheese. After a long day in the sun, cool off with some homemade creations from The Ice Cream Store.", "And if you're staying at a rental property equipped with a kitchen, take advantage of the fresh local seafood and the popular Rehoboth Beach Farmers Market to create your own meals at home. The farmers market is held every Tuesday from noon to 4 p.m. from May to November. The market is located less than 2 miles west of the beach in Grove Park (off of Rehoboth Avenue).", "The best way to get around Rehoboth Beach is on foot. Although you'll need a car to get here (the closest major airports are in Baltimore, Philadelphia and Atlantic City, New Jersey), once you arrive you'll find navigating within the 1-square-mile city easiest on foot. However, if you plan to check out sites like Cape Henlopen State Park or the Tanger Outlets, which are located outside city limits, having a car will make it much easier to explore beyond the beach. The city also offers public transportation options, though many only available from Memorial Day to Labor Day.", "Rehoboth Beach is served by a few airports. Atlantic City International Airport (ACY) is located about 70 miles north, but you'll have to take the Cape May ferry to reach Delaware. Philadelphia International Airport (PHL) and Baltimore/Washington International Thurgood Marshall Airport (BWI) are both about 113 miles to the north and west, respectively. The smaller Salisbury-Ocean City Wicomico Regional Airport (SBY), about 42 miles southwest, is the nearest airport, though it offers limited service. Rental car services are available at all the airports."]}