{"name": "Tibet", "description": ["Tibet is a region in conflict. To the Chinese, Tibet is an autonomous region part of their country, but to Tibetans, they are (and hope to become again someday) an independent country. The details of this clash are subjective, depending on who you ask, but since China's invasion into Tibet in the 1950s, Tibet has never been the same. Since then, assimilation has been heavily resisted, the Dalai Lama – Tibet's spiritual and political leader – has gone into exile (and has remained so for about 50 years) and locals continue to cling tight to a culture that has been systematically fading away for decades. Some Tibetans have gone to extremes to get the world to notice, and people have been listening.", "Part of Tibet's draw is no doubt seeped in its political struggles, but the region is so much more than its conflict with China. Beyond the history and the headlines lies a beautiful land rich with culture and natural splendor unlike anywhere else in the globe. Tibet lies on the highest plateau in the world, earning it the nickname \"the roof of the world.\" Here, you'll find the highest everything, including mountains (Everest is here), lakes, roads, railways (the Qinghai-Tibet Railway) and even post offices (found at Mount Everest Base Camp). This altitude dictates Tibet's day to day, but not as much as its namesake religion. Tibetan Buddhism is the foundation of Tibetan culture, and locals' dedication to their faith is nothing short of inspiring. Observing this spiritual devotion is tantamount to understanding Tibet and its people. So while here, don't interject what you know but seek out what you may not and you'll surely be, as the Buddhists themselves say, enlightened.", "The best time to visit Tibet is from June to August. Situated high on a plateau, Tibet experiences low temperatures and frost for the majority of the year. Summer is the only time where temperatures hover in the 70-degree range during the day. Plus, oxygen content is the highest in the summer, making it easier to acclimate to the altitude. Spring and fall are also good times to visit if you're looking to beat the summer crowds, but expect chilly, winter-like nighttime temperatures. On the upside, spring and fall provide better visibility than the summer months if you've come to see Mount Everest. Winter is characterized by freezing temperatures. And roads to the mountains and other remote attractions can be closed off due to the elements. Plus, entry permits are not given to foreign visitors from February to March and sometimes to early April.", "The most important thing to know about Tibet's culture is that it's dominated by religion. So much so that the Dalai Lama, who is the head monk of Tibetan Buddhism, is traditionally in charge of Tibet's government. Today, that is no longer the case. The current Dalai Lama (there have been 14 over the course of history) no longer rules Tibet, but instead lives in exile in Dharamsala, India. This has to do with China's incorporation of Tibet. It's important to know that this is a hotly contested issue among the Tibetans and Chinese. And depending on who you ask, you may get different stories.", "For Tibetans, their land and culture was taken from them by China. Soon after Mao Zedong and his communist party drove out China's former nationalist party and established the People's Republic of China, Tibet was invaded. Whether or not Tibet was a truly independent country prior is subject to debate, but the invasion by China changed the region's way of life forever. In 1950, troops were sent in by the thousands from China. The army not only defeated the smaller Tibetan army but occupied a large portion of the country, leaving Tibetan leaders, including the current Dalai Lama, with no choice but to agree to their terms. In 1959, Tibetans revolted as a response to China suppressing their culture and religion. Thousands ended up dying in the clash and as a result, the Dalai Lama fled.", "Today, Tibetan culture is still suppressed. Schools no longer teach in Tibetan, and while Tibetans are still able to practice their religion, everything remains closely watched (there are security cameras placed on the streets of Lhasa). Merely possessing an image of the Dalai Lama could result in arrest. And one of the reasons Tibet's borders are closed from February to the end of March or beginning of April is due to the anniversary of the 1959 revolt, which falls on March 10th. As a traveler, bringing the Tibetan flag or any kind of material about the Dalai Lama or Tibet's contentious history with China into Tibet is not recommended. Even Tibet guidebooks, including Lonely Planet guidebooks, have been known to be confiscated upon entering the region. Despite the restriction on language in schools, Tibetan is still widely spoken in the region. However, Tibetans don't have their own currency, instead they use the Chinese yuan. Be sure to check the conversion rate before you go, as it often fluctuates. ", "Tibet is not a foodie destination, but there are still some signature dishes and drinks from the country's cookbook that will certainly enhance your cultural experience. First, it's important to know that Tibet's mountainous terrain yields a very hearty diet. You won't find many vegetables or fruits here, as they have trouble growing in Tibet's dry, wintry environment. Instead, locals feast on meat, dairy, starches and stews. The most important dish in Tibet is momo. Momo are dumplings filled with everything from beef to yak's cheese and are loved by locals. Oftentimes, parties are thrown just to eat momo. Noodles and barley dishes are also a big staple in the Tibetan diet as well and, despite China's influence, you won't see a whole lot of rice here.", "Yak is another big part of the Tibetan diet. Tibet is full of yaks, and along with providing photo ops for tourists, they are used to make cheese, butter and meat. Momo can also be stuffed with yak meat, and yak jerky is a popular snack. Another very popular snack is tsampa. Tsampa may be a bit strange to the western palette. Tsampa is roasted barley flour mixed with butter tea, dried dri cheese (dri is the name of a female yak) and often sugar. The ingredients are mixed into a dough but remain uncooked. The snack is known for being very powdery and as such, can cause a coughing fit. Be sure to not inhale before eating tsampa. ", "As for the signature drink of Tibet, that's butter tea. Butter tea is made with yak butter, barley powder and milk curds. The tea acts as fuel for nomads braving the cooler temps in the more remote regions of Tibet. But it's not just for the nomads, you can find butter tea all over. On Lhasa's Barkhor Street, you'll find tea houses and restaurants serving butter tea. Because of all its use of dairy and meat in its dishes, vegetarians and vegans may have a hard time eating in Tibet.", "Tibet is pretty safe for tourists. That's because the Chinese keep a very watchful eye on Tibetans. Not only are there security cameras all over Lhasa, but guards patrol the city. Some don't even wear uniforms while on duty. There are also numerous checkpoints situated throughout the region's highways. There have been some reports of pickpocketing in Lhasa but overall, theft is not common. However, travelers may encounter political protests from Tibetans. If you do, follow the instructions of your tour group leader. While visiting, don't talk politics or bring any kind of material about the Dalai Lama or Tibet's history. Consult the U.S. State Department's website for updates on any potential threats and consider enrolling in the Smart Traveler Enrollment Program (STEP) to receive security messages.", "The best way to get around Tibet is with your tour group. Due to the provisions of Tibet's travel permits, all forms of transportation around Tibet must be prearranged through a tour group. If you want to venture outside of Lhasa, Tibet's main city and tourist hub, you have to apply for an additional permit through your tour company. You are not allowed to travel outside of Lhasa independently.", "Within Lhasa, if transportation around isn't already provided for you with your tour (it usually is), the best way to get around is by taxi, as rates are fairly inexpensive. There are also pedicabs, but due to their reputation for overcharging tourists, they should be avoided. You can rely on your own two feet, but keep in mind that most top attractions in Lhasa are more than a mile apart. Buses are available but can be confusing for foreigners as route timetables are in Chinese.", "Getting to Tibet is also organized by your tour company. Some tours include the price of transport to Tibet, while others only provide instructions for booking. All tourists come into Tibet through Lhasa, accessible via the Lhasa Gonggar Airport (LXA) and the Lhasa Railway Station. To get to either the airport or train station, you must first fly into mainland China. The Lhasa airport can be reached from a number of major cities in China, including Beijing, Shanghai, Guangzhou and Chengdu, the latter of which is the closest major city to Tibet. If your tour operator doesn't already provide transportation to your hotel, you can take a taxi from the airport (about 40 miles south of the city) into Lhasa for between 130 and 300 yuan (around $20 to $45).", "The Lhasa Railway station is closer to Lhasa, making taxi fares more affordable (it will cost you 30 yuan, or around $5 to get into town). However, your journey via train will be a lot longer (from Chengdu, it's more than a daylong trip). If you're willing to endure the long transit time, consider riding the Qinghai-Tibet Railway, the highest railway in the world (more than 13,000 feet above sea level). This 20-hour journey (starting at Xining) is lauded for its scenic route, passing through snow-capped mountains, untouched valleys, and alpine lakes and rivers.", "U.S. citizens must have a passport that is valid six months beyond their departure date to enter China. U.S. citizens are also required to obtain a visa. There are 16 visa categories for foreigners entering China. Your trip will likely fall under the \"L\" category, designated for people visiting China as tourists. In addition to an application, photo and passport, you'll have to provide copies of your hotel and round-trip airline reservations. And depending on where you live in the U.S., you may also have to provide proof of residency for that city.", "Chinese consulates and embassies don't accept applications by mail, email or fax, so if there is a consulate office in your city it's best to just drop it off in person.If you don't live in a consulate city, you should use a visa service like My China Visa, which will deliver the application for you. Visa applications take about four business days to process, but since processing times can vary, the Chinese Embassy recommends that you arrange your visa at least a month before your trip. The cost for a single-entry visa for U.S. citizens is $140. For more information on visa requirements, visit the Chinese Embassy's website.", "Once you've secured your Chinese visa, you need to obtain a Tibet Tourism Bureau permit for traveling to Tibet. Since foreign citizens are not allowed to travel in Tibet independently, your tour operator will be the agency helping you secure your permit and is usually included in the cost of your tour. Keep in mind: Your permit can be checked anywhere in Tibet – at the airport, the train station, your hotel and even top attractions, so you should carry it with you at all times. Allow about two weeks for your tour operator to secure your permit. There are a number of tour operators that travel to Tibet, including National Geographic Expeditions, G Adventures and Tibet Vista, a reputable Tibet-based tour operator. Your tour operator will help you obtain the documents needed for your permit; and you'll need to obtain your permit at least 15 days before your scheduled departure. If you are flying into Tibet, you will need your original permit. If you are taking the train, a copy is sufficient. How you receive your permit varies by tour operator."]}