{"name": "Flagstaff", "description": ["Compared to the desert-urban enclave of Phoenix and resort-filled Sedona, Flagstaff often gets written off as a pit stop – a place to pause on a long road trip to the Grand Canyon. But it shouldn't be dismissed so swiftly. This city of approximately 77,000, in the shadows of the San Francisco Peaks and hemmed in by ponderosa pine forests, exudes a laid-back, outdoorsy charm. Locals, who bike, ski, hike – and enjoy a craft beer or two – infuse Flagstaff with life, and neighboring Northern Arizona University's college students lend the city some youthful energy, too.", "For an easygoing vacation – 7,000 feet above sea level – complete with outdoor excursions, local eats (many of which are priced for college students), and a handful of unique natural attractions, including Walnut Canyon National Monument, Flagstaff should be your vacation destination, not just a stop along the way.", "The best time to visit Flagstaff is between September and November when the summer crowds have dispersed, the trees are alight with color and the weather is crisp and clear. The three months between December and February are popular among winter sports enthusiasts, but Flagstaff typically has very snowy winters, which can make travel difficult. In March, April and May, the city starts to thaw, but this time of year is also known for having high winds. June, July and August are high travel season when visitors descend on Flagstaff to take advantage of the beautiful 80-degree weather. ", "Remember the altitude Flagstaff has a higher elevation than mile-high Denver. Fend off altitude sickness by drinking plenty of water and imbibing alcoholic drinks moderately.", "Flagstaffians are friendly If you have a question, don't be afraid to ask a local. They're a friendly and helpful bunch, probably thanks to their constant release of endorphins (Flagstaffians are also very athletic).", "Visit two national monuments for the price of one Admission to Sunset Crater gets you into Wupatki for free – and vice versa – so you can experience both for one price.", "Take advantage of the outdoors The hiking trails at Mount Humphreys and Mount Elden (both within an hour's drive of Flagstaff) won't cost you a thing to access, and parking at the mountain base is free as well.", "Stare at the skies Flagstaff puts on a brilliant show every night for free. In fact, the city is one of the world's best places to stargaze, as designated by the International Dark Sky Association.", "The dining scene in Flagstaff is influenced, in part, by its college-student cohort. You'll find an array of budget-friendly pizza and burger restaurants scattered near campus, which is located in the center of the city. Students at Northern Arizona University keep a lot of these establishments busy, but travelers should try to drink in the ambiance and the coffee at Macy's European Coffeehouse & Bakery and grab a slice at Oregano's Pizza Bistro – two popular spots near NAU. Other local favorites include Satchmo's for barbecue and Delhi Palace for Indian.", "When it comes to drinks, craft beer is a big deal in Flagstaff. In fact, there's even a Flagstaff Brewery Trail that offers travelers a self-guided walking tour of a handful of the best breweries in the city, including the beloved Mother Road Brewing Company. Wanderlust Brewing Company and Flagstaff Brewing Company are also popular among locals and travelers alike.  ", "The best way to get around Flagstaff is by car. Although there is a public bus that runs regular routes throughout Greater Flagstaff, a personal vehicle will give you the most freedom to explore the best things to do and dining scene on your own time. Although there are pedestrian-friendly areas, such as the Historic Downtown and Railroad District, the city is too spread out to get around on foot alone.", "The Flagstaff Pulliam Airport (FLG) is located about 5 miles south of downtown Flagstaff. The airport is small and welcomes flights from Phoenix Sky Harbor International Airport (PHX), which is the next closest airport about 150 miles south. There are also nonstop flights to Dallas/Fort Worth International Airport (DFW) and Denver International Airport (DEN). From the Flagstaff airport, visitors can take a taxi, rideshare or rental car into the city. The city’s public bus system offers Mountain Line GO!, a $2 shared airport shuttle service that provides service to any location within Flagstaff city limits. Amtrak and Greyhound also operate out of Flagstaff. "]}