{"name": "Salzburg", "description": ["The city that inspired Mozart, Haydn and Julie Andrews continues to enchant. And you too could be susceptible to its spell as you weave through its Baroque buildings and Romanesque archways, hoping to hear the lingering echoes of Mozart's fortepiano or a \"Do-Re-Mi\" from the Trapp Family Singers. Since there's little chance of that, try visiting during one of the city's many festivals or concerts instead, such as the summertime Salzburg Festival. While you're here, take a stroll through the Gothic Festung Hohensalzburg, say a prayer at Dom zu Salzburg or dine on schnitzel and dumplings in the Altstadt (Old Town) district. You'll soon learn that this city is steeped in more than just musical history; it also boasts a majestic arrangement of medieval strongholds and magical palaces and gardens.", "The best time to visit Salzburg is from September to October when summer crowds have tapered off and you can enjoy the beautifully pruned gardens in comfortable temperatures. Although the hills begin to sing and bloom in spring, March and April are still a bit chilly. And summer's gorgeous weather brings increased traffic, temperatures and prices. Winter, though not unbearably cold, will encourage brisk walks through the few gardens that are open. And you'll be right at home if you're a skier, as the surrounding mountains welcome lots of snow. Whenever you go, bring an umbrella as precipitation is common throughout the year.", "It's great for music-loving tourists If you've come to pay tribute to a musical legend, it's best to join the flock of followers on any of \"The Sound of Music\" or Mozart tours that are led by knowledgeable, cheery guides. Panorama Tours is one traveler-approved operator.", "It has Bavarian neighbors If you thought you had great neighbors, think again. With Bavaria (southern Germany) next door, Salzburg gets delicious brews and hearty Germanic food on the cheap.", "The hills are alive Ms. Andrews is right! The surrounding mountains are chock-full of picturesque villages and great hiking trails that make perfect daytrips.", "Use the card The Salzburg Card, that is. Purchase this handy rectangular discount pass from hotel reception desks or tourism offices across the city for free admission to almost every attraction, cheaper rates on excursions and rentals and waived public transportation fees for the duration of your card. You can buy cards valid for 24, 48 and 72 hours.", "Opt for a tour If you elect to not get the Salzburg Card in favor of seeing the sights on your own, choose a tour that will bus you around town and include admission to the local attractions.", "Paying for proximity Salzburg lives off tourism. Therefore, food and shop prices will be higher closer to the city center and main attractions. For less expensive (and perhaps more authentic) Austrian cuisine, head farther away from Old Town.", "Because of Austria's proximity to Germany, Salzburg's official language is German. However, since most Austrian schools teach English as a second language, most English-speakers can get around Salzburg without experiencing much of a language barrier. But should you require a little help, consider bringing a German dictionary or ask a local for assistance.", "Like other Austrian cities, Salzburg has several customary practices that are important to remember during a visit to the region. When greeting someone, shake their hand and say \"gruss Gott\" (greet God) or \"gruss dich\" (greet you). And when dining, wait until after a toast is given – such as \"guten appetit\" (enjoy your meal) – before you start to eat.", "Additionally, it is important to understand when tips are applicable in Salzburg. Much like other European countries, Austria includes gratuity in all dining bills. However, if you feel you received good service, add an additional 10% (or round up to the nearest euro) onto the bill total. When taking a cab, tips are expected, so give an extra 10% above the meter fare. And for hotel bellhops and porters, it is customary to give up to 1 euro (about $1) per bag.", "Foodies will find plenty to sink their teeth into during their time in Salzburg. Here in the city of Mozart and \"The Sound of Music,\" travelers can find a wide array of eateries and breweries, which range from affordable coffee shops and casual bites to pricier Michelin-starred restaurants and fine dining establishments. Salzburg has many gourmet restaurants within its city limits. As a result, diners can indulge in plenty of top-notch Austrian and German food – which consists of hearty soups, dumplings and stuffed pastries – while visiting Salzburg.", "For those on a budget, there are plenty of affordable options. To start, coffee lovers should check out 220 Grad, which roasts all the coffee it serves in-house alongside an assortment of cakes, crostini and small bites. And if you're in need of some authentic Austrian and German comfort classics, grab a bite at Zum Zirkelwirt. The restaurant's menu includes traditional dishes like Wiener schnitzel (fried pork cutlets), gulasch (the Austrian take on Hungarian goulash served with bread), rindsuppe (beef soup with dumplings or pancakes) and marillenknödel (apricot dumplings).", "Diners who are willing to spend a bit more coin cannot leave Salzburg without visiting the Michelin-starred Esszimmer. Previous visitors rave about the three-course lunch menu offered here, which features rotating offerings like goose liver pate, halibut and beetroot ice cream alongside recommended wine pairings. Another Michelin-starred option is Restaurant Ikarus, which was established by Red Bull founder Dietrich Mateschitz.", "The best way to get around Salzburg is on foot and by public transportation. Many of the city's attractions are found in the Altstadt neighborhood, which means many are within walking distance of one another. For short distances, bicycling is a viable option as well. Within the city, fiakers, or horse-drawn carriages, offer a novel – if less economical – way to get around. There are plenty of taxis available throughout the city as well. But if you're interested in venturing outside of the historic city center, Salzburg's BusTaxi and railway are ideal. And for getting to and from Salzburg Airport, bus routes Nos. 2 and 10 routinely stop at the airport and near Altstadt. Regional bus fares start at 2.10 euros (about $2.25) per ride if purchased from the bus driver, while a fare between the airport and Altstadt will cost 2.50 euros (about $2.70). A taxi trip from the airport to the center of town will cost approximately 12 euros (around $12.50).", "For visits up to 90 days, U.S. citizens do not need a visa to enter Austria. If you plan on staying longer, proper visa documentation – which can be obtained from the Austrian Embassy – must be completed prior to departure. A passport that is valid for at least six months after your return is required for entry. For more entry and exit requirements, including current COVID-19 advisories, visit the U.S. State Department's website.", "Although there's plenty to see and do during the summer months, once the temperatures drop and snow falls, Salzburg transforms into a picturesque winter wonderland."]}