{"name": "Knoxville", "description": ["Tennessee's third-largest city, and the site of its first capital, often flies under the radar, but once visitors get acquainted with the historic and charming Knoxville and its accessible downtown, as well as its proximity to the Great Smoky Mountains, they often become fans. One of Knoxville's most famous landmarks is the gleaming Sunsphere, a 266-foot-tall, gold-tinted tower built for the 1982 World's Fair. Now an observatory, located in the World's Fair Park, it's just one of the city's many attractions.", "Downtown Knoxville is full of interesting independent shops and restaurants, many radiating out from popular Market Square. The Tennessee River runs alongside downtown, so many locals and visitors get out on the water by kayak, canoe or river boat cruise. Historic attractions abound, especially Civil War sites, battlegrounds and homes. Furthermore, friendly residents with a genuine welcoming attitude, lots of green spaces, tasty southern cuisine and an-easy-to-navigate downtown make Knoxville an appealing city to visit.", "The best time to visit Knoxville is March through June and September through November. While Knoxville experiences four distinct seasons, the beautiful dogwoods in spring and the bright foliage in the fall make visiting during these months especially appealing. Summer can get quite warm and is the busiest season for tourism in Tennessee, which leads to higher hotel prices. While fall can be a great time to visit because of the cooler temperatures and beautiful fall foliage, be aware that hotel prices are very high on those weekends when the University of Tennessee is playing home football games. Winter is typically pretty mild, though can get chilly, making it a less popular time to visit, which can lead to lower room rates.", "Find live music Nashville and Memphis aren't the only cities in Tennessee with a great music scene. Knoxville has several venues to catch a live show, including The Mill & Mine and Boyd’s Jig and Reel.", "Get on the river The Tennessee River waterfront is a main feature of downtown, so there are plenty of opportunities to get on the water. Try canoeing, kayaking or cruising on a paddlewheel riverboat.", "Visit free attractions Knoxville has so many free attractions, from the museums to botanical gardens, you can easily enjoy some of its best offerings without paying a cent.", "Listen to the music Make time for the WDVX \"Blue Plate Special,\" a live performance radio show held at noon at the WDVX studio inside the Knoxville Visitor Center Monday through Thursday and on Saturday. On Friday, \"The Big Plate\" is at Barley's Taproom and Pizzeria on Jackson Avenue. Local and even some nationally known musicians perform everything from bluegrass to Celtic music.", "Downtown Knoxville's dining scene ranges from popular food trucks to gourmet cuisine created by award-winning chefs. A great place to start is Market Square, which offers plenty of fine dining establishments, several rooftop bars and a handful of casual dining spots.", "Nearby Gay Street is known for its fine dining – including a mix of international cuisines like Latin, Asian, Mediterranean, French and more – interspersed with spiffy bars and ice cream shops. In the Old City district, you'll find gourmet Southern fare, seafood, fondue, as well as drinking establishments that range from beer joints to fancy cocktail bars.", "Downtown North is known for its coffee shops as well as its many breweries and even some first-class bakeries. Across the river in South Knoxville is another concentration of popular breweries, as well as a newly opened food hall with more than 20 different restaurants.", "As for what classic foods to try while you're here, barbeque is most everyone's favorite, including both pulled pork and pork or beef ribs. Fried chicken, country ham and soul food are also good choices, as are other classic southern fare like grits, fried green tomatoes and collard greens. Southern biscuits (with sausage gravy) are a staple, as is cornbread.", "The best way to get around downtown Knoxville is on foot, though if you want to travel farther afield (like to Great Smoky Mountains National Park), you'll need a car. Knoxville's McGhee Tyson Airport (TYS) is the closest airport to Knoxville and is located just 12 miles from downtown. There are several car rental agencies at the airport, as well as taxi and ride-hailing options, such as Uber and Lyft. If you choose to rent a car, you'll find that there are plenty of free places to park around the city. Keep in mind: There is no public transportation option that will take you from the airport into downtown Knoxville."]}