{"name": "Catalina Island", "description": ["Situated 22 miles off the Southern California coast, Catalina Island offers a captivating blend of natural beauty, outdoor adventure and laid-back island culture. A short ferry ride transports you to this idyllic getaway where time slows down and worries fade away.", "On Catalina Island you will discover pristine beaches, crystal-clear waters and rugged landscapes perfect for hiking, biking and kayaking. Dive into an underwater wonderland through snorkeling or scuba diving adventures or embark on a semisubmersible submarine tour. Catalina offers a variety of activities to satisfy every adventurer's spirit, including zip lining, parasailing and off-roading excursions.", "You can also opt to simply stroll through the southern town of Avalon, explore its rich history at the museum or dip your toes in the sand at the Descanso Beach Club. Venture to Two Harbors on the other side of the island for a slower and more rustic experience. You'll fine hiking trails to explore during the day and campgrounds when it's time to bed down at night. You can stargaze to your heart's content here, or sway in a hammock while overlooking the ocean.", "The best time to visit Catalina Island is during the fall months, particularly September and October. The weather is still warm and sunny, but the crowds have thinned. You'll still find lush hillsides and water still warm enough for swimming. There are also several fun events happening in the fall, including the Catalina Film Festival and Oktoberfest.", "Getting there Catalina Express operates daily ferry service to Avalon from San Pedro, Long Beach and Dana Point, and to Two Harbors from San Pedro. If you're traveling from Newport Beach, you can take the Catalina Flyer. Trips range from 1 to 1.5 hours.", "Try the buffalo milk No, it doesn't come from a buffalo. Buffalo milk is a creamy, boozy cocktail, often described as a tropical White Russian. The drink is a signature on the island, and you'll find it on menus all over. Don't miss a chance to try this delicious local specialty.", "Navigating the island Only businesses and a limited number of residents are allowed to have cars, so the main forms of transportation are golf carts and bicycles. There is one taxi company and COAST, a shuttle service that uses electric vehicles. Learn more on the tourism authority's website.", "Stay the night Catalina has so much to offer, and it's best to stay the night rather than just a day there. Many hotels offer \"Second Summer\" promotions where you can stay three nights for the cost of two in the fall. Prices are valid from Sunday through Thursday.", "Budget adventures There are many ways to explore Catalina for free or at a low cost, including taking a scenic hike along the Hermit Gulch Trail or strolling through Avalon.", "BYOB If you plan to cycle around the island, you can skip rental fees by bringing your own bike on the ferry. You'll pay just $20 to stow your bike on board.", "Just ask It may not work all the time, but many businesses offer an island discount to savvy travelers when booking activities or accommodations. You'll have the best luck during the off-season between November and April, so it's definitely worth it to ask."]}