{"name": "Tel Aviv", "description": ["Don't get confused, Tel Aviv is definitely not Jerusalem. Although they're less than 50 miles apart, Tel Aviv lacks the historic significance of the Holy City. In place of religious sites and ancient ruins, Tel Aviv features world-class beaches and rip-roaring nightlife. Tradition in Tel Aviv consists of Friday night revelry rather than quiet reflecting, and kosher cuisine is overshadowed by a wealth of international culinary delights.", "Tel Aviv's love of the arts and culture shines through it's fantastic (albeit few) museums. If you've come to see the sights though, you won't need more than a couple of days here. The purpose of your visit shouldn't be to just see Tel Aviv, it should be to fully experience it. Once you've had your fill of museum hopping, let yourself fall into the rhythm of this modern Mediterranean metropolis. Devote your days to lounging on its beaches or meandering through the streets of Jaffa. And when night falls, allow yourself to be swept up by the luring hum of club music and the nonstop flow of cocktails.", "The best times to visit Tel Aviv are March through April and September through November. Spring and fall mark this city's \"sweet\" tourism spots, boasting pleasant temperatures and affordable prices. Despite the intense heat, most travelers head to Tel Aviv during the summer months, determined to hit the beaches and return home with a tan. Between May and August, expect inflated prices. The winter months also see a spike in tourism as travelers from northern countries (particularly in Europe) come to thaw.", "Tel Aviv is a laid-back city where people from all walks of life come to share a beach umbrella or a cafe table. Here, the Sabbath is more commonly celebrated with a night out on the town rather than an evening of prayer.", "This freewheeling debauchery wasn't necessarily the ambition of the Tel Aviv's founders. The city came to life in the early 1900s when a small group of Jewish people migrated north from the cramped living conditions of Jaffa, which was a predominantly Arab town at the time. In 1921, riots in Jaffa drove roughly 40,000 inhabitants to the tiny settlement, while the outbreak of World War II caused another large influx of residents. To accommodate the rapidly growing population, Tel Aviv underwent an extreme expansion, both outward and upward. Today, the city is characterized by modern skyscrapers and wide boulevards.", "This is a very diverse city because its residents come from all corners of the globe. Strolling down the street, you'll come across a variety of people and cultures, which range from Orthodox Jews to Arabs to European expats. Hebrew and Arabic are the dominant languages here, but the majority of people you'll interact with here speak English as well.", "The Israeli new shekel (commonly referred to as the Israeli shekel) is Tel Aviv's official currency. One shekel is divided into 100 agorot (singular is agora). Money can be changed in small exchange bureaus, banks or hotels. (Most banks are only open Sunday through Friday until noon, then again from 4 to 6 p.m. on Sundays, Tuesdays and Thursdays.) One shekel is equal to approximately $0.30, but the shekel to dollar rate often fluctuates, so check the latest exchange rate before you go. Major credit cards are also accepted in most transactions (excluding taxis).", "As a city of immigrants, Tel Aviv's diversity has led to an extremely eclectic culinary scene. You'll find crowded cafes rubbing elbows with restaurants that serve everything from Mediterranean specialties to sushi. Must-try delicacies include hummus masabacha (hummus with whole chickpeas, paprika and tahini), kanafeh (Palestinian dessert pastry of cheese that is soaked in syrup) and sabich (eggplant sandwich with tons of toppings).", "For an eclectic Mediterranean menu, head to Night Kitchen, beloved by visitors for its fun ambiance and shareable plates. Plus, Sunday through Thursday the restaurant offers a happy hour special in which everything on the menu is 50 percent off. If you're looking for seafood-focused dishes, travelers suggest you visit Shila – Sharon Cohen’s Kitchen & Bar. For Middle Eastern fare, the trendy Santa Katarina earns favorable reviews for its ever-changing menu and intimate courtyard setting across from a synagogue.", "Kosher options are slightly harder to find in Tel Aviv in comparison to other cities in Israel, but there are several popular options. Falafel Hakosem receives rave reviews from locals and tourists alike thanks to its hummus, falafel, shawarma and sabich. Expect crowds, especially around lunch, for this fast-casual spot. The House of Hummus, which specializes in hummus dishes, is another popular lunch outpost, as is the unassuming Abu Hassan. For a wide variety of cafes, head to the Neve Tzedek neighborhood (Dallal Bakery is a favorite).", "Tel Aviv's varied religious and political affiliations may raise some safety concerns. But while the Israeli-Palestinian conflict may be the subject of heated debates, the city has not been a target of political violence since the 1990s. While visiting Tel Aviv, you should feel completely safe in public areas. However, remember that this is a big city: Keep an eye on your valuables and avoid walking alone at night, especially in unfamiliar areas.", "The best way to get around Tel Aviv is by bike. The city is relatively flat, and many of the top attractions are located fairly close to one another, making it easy to navigate on two wheels. Buses run frequently (although less so on Fridays and Saturdays during the Sabbath) and offer an affordable way to get from downtown Tel Aviv to neighborhoods like Jaffa. For cheap (albeit slow) transportation to Ben Gurion International Airport (TLV), located about 11 miles southeast of downtown, you should rely on the train. You can also take a taxi or bus from the airport; you'll get into town more quickly in a taxi, but you'll pay much more than you would for the bus. Ride-hailing services, such as Uber, also service the city, but they only call licensed taxi drivers.", "The Israeli government does not require your passport to be valid for at least six months after your arrival, but many airlines do. You will also need to show a return or onward ticket and sufficient proof of funds to enter the country. Expect heightened security screenings at the airport; the Israeli government has been known to deny travelers entry based on background checks. The government will also deny entry to anyone looking to travel to the West Bank or Gaza. You can learn more by visiting the U.S. State Department website."]}