{"name": "Chilean Patagonia", "description": ["With its aura of remote romance, wind-whipped Chilean Patagonia attracts those travelers with an eye for beauty and a zest for adventure. Icy glaciers plunge into emerald lakes; wild fjords snake through hardwood forests; and the Andes' dramatic peaks ascend into swirling clouds and mist. It's hardly surprising that Chilean Patagonia's fabled lands have lured Magellan, Darwin, and even Butch Cassidy and the Sundance Kid. Spend a day getting acquainted with the quirky Magellanic penguins congregating on Isla Magdalena. Then, continue south for jaw-dropping views of Tierra del Fuego's sky high mountains, pristine glaciers, and verdant forests. When you're ready for some R&R, retreat to your cozy lodge to get energized with some fresh Patagonian air and a hearty supply of seafood and wine.", "With so much to see and do, getting oriented in Chilean Patagonia can be a challenge. The territory's incredible size (consuming Chile's lower third) and diverse landscapes force you to be selective about where you explore. There are three distinct regions. In the north, the awe-inspiring Lake District extends from Puerto Montt to Aisén. The Southern Coast, a 620-mile strip of land, sits between the Lake District and Southern Chilean Patagonia. This southernmost region includes Puerto Natales, Punta Arenas, and Tierra del Fuego—three noteworthy places. You may not see everything, but be sure to take in the rugged spirit of this breathtaking natural setting.", "The best time to visit Chilean Patagonia is November to early March (summertime in the southern hemisphere). Although you'll compete with heavy crowds during this peak season, the weather is ideal for exploring Torres del Paine National Park and Tierra del Fuego. September, October, and November (spring) welcome colorful blooms, while March, April, and May (fall) usher in autumnal hues. Both times of year experience mild temperatures and fewer crowds. Avoid visiting between June and August (winter), when most attractions close and Southern Chilean Patagonia empties out. No matter when you visit, remember to pack layers and a sturdy windbreaker to shield yourself from Patagonia's chilly year-round winds.", "There are two southernmost cities While Argentineans often cite Ushuaia (Argentina) as the world's southernmost city, Chileans say the title goes to their own Puerto Williams.", "Border-hopping is easy If you don't mind waiting in a long line, it's relatively easy to pass from Chile to Argentina at one of the three border crossings.", "Prepare for wind The gusts are strong at the tip of South America. In extreme conditions, car windshields have been known to crack. Arm yourself with the appropriate gear and a windbreaker, before heading to Tierra del Fuego and Cape Horn.", "Come during the shoulder seasons Visit between September and November (spring) or between March and May (fall). You'll capture spring blooms or autumnal foliage, mild temps, fewer visitors, and reduced hotel rates.", "Pick up a car in Punta Arenas, not Puerto Natales Puerto Natales car rentals are quite steep compared to those in Puntas Arenas. To save extra bucks on your rental, get your wheels at Magallanes' provincial city.", "Pack light Many domestic airlines have weight restrictions, so you'll want to avoid packing more than 22 pounds per person to prevent paying extra fees.", "Chilean Patagonia contains an array of cultures. In Southern Chilean Patagonia, indigenous tribes, like the Tehuelche, live alongside the descendents of 19th-century European settlers, who came during the gold rush. In the Lake District and Southern Chilean Patagonia, sheep ranchers, fisherman, and guachos (cowboys) share charming estancias (rural ranches) and pampas (lowland landscapes) with newcomers. Today, you'll find tourists and locals rubbing elbows as they admire arresting views.", "Although the official language here is Spanish, a growing tourism market has brought English to heavily trafficked spots and popular hotels. Additionally, hotel staff can connect you with an Anglophone guide if need be. Still, it's polite to know a few key Spanish greetings, like \"buenos días\" (\"hello\"), \"por favor\" (\"please\"), and \"gracias\" (\"thank you\").", "Seafood, Cabernet Sauvignons, and Chardonnays are specialties in Patagonia. Along the coastline, particularly in the Lake District, you'll want to sample the daily trout, mussel, crab, or salmon catches. There are also plenty of other options on the menu, ranging from steak and lamb to empanadas and pizza. If you have a sweet-tooth, try one of the region's stone fruits, an ingredient infused in local fruit preserves and jams. As far as dining goes, don't expect to sit down for dinner till around 8 p.m. and plan to linger; dining is a leisurely affair here.", "The best ways to get around Chilean Patagonia are by car or plane. You can explore most areas by car, but you'll end up spending most of your vacation on the road. Unless you plan on visiting for a week or longer, you'll have to pick and choose your destinations within Chilean Patagonia. Numerous airlines allow you to easily hop between cities. You can also sail between cities on a ferry, but sea journeys are often attached to a hefty price tag. Conversely, buses are an affordable way to get around, but they're difficult to navigate and don't reach some must-see attractions.", "To reach Chilean Patagonia, you'll most likely fly through Comodoro Arturo Merino Benítez International Airport (SCL)—located about 30 minutes west of Santiago, Chile—and then take a hopper flight to your desired destination. Consider booking a flight to Punta Arenas Airport (PUQ) as Punta Arenas serves as an excellent base for the region's top attractions. Alternatively, you could also cross into Chile from El Calafate in Argentine Patagonia, but this will take longer.", "A valid passport is required for entry into Chile. U.S. travelers can stay for up to 90 days without obtaining a visa. Travelers arriving into Santiago's International Airport (SCL) will be issued with a tourist card and are required to pay a $140 USD reciprocity fee upon arrival. For more information on entry and exit requirements, consult the U.S. State Department's website.", "You can cross from Chile into Argentina at three different borders: Dorotea Pass, Casas Viejas Pass, and Cancha Carrera. Each border-crossing can be reached from Puerto Natales. Dorotea Pass and Casas Viejas Pass are within 30 miles of Puerto Natales and are open year-round; however, they have varying operation hours throughout the year. Cancha Carrera is open only from December to March and provides travelers with access to El Calafate in Argentina via Route 40."]}