{"name": "Fort Collins", "description": ["Fort Collins is possibly best-known as the home of Colorado State University, but it caters to visitors of all ages, not just the college set. Here, travelers can engage in the outdoor pursuits Colorado is famous for, including hiking and whitewater rafting. Biking is also big here, but it's not just for the trails. Locals usually hop on two wheels to get around the city, which has plenty of bike racks and designated bike lanes. Fort Collins' city-based offerings are just as diverse as its recreation. The city hosts events year-round ranging from foodie-focused festivals to family-friendly concert series. And those who want a taste of Colorado's brews need not worry. Fort Collins' craft beer scene outdoes the one of neighboring Denver, which sits about 65 miles south.", "The best time to visit Fort Collins is from March to October. That being said, for a city that sees about 300 days of sunshine annually, there's not really a bad time to go. Temperatures in the spring and fall range from the mid-50s to the low 70s, making the weather perfect for exploring the great outdoors. Summer temperatures climb to the upper 80s, but Fort Collins' humidity stays pretty comfortable year-round, which means you won't have a problem splashing in the river or Horsetooth Reservoir after a nice hike. From November through February, highs rest in the low to mid-40s. If you travel during this time, you may be treated to some snow, so pack accordingly.  ", "Sample the food Fort Collins boasts more than 70 different food trucks selling everything from waffles to cookies to barbecue to hot dogs. The summertime Food Truck Rally is also a great place to try all your favorites.", "Use Fort Collins as a home base Rocky Mountain National Park, Denver, and Cheyenne, Wyoming, are all within driving distance of Fort Collins. Any of these locations would make a great daytrip.", "It's a college town Colorado State University's campus is about 2 miles southwest of downtown Fort Collins. On-site, there are several museums to explore as well as the school's trial garden, not to mention you can always attend a game during football, volleyball or basketball season.", "Attend weekly events Both the Fort Collins Foodie Walk and the First Friday Art Walk are free events. If you happen to be in town during one of them, you'll have access to a full evening of activities without spending a dime.", "Pitch a tent Horsetooth Reservoir, along with several other parks, have campsites and camper cabins available. If you're willing to rough it, you'll spend a fraction of what you'd pay for a hotel.", "Take public transportation While a car will be useful to get you to surrounding natural areas, rental fees and parking fees downtown can add up. If you'll be sticking around town, try biking or taking the bus. A day pass for riding the bus costs $3 while a seven-day pass costs $10."]}