{"name": "Kennebunkport", "description": ["A politico can tell you that the Bush family has been vacationing on Kennebunkport for years. And a paparazzo might encourage you to camp out along Ocean Drive to snap a blurry photo of the presidential family at their Walker's Point compound. But harboring politicians isn't even what this southern coastal area of Maine does best, nor is it what the town should be known for. Kennebunkport is simple, sea-centric bliss: a natural beach destination with miles of rugged shoreline dotted with summer homes and sailboats. In town, local fisher- and lobstermen deliver the morning's catch to the open-air cafes while artists open up shop on the wharves of Dock Square. Even the beaches are unassuming and quiet, with secret footpaths leading you from the road. Here, you might have literally found the place where you can get away from it all.", "The best time to visit Kennebunkport is between June and October, when the weather is at its warmest. The only downside: nightly rates will be at their peak during this lengthy season. March through May is a less pricey and less crowded time to visit, but businesses are slow to open after the big chill from November to February. Temperatures can dip to the low teens, so you should pack thick layers.", "Use two wheels, not four Parking spots are impossible to find in Dock Square, and beach parking comes with a hefty permit price. Save yourself some dough – and a lot of hassle – and rent a bike.", "Try the lobster Nothing beats fresh Maine lobster. Lobster rolls are a popular lunchtime snack, but a boiled lobster dinner is the classic way to go. If you're a beginner, ask for a soft-shell lobster – it's easier to crack.", "What the heck are the Kennebunks? You'll often hear Kennebunkport referred to as part of the Kennebunks, a shorthand nickname for both Kennebunkport and its neighbor, Kennebunk.", "Fly to Boston More airlines service Boston Logan International Airport (BOS) and more daily flights are available compared to Portland International Jetport (PWM), so you have a greater chance of scoring a deal.", "Avoid weekend trips If you plan a trip during the middle of the week, you'll find fewer crowds and reduced nightly rates at many hotels and bed-and-breakfasts.", "Thanks to Kennebunkport's location along New England's Atlantic coast, the town's dining scene includes lots of seafood. You'll find oysters, clams, mussels, lobster, fish and more on menus around town. Many of the city's eateries are perched along the water, allowing for great waterfront views from patios and a pleasant atmosphere to enjoy a meal.", "Hoping to sample a traditional Maine lobster roll? Visitors and locals favor Nunan's Lobster Hut and The Clam Shack, saying both spots offer some of the best lobster rolls in New England that are piled high with sweet meat. If you're in the mood for a meal with a view, head to Arundel Wharf, which overlooks the Kennebunk River and features a deck for visitors to enjoy small bites and cocktails and a menu of seafood and pasta. The casual Federal Jack's, the original home of Shipyard Brewing Company, also offers a deck with river views and tasty brewpub fare. Looking for more of a fine dining experience? The AAA Five Diamond-rated White Barn Inn Restaurant receives top marks for its upscale ambiance, decadent cuisine and varied tasting menu. Old Vines, in nearby Kennebunk, is a great spot to enjoy live music, an extensive wine-by-the-glass list and creative comfort dishes, like chicken meatballs, portobello Wellington and braised short ribs. Meanwhile, the restaurant at The Boathouse has a gorgeous waterfront location and what it calls a \"classic\" Maine menu, with a seafood bar featuring fresh oysters, crab and lobster tacos.", "The best way to get around Kennebunkport is by foot or bike. There's also the seasonal Shoreline Trolley for traveling between surrounding towns. The town's small size and lack of parking are strong arguments for these modes of transportation. To get to Kennebunkport, you can fly into Portland International Jetport (PDM), located approximately 30 miles north of Kennebunkport, or into Boston Logan International Airport (BOS), about 90 minutes south of Kennebunkport. At either airport, rental cars can be easily obtained. Once you're in town, it's best to park your car and leave it at your accommodation, unless you're heading out for daytrips."]}