{"name": "St. Lucia", "description": ["Lush, unspoiled St. Lucia is a hit with travelers of all kinds. Some of its vacationers are music lovers, letting loose at the springtime St. Lucia Jazz & Arts Festival. Meanwhile, adrenaline junkies test their limits by climbing The Pitons or zip lining through the Chassin region's rainforest. Others are honeymooners, unwinding on one of the island's chalky beaches or holing up in one of its isolated resorts.", "But what if you don't fall into any of these categories? Don't worry: St. Lucia refuses to be pigeonholed as any \"type\" of Caribbean vacation. Start your mornings basking in an orange-tinted Soufrière sunrise then round out your evenings at an evening \"jump-up\" (or dance party) along Gros Islet. To discover the rest of the island's indescribable charms, you'll have to visit for yourself.", "The best time to visit St. Lucia is between May and June. These late spring and early summer months offer wonderful weather – high 70s to 80s – plus there are enviable room rates at the best hotels. Music lovers should consider visiting in early May specifically to attend the St. Lucia Jazz & Arts Festival that's held at Pigeon Island National Landmark. The island is flush with activity in the summer and late fall, but there's a greater chance of hurricanes. The busiest and most expensive time to vacation is from December to April, the driest season.", "The electricity is different St. Lucia's electric current runs on 220 to 240 volts. Depending on where you stay, you may need to buy a converter and plug adapter to be able to use your 110-volt U.S. appliances.", "The currency is different But this will work out to your advantage. The Eastern Caribbean Dollar (XCD) is valued at a little less than 40 cents. And don't worry about exchanging money – U.S. currency (as well as most major credit cards) is widely accepted throughout the island.", "Driving is different Considering St. Lucia's history with the British Empire, it's no wonder the country has adopted driving on the left side of the road. With public transportation few and far between, travelers should set aside ample taxi fare to and from attractions.", "Leave your kids at home Airfare for three, four or five vacationers can quickly add up. But St. Lucia, more than any other Caribbean island, is the place to enjoy with just your sweetheart. Take your children on your next tropical vacay to a more family-focused place like the Bahamas.", "Shop on the weekend Fridays and Saturdays are popular market days. Save your souvenir buying for those days and you might haggle a better deal on your trinkets.", "Mind the service charge There'll be a 10% tip added to your hotel bill and to restaurant checks, as well as a tourism levy of a few dollars per night (depending on the cost of your hotel). Factor that into any additional tipping you decide to do.", "With such a rich history of cultures, from Amerindians to Africans to the French and British, it's no wonder St. Lucia has an enormous melting pot of cuisines. Of course, as an island, fresh seafood plays a central role, with everything from conch to mahi-mahi prepared in a myriad of ways. The island's national dish, saltfish and green bananas (known locally as green figs), has a long history dating back to when salted cod was a staple for sailors on long voyages. The fish is stewed with peppers and onions and served with boiled, unripe bananas. You'll find it on most menus across the island. Barbecued pork and chicken are also quite popular. Cocoa tea, made with local cocoa, spices and milk, is a standard breakfast drink, along with hot, deep-fried bread.", "Since many of the island's best hotels offer all-inclusive packages and boast several restaurants on-site, you may be tempted to enjoy all your meals within the comfy confines of your resort. But those who ventured off-property reported finding several delicious local eateries.", "Recent visitors recommend The Pink Plantation in Castries for brunch, giving it high marks for service, food and views. Meanwhile, The Coal Pot earns rave reviews for its waterfront ambiance and fresh seafood. Many visitors also love the casual Roots Beach Bar, where you can enjoy barbecue, beers and views on the beach in Marigot Bay.", "The best way to get around St. Lucia is by car or minibus, though taxis are also available and water taxis around the island are plentiful. Rental cars can be obtained at the Hewanorra International Airport (UVF) in the southern town of Vieux Fort, which is about 35 miles to the south of Castries. Rates average about $70 a day. ", "To enter and exit St. Lucia, you will need a passport that is valid during the duration of your stay. Visas are not required for citizens of the U.S. or Commonwealth countries, as well as citizens of most European countries. Travelers must show proof of a return ticket upon entry into the country. Vacationers will also need to fill out an electronic immigration form listing their itineraries and contact information within 72 hours of arrival. One form is required per family. For more information on entry and exit requirements, visit the U.S. State Department's website."]}