{"name": "Los Angeles", "description": ["Los Angeles both confirms and dismantles all of its stereotypes. Sure, it's a sprawling metropolis with eternally congested freeways, but it also contains one of the most diverse and unique sets of neighborhoods in the United States. La-La Land is filled to the brim with the glamour of chic Hollywood name brands and movie set backdrops, yet it's also home to renowned art galleries like the Los Angeles County Museum of Art and architectural masterpieces like the Getty Center. The world's visual entertainment empire, LA offers tourists behind-the-scenes looks into the world of filmmaking and television broadcasting at studios like Paramount Pictures Studios and Warner Bros. Studio. What's more, the City of Angels features some of the country's most eclectic cuisine and dozens of highly acclaimed restaurants. Away from the revitalized downtown area, the Malibu and Santa Monica beaches provide sun, sand and surfing, while Venice Beach offers close-ups of the city's most unique residents. Additional outdoor pursuits like hiking can be found at Griffith Park and Angeles National Forest.", "At more than 500 square miles, Los Angeles is massive and touring it can be exhausting – but that doesn't deter visitors. The area is one of the most visited in the country, especially between June and October when thousands of travelers use their summer vacations to experience as many LA attractions as possible. But the key to a successful LA vacation is simple: Plan ahead. Pick a few areas that best suit your interests and needs, or take a guided tour if you want a little more assistance. Then all that's left to do is explore, explore, explore.", "With so many things to do in LA, you'll need to strategically plan enough time to see and do it all (and may want to consider a basic travel insurance policy accordingly, in case plans change).", "The best times to visit Los Angeles are from March to May and between September and November, when the air is more breathable and the crowds are less oppressive. Average temperatures during these months range from the low 50s to the low 80s, which makes walking around and visiting outdoor attractions much more comfortable. During the summer, average highs soar into the mid-80s; the heat coupled with heavy smog levels often drive visitors and residents alike to the already crowded oceanside neighborhoods. If you're looking for deals, consider a winter trip. Just make sure to pack an umbrella, since you're bound to encounter a little rainfall in January and February.", "A car is essential Although LA has public transportation, you'll find that getting around this massive city is much easier with your own set of wheels.", "Planning is a must Because of its size, it's practically impossible to wing your tour of LA. Many of the top attractions are spread out, so schedule your time accordingly. Taking a guided tour is another great way to maximize your time.", "Stay away from the beach At night, that is. Hotels overlooking the ocean charge a pretty penny for their views. Consider staying slightly farther inland, where prices are lower and beach access is just as convenient.", "Rodeo Drive is for browsing If you're looking to indulge in LA's fabulous shopping scene, you'll find a plethora of more affordable boutiques lining the streets of nearby West Hollywood.", "Don't pass on the freebies Some of Los Angeles' most notable attractions – Universal Studios Hollywood, for example – can put a major dent in your bank account. Instead, pay a visit to favorites like Griffith Observatory, where price isn't a concern.", "Los Angeles is known worldwide as the home of the United States' television and film industry, and that facet of the city's identity tends to take the spotlight. You can see the side of LA that's glamorized in movies in Hollywood and in the ritzier neighborhoods of Beverly Hills and Malibu. However, don't ignore the rest of La-La Land: You'll encounter different atmospheres (and a range of people) in other parts of the city. The quirky characters in Venice Beach hang 10 with the surfers and skim boarders of Santa Monica, while the business savvy showcase their smarts in downtown LA, and the health conscious shop for the freshest kale at farmers markets throughout the city. LA also has a strong LGBT community, and the city hosts one of the largest pride celebrations in the world.", "Los Angeles offers a lot in the way of culturally enriching attractions: \"Museum Row\" flaunts its prowess with four major institutions, a plethora of music venues fill ears with tunes, and theaters small and large put on dance and musical productions.", "But even though LA is a complex mix of cultures and lifestyles, it's unlikely you'll be able to avoid Hollywood culture, altogether. No matter where you are in Los Angeles, there is probably a movie, TV show or commercial filming right around the corner.", "Diversity is the key to LA's cuisine. It's also no surprise that LA is the birthplace of the celebrity chef phenomenon, with big names like Wolfgang Puck and Gino Angelini at the forefront of the city's premier kitchens. Diners especially enjoy the exquisite (albeit expensive) Italian options at Osteria Mozza in Hollywood. Travelers may also opt for certain restaurants based on who might be sitting at the next table. Those looking for a star-studded meal might try Palm Restaurant or The Ivy in or near Beverly Hills, Fig & Olive in West Hollywood, or The Polo Lounge at The Beverly Hills Hotel on Sunset Boulevard.", "Meanwhile, Los Angeles boasts a more than 130-year-old Little Tokyo and has been a sushi town ever since the California roll hit LA restaurants in the 1960s – there's even an area along Ventura Boulevard in Studio City dubbed \"Sushi Row.\" To satisfy a craving for raw fish and rice, many suggest Katsu-ya, Sushi Gen and SUGARFISH by Sushi Nozawa.", "But you can't say you've truly had the Los Angeles food experience until you've consumed your weight in Mexican fare. Try El Compadre Restaurant for flaming margaritas, enchiladas and live mariachi music nightly. If you're feeling adventurous, order some tacos de lengua (beef tongue tacos) from a taco truck.", "Food trucks serving up everything from loaded hot dogs and barbecue to sushi burritos (large sushi rolls eaten like a burrito) and gourmet quinoa bowls are popular in Santa Monica and Venice Beach, perfect for a quick bite before heading back to the sand. For an overview of the city's eclectic dining scene, sign up for a guided foodie tour.", "And while Los Angeles may not be the first city that comes to mind when you think of a burgeoning brewery culture, it is certainly home to some top-notch breweries beer lovers will enjoy. Those interested in a swankier scene can head to one of the city's best cocktail bars, including The Varnish and ETA. Plus, those interested in wine will enjoy touring through Temecula, which sits 85 miles southeast of the city.", "The main tourist points in LA remain relatively safe, but a bit of caution can go a long way in this huge and sometimes dangerous city. Neighborhoods on the outskirts of downtown, south central LA and even parts of the city center (like Skid Row) can be seedy as criminals tend to frequent these areas. Pickpocketing and petty theft are common, so be sure to safeguard all belongings; credit cards are accepted almost anywhere, so there's no need to carry around large amounts of cash. Homelessness also remains a problem, but it generally poses little risk to your safety. For more information on crime statistics within specific neighborhoods, visit the Los Angeles Times' detailed analysis online.", "Additionally, avoid people who approach you on the street saying they're from a production studio or scouting agency. If someone does approach you, ask for his or her business card and check credentials before pursuing anything. Casting call scams have increased over the years, with scammers imploring people to fill out applications for shows that don't exist with the intent to steal personal information for identity theft.", "The best way to get around Los Angeles is by car. Los Angeles is spread out across about 500 square miles, and while there is a public transportation system, its routes are limited compared to those found in other major cities. You can rent a car from one of the dozen or so rental agencies at Los Angeles International Airport (LAX) – located about 15 miles southwest of the downtown area – or at any of the rental agencies found around the city. The Metro and bus systems also serve the airport, but be prepared for a slow ride. You can also take a taxi from the airport into the city, but that can be expensive: Flat rates between the airport and downtown are nearly $50 one-way. Lyft and Uber also operate at the airport. You'll meet your taxi, Lyft or Uber at LAX-it (pronounced \"LA exit\"), a recently-introduced pickup area for taxi and ride-share passengers. Travelers have the option to walk to LAX-it or hop aboard the dedicated shuttle from their terminal. For more information, visit the LAX website."]}