{"name": "Puerto Vallarta", "description": ["This is more than just a coastal resort getaway. Somehow Puerto Vallarta – also known as \"Vallarta\" or just \"PV\" – maintains a small-town atmosphere, while still boasting one of the most unique and sophisticated oceanfronts in Mexico. The dining options and the hotel choices reflect more of the same – you'll find both elegance and efficiency mingled together within the hotel and restaurant areas. ", "Most people associate this west coast town with its boundaries – the Banderas Bay that snakes along the coast or the palm tree-lined Sierra Madre mountains that stand tall in the east – but Puerto Vallarta is more than its scenery. Take some time to discover its other perks for yourself by sampling the delicious food, discovering a hidden boutique in the Zona Romantica, sipping a signature cocktail at a bar along the Malecón or dancing to a salsa beat in a Havana-style nightclub. When you want a little guidance exploring beyond your resort, sign up for one of the best Puerto Vallarta tours. And if you like to cruise, you'll be delighted to know that deals can be found year-round to this destination. ", "The best time to visit Puerto Vallarta is between April and June when the weather is pleasant and the room rates are affordable. During these months, rain is scarce and there are fewer tourists compared to the winter high season. If you're interested in whale watching, however, visit from December to March. Just prepare yourself for the area's most astronomical travel fares.", "PV's a haven for timeshares You'll want to avoid the timeshare reps that circle the airport, the beach and even the restaurants. That is, unless you're willing to give up several hours of your vacation listening to a sales pitch.", "PV's a haven for LGBTQ travelers This town is recognized as the gay beach capital of Mexico. Zona Romantica is the best neighborhood for gay nightlife and many of that area's condos, hotels and bed-and-breakfast accommodations are LGBTQ friendly.", "PV's a haven for artists As evidenced by the elaborate sand sculptures lining the Malecón or the beautiful ceramics and paintings in the art galleries. There are clusters of galleries and art walks in El Centro, Zona Romantica and Bucerias.", "Buy a map Taking the bus or a taxi around town is cheap in theory, but in practice, you could end up covering extra ground and paying unnecessary fares if you don't know where you're going.", "Pack an umbrella If you don't mind the frequent (but short) rain showers, then plan your visit for late summer. Just don't forget to bring your umbrella or a light rain jacket.", "Just say no From the beach vendors that stroll along Banderas Bay to the timeshare representatives that stroll along just about everywhere, there are plenty of ways to let go of more money than you intended. Learn to say a firm but courteous, \"No, gracias,\" if you're not interested in what they're selling.", "Spanish is the primary language spoken, but many people – especially those who work in the tourist zone – speak English. It may be both helpful and respectful to know some basic Spanish vocabulary, such as \"hello\" (hola), \"goodbye\" (adíos), \"please\" (por favor) and \"thank you\" (gracias).", "Puerto Vallarta's official currency is the Mexican peso. Since the Mexican peso to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. American dollars are, however, widely accepted in Puerto Vallarta.", "As is the case with neighboring Mexican and Caribbean vacation destinations, Puerto Vallarta's dining scene can be as narrow or expansive as you like, depending on how willing you are to venture off the grounds of your all-inclusive resort. From food carts to European fine dining establishments, PV's cuisine runs the gamut. For a crash course in the bold regional flavors that define the city, consider signing up for a food tour – Vallarta Food Tours comes highly recommended for its variety of experiences and knowledgeable and engaging guides. One of its most popular is An Evening Taco Adventure, which explores the night street foods of Vallarta. If you'd rather take your own self-guided tour, you may want to head over to Food Park, where you'll find a collection of food trucks, along with live music and a DJ on the weekends. ", "Of course, no visit to Mexico would be complete without a sunset dinner on the beach. For that, travelers and experts recommend La Palapa Restaurant. Sitting pretty on Playa Los Muertos, this family-run eatery serves what it calls \"tropical Mexican cuisine\" that combines combines Mexican, Asian and French flavors. If you're on the hunt for an upscale setting with a sophisticated menu to match, Barcelona Tapas, La Leche and the award-winning Café Des Artistes both come highly recommended.", "The drug and gang violence that has afflicted much of Mexico in the past several years has not greatly affected Puerto Vallarta. That said, be sure to check U.S. State Department travel advisories before heading to Puerto Vallarta or anywhere in Mexico. Most of the dangers in Puerto Vallarta involve swimming and food safety. Never swim by yourself or without the supervision of a lifeguard. Travelers should also note that the surf is rougher in the days following rain or a thunderstorm, so proceed with caution after bad weather. If you're going hiking or walking in the wilderness, wear long pants and shoes to prevent serious injury from snake bites.", "The best way to get around Puerto Vallarta is by bus – there are plenty of stops and the fares are cheap. If you're looking for a less bumpy ride (though not by much) you can also take a taxi or an Uber. The bus is also the best means of getting from PV's Licenciado Gustavo Diaz Ordaz International Airport (PVR) to the hotel zones. Renting a car is also an option, but you'll pay hefty fees for the privilege. To really get a feel for Puerto Vallarta's neighborhoods, you'll want to rely on your own two feet, especially in areas like the Zona Romantica.", "Most travelers arrive via airplane or cruise ship. The cruise ship terminal sits about 3 miles north of downtown Puerto Vallarta. Meanwhile, the Licenciado Gustavo Díaz Ordaz International Airport (PVR) is located about 3 miles south of downtown. Expect a taxi ride from the airport to the Hotel Zone to start at around $26. ", "Citizens of the United States need a passport to visit Mexico. Travelers must also carry a Mexican Tourist Permit, which is usually issued free of charge upon arrival. Any additional fees for the tourist permit are usually absorbed in the cost of your plane ticket. Be sure to hold onto this card throughout your trip, as you will need to present it upon departure. For more information on entry and exit requirements, visit the U.S. State Department's website."]}