{"name": "St. Petersburg, FL", "description": ["Holding the Guinness World Record for the most consecutive days of sunshine, St. Petersburg is appropriately nicknamed \"The Sunshine City.\" The city provides visitors with a unique blend of traditional beach getaway and urban flavor. The white, sandy beaches offer views of spectacular sunsets and the 137 parks invite travelers to enjoy a host of activities, including hiking, camping and kayaking. An ongoing creative renaissance also promises an extensive cultural experience, whether it's through the world-class Dalí Museum or the Museum of Fine Arts.", "And every year, more than 1,000 events are held in the city – everything from St. Anthony's Triathlon to Florida's largest Pride celebration. With all that it has to offer, the sunshine-infused city is a popular destination for visitors all ages: families will love the relaxing outdoors and teeming wildlife, and the younger set will find plenty to do downtown, including the lively nightlife.", "The best time to visit St. Petersburg is from March to May, when the weather is comfortably warm and a plethora of outdoor events make the city come alive. You'll find more affordable room rates from June to November, but the threat of hurricanes is imminent and the weather can often be scorching. The temperature cools down significantly for the winter months.", "Dogs are welcome Feel free to bring your four-legged friend when visiting St. Petersburg. The city features six dog parks, a lengthy dog beach at the Fort de Soto Park and a dog-friendly Saturday Morning Market.", "Theme parks are a short drive away Don't fret – you can still enjoy Florida's thrilling theme parks while visiting St. Petersburg. Busch Gardens (near Tampa) is about 30 miles northeast and Walt Disney World is about 70 miles northeast.", "Enjoy the wildlife The Sunshine City is home to an abundance of wildlife, so keep an eye out and enjoy the scenery. Dolphins are seen year-round, while manatees appear in the wintertime. Beachgoers should do the \"stingray shuffle\" as they wade into the surf to avoid stepping on buried stingrays. Plus, the city features the most diverse water bird colonies in North America.", "Call before you go Some attractions will close completely for major city events – such as the Firestone Grand Prix of St. Petersburg in March – so you'll want to double check the attractions' hours before you visit.", "Invest in a GO Card If you plan on getting around the city by bus, you may want to use a reloadable GO Card. These can be purchased on the bus with exact change. Regular fares cost $2.25. You can also pay for fares with exact change.", "Pick the right beach Sunshine City features plenty of beaches but almost none of them offer free parking. Municipal lots, such as those offered by Treasure Island, often offer the best prices. If you'd rather not bring your own set of wheels, the Suncoast Beach Trolley is an inexpensive shuttle that runs between the area's beaches and offers connecting service to downtown.", "Indulge in free events The city hosts more than 1,000 events each year. Check the St. Petersburg Calendar to take advantage of the ones that are free while you're in town. ", "As a city on Florida's Gulf Coast, seafood is a must in Sunshine City. Make sure to visit 400 Beach Seafood and Tap House and The Maritana Grille (at The Don CeSar) for exquisite seafood dishes like fresh oysters, coconut shrimp, tuna tartare and crispy calamari. And if you're not a fan of fishy food, there's plenty else in the city to eat as well. Beach Drive and Central Avenue feature alfresco dining. If you'd like a change of scenery, the Saturday Morning Market is a great place to pick up fresh produce, and food trucks all over the city offer fantastic street fare.", "The best way to get around St. Petersburg is by car. The roads are easy to navigate and parking is inexpensive, except in downtown lots during sporting events. Within the downtown area, many attractions are within walking distance of one another, so if you're staying in the city, getting around by foot is another easy way to see St. Petersburg. You can also explore with the help of public transportation – buses and trolleys run throughout and the fare is relatively inexpensive.", "To visit St. Petersburg, you can fly into St. Pete-Clearwater International Airport (PIE), located about 12 miles north of downtown, or larger Tampa International Airport (TPA), located about 20 miles northeast of downtown. Though buses run between St. Pete-Clearwater airport and the city, the travel time can be more than triple what it is by car. So, the most convenient way to reach St. Petersburg (from both airports) is by either renting a car or taking a cab."]}