{"name": "El Paso", "description": ["Situated in the westernmost tip of Texas, El Paso straddles the divide between the U.S. and Mexico both geographically and culturally. The city sits just 7 miles northwest of Ciudad Juárez, Mexico, a city once deemed one of the world's most dangerous that now has experienced a revitalization. And to El Paso's north, you'll find several of New Mexico's top places to visit, including White Sands National Park and Albuquerque. Within El Paso itself, you'll discover a mix of cultures heavily influenced not only by Mexico, but also by the Tigua Indian Tribe, Spanish conquistadors and the American military (Fort Bliss, an Army post, is nearby). As such, you'll have your pick of attractions steeped in history, as well as Mexican culinary delights. You'll also find outdoor oases like Franklin Mountains State Park within city limits, should you want to go hiking or mountain biking. So pack your bags and brush up on your Spanish – you're in for a wild ride.", "The best times to visit El Paso are from March to May and between September and November. Temperatures during these spring and fall months are temperate, with highs ranging from the upper 60s to the upper 80s. These conditions are perfect for exploring all of the area's parks. June, July and August are not only hot (think: temperatures creeping into the mid-90s) but also incredibly wet. December, January and February could be good times to visit, too, but you'll need to bring along a coat. Lows dip into the 30s during these winter months.", "Check your watch While most of Texas adheres to Central Standard Time, El Paso follows Mountain Standard Time, which means it's one hour behind the rest of the state.", "Learn Spanish Spanish is the predominant language of El Paso, and more than half of its residents speak it. Be sure to brush up on your skills or pack a phrasebook for your trip.", "It's in a desert El Paso is located in the Chihuahuan Desert. It gets particularly hot in summer, so be sure to pack plenty of water and sunscreen if you venture out. Additionally, daytime and evening temperatures can vary by nearly 30 degrees. Bring a jacket to stay warm after the sun sets.", "Get a bus pass El Paso offers an extensive bus system, including its unique refurbished streetcars that take passengers through downtown and uptown. Weekly passes, which cover unlimited rides on buses and streetcars, only cost $12. Meanwhile, day passes cost $3.50, and single fares cost $1.50.", "Look but don't buy Cowboy boots may seem like a tempting souvenir for your Texas adventure, but they come at a price. A quality pair can cost hundreds, if not thousands, of dollars. So peruse the shops in town to your heart's content, but save your coin for El Paso experiences."]}