{"name": "Madrid", "description": ["Spain's capital since 1561, Madrid has been the beating heart of this southern European country for almost 500 years – longer than most countries have even existed. In many ways, it can be compared to other international capitals – it's Spain's biggest city, has the country's largest population and is the center for international business. But if you listen carefully, you might hear the alluring strings of a Spanish guitar, the clicking of a flamenco dancer's castanet, and the swish of a bullfighter's red cape. Yes, Madrid is for travelers interested in famous paintings and stunning architecture, but it's also, and maybe more so, for those looking for passion turned into art, and a taste of life lived with color and intensity.", "The best time to visit Madrid is in the fall (September to November) or spring (March to May), when balmy temps blow through the city, making it come alive. But if you don't mind layering up or experiencing a toned down Madrid, visit in the winter when hotels reduce their rates. Peak tourist season is summer – despite nearly unbearable heat – but many Madrileños close up shop this time of year (especially in August) and take vacations themselves.", "Botellón is illegal Although some Madrileños still botellón, or drink in the city squares or parks before going to bars or clubs, doing so is illegal. If you get caught with an open container, you can be smacked with a huge fine.", "Dress up Like Parisians and the Milanese, Madrileños take pride in their appearance. If you plan to go to upscale, busy clubs or restaurants, the sharper you dress, the higher your chances of getting in – that means heels for the ladies, and closed shoes for the gents.", "Walk Madrid is the largest city in Spain, but the biggest attractions, from El Retiro Park to Mercado de San Miguel, are centrally located and are mostly within walking distance from each other.", "Visit major sights during free entry days Many places of interest offer free admission, and even those that don't may be free at certain times of the week (usually between 6 and 8 p.m.).", "Madrileños love to live life to the fullest. Much like the rest of Spain, they don't live to work, they work to live. Travelers visiting the city will find this evident quickly upon arrival. When the weather is right (and sometimes not), visitors will see hordes of Spaniards dining al fresco along the city's streets for hours on end, and laying out on a blanket with loved ones in Parque Retiro.", "At night, regardless of the season, the city comes alive in a different way when its denizens get off work and party all night. In Madrid, dinner starts at 9 or 10 p.m., and most clubs open at midnight. The \"discotecas,\" as locals call them, get busy between 1:30 a.m. and 4 a.m., closing as late as 6 a.m. ­– dancing 'till sunrise is routine.", "If you're unsure of where to start, try Puerta del Sol. There are club and bar promoters stationed there throughout the night offering discounts on drinks and entrance fees – but don't feel tied down to one place. It's a Madrileño pastime to bar and club hop, unless you have paid a steep cover charge at one place.", "Madrid's nightlife scene extends far beyond clubbing. Ascend to the rooftop terrace of the Círculo de Bellas Artes to marvel at 360-degree views of the city, especially during sunset. Even those not fond of clubs will find themselves drawn to dance floors like that of El Son, a destination for salsa, Latin and Caribbean music. For lovers of light opera, Teatro de la Zarzuela presents Madrid's own zarzuela productions in a theater modeled after La Scala in Milan. Meanwhile, Teatro Real stands as one of Europe's most esteemed opera houses, showcasing a lineup of both local and international productions, along with classical and contemporary concerts and dance performances. These are just a few options in a city unlike any other, with its unique blend of Renaissance pomp and Latin American flavor.", "Madrileños are an easygoing bunch, as evidenced by their unofficial motto, no pasa nada, which translates to \"don't worry about it.\" However, they can be proud and prefer to avoid speaking English, opting to encourage your attempts at Spanish. Learning a few local phrases will take you far, and Madrileños will graciously meet you halfway as they can. If you're having trouble, it might prove fruitful to approach someone younger for questions and directions.", "Service with a smile is few and far between in Spain, so don't expect anything else of your server aside from taking your order and handing you your food. Service might also seem slow, as locals take their time when dining out. There are fewer grab-and-go places in comparison to the U.S.; Spaniards engage in sobremesa, literally \"over the table,\" or after-dinner conversation, which can last for hours. Because of this, checks take much longer to arrive, so don't be afraid to ask more than once to get your bill. It's important to note that words from Latin American Spanish differ in Castellano, the dialect of Spanish named after the old kingdom Castile. Vocabulary such as baño, which means \"bathroom\" in Latin American Spanish, is servicio or aseos in Castellano. And instead of saying adios, or \"goodbye,\" Spaniards tend to say hasta luego (“until later”) instead.", "Historically, tipping has always been considered as purely optional in Spain, although recently changes have been observed in bigger cities like Madrid and Barcelona. At restaurants and bars, a service charge is usually added to the bill, so you don't have to tip extra. If you received exceptional service dining at a restaurant, 5 to 15% of the bill is the usual range. If you want your server to get the tip in full, it's better to leave your tip in cash. In hotels, doormen and cleaners may be tipped about a euro for their services, although it isn't generally expected.", "Traditionally Madrid's cuisine is fairly rustic. Meat, bread and cheese heavy, Madrid's food is best tasted in tapas – which are small plates or samples of Spanish dishes that come free when ordered with a drink at a bar. Note that Madrileños eat a late, large lunch, nosh on some tapas around 8 p.m., and then enjoy a later, lighter dinner meal. The incredibly popular Mercado de San Miguel offers ready-to-go tapas, as well as coffee, cocktails, dessert and produce stalls. The market even has a sushi counter. However, if your heart is set on having traditional complimentary tapas with a drink, head to El Tigre. Located near Chueca, El Tigre serves large drinks with equally large plates filled with tapas piled high on top of each other. El Tigre is messy, small and incredibly loud, but quintessentially Madrid, serving as a stop for many Madrileños on the way to the club. For an overview of some of the city's best tapas, consider tagging along on a tapas tour. The Madrid Tapas Night Walking Tour is especially popular with past travelers. ", "Spanish specialties include tortilla española (potato omelette), paella (rice with fish), croquetas (fried breadcrumb rolls typically filled with mashed potatoes, cheese and meat), gazpacho (cold soup) and patatas bravas (sautéed potatoes typically served with a spicy aioli). But the country's most beloved dish is a simple plate of jamón Iberico, or Iberian ham. Visitors should not leave Spain without sampling the jamón Iberico, as it is considered by food experts to be some of the best ham in the world. It also isn't widely available in the U.S. Jamón is everywhere in Madrid. You will not only see it on many restaurant menus and tapas plates, but hanging in its original form in shop windows as you stroll the streets. It is just as much of a staple in Spanish culture as flamenco and bullfighting, only much more delicious.", "If you grow tired of the heavy Madrid fare, the city also offers a number of international establishments serving up Indian, Asian and Latin American cuisine. For a sampling of global cuisine, especially Indian food, head to Lavapies, one of the city's most diverse neighborhoods. For cheap, and truly delectable Chinese food, venture underground Plaza de España to the Cafeteria and sample the tallarines fritos (or fried noodles). As for drinks, order a jarra (pitcher) of sangria, a glass of tinto de verano (summer wine), wine from the Rioja region and Mahou beer.", "Madrid is a pretty safe place, but it does see its fair share of pickpocketing. Be especially mindful of your wallets and purses when taking out money at ATMs, when using public transportation to or from the airport and when touring Madrid's top attractions like Sol, Plaza Mayor and El Rastro market. Spain has also been the target of terrorist attacks.According to the U.S. Department of State, terrorist groups continue to plot attacks, so increased vigilance is required. Travelers should stay aware of their surroundings, consider enrolling in the Smart Traveler Enrollment Program to receive security messages and follow local media to stay informed.  ", "The best way to get around Madrid is by metro. A handful of metro lines extend as far north as the Madrid-Barajas Airport (MAD) as well as into the city's southern suburbs. Buses are an option, too, as are metered taxis, which can be hailed on the street or found in ranks throughout the city. Renting a car is another alternative, but you should note the Madrid 360/Low Emissions Area, an anti-pollution protocol affecting traffic and parking, and the Mobility regulation, which sets the maximum speed at 30 kph in many streets.", "To get from the airport into Madrid, you can take the metro (line No. 8) for 4.50 to 6 euros (around $5 to $6.50). The 24/7 Airport Express Shuttle, known as \"Exprés Aeropuerto,\" takes approximately 30 minutes to reach Terminal 1, with an additional 5 minutes to Terminal 2 and Terminal 4. During the day, the journey takes 15 to 20 minutes, while at night it takes 35 minutes. The ticket price is 5 euros (around $5.50). Taxis charge a flat fare of 30 euros (approximately $33). There are also several car rental companies located at the airport.", "In Madrid, you can also use ride-hailing apps like Uber, Cabify (a local version) and Bolt. For eco-friendly options, consider bike and e-scooter sharing apps, such as Dott, Lime, TIER (for e-scooters) and BiciMAD (for bike-sharing). The average price for renting an electric scooter is 0.15 euro per minute (around $0.16).", "A valid passport is required for United States citizens traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. Your passport must be valid for at least three months after your visit. You won't need a visa unless you plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements."]}