{"name": "Moscow", "description": ["Moscow's opulence and high culture is a sight to be seen. Forget what you learned about Russia in grade school. This lavish capital of a formerly communist nation has fully embraced the luxuries, excesses and decadence of Western capitalism. Like many former Soviet countries, Mother Russia struggles to successfully confront issues of widespread poverty, alcoholism, failing healthcare, and environmental protection. But Moscow has burgeoned into one of the most expensive, exclusive and largest travel destinations in the world. It comes complete with world-class museums, magnificent palaces, $1,000-a-night hotels, \"face-control\" nightclubs and internationally-renowned restaurants. Don't think you can afford Moscow? Don't be afraid. You can still find affordable deals if you are vigilant. This metropolis has a big and bold character and grandiose setting that's definitely worth getting to know.", "The best time to visit Moscow is April and May, when the temperature creeps into the 50s and 60s, the sun begins to shine for significant portions of the day, and hotel rates have yet to skyrocket into peak ranges. Of course, the golden period is summer, when the city is warm and bustling. But if you want to (slightly) spare yourself from the perpetually expensive rates, try the shoulder seasons in the spring and early fall. Preferably spring, since fall experiences more rainfall and less sunlight. Winters are brutally cold, but this is when you'll get a true glimpse into the Moscow experience (A frost-bitten walk through Red Square seems to intensify the historical significance of this great capital city).", "A little Russian English is spoken only in major hotels and restaurants, and you'll find mostly Russian speakers in the less tourist-heavy areas. American visitors also struggle with the Cyrillic spellings and pronunciations. Practice some key Russian phrases on the long flight over.", "A lot of vodka This Russian drink of choice (yes, they usually consume it straight) is found at any bar. But if you wish to taste it and learn about its origins, the Moscow Distillery Cristall is your best bet.", "If it seems too good to be true It probably is. Take that proverb to heart in Moscow, and don't expect the Czarist medal you purchased off a street vendor to be worth anything more than a good memory.", "If you're oblivious on the subway You'll probably leave several rubles lighter. Pickpockets prey on unsuspecting foreigners in crowded places, particularly metro cars. Beware!", "If you're not scared of the dark You may be able to handle Moscow's long nights in fall, winter and spring, when hotels offer the lowest rates. December sees an average of 18 hours of sunlight … in total.", "English is spoken in major hotels and restaurants, but you'll find mostly Russian speakers in the less tourist-heavy areas, such as at the market or in small inns. Some helpful Russian greetings include the informal hello (pronounced, pri-VET); the formal hello (Zdravst-vwee-tye); the informal goodbye (pah-KAH); and the formal goodbye (Dah svih-DA-nee-ye). To thank someone, say \"Spas-EE-ba.\"", "Traditional Russian fare focuses on hearty meat dishes and cold soup, a particularly Russian specialty. But don't arrive in Moscow thinking you'll experience only the old cuisine. Russia's new personality has been accompanied by a lavish taste for international cuisine, especially Asian food. Sushi and Asian fusion restaurants are among the most popular in the city, and other dining options include American and Italian cuisine. Eating out, like everything in Moscow, can be very expensive, but you can find cheaper restaurants in shopping centers and areas outside the city center. ", "Stay alert for pickpockets when using public transport and when visiting the main tourist sites. Many an unsuspecting traveler has been relieved of some rubles on the Moscow Metro and near Red Square. Also, make sure to exercise extra caution when leaving bars and clubs at night.", "There have been cases of corrupt police asking for random fines -- if this occurs, get the officer's number and name and ask to go to the police station with him or her.", "The best way to get around Moscow is the metro. Faster and more efficient than the trolley buses and trams, this extensive system has stations that contain beautiful ornamentation, sculptures and mosaics. You could rent a car, but it's best to use public transportation to avoid the city's perpetually congested roads. Plus, street signs are all in Russian. In fact, English signs are nonexistent in the public transit system as well, so it's best to quickly get familiar with a map. Most travelers arrive through Moscow's Sheremetyevo International Airport (SVO), but there are several other airports that serve the metro area. Several buses and a metro line shuttle airport travelers to and from downtown.", "Acquiring a visa to travel in Russia is a bit more complicated and expensive than visiting other countries. Every foreign traveler entering Russia must have a Russian-based sponsor (like a hotel, tour company, university or relative). In addition to a valid U.S. passport, you must also obtain a travel visa from a Russian embassy or consulate prior to arriving in Russia. If you plan to stay in Russia for more than seven days, you have to register your visa and migration card (the white paper document given by the border police on first entry to Russia) with the Federal Migration Service. Visas can cost anywhere from $160 to $250 per person, depending on the length of your stay. For more information on entry and exit requirements, visit the U.S. State Department website."]}