{"name": "Bangkok", "description": ["Travelers have a hard time putting a pin in Bangkok's personality. Most first-timers see this city as one caught between the past and the present. Ancient temples and modern shopping malls comprise Thailand's capital, and Buddhist monks and regulars of Patpong (Bangkok's red light district) share the city's streets. The contrast can result in an exhilarating yet chaotic setting.", "With that said, Bangkok's dynamic environment requires a lot of energy. Consistently hot weather and persistent crowds take their toll on unprepared visitors. Yes, the city seems to boil over with everything from humidity to humanity, but it's this exotic overabundance that charms travelers. Here, you'll find the world's largest open-air market, a world-class aquarium housed in an eight-level shopping mall, a 150-foot golden Buddha statue and so much more. It's a city of vast surprises, so savor its delightful incongruity. ", "The best time to visit Bangkok is from November to March when the heat and humidity are at their lowest. Still, Thailand's tropical climate could easily bring temperatures up to 90 degrees on any given day, regardless of the time of year. To find deals on airfare and hotel rates, consider a trip between April and October, the hottest and rainiest time of the year. Not only are you more likely to find a deal during this time, but crowds will also likely be fewer in comparison to \"winter,\" which is Bangkok's peak travel season. Keep in mind that monsoon season officially starts in May and generally lasts until late September and early November. ", "Thai is the official language here, although you'll find English-speakers at major hotels and heavily touristed areas. If you get off the beaten track, you'll most likely run into communication problems. To avoid any miscommunications in transit, write down the address of your destination before you head out. However, most of the city's top attractions as well as the Skytrain and Metro, have signs in English. ", "The predominant religion in Thailand is Buddhism, and you'll find temples and statues bearing the image of Buddha throughout the city. At most temples, you'll find that the dress code calls for modest attire (long pants, skirts that fall below the knee, and shirts that cover shoulders and midriffs). The Thai baht is the official currency here; one U.S. dollar is equivalent to 33 baht, but the exchange rate fluctuates, so be sure to check it before you go.  ", "Don't disrespect the king. The Thai people are very proud of their royalty and will find it immensely rude if you're cracking jokes or criticizing their leader. Also, do your best to be polite. Thais put a high value on kindness and manners, so be considerate. One way you can do this is by practicing \"the wai\" or the Thai greeting. Join your palms together in prayer, and touch your connected hands to your chest as a way to respectfully say \"hello.\"", "The world is your oyster when it comes to the dining scene in Bangkok. The city is considered to be a top foodie destination for a variety of reasons, but its main calling card is its street food. There are more than 300,000 street food vendors in the city, meaning you could probably spend your entire stay in Bangkok without stepping into a sit-down restaurant. You can find street food all over the city, but you should start in Chinatown, particularly on Yaowarat (the neighborhood's main thoroughfare), Khao San and Sukhumvit roads. Here you'll find street vendors in droves, lined up side by side, serving up all kinds of delectable Thai fare.", "Stir fries, fried rice, curries, grilled meat and fish skewers, pad see ew, and other noodles dishes are all staples in the street food scene, as is papaya salad, or som tam. Som tam is grated papaya mixed with string beans, chilies, garlic and a host of other spices. This mixing of opposites, such as the sweet and savory or the sweet and spicy, is what Thai cuisine is all about. This blend can also be found in other popular Thai dishes, including massaman curry, a coconut curry with savory ingredients, including potatoes, or sticky rice with mangos, which is sticky rice mixed with mangos and covered in a coconut cream sauce.", "Now that you know where to go and what to order, it's important to know how to order, as well as what to look out for when approaching a street vendor. Contrary to popular belief, Bangkok is not getting rid of its street vendors. Instead, the local government is implementing measures to make street food more sanitary. If you see a stall that people – especially locals – aren't visiting, it's best to keep moving. And remember: Some stalls may have English menus, but most don't. Travelers have said that merely pointing to certain ingredients, pictures or what other diners are eating can be the easiest way to order if the vendor only speaks Thai (as most do). Vendors are aware of Bangkok's reputation as a street food capital and are accustomed to dealing with tourists; they'll be able to understand you with even the slightest gesture. ", "Bangkok is generally safe to visit. Violent crime against tourists is rare. However, the city is rife with scams. Never ride in a taxi without a meter and make sure the meter is switched on before you get in. And be wary of flat fares. Sometimes drivers offer flat fares instead of a metered fare as a way to overcharge tourists. Tuk-tuks are a fun way to get around the city but don't agree to a tour if offered. Drivers have been known to zip by attractions and take you to shops that pay drivers to bring them shoppers. And while on the subject of shopping, it's best to avoid buying gemstones here unless you're at a luxury outpost. Be cautious of locals approaching you about gemstones, even at a market, as well as those who tell you an attraction or public transportation is closed (the latter is a very common scam). While going about town during the day is pretty safe, you'll want to keep your guard up if you plan on partying. Stay away from the Patpong area (the city's red light district) and also keep track of your drinks. Some bars have been known to hand travelers an expensive bar bill filled with drinks and cover charges that weren't advertised. Sexually-motivated violence has also been known to occur in party settings. For more information, visit the U.S. State Department's website.  ", "The best way to get around Bangkok is by Skytrain or Metro, which is fast, affordable and easily navigable for visitors. The city also offers an extensive network of buses, but these are prone to traffic jams, which the city is notorious for. Taxis are fairly cheap, but again, gridlock is a regular issue. However, taxis are the easiest way to get from Bangkok's Suvarnabhumi Airport (BKK) to downtown. The Airport Rail Link is another great option. For a scenic view of the city, we suggest hopping aboard a riverboat and floating down the Chao Phraya River. ", "While you'll no doubt want to admire the beautiful mosaics that comprise Wat Arun during the day, make sure to come back at night to see the spectacular holy site lit up. "]}