{"name": "Split", "description": ["Croatia's second-largest city has some first-class charms. First, Split (pronounced like it's spelled) is located on the glittering Adriatic Sea in central Dalmatia. Its rolling terrain slopes down to pebbly beaches and turquoise waters, which look out onto neighboring islands like trendy Hvar. Second, it's played host to an incredible amount of history: think Roman emperor Diocletian, who started building his palace here in A.D. 295. But in spite of its historical cachet, Split isn't stuck in the past. For instance, these days its labyrinthine medieval palace contains buzzy bars, happening restaurants and fashionable shops. What's more, the sun is nearly always shining in Split, and it's still relatively cheap to visit – so the question is, what's keeping you from going?", "The best time to visit Split is September and October when tourist crowds have dispersed and the Adriatic Sea is still warm enough for a dip. By November, temperatures tend to drop into the 40s and 50s, where they'll hover for the rest of the winter. The months between April and June see rising temperatures and crowds, but the city's peak season is in July when the weather is hot and both tourist levels and rates for accommodations, flights and rental cars are at their highest.", "The official language in Croatia is Croatian, but many people in Split, especially those in the tourist industry and younger Croatians (generations Y and Z) speak English. Still, it's nice to know a few key words and phrases, such as the common greeting: good day, \"dobar dan.\" Other key phrases include please, \"molim,\" and thank you, \"hvala ti.\" Because of the complex relationship between Croatia and Serbia, it's wise to avoid speaking about Croatia and Serbia relations when chatting with locals. ", "The currency in Split is the Croatian kuna (HRK). One U.S. dollar is equal to about 6.25 kuna. Since the exchange rate fluctuates, you'll want to check it before you travel. You can exchange currency at the airport, but you might find a better exchange rate in town. If you have an ATM card that doesn't charge fees for withdrawing money overseas, you might want to collect your cash at a local ATM. ", "When it comes to tipping, keep in mind that there's no standard amount. Still, most service staff – from restaurant servers to taxi drivers – will appreciate at least a symbolic amount, especially as wages aren't too high in Croatia. Ten percent of a restaurant bill, for instance, is considered a generous tip. ", "On the whole, Split is considered a very safe vacation destination. But while you're walking around the narrow streets of Old Town and Diocletian's Palace, be wary of potential pickpockets that might target tourists. ", "Split is increasingly becoming a nightlife destination, and travelers will find trendy bars and clubs that line the beachfronts and are scattered through the city. For indie music, try Klub Quasimodo; for a thrumming club scene, hit up Club Jungla; and for Croatian rock and roll, try Legends Bar.", "With its coastal location, seafood is Split's main specialty – from fish to mussels to squid and octopus. And locals have a popular saying about how seafood should be prepared: \"A fish should swim three times: First in the sea, then in olive oil and finally in wine – when you eat it.\" Olive oil and wine are Croatian specialties built into many of the city's menus. Sample a wide assortment of olive oils during a tasting at Uje Oil Bar, located within Diocletian's Palace. ", "Wine is practically a separate food group in Split, and anyone that enjoys an occasional glass should take some time to visit Putalj. This traveler-approved winery, which produces a zinfandel, a Plavac Mali, a rosé and a special winemaker's blend, earns rave reviews for its beautiful setting, generous wine tastings (a purchase of a bottle comes with a plate of bread and cheese) and the amenable and knowledgeable staff. You'll find it across the bay from Old Town. ", "There are hundreds of restaurants in Split, but some will be nondescript, overpriced tourist traps – especially near the beaches, resorts and harbor. It's best to do your homework and avoid these eateries and instead dine at traveler-approved places, such as Bokeria Kitchen & Wine Bar, Kasa Grill & Bar in the Stobrec neighborhood or Villa Spiza. Wine bars are also abundant, and Zinfandel Food & Wine Bar gets high marks, as does Paradox Wine and Cheese Bar.", "The best way to get around Split is by car since it gives you the most flexibility to travel on your own timetable, but renting a car isn't the most economical way to get around. Relying on the city's buses (and ferries for island hopping) will save you the most kuna. But if you plan on sticking close to Old Town, you can easily get around on foot. ", "To reach the city, many travelers fly into Split Airport (SPU), located about 15 miles west of Old Town. To get to Split from the airport, travelers can rent a car, jump in a taxi or Uber, or for 30 kuna (about $5), take an airport shuttle, which drops off travelers at the city's main bus terminal. The ferry terminal – Trajektna luka Split – which is about a 10-minute walk from Old Town, is the place to catch a boat to nearby Croatian islands.", "For U.S. citizens entering Croatia, a passport that is valid for at least three months beyond the travel departure date is required. Note: Croatia is not part of the Schengen area, but if you are traveling to a Schengen country on your way to Croatia, your passport should have at least six months of validity. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for more information on entry and exit requirements."]}