{"name": "Buffalo", "description": ["Buffalo isn't often a destination that appears on a traveler's must-visit list. Blizzards and Bills losses usually dominate national headlines when news circulates about Buffalo. But in the last decade, a palpable resurgence has been fueled by local pride, grit and a deep belief that the things that once made Buffalo great – its Great Lakes waterfront, its ingenuity, its art, and most of all, its people – are the same things that make it great today. That belief, paired with roll-up-the-sleeves determination, has transformed the city from a rust-belt has-been to a destination worth discovering.", "But despite all its revitalization and growth, Buffalo is still a bigger city (the second largest in New York) with a small-town feel – prices won’t break the bank, everything is less than a 20-minute drive away, and it’s nicknamed the \"City of Good Neighbors\" for a reason: the people here are warm and welcoming, always ready to converse with strangers over a pint, dig your car out of a snowbank and share insider tips on the best that Buffalo has to offer.", "The best time to visit Buffalo is between June and September. Although summertime is the most crowded and the city's high season, the weather can't be beat: Average highs are in the upper 70s and lower 80s. The tourist crowds tend to wane a bit in the fall and spring, but these seasons can be pretty chilly. Wintertime in Buffalo can be downright dismal with temperatures hovering around freezing, coupled with lots and lots of snow.", "Check out the 'hoods Buffalo's neighborhoods are fun to explore. Allentown is known for its galleries and nightlife, while the Elmwood Village and Hertel Avenue are a favorites for local shops and restaurants.", "Spend a night at the theater Buffalo brims with theaters that stage everything from Broadway to dramas and more. Shea's Performing Arts Center is a particularly stunning venue.", "Pack a passport If you're thinking about taking a day trip to Niagara Falls and would like to visit the Canadian side of the falls (a must, according to recent travelers), remember to bring your passport to present at the border crossing.", "Enjoy the freebies The view from the observation deck at Buffalo City Hall, walks through picturesque Forest Lawn, Delaware Park and Canalside won't cost you a thing. Many museums offer free admission days each month.", "To put it plainly, Buffalonians love to eat (and drink). The city is rich with cultural food influences, first by its early settlers from Italy, Germany, Poland and Ireland, and in recent years, waves of new neighbors have shared dishes from Puerto Rico, Iraq, Somalia, Yemen, Burma, Bangladesh and Vietnam. In Buffalo, portions of ethnic cuisine tend to be huge and affordable.", "Amidst the varied menus are certain foods Buffalo is most famous for. Buffalo wings, served with blue cheese and never ranch, are an icon; every neighborhood will swear their corner pub serves the best, but Anchor Bar, Duff’s and Bar-Bill Tavern usually top the list. There’s also “Beef on Weck,” thinly hand-carved roast beef on a salt- and caraway-crusted kummelweck roll served with horseradish; and sponge candy, squares of meltingly light spun sugar candy coated in chocolate. Buffalo is also a beer town, with a long history of beer-making and a continuously growing cadre of quality breweries.", "But there's more than just pizza and Buffalo wings in Buffalo. In recent years the Queen City’s chefs have garnered national attention with James Beard Foundation accolades for showstopping menus featuring inventive dishes, farm-to-table ingredients and international influences. Reservations can fill up months in advance, so it’s wise to book a table as soon as travel plans are known.", "The best way to get around Buffalo is by car. Although the city offers both bus and train service, a car will be the most convenient option for getting to and from Buffalo hotels and the top things to do. If you'd rather take a taxi, you'll have to call one of the city's trusted companies or request an Uber or Lyft; hailing a cab on the street isn't easy.", "To get into the city, you can fly into Buffalo Niagara International Airport (BUF), which is located about 10 miles east of the city center. Alternatively, you can travel by Amtrak train, which drops passengers off near the city center, right off the Niagara Thruway."]}