{"name": "Charlottesville", "description": ["Speak to one of the locals and they'll tell you that Charlottesville is \"Mr. Jefferson's Town.\" Truly, Thomas Jefferson's legacy does indeed shine brightly here. You'll feel his imprint while strolling past the columns of the University of Virginia's Academical Village, or through the vegetable gardens of Monticello. This town bears the mark of other founding fathers, as James Monroe's home, Highland, is also here (and coincidentally, TJ had his hand in Monroe's selection of the property). Still, \"C-Ville\" is good for more than a stroll down historical memory lane — just take a look at the youthful, diverse population as proof. You'll find hip coffee shops and hookah lounges, and an outdoor pavilion space that hosts up-and-coming indie music talent each summer. In other words, this central Virginia city encourages you to embrace both its heritage and its forward-thinking movement. Mr. Jefferson wouldn't have it any other way.", "The best time to visit Charlottesville is from May to July. It's a smart idea to plan a trip to the city around the academic calendar and the best wine-tasting seasons; in this case, spring is the season for wine festivals and balmy Virginia weather. Fall is also nice, particularly if you want to catch a glimpse of the region's spectacular autumn foliage. But keep in mind: other travelers have the same idea, meaning the city and surrounding Shenandoah National Park can get busy. And come August, students return to UVA for classes which ushers in extra crowds. Winters can be biting with less-than-ideal conditions for walking around, but the chilly temps do usher in more moderate lodging and airfare rates.", "Jefferson dreamed of a school His vision, the University of Virginia, was the first school in the country where students could receive a nonsectarian (or nonreligious) education. UVA is still regarded as a brilliant institution of higher learning, and for its striking, sprawling campus.", "Jefferson dreamed of Virginia wine And thus, he sold part of his land to an Italian viticulturist to plant grapes. Years later, the Jefferson Vineyards is just one of many local wineries for you to explore.", "Jefferson picked an ideal location Charlottesville makes a great base for taking daytrips to other Virginia cities. Richmond, Staunton, Lynchburg and Harrisonburg are all about an hour's drive from Charlottesville.", "Hop on the trolley Though a rental car is the easiest way to get around the region, Charlottesville Area Transit does offer a free trolley that services the historic Downtown Mall and the University of Virginia.", "Take advantage of free spots A few museums, art galleries and the city market are free and open to the public. From the Rotunda at UVA to the Saunders-Monticello trail, you can get a full C-Ville experience without spending a dime.", "It would be a shame if Charlottesville lacked a vibrant restaurant scene to pair with its delectable wines, but luckily, the city delivers on both fronts. ", "Let's start with breakfast. Both visitors and locals rave about Bodo's Bagels, which manages to be fast, cheap and (perhaps most importantly) tasty, with a menu of New York water bagels. For a fuller menu, head to Bluegrass Grill & Bakery, which wins favor with foodies for its homemade biscuits and chocolate-covered bacon. If coffee is all you're after, you can't go wrong with Mudhouse, according to residents. You'll find several locations scattered around Charlottesville, but travelers suggest you head to the original in the historic Downtown Mall. For coffee with a side of delectable, freshly baked pastries, head to MarieBette Café and Bakery.", "When it comes to lunch and dinner, you'll have just about any cuisine at your fingertips – or should we say tastebuds? For casual bites, locals say you can't go wrong with Dr. Ho's Humble Pie (pizza), Mel's Cafe, Soul Food Joint and Citizen Burger Bar. If you and your companions can't agree on a cuisine, hit up Dairy Market. The food hall serves everything from pizza to vegan burgers and desserts to Japanese. For a finer dining experience, C & O Restaurant, which has been open since 1976, is a perennial favorite among locals. And it's not just because of the locally sourced menu; the restaurant boasts six unique dining areas, each offering a different ambiance to enjoy the eatery's menu of American classics. Fleurie also wins high marks from patrons for its French cuisine and comprehensive wine list. Just bear in mind that you'll be splurging to dine here. Other favorites include tavola (Italian), Mas Tapas (Spanish) and the Ivy Inn Restaurant.", "Centuries after Thomas Jefferson bought acres of land with the idea of cultivating grapes for wine, the region's wineries are flourishing. The variations in soil, temperature and light in the Charlottesville area make for a diverse selection, so sampling some of Virginia's best wine is a must-do while in C-Ville. If you want to pick wineries yourself, check out the Monticello Wine Trail, an association of more than 30 wineries within 30 miles of Charlottesville. Should you want someone else to drive, as well as get help from an experienced guide, recent travelers agree you can't go wrong with Monticello Wine Tours. Oenophiles particularly recommend the company's Western Wine Region Tour, which hits three different vineyards west of Charlottesville.", "If you're not into the region's vino, you're in luck: Charlottesville has a host of other drinking establishments, including several breweries and cideries. Locals recommend Blue Mountain Brewery, Champion Brewing Company and Three Notch'd Brewing Company if you're looking for beer. Favorite cideries include Potter's Craft Cider, Albemarle Ciderworks and Bold Rock.", "The best way to get around Charlottesville largely depends on what you plan to do. The close proximity of businesses in downtown make it easy for visitors to walk from place to place. Not up for walking? The city provides a free trolley service that delivers passengers to the main local attractions including the UVA rotunda, Scott Stadium and the Downtown Mall. The bus system is also an option for getting around downtown, though the majority of its routes is for residential use. It offers one-day unlimited use for only $1.50.", "If you want to enjoy attractions outside of the city with a trip to a winery, presidential homestead or Shenandoah National Park, you will need a car. Most of these options are at least 5 miles outside the city center. Parking garages are available downtown and your hotel may have parking available as well.", "The closest airport is the Charlottesville-Albemarle Airport (CHO), which is about 10 miles north of downtown. It's serviced by top airlines like Delta, United and American. If you do decide to rent a car, you can do so at the airport.", "Fall is a popular time to visit Charlottesville thanks to the stunning autumn foliage in Shenandoah National Park, but spring is just as beautiful, especially at Monticello."]}