{"name": "Madagascar", "description": ["Dreaming of a tropical getaway spent lounging on idyllic islands, trekking through verdant rainforests, hiking around jaw-dropping rock formations and spotting unique wildlife? Then set your sights on Madagascar. Located in the Indian Ocean, about 743 miles east of Mozambique, this African paradise is the fourth largest island in the world. Approximately 19,000 types of plants can be found in the country's 47 national parks and reserves, but its one-of-a-kind animals are the main draw for nature lovers. All of the world's 100-plus lemur species call this island nation home, as do more than 340 kinds of chameleons and a variety of birds.", "Though you'll likely spend some time in populous areas like Antananarivo (the country's capital) and Nosy Be (a small island off the mainland's northwest coast), Madagascar is filled with regions ripe for exploration. Travelers can head offshore to snorkel around Nosy Sakatia or swim at The Three Bays, and photography enthusiasts can snap breathtaking pictures of the sun rising or setting over Morondava's Avenue of the Baobabs. Fitness buffs, meanwhile, have access to hiking trails at Anja Community Reserve, plus Tsingy de Bemaraha Strict Nature Reserve's towering limestone pinnacles, which are ideal for climbing. If you'd rather have a more quintessential Malagasy vacation, travel deep into national parks like Isalo and Mantadia to watch lemurs, boa constrictors and more lingering in the trees.", "The best time to visit Madagascar is from April to October. This dry season brings fewer rain showers, meaning optimal conditions for observing animals, hiking and participating in water sports activities. Although accommodation rates are higher at this time, properties will be easier to access due to the country's roads being clear. Temperatures will also be more comfortable than they are during the wet season.", "Home to 18 main ethnic groups, Madagascar is a diverse island nation. Malagasy and French are the country's official languages, the latter of which was introduced when the French colonized the region from 1896 to 1960. You may also find a few Malagasy people who speak English, but it is best to use Malagasy or French when possible. Of the two primary languages, Malagasy is more commonly used. Some key Malagasy and French terms and phrases to use while traveling in Madagascar include \"manao ahoana e\" and \"bonjour\" (hello), \"Manao ahoana ny fahasalamanao?\" and \"Comment allez-vous?\" (How are you?), \"Tsy azoko\" and \"Je ne comprend pas\" (I don't understand), \"Mahay miteny angisy ve ianao?\" and \"Parlez-vous anglais?\" (Do you speak English?), and \"veloma\" and \"au revoir\" (goodbye).", "Although Madagascar's capital city of Antananarivo has a population of more than 1.3 million people, the majority of Malagasy people live in rural areas, where traditional customs and practices are the norm. Men and women who live in the countryside, for example, mainly wear locally made garments like dresses with gathered skirts and oversized shirts with long pants, while wealthier individuals and those living in cities often wear a mix of Western attire and traditional items like lambas (shawls) and raffia hats. Many Malagasy people will also celebrate family-focused ceremonies, such as Famadihana (a sacred ritual that involves removing the bones of loved ones from an ancestral crypt to rewrap with fresh garments).", "Music is an integral part of Malagasy culture. Western dances, lyrics and instruments are blended with Malagasy rhythms to create the bulk of the country's contemporary music. Western musical styles like rock, jazz and hip-hop can also be heard here, but one of Madagascar's most popular genres is salegy, an energetic style that features electric guitars, accordions, drums and call-and-response vocals. Salegy and other genres are played at various bars and clubs throughout Antananarivo, including the Hotel Glacier, Pandora Station and Espace Dera, but prostitution – which is illegal in Madagascar – occasionally takes place in entertainment venues, so exercise caution when enjoying Malagasy nightlife.", "The official currency in Madagascar is the Malagasy ariary (MGA). One Malagasy ariary equals approximately $0.0003, or less than one American penny, but you'll want to check the latest exchange rate before visiting. Euros are easiest to convert to Malagasy ariary in-country, but some currency exchange vendors will take dollars. Credit cards are not accepted at most Malagasy locales, so plan on using cash; if you need additional currency, ATMs are available in most major towns.", "Visitors are expected to tip for tourism-related services, but tips are not required for taxi services. It is customary to tip 5 to 10 percent of your food bill at restaurants that do not list service charges on receipts, while hotel employees (think: bellhops and housekeepers) should receive about 2,000 Malagasy ariary (less than $1) each per stay. Tour guides generally expect 10,000 to 20,000 Malagasy ariary (or $3 to $6) per day, and you should allot about 5,000 to 10,000 Malagasy ariary (or $1.50 to $3) per day for drivers.", "The predominant cuisines in Madagascar are Malagasy and French, with French fare generally being more expensive. Antananarivo and Nosy Be are considered the best cities for fine dining and house many of the country's most popular restaurants. For a quintessential French meal, travelers suggest La Rhum Riz - Chez Nono on Nosy Be and Le Restaurant La Varangue, KUDéTA and Restaurant Sakamanga in Antananarivo. Nosy Be's Chez Loulou and Chez Mama are also highly regarded for their authentic Malagasy dishes, such as ravitoto (a pork and cassava leaf entree that's commonly served with white rice) and romazava (a stew made with beef, chicken or pork and leafy greens).", "If you're willing to trek outside Madagascar's culinary meccas, try grabbing a bite to eat at Le Restaurant Mad-Zébu de Belo, which is in the small town of Belo Tsiribihina. Though service is sometimes slow, visitors say the European-inspired dishes are as tasty as those served in many Michelin-starred restaurants. L'Idylle Beach, on Nosy Boraha (also known as Île Sainte-Marie), is also recommended for French cuisine and panoramic ocean views.", "For more affordable meals, consider savoring some of the country's street fare. By Antsirabe's daily market, you'll find hawkers selling fried finger foods like nem (eggrolls) and sambosa (similar to samosas, or triangular pastries stuffed with potatoes and ground beef). Antananarivo's Analakely market, meanwhile, boasts an array of fresh fruit (think: lychees, bananas and papayas), plus fresh fish and grilled meat dishes.", "Pickpocketing and stealing luggage from Ivato International Airport's baggage claim occurs regularly in Antananarivo. Additionally, violent assaults against travelers occasionally takes place in areas like Nosy Be and Tamatave, and remote highways are frequently targeted for robberies. What's more, street altercations and traffic accidents designed to draw a scene and incite violence against a foreigner is becoming increasingly more common. As a result, it is best to be aware of your belongings and surroundings at all times and to avoid unpopulated roads and public disputes.", "Since a democratic government was elected in 2014, violent political events have been rare. However, deadly incidents do occur from time to time, so it's best to avoid or stay alert when visiting government buildings, national sports arenas and historic monuments in Antananarivo.", "Malaria can be contracted from Malagasy mosquitoes carrying the disease. To protect yourself while staying in the country, wear long-sleeved clothing and insect repellent with DEET (a chemical that makes it difficult for mosquitoes to smell you). You'll also want to speak with your doctor before your trip to obtain an anti-malarial medication and go over possible drug side effects.", "The U.S. State Department strongly advises all Americans who plan on vacationing in Madagascar to sign up for the free Smart Traveler Enrollment Program, which notifies the nearest embassy or consulate of your travels. Additional security concerns and safety tips for Madagascar can be found on the U.S. State Department's website.", "The best way to get around Madagascar is to hire a car with a driver or join an organized tour. Car rentals commonly come with a driver as part of their rates and give you the most flexibility with your itinerary. Tours, however, generally cover the cost of accommodations and some or all meals, but you'll have to stick to a set schedule and travel with other visitors. Limited public transportation options are also available, but these affordable services are slow and often uncomfortable and unsafe. For longer trips between select towns, traveling by plane can be arranged. Getting to the island will require flying into Ivato International Airport (TNR) in Antananarivo or arriving by cruise ship to various Malagasy locales, including Antsiranana, Nosy Be and Tamatave, via cruise operators like Costa Cruises and MSC Cruises.", "To enter Madagascar, you will need a U.S. passport that is valid for six months past your arrival date and has three blank visa pages. A tourist visa is required for all stays less than 90 days, which can be purchased at the Embassy of Madagascar in Washington, D.C., or any port of entry in Madagascar. Visas cost $28.70 for stays lasting up to 30 days; $35.88 for stays lasting between 30 and 60 days; and $50.23 for stays lasting 61 to 90 days. For visas purchased upon arrival, only dollars, euros and Malagasy ariary are accepted. A valid World Health Organization-approved International Certificate of Vaccination (also known as a \"yellow card\") is also required if you have visited or had a stopover in a country where yellow fever is present up to six months before your arrival. Additional information about entry and exit requirements can be found on the Embassy of Madagascar's website and the U.S. State Department's website.", "Madagascar is the only country in the world where wild lemurs reside. You'll find 97 species of this one-of-a-kind primate living throughout the island."]}