{"name": "Stockholm", "description": ["One of the most visually arresting cities in Scandinavia, Stockholm is situated on an archipelago containing roughly 30,000 islands that eventually lead to the Baltic Sea. Among the various islands positioned throughout the city's vast amount of waterways, bays and rivers visitors will find an assortment of architectural, cultural and natural gems begging for further exploration. From the quaint and pristinely preserved 13th-century-old Gamla Stan, or Old Town, to the sprawling, attraction-packed Djurgården park island, Stockholm is a floating, visual treat that has the power to leave sightseers awestruck at its incredible landscape.", "The city's uniqueness isn't only tied to its grand topography – Stockholm also features an astonishing climate and setting. Visit in summer to experience close to 24 hours of sunlight, a phenomena celebrated with a Midsummer Festival that will leave you with a hearty knowledge of Swedish cuisine and tradition. Or, test your tolerance during one of Sweden's notoriously freezing winters for a chance to ice skate on one of the city's many frozen rivers. Whenever you choose to visit, know that you'd be hard-pressed to find a city like it anywhere else in Europe. Maybe even the world.", "The best time to visit Stockholm is in the summer – albeit the city's priciest season – because the temperatures are warmest and daylight lasts the longest. Average summertime highs range between 68 and 71 degrees Fahrenheit, with the hottest weather occurring in mid-July. It's important to bring layers, however, as temps can sometimes drop by 10 to 20 degrees come nightfall. The fall and spring seasons are chillier, with highs barely reaching 60 degrees, and that's only during September and May. Winters in Stockholm tend to be extremely cold but are ideal for travelers interested in winter sports or a picturesque Christmastime getaway.", "Take off your shoes In Sweden, it's expected that you remove your footwear when entering someone's home. It's such a cultural staple that if you didn't do so, you'd be seriously offending someone.", "It will be cold Sweden's winters are notorious, but it can still get chilly during the warmer months. If you're visiting during the summer, wear layers as temperatures drop 20 degrees lower at night.", "Stay away from Gamla Stan The city's Old Town is also known as the tourist district among locals, so expect room rates and restaurant prices to be way more than what they would be elsewhere in the city.", "Rely on your own two feet Stockholm is big and walking the whole city is not recommended. But many of the city's top attractions, including Gamla Stan, Djurgården and Fotografiska, are all a little more than a mile apart from one another.", "Don't take taxis Taxis are incredibly expensive in Stockholm, with 6-mile journeys clocking in at almost $40. The city has plenty of great public transportation options, including metros, buses, ferries, light rail lines and trams.", "Though Sweden is a part of the European Union, the country is more independent. It doesn't share the euro with other member countries, but rather has its own currency called the krona. If anything, the country identifies itself as more a part of Scandinavia than anything, which includes Sweden as well as neighboring Norway, Finland and Denmark. Due to its placement high up north, Swedes lives are completely dictated by the weather in ways that people in other countries with milder seasons just aren't. Winter is long, inches of snow are the norm for months and during certain times of year, the sun sets as early as 3 p.m. So for the few months that you don't need to wear a sweater outside, you'll see Swedes out in droves both during the day and night laughing and enjoying life to the fullest. This can definitely be seen during Midsummer. Midsummer is one of the most important holidays in Sweden, rivaling Christmas as the biggest. In short, it's a summer solstice celebration that takes place sometime between June 20th and 25th where family and friends come together to celebrate the season. There are a number of traditions carried out as well, but mostly it's a time to unwind, enjoy Sweden's beautiful surroundings and cook a big feast equipped with the most traditional Swedish dishes. All Swedes head to the countryside to celebrate, so if you happen to be in Stockholm during Midsummer, the city will be next to dead. If you want to be part of the festivities but don't necessarily know where to go, Skansen hosts Midsummer festivities. ", "Swedes are a reserved bunch but are quite friendly to tourists, so if you need any directions they are likely happy to help out. The city is also practically fluent in English, so your chances of getting lost in translation with the Swedish language are about slim to none. Though Swedes are warm to visitors, it's worth noting they like order, especially on public transportation. To avoid ruffling any feathers, always remember to stand on the right when going up or down escalators on public transportation, to make way for anyone who wants to walk down the escalator on the left. When meeting Swedes socially, don't ever do the two kisses greeting commonly found in other parts of Europe. Much like other countries in northern Europe, such as Ireland and Germany, Swedes greet each other with a handshake when meeting for the first time. And if you're ever invited into a Swedish home, it's considered rude not to take your shoes after entering the house.", "Though it's easy to find a wide variety of international cuisines in Stockholm, try to seek out Swedish food during your stay. And no, it's not all meatballs (though the Swedes do love their meatballs). Swedish food tends to be on the heavy side, and is a very meat-and-potatoes-type diet filled with lots of proteins and starches, as well as some fruits and veggies. Sweden's close proximity to the coast yields lots of fish-focused meals too, including herring, one of the most traditional dishes in the Swedish palate. Herring can be found in bulk off the Baltic coast and as such has been eaten by the Swedes for centuries. Though it can be prepared in a variety of ways, the most popular form is pickling, with the most common flavors being mustard, onion, garlic and dill herring served with a side of potatoes, boiled eggs, sour cream or sharp hard cheese. Other popular seafood dishes are Jansson's Temptation, a potato and anchovy casserole, and toast Skagen, which is toast topped with a mixture of shrimp, mayo, dill and lemon.", "Along with seafood, another staple in Swedish cuisine is bread. In the 1970s, the Swedish National Board of Health and Welfare and the Swedish Bread Institute ran a campaign recommending Swedes eat between six to eight slices of bread a day. You'll likely see bread in various forms on many Swedish menus, with the most popular being open-faced sandwiches (sandwiches with just one piece of bread) and crispbreads, or big crackers served either with meals as a light side or covered with toppings. If you really want to feel like a Swede, get some crispbread and top it with Kalles, a cod roe spread squeezed from a tube, typically consumed for breakfast. Those who have an adventurous appetite should definitely try surströmming, or herring which is fermented for months in a tight, tin can. The dish is widely considered one of the world's most pungent, with some comparing it to the stench of raw sewage. The smell is so strong, most won't allow it to be served indoors.", "If you're not one for seafood, Sweden still has something for you. Meatballs are as beloved here as they are at Ikea, and pancakes are another delectable option as well. In Sweden though, pancakes are thin and made with ground potato instead of flour and eggs. Lingonberries, the same sweet sauce you may remember being served with your meatballs at Ikea, are almost always served with pancakes. Sweets are kind of a big deal in Sweden, so much so that there is a day dedicated to indulging called lördagsgodis, or \"Saturday sweets.\" While in Stockholm, pick up a cinnamon bun (buns are to Swedes what biscotti is to Italians), try a slice of princess cake (yellow sponge cake with jam and vanilla custard covered with green marzipan), or saffron buns (pastries made with golden saffron and sprinkled with dark raisins).", "Stockholm has a reputation for being a very safe city, for locals and visitors alike. Make sure to exercise common sense practices both day and night, including keeping your bags secure and walking along lit streets.", "The best way to get around Stockholm is by the excellent public transportation system; several bus lines, metro, commuter rails, trams and ferries cover the big city very efficiently. Biking is another popular option for getting around, as the city boasts numerous bike lanes and paths. Neighborhoods like Gamla Stan are certainly walkable, but the expansive city is tough to cover solely on foot. Although we don't recommend driving, rental cars are available at the Stockholm Arlanda Airport (ARN) – about 30 miles north of the city. But it's easier to take the commuter rail or the Arlanda Express high-speed train into town instead. Taxis from the airport to the city center charged a fix fare of 450 to 500 kronor (about $52 to $58).", "U.S. citizens will need a passport to enter Stockholm and it must be valid at least three months past your stay. A visa is not required unless you plan to visit for longer than 90 days. Visit the U.S. State Department's website for more information on entry and exit requirements. "]}