{"name": "Charleston, SC", "description": ["Centuries-old mansions, Spanish moss-draped trees, spooky cemeteries, cobblestone alleys: in a word, Charleston. As you walk the gas lamp-lit streets at night and pass horse-drawn carriages, you just might think you've traveled back in time. But just because this South Carolina city is proud to celebrate its heritage doesn't mean it's stuck in the past. Charleston boasts innovative restaurants, interesting shops, contemporary art galleries and the world-class Spoleto Festival USA. ", "History pervades almost every aspect of the Holy City, from the majestic homes-turned-museums to the landmarks that promote the city's role in United States history. History buffs can visit Fort Sumter to learn about the Civil War, Middleton Place to hear stories about the plantation owners and the enslaved Africans who worked for them, and Emanuel AME Church to see where Martin Luther King Jr. once delivered a historic speech. Meanwhile, shopaholics looking for locally made goods should peruse the Charleston City Market where they will find sweetgrass baskets woven in traditional Gullah design, among other unique souvenirs. When you're ready for a day at the beach, the city's got you covered there, too. Several neighboring beach towns, including Sullivan's Island, Isle of Palm and Folly Beach, offer sun, sand and gentle waves.", "The best time to visit Charleston is from March to May or from September to November when temperatures are mild – but not stifling. Hotel rates, however, will be high, especially around Easter. Also, the city will be thick with crowds \"ooh-ing\" and \"ahh-ing\" at the blooming magnolia trees, the Southern fried food and their tour guide's ghost stories. Steer clear of high prices and tourist swarms by visiting in the late fall or early winter.", "Take to the streets Charleston is known for its excellent (albeit decadent) Southern food. Burn some calories by strolling to dinner or taking a walking tour.", "Don't forget the sunscreen Summer here is hot, hot, hot. The sun scorches and the humidity can be suffocating. Lather on sunscreen, wear your shades and hydrate.", "Visit in the winter You might score a lodging deal by traveling in the offseason, and you'll definitely see fewer tourists. What's more, winter temperatures are hardly inhospitable – they hover between 40 and 60 degrees.", "Stay at a bed-and-breakfast Charleston is full of charming B&Bs and many of them are cheaper than the city's brand-backed hotels. Plus, you'll likely enjoy extra perks like complimentary breakfasts and evening happy hours.", "Make lunch reservations Get the most bang for your buck by making lunch reservations – rather than dinner ones – at the most expensive restaurants. Many eateries offer reduced-price midday menus.", "Consider dressing up a little if you don't want to stick out as a tourist in Charleston. Residents have a different take on casual; women wear skirts and dresses while you'll see many men dressed in khakis and polo shirts.", "\nWhile you're in town, you will also get a glimpse into Gullah culture. Gullah people are residents of low country South Carolina whose ancestors were brought to Charleston in the transatlantic slave trade, and they have preserved their African culture and heritage over time. Their tradition has influenced much of Charleston cuisine, from the food (red rice, okra soup, gumbo) to the \"Bruh Rabbit\" folk stories (slave fables starring a devilish rabbit) to the songs (\"Michael Row the Boat Ashore\"). If you're shopping for souvenirs, keep an eye out for the Gullah's handcrafted sweetgrass baskets, which you can find at the Charleston City Market. If you're interested in learning more about Gullah language and customs, consider signing up for a guided tour. Gullah Tours earns high marks from travelers, who applaud the tour guide's vast knowledge of Charleston's Black history.", "Charleston is a top foodie destination in its own right. Even if you're not in town for one of the city's culinary events (like the Charleston Wine + Food Festival or Charleston Restaurant Week), you'll still get a chance to sample some low country cuisine at any one of the city's top restaurants.", "Travelers and locals alike heap praise on Husk and Magnolias for their contemporary Southern menus and attentive service. Favorite dishes at Magnolias include the down south egg roll, the buttermilk fried chicken breast and the shellfish over grits. On King Street, you'll find locals and tourists headed to Rodney Scott's Whole Hog BBQ to sample ribs and pork sandwiches. For some true low country soul food, try traveler-approved Bertha's Kitchen. Poogan's Porch is a great place for brunch and is set in a charming, restored Victorian house, but if you're in the mood for more casual breakfast or coffee spots, consider The Daily or Second State Coffee. ", "Of course, Charleston's location near the ocean makes it a great spot for fresh seafood, and restaurants like Gillie's Seafood, Nana's Seafood & Soul Uptown and 167 Raw – an oyster bar that's popular for its oyster selection and lobster rolls – will deliver. During peak tourist season, waiting for a table at one of these eateries can turn into a long night. If you already know where you'd like to dine while in Charleston, make reservations before you get into town. ", "Along with its impressive food menus, Charleston also boasts a bevy of trendy drinking establishments worth checking out. The Gin Joint, The Belmont and The Rooftop Bar at Vendue are all praised watering holes to consider. Meanwhile, Bourbon N' Bubbles caters to a glamorous crowd.\n ", "Downtown Charleston near the Historic District is generally safe and best known for its Southern hospitality. However, it's still a busy city and visitors should use common sense when exploring. Avoid walking alone at night (especially in the city's many alleyways) and keep valuables close to you.", "The best way to get around Charleston is on foot. That said, you'll probably enjoy the use of a car too. You can rent some wheels at Charleston International Airport (CHS) – or bring your own – and leave it parked in one of the garages that pepper the city. Having a car is especially helpful if you're staying in the city outskirts or if you plan on indulging in some beach time. City buses and trolleys are available too, as are taxis. From the airport, which is located about 12 miles northwest of the downtown area, you can take a cab or shuttle bus. There is a $15 minimum charge for taxis departing from the airport. From the airport, there is also a shared shuttle bus that departs every 15 minutes and costs $15 per person. The price is lower than a taxi ride, but the trip will be longer due to the multiple stops the bus makes."]}