{"name": "U.S. Virgin Islands", "description": ["The U.S. Virgin Islands are \"America's Caribbean Paradise\" – the place to see moko jumbies (stilt walkers) dance at a Carnival parade, hear the lilting patois of a Creole dialect or smell the spices in a saltfish pate (all without losing cell phone reception). You can visit either St. Thomas, St. John or St. Croix, or better yet, spend a little time on all three islands. That way you'll get plenty of pampering, undisturbed nature and colonial history jammed into one vacation.", "Each island offers something different. Called \"Rock City\" for its hilly, craggy horizon, St. Thomas is known for luxury – from the megayachts moored in the harbor to the high-end storefronts along Main Street. Located a short ferry ride east, St. John appeals to honeymooners and nature lovers, with more than 7,000 acres of dedicated parkland, along with pristine beaches. Way down south in the Caribbean Sea, St. Croix allows visitors to explore the islands' colonial heritage and the history of slavery at several different forts and plantations. Plus, it's on this island that you'll find the Cruzan Rum Distillery.", "A visit to the islands now may look a little different than it did several years ago. Hurricanes Maria and Irma devastated the islands, leaving homes and hotels either uninhabitable or severely damaged. However, since 2017 the region has taken great strides in restoring itself and is happily welcoming visitors once again. So, if you're in need of a beachy vacation, don't hesitate to book your trip.", "The best time to visit the U.S. Virgin Islands is April to June, when you can expect mild weather and very little rainfall. In the USVI's peak season, from December to March, the temperature ranges from the mid-70s to high 80s with breezy evenings. July to October is the region's hurricane season with average temps in the upper 80s.", "Learn the proper greeting Say \"good morning,\" \"good afternoon\" and \"good night\" to locals when you enter or exit a room. They consider these phrases friendlier greetings than \"hello.\"", "You need special sunscreen In March 2020, the U.S. Virgin Islands banned the use and possession of sunscreen that contains oxybenzone, octinoxate and octocrylene to protect its prized ecosystem. Sunscreens labeled \"reef safe\" are likely free of these three ingredients, but always check the label to be sure.", "Book early It's possible to secure a good deal at one of the USVI's four-star hotels in the peak season, but you should start looking for a room up to a year in advance. ", "Take an Eastern Caribbean cruise St. Thomas is one of the busiest ports in the Caribbean, and the top cruises generally dock for up to eight hours. That'll give you time to explore Rock City or even take a ferry to St. John.", "Similar to the residents of other Caribbean islands, Virgin Islanders dress casually but conservatively. Wearing a bathing suit — or even sandals — anywhere besides the beach marks you as a tourist. ", "Since these islands are territories of the United States, their currency is the U.S. dollar. Overall, tipping etiquette is the same in the Virgin Islands as in other parts of the United States; 15 to 20% is considered the standard, but more is appreciated for exceptional service.", "The U.S. Virgin Islands offer an assortment of restaurant options that range from white tablecloth establishments to affordable diners and fast-food joints. For a tasty meal on St. Thomas, head to restaurants in Frenchtown or Red Hook. On St. John, Cruz Bay is the place to be. There are also a handful of suitable options on St. Croix's West End. ", "Most restaurants in those areas will give you the coddling tourist experience, but you might also find the opportunity to try a local dish. Look for menu options like pate (ground beef, chicken or salted cod wrapped and deep-fried in dough), johnnycake (deep-fried dough), fungi (corn meal) or peas and rice (kidney beans or lentils with brown rice) to eat like a Virgin Islander.", "St. Thomas is a major commercial hub and a very busy cruise port, and therefore susceptible to tourist-targeted crime. Additionally, there is a presence of violent crime on this island, though you'll see fewer violent crimes on St. Croix and St. John. Take a taxi if possible, and if you have a rental car, keep it locked. Limit your travels at night – particularly in Charlotte Amalie, Christiansted and Frederiksted – and don't travel alone.", "You should also safeguard your skin. The heat in the Caribbean can certainly be luxurious, but also scorching. Always remember to apply sunscreen before venturing out and reapply frequently if you'll be outside all day. (Know, too, that the U.S. Virgin Islands has banned sunscreen that contains oxybenzone, octinoxate and octocrylene.) Use insect repellent in the evenings when the islands' \"no-see-ums\" (tiny gnats) like to bite.", "The best way to get around any U.S. Virgin Island is in a car – either your own rental or a taxi. You can rent a car at or nearby one of the islands' two airports: the Cyril E. King Airport (STT) on St. Thomas and the Henry E. Rohlsen Airport (STX) on St. Croix. Ferries from St. Thomas are the most efficient way of getting to St. John (which has no airport) or even the British Virgin Islands. ", "Taking a cruise is also a popular way to travel to the Virgin Islands – in fact, St. Thomas is one of the busiest cruise ports in the Caribbean. Although its port is less busy, you can also take a cruise to St. Croix. Popular lines to visit both islands include Celebrity Cruises and Royal Caribbean.", "Although a passport is not required to travel between the United States and the U.S. Virgin Islands, you must bring a passport if you're planning to visit the British Virgin Islands during your stay. Visit the U.S. State Department's website for more information on entry and exit requirements."]}