{"name": "South Island, New Zealand", "description": ["Whether it's the area's famed adventure destinations, dreamy alpine adventures and colorful hiking routes or simply a tranquil, healing escape from the hurdles of recent pandemic years, New Zealand's South Island has something for every traveler. And with the country's government having dropped border restrictions in July 2022 following more than two years of some of the tightest entry controls in the world, now's the perfect time to plan that bucket list trip you've been dreaming about since the world shut down.", "Known in Maori (the language of New Zealand's indigenous Maori people) as Te Waipounamu, the 58,084-square-mile island is situated in the southernmost region of Australasia, with the Pacific Ocean on the east and the Tasman Sea to the west. Larger in geographic size, but smaller in population than the North Island, the destination stretches from the pristine golden sands of the Nelson region (a 3.5-hour ferry ride from the capital city of Wellington on the North Island) to the rugged mountain landscapes of rural Otago and Southland. In between, visitors will find everything from wine regions, Maori cultural experiences and Hollywood filming locations to the breathtaking backbone of the Southern Alps mountain range.", "American travelers can fly direct into Auckland, on the North Island, from cities including Los Angeles, New York City, Dallas, Honolulu and San Francisco, then take a domestic flight to South Island cities like Queenstown, Dunedin, Nelson and Christchurch. From Auckland, domestic connections within Aotearoa (the Maori name for New Zealand) are all less than two hours and scenic adventures of their own as you gaze down on one stunning view after the next before touching down at your destination. Window seats are a must!", "The best time to visit the South Island of New Zealand is December to February if you're looking to experience outdoor fun in optimum summer weather. The average daily temperature ranges from 68 to 77 degrees Fahrenheit during this time, but bear in mind that the farther south you venture, the cooler lows you may face. And remember that \"four seasons in one day\" is how Kiwis often describe weather during any given season. For those hoping to enjoy the region's winter resorts and activities, the best time to visit is between June and August. For ski vacations, the season typically runs from mid- to late June to October. Average daytime temperature during New Zealand's winter are 53 to 61 Fahrenheit, but remember that it gets cooler the farther south you go.", "Weather can change drastically and rapidly, especially during activities like visiting Milford Sound, multiday hikes and alpine excursions. Pack layers and comfortable footwear and ditch fancy frocks or heels – even upscale South Island establishments will let you in wearing flip-flops.", "The thinness of the ozone layer above New Zealand results in high UV exposure, particularly in the summer months (December to February). Remember the Kiwi saying, \"slip, slop, slap:\" slip on a T-shirt, slop on a hat and slap on sunscreen. In summer, avoid direct sunlight between 10 a.m. and 4 p.m., when UV exposure is highest.", "New Zealand asks tourists to agree to the Tiaki Promise – a pledge to exercise care and consideration for the country's environment (by leaving each destination as you find it), people and culture, and to travel with \"an open heart and open mind.\"", "While trains, buses and flights will help you travel around the island, a rental car is the best way to experience the South Island. Remember that you'll be driving on the left side of the road and allow time between destinations to capture Instagram-worthy scenes along the way.", "Plan an off-peak trip Summer is busy, particularly in tourism hot spots like Queenstown, so consider visiting on bordering months like November or March, when you can still experience warmer weather without peak rates.", "Rent a car Outside bigger cities, public transport and ride-sharing options may be limited, so a rental car can help you get around in the most affordable way, particularly if there's a filming location or off-the-beaten-track scenic stop you wish to see. Tourists with a current and valid overseas license or driver permit can drive in New Zealand for a maximum of 12 months. See more on driving in New Zealand here.", "Book a rental home or apartment Websites like Bookabach, Holidayhouses.co.nz and Airbnb offer amazing homes in stunning locations. What's more, vacation rentals are usually cheaper than a traditional hotel. Staying at homes or apartments also means you can stock up on Kiwi goodies like Whittaker's Chocolate, meat pies and Marmite at the local supermarket and save money on dining out."]}