{"name": "Grand Teton National Park", "description": ["Towering above Jackson Hole, Wyoming, are the jagged snow-topped peaks of the majestic Teton Range, which are in high relief at Grand Teton National Park. From the 13,770-foot Grand Teton to the glittering Jenny and Jackson lakes – which can reflect the mountains in their depths – the photo-ops are endless. But the park isn't just for mountaineers and photographers. In winter, there is cross-country skiing and snowshoeing. In the peak summer season (July and August), the park's trails call to hikers of all abilities and reveal gems like hidden waterfalls and breathtaking views of the Tetons. Meanwhile, Snake River appeals to kayakers, rafters and those who simply fancy a float. Historic districts like Menors Ferry and Mormon Row attract history buffs interested in the 19th-century past of this piece of Western Frontier. ", "The nearly 500-square-mile park also contains an array of wildlife, including black and grizzly bears, moose, antelope and bison. Plus, autumn visitors can witness the park light up with golden aspens. Travelers who want to tick off another national park on the same vacation can travel the few miles north to Yellowstone, which adjoins Grand Teton via the John D. Rockefeller, Jr. Memorial Parkway.", "The best time to visit Grand Teton is from mid-May to late September when all of the park’s visitor centers, hiking trails and activities like kayaking, horseback riding and fishing, are open and accessible. October in Grand Teton National Park can either be a magical with warm sunshine or an early start to winter. However, even if it's a warm fall, few of the park’s campgrounds and other facilities are open. By November 1, all campgrounds, lodges and restaurants in the park are closed, as are 13 miles of the Inner Park Loop Road (another name for Teton Park Road, which reopens May 1). Winter in the park draws cross-country and backcountry skiers. With a very few exceptions, snowmobiling is not allowed in GTNP.", "Icy trail conditions Snow can linger until early summer, so it's smart to check with park rangers about trail conditions – and what equipment you might need, from ice axes to traction devices for your footwear.", "Prepare for packed parking lots In July and August, you'll find that the parking lots at popular trailheads, such as Jenny Lake and String Lake, are filled by late morning. Start your hike before 9 a.m. to ensure you snag a spot.", "Be mindful of closures The park is open 365 days a year, but many of this park’s facilities and roads are closed from late fall to spring. But that means snowshoers and cross-country skiers get free rein. For more information on winter activities, check out the National Park Service's website.", "Respect wildlife All of the animals that live in Grand Teton National Park are wild, which means they’re unpredictable and dangerous. For your safety, and for the safety of the animals, you must stay at least 300 feet from bears and wolves, and 75 feet from all other wildlife. These distances are minimums though; if an animal is reacting to your presence, you’re too close.", "Pack a picnic Hit up a grocery store in the town of Jackson and pack your lunch before you visit the park. You can enjoy it at the scenic Cottonwood Creek and the String Lake picnic areas, which are also fitted with vault toilets.", "Split the fee If you share your ride with friends, you can split the $35 entrance fee, which grants the driver and its passengers admittance to the park for seven days.", "Bike into the park A paved pathway connects the town of Jackson to GTNP and continues into the park to South Jenny Lake. It’s only $20 to enter the park via bicycle.", "There are 10 restaurants in Grand Teton National Park, and they are only open between mid-May and late September. These include reservation-required fine dining establishments (at Jenny Lake Lodge and Jackson Lake Lodge’s Mural Room), lounges, a pizzeria, and casual grills. Dornans in Moose, just outside of the park’s Moose entrance, isn’t in the park but is a must-stop for many park visitors. It has a seasonal chuckwagon (open June to September), a year-round pizza and pasta restaurant with a rooftop deck and stunning Teton views, a market, a deli and one of Wyoming’s best bottle shops. Visitors to the park outside of the summer season or who want diverse eating options head to the town of Jackson or the communities of Wilson and Teton Village – where you can find everything from fast food to grocery stores, delis and James Beard-recognized eateries – for meals.", "A trip to Grand Teton National Park can be a wonderful experience for visitors of all ages, but it's important to take certain safety precautions. For instance, hiking is one of the main activities at the park, but hiking alone is not recommended. Hikers should always hit the trail in pairs or groups. As for gear, hikers should make sure to wear comfortable footwear and carry a daypack with bear spray, drinking water, snacks and extra clothing. In the mountains, weather can change very quickly. Before heading out on a hike, check the weather and let someone know where you're going and when you expect to be back. Hikers that want to head for the park’s higher elevations before snow has fully melted off trails should also carry an ice axe and crampons or Microspikes, metal teeth attached the front and bottom of your boots.", "This park is home to a both black and grizzly bears, and it's possible that you might encounter either of these on the trail or in campgrounds. Visit the bear safety section of the park website to learn the safety basics, such as how to tell the difference between the two species, use bear spray (a hint: it’s not like bug spray that you spray on yourself) and how to properly store your food when camping.", "The park's Snake River and Jenny and Jackson lakes provide opportunities for boating, fishing, kayaking and more. While the Snake River in GTNP is not whitewater, it is not recommended for inexperienced rafters or paddlers to go it alone. There are channels that dead-end and snags of deadfall. You'll want to take a trip led by an experienced guide to explore the Snake. Before hitting the water, check flow rates and caution areas at ranger stations or visitor centers, or by calling the hotline at 1-800-658-5771. It is advised to wear a personal flotation device (this is required for visitors younger than 13) and bring snacks and water and, in a waterproof dry bag, extra clothes and a first-aid kit. For more safety tips, visit the National Park Service's website.", "The best way to get around Grand Teton National Park is by car. Not only will you be able to explore the park on your own terms, but your $35 entrance fee will get your vehicle (and all its passengers) admittance to the park for seven consecutive days. The park is far too big to explore on foot alone. ", "To reach Grand Teton National Park, many visitors fly into Jackson Hole Airport (JAC) since it's about 5 miles away from the park's southern entrance at Moose. (Fun fact: This airport is actually in Grand Teton National Park, making it the only commercial airport in a national park in the continental U.S.) The Idaho Falls Regional Airport (IDA) is located about 90-some miles to the west, but to find potentially lower rates travelers have to fly into Salt Lake City International Airport (SLC), rent a car and drive the nearly 300 miles (about five hours drive time) to the park. Alternatively, shuttles such as the Jackson Hole Alltrans or the Salt Lake Express, can deliver you from SLC to the town of Jackson or the Jackson Hole Airport (if you want to pick up a rental car). "]}