{"name": "Tahiti", "description": ["Miles of shoreline, dozens of resorts, French cuisine to die for – Tahiti has all the makings of a honeymoon destination. But beach bums often pass over Tahiti's sands in favor of Bora Bora's ivory shores. Despite its idyllic reputation and accessibility, Tahiti is often more of a stopover point en route to romantic getaways on smaller islands. However, that doesn't mean Tahiti should be ignored.", "Leafy forests sit beside sandy shores, while French crêpes are served alongside Tahitian poisson cru (raw fish). If there ever was a place that embodies the beautiful duality of the French Polynesian archipelago, it's Tahiti. Here, the quirky, often chaotic atmosphere of the island's capital, Papeete, rubs elbows with uncorrupted natural beauty.", "In fact, Tahiti – the largest of French Polynesia's 118 islands – is often referred to as two separate islands despite them being joined by a tiny land bridge. Tahiti Nui is the larger, northwestern section where Papeete can be found. Tahiti Iti (the smaller, southeastern half) is less accessible, although many visitors make the trek here for the seclusion. Just note that spending a week on either part of Tahiti will cost you quite a chunk of change. Regardless, travelers agree that the warm waters, lush jungles and luxurious resorts are worth the splurge.", "The best time to visit Tahiti is between May and October. Although the temperatures are balmy year-round, Tahiti's winter season enjoys less humidity. Tahiti really only experiences two distinct seasons: Winter brings less rain and pleasant temperatures while the summertime – November through April – can be quite hot and humid (especially December), not to mention rainy. But regardless of when you travel, you can expect hotel rates to be high. A simple hotel room runs between $100 to $250 per night, and resorts can start anywhere from $400 per night and go much higher. Vacation rental stays, both private rooms and entire homes, typically cost a minimum of $100 to $200 per night.", "The food trucks The food truck craze has hit Tahiti. Catch the roulottes – or food trucks – with everything from Chinese fare to French crepes, lined up along Papeete's waterfront in the evenings.", "The sharp sand Sandals or water shoes are a must at the beaches. These shorelines are speckled with jagged shells, along with waves that hide barbed coral.", "Head to the supermarket Restaurants are quite expensive, so save cash by purchasing breakfast and lunch items at the supermarket. Then, you can splurge on dinners.", "Stay at a guesthouse Tahitian guesthouses, also referred to locally as pensions (pronounced pone-see-on), are typically family-operated accommodations that range from dormitory-style lodging to individual bungalows and villas. They often cost less than a hotel. Tahiti Tourisme offers a comprehensive list on its website.", "Go for a cruise Taking a cruise that stops in Tahiti and other islands in French Polynesia can be more affordable than flying in and reserving accommodations on the island. Cruise lines like Princess Cruises and Oceania sail to this island paradise.", "French is the official language of French Polynesia, though you'll find that many locals (especially those who work in the tourist industry) speak English. That said, it is more common to use the Tahitian greeting \"La ora na,\" over the French \"Bonjour.\"", "Also, bear in mind that for most Tahitians, English is a second language. Be patient and courteous when conversing with locals. You may also hear bits and pieces of Tahitian, the local island language, but most residents will promptly switch to French or English when communicating with you.", "The currency is the French Polynesia franc (XPF). The exchange rate fluctuates, so be sure to check it before you go. Tipping is not customary on the islands – gratuities are included in hotel and restaurant bills, but like anywhere else, a little extra for excellent service is always appreciated.", "Tahiti is a safe place for tourists. Generally speaking, there are only a couple of dangers to watch out for: pickpockets in Papeete and moray eels in the coral reefs on scuba dives. Most visitors soon discover that Tahiti is warm and welcoming to foreigners. In fact, locals have a philosophy: \"aita pea pea\" (which translates to: \"not to worry\"), which results in a very laid-back and affable culture. Don't be surprised when strangers greet you on the street. ", "Surrounded by the South Pacific Ocean and blessed with ample sunshine and rain, Tahiti is an ideal spot to harvest seafood and grow fresh produce. Fish reigns supreme on menus in the restaurants in this French Polynesian island, with mahi mahi, grouper and tuna undoubtedly the most popular. You'll be remiss if you don't sample Tahiti's national dish, poisson cru, which is raw tuna marinated in coconut milk and lime juice, similar to a ceviche. When it comes to fruit, the island grows some of the tastiest pineapples, coconuts and bananas. Roulottes (food trucks) are also a staple in Tahiti, dishing out a variety of quick (and cheap) eats like pizza, crepes and burgers all packed with flavor.", "Many of the island's top resorts house some of the best restaurants in Tahiti – they're also some of the most expensive. However, experts, visitors and locals suggest at least one meal at one of the upscale eateries; favorites include the overwater Le Lotus at InterContinental Tahiti Resort & Spa and French and Polynesian fusion restaurant Le Carré at the Tahiti la Ora Beach Resort. Downtown Papeete is home to some standout restaurants as well, according to recent travelers. They say those looking for a decadent French meal should look no further than Le Grillardin or Restaurant Le Sully.", "The best way to get around Tahiti is by taxi or rental car. If you're planning on doing a lot of traveling throughout the island, a rental car is a good option. A bike is an option, too. For journeys to other French Polynesian islands, you'll have to book passage on a boat or airplane. Most travelers arrive into Faa'a International Airport (PPT), which is an approximately 4-mile drive west of the capital city of Papeete. If a representative from your hotel isn't picking you up at the airport, you can hop into a taxi to your destination (though the short ride will likely be quite expensive). From the airport, you can also hop on flights to Bora Bora or nearby Moorea.", "To visit French Polynesia, you'll need a U.S. passport valid for six months beyond the duration of your trip. If you're planning to stay in the country for more than 90 days, you'll also need to acquire a visa. For more information, visit the U.S. State Department's website. "]}