{"name": "Mount Rainier National Park", "description": ["Mount Rainier National Park was established in 1899, making it the nation's fifth national park. Its dominating feature is, of course, the 14,410-foot-tall active volcano for which it is named. The mountain is the tallest volcano in the Cascade Range and the most glaciated peak in the continental United States, with 25 named glaciers. Every year, thousands of people successfully scale its glaciers to enjoy the contrast of the steaming volcano – which last erupted in 1854 – to the icy rivers along its sides.", "But visitors don't have to be experienced mountaineers to enjoy the park. You can drive up to Sunrise, which – at 6,400 feet – is the highest point in the park accessible by car. Or, head to subalpine meadows in summer to be wowed by wildflowers. In winter, a variety of activities from skiing to snowshoeing offer a different view of the park, which is as changeable as the weather.  ", "The best time to visit Mount Rainier National Park is July through August, when wildflowers transform the park's subalpine meadows and the dry, warm weather provides optimal hiking conditions. If you want to see the mountainous landscape blanketed in snow, you'll be treated to a winter wonderland if you visit between November and March. The park is open year-round, but in the winter season (which lasts from November through May), many areas of the park are closed, including roads. The road from the Nisqually Entrance Historic District to Longmire is open year-round, but it closes during extreme weather. But there are several wintertime activities that make a visit during this season worthwhile, including ranger-led snowshoe walks. Travelers should always check the park website before visiting.", "Avoid summer congestion In the summer, especially on the weekends, there can be long, long waits to enter the park or find a parking space. Come mid-week or visit before 10 a.m. or after 2:30 p.m. if you can.", "Pay to play A vehicle pass to the park costs $25; an individual pass – for a pedestrian on a bicycle or on foot – costs $10. Each pass is valid for seven consecutive days.", "Check the weather At Mount Rainier, the weather can change rapidly. Some areas may be closed or you may need snow tires or chains, even in the fall or spring. Check the park's website for the most current information.", "Visit on an entrance-free day All national parks offer free admission four days of the year, including Martin Luther King Jr. Day, the first day of National Park Week (in April) and Veterans Day, among others.", "Pack a picnic There are plenty of gorgeous places to enjoy a picnic, so plan ahead and bring your own meal. You'll find picnic tables throughout the park, including the Kautz Creek rest area, in the Longmire area and outside the Jackson Visitor Center at Paradise. There's also a large picnic area behind the Sunrise Visitor Center.", "Camp out With campsites costing just $20 a night, roughing it can save you a bundle. There are four different camping areas through the park. Depending on the area, camping is available generally from late May through early October.", "As with many national parks, dining inside Mount Rainier National Park is limited. Inside the park, visitors will find two restaurants, two snack bars, a cafe and a small general store. The Dining Room at the National Park Inn serves breakfast, lunch and dinner and it's the only in-park dining facility that is open all year. The menu focuses on flavors of the Pacific Northwest, with dishes like bison stew, Alaskan halibut and cedar plank red trout. Next door to the National Park Inn, the Longmire General Store is open daily year-round with a small selection of groceries and camping supplies.", "The Paradise Inn, which is open from May through early October, is home to the Dining Room, open for breakfast, lunch, dinner and brunch, and the Tatoosh Café, which is more like a coffee shop. The Dining Room, with Mount Rainier visible through the windows, is a great spot to enjoy dishes like its signature bourbon buffalo meatloaf.  The cafe offers a variety of sandwiches, ice cream, snacks, beverages and fresh pastries.", "There's also a cafeteria at the Jackson Visitor Center at Paradise, open daily May through early October and on weekends and holidays in the winter. A snack bar, located at the Sunrise Day Lodge, is open from July through September and serves up casual fare, including burgers, at the highest point in the park accessible by car. Instead of eating inside, you can get your lunch to go and enjoy the views from a picnic table.", "Weather is a major factor in planning a visit to Mount Rainier. It can snow as early as September and continue until May. The park requires that all vehicles carry tire chains when traveling in the park from Nov. 1 through May 1. This applies to all vehicles, even those with four-wheel drive, regardless of the weather conditions.", "Hikers, especially those tackling Mount Rainier, always need to be prepared with proper food, clothing and supplies. It's never a good idea to rely solely on smartphones, as cell service can be spotty. Start your visit by picking up a map at one of the park's visitor centers.", "There is plenty of wildlife in the park and while black bears and mountain lions are found here, you are unlikely to see them. Make sure you always secure your food and garbage, make plenty of noise as you hike and never approach a wild animal.", "The park service actually sees thieves as more of a threat. According to the NPS, every year auto burglaries occur at trailheads and parking areas both inside and outside of the park. To avoid being a victim, make sure you don't leave any valuables in your car. If you want to leave anything in the trunk of your car, stow it before you arrive, as you could be watched at the trailheads and parking lots. For more safety tips, visit the NPS website.", "The best way to get around Mount Rainier National Park is by car since the park does not provide shuttle buses. On a summer weekend, it can be difficult or impossible to find parking at the Paradise, Sunrise and Grove of the Patriarchs parking lots, and at the trailheads between Longmire and Paradise. Parking is not permitted along the road edges. All vehicles are required to carry tire chains when traveling in the park during the winter season, which lasts from Nov. 1 through May 1.", "Many visitors fly into one of two major airports located about a two- to three-hour-drive away, including the Seattle-Tacoma International Airport (SEA), which is about 55 miles northwest of the park, and the Portland International Airport (PDX), which sits 135 miles southwest of the park. There are three main access points to the park: the Southwest Entrance, the Northwest Entrance and the East Entrances.", "The Southwest Entrance is open year-round except during extreme weather. The Northwest Entrance is also open year-round, but vehicle access is permitted only to the park entrance. After that, visitors have to go on foot or by bike. Another access point in the northwest is Mowich Lake, but due to heavy snowfall, it is only open in the summer. The East Entrances are composed of three different access points, each of which is open depending on the season and weather. Visit the park's road status website for details."]}