{"name": "Cocoa Beach", "description": ["Perched on Florida's Space Coast, about an hour east of Orlando and about 90 minutes south of Daytona Beach on the Atlantic Ocean, Cocoa Beach is not only one of the Sunshine State's most iconic beaches, but one of its most family-friendly destinations, too. Tourism began in the area in the mid-1920s by way of a bus tour to the beach, and by the late-1930s just 49 people lived in the coastal town. Fast-forward nearly a century and the city's population has grown to 12,000, with more than 2.5 million annual visitors. ", "The draw? Aside from being the closest beach to Orlando, there are 6 miles of beaches; a chance to visit galaxies far, far away; plenty of arts and culture to enjoy; natural landscapes to explore on foot or by water; and some of the best surfing on the eastern seaboard. In fact, Cocoa Beach is considered the “Surf Capital of the East Coast.” The Space Coast also enjoys several natural phenomena, like sea turtle nesting (May to October), bird migrations (September to February) and bioluminescence in the intracoastal waterways (May to October).", "The best time to visit Cocoa Beach is between March and May. Like most of Central Florida, the weather during this time of the year is usually incredibly pleasant, with average temperatures in the 70s during the day. Unsurprisingly, the near-perfect weather and being a popular spring destination results in the area's highest rates in March. If you can hold off a month, you may find lower rates during visits in April and May.", "Let someone else drive Once you arrive in the area, the Cocoa Beach Loop trolley/bus route, available seven days a week, makes getting around the area easy without having to find parking along the way.", "Keep your eye on the sky If a rocket launch is scheduled during your visit, lay a blanket on the beach for unobstructed views and watch it blast off into space. There are usually several launches a week, so there’s a good chance you’ll catch one during your visit. Launches can change based on several factors, including weather and mechanics, so keep that in mind when planning your visit.", "Fly into Orlando Melbourne Orlando International Airport is closer to Cocoa Beach (about 20 miles) than Orlando International Airport (about 50 miles), but you’ll find cheaper flight prices by flying into Orlando rather than Melbourne."]}