{"name": "Sardinia", "description": ["Sardinia, a 9,301-square-mile island situated in the Mediterranean Sea, just west of the Italian mainland, lures travelers with its unique blend of ancient culture and arresting coastal views. In his travel book \"Sea and Sardinia,\" D.H. Lawrence wrote that \"Sardinia is different.\" And it's true. Not only can you lounge on a white beach or wade out into clear, turquoise waters, but you can enjoy a leisurely pranzo (lunch) complete with Sardinia's own take on pasta and wine. Yes, you can snorkel among colorful fish in nearby coves, but you can also explore inland Sardinia's traditional villages and see shepherds tending to their flocks. The drive along the island's northern Emerald Coast would convince you that Sardinia is characterized solely by glamorous hotels and ristorantes, and utterly perfect beaches, but you'd be wrong. It's also home to humble farms, forested mountains, and friendly but reserved locals… it's as Lawrence penned, different.  ", "The best time to visit Sardinia is from April to June when the flowers are in bloom, the sea waters are warm, and the temperatures haven't yet reached their July and August highs. Still, summertime in Sardinia has its perks: For instance, the Tyrrhenian Sea (east of the island) and the Mediterranean Sea waters are incredibly refreshing this time of year, and a vibrant lineup of festivals and events fill the calendar. September and October offer travelers mild weather and fewer crowds, while the months between November and March constitute low season with chilly temperatures and fewer tourists. ", "The culture in Sardinia is similar to that of other Italian destinations: Sardinians have a deep fidelity to friends and family, they value traditions and good food, and they take a laid-back approach to life. And although beaches ring their island, many locals have grown up far from the tourist bustle – in the small villages that lie inland where traditional values reign and shepherding is the main industry. ", "Sardinia is also heavily influenced by the Catholic church. Festivals (\"festas\") that celebrate Catholic saints punctuate the Sardinian calendar, and attending Mass is still a weekly event for many locals. ", "Along with speaking a Sardinian dialect, locals also speak Italian. Those working in the tourist trade likely speak some English as well, but it helps if tourists know a few basic phrases, such as \"hello,\" buongiorno; \"goodbye,\" arrivederci, \"please,\" per favore; \"thank you,\" grazie; \"yes,\" si. Sardinia's official currency is the euro. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go.", "Like other Italian destinations, Sardinia is serious about good food. Coffee is an art here, but ordering un caffe will get travelers a small shot of espresso rather than the big mug they might be accustomed to. A doppio espresso is a double shot of espresso. Visitors will likely be familiar with Sardinia's other types of coffee. For instance, an americano is an espresso with hot water, and its roster of milky coffees include lattes, cappuccinos and macchiatos.", "Sardinia also has its own local vineyards, which produce Sardinian wines, such as vermentino whites, cannonau reds and vernaccia whites and fortified wines. Visitors can try these and other Sardinian wines at enotecas or wine bars around the island, or they can plan a visit to the wineries or wine cellars for tastings. Some of the favorites include Sella e Mosca, Antichi Poderi di Jerzu and Tenute Olbios, among others. ", "The island also has its own specialty breads, pastas, cheese, meat, fish and seafood dishes, and sweets. For instance, visitors should stop by a panetteria (bakery) and pick up a loaf of civraxiu, a round loaf with a crispy crust and soft center. The hard, tangy pecorino cheese is a Sardinian specialty, as are creamy goat cheeses, such as ircano and caprino. The island's many different pastas include a saffron-flavored malloreddus and a ravioli-type pasta stuffed with pecorino or ricotta, called culurgiones. ", "Lobster, tuna and octopus all feature heavily on Sardinian menus, as do suckling pig, lamb and goat. Sardinian sweets, meanwhile, vary by region. For instance, different parts of the island add ingredients, such as cinnamon, mulled wine, vanilla or orange blossom, to the traditional papassino, a dessert made with raisins.", "The best way to get around Sardinia is by car. It's the easiest way to hit the places on your itinerary, though it's not the cheapest option. Using public transportation will save you some cash, but the trains and buses aren't the most reliable or efficient ways of traveling around the island. And the only way to reach some islands like La Maddalena, for instance, is by hopping aboard a ferry.", "To get to Sardinia, most travelers fly from Italian or European cities into one of Sardinia's three main airports, located on the outskirts of Cagliari, Olbia and Alghero. A variety of domestic flights transport visitors between the mainland's airports, including Rome, Milan, Naples, Bari, Bologna, Turin, Venice and Verona. If you'd rather take the ferry, there are several routes available from cities like Naples, Palermo, Genoa, Livorno and Civitavecchia (outside of Rome). There are also ferries from mainland France and Spain to Sardinia, but these sailings can take as long as 12 hours. Grandi Navi Veloci, Moby Lines and Tirrenia are the three principal ferry operators offering regular service between mainland Italy and Sardinia. There are multiple arrival ports in Sardinia, including in the north, along the east coast and in the south.", "A passport that is valid for at least six months after your planned departure date is required for United States citizens traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for more information on exit and entry requirements."]}