{"name": "Lima", "description": ["Lima is one of South America's best kept secrets. Once treated as a stopover by travelers on their way to the famous Machu Picchu, the capital of Peru has always been a vibrant destination in its own right. And the world is now taking notice.  ", "The city of more than 9 million citizens is a sprawling metropolis with sights and smells at every turn. The historic city center, given the name Ciudad de los Reyes (City of Kings) by Spanish conquistadors, enchants visitors with its pre-Columbian history and colonial architecture. Meanwhile, the modern Miraflores district beckons sun seekers and trendsetters and the Barranco district is a bohemian paradise. Plus, any world-traveling foodie will tell you that the vast and delectable Peruvian cuisine is not to be missed. In short, Lima has something for everyone. ", "The best time to visit Lima is from December to April. Since Lima is in the Southern Hemisphere, these months offer warm, summer weather (sometimes upward of 80 degrees). The city's geography as a coastal desert means it experiences moderate temperatures throughout the year, very little rainfall, but plenty of high humidity. If you visit from May through November, considered Lima's cooler months, you're likely to find what locals call la garua: a thick misty sea fog that hangs over the city along with overcast skies. ", "Famous Spanish conquistador Francisco Pizarro founded the Ciudad de los Reyes (City of Kings) in 1535. Prior to its colonization, Lima was home to a variety of indigenous people, including the well-known Incan Empire.", "Since Peru's independence in 1821, both cultures have melded together to create a unique society. Lima residents, known as Limeños, take pride in their city and its heritage. Limeños are also known for being a welcoming and friendly people, so don't be afraid to strike up a conversation in Spanish. Knowing some common phrases and words, such as por favor (please), gracias (thank you) and ¿Cuanto cuesta? (How much does it cost?) will help you move around the sprawling city. The majority of Peruvians identify as Catholic, and most national holidays are religious celebrations.", "The arts, including crafts, music and dance, are an important part of Peruvian culture. You'll find handcrafted jewelry, pottery and textiles to take home with you, including products created with Alpaca fur. Music and dance are also essential parts of life in Lima and throughout Peru. You'll hear Criollo music, a mixture of Spanish and African sounds, along with the more modern Chicha music, which incorporates Andean drum beats. Peruvians are equally passionate about their national sport: soccer (aka fútbol).", "The climate in Lima is generally humid and dry, so pack clothes made from natural fabrics, such as cotton and linen, and don't forget to bring along layers for breezy nights.", "The Peruvian sol (PEN) is the official currency of Peru, which has a favorable exchange rate to the U.S. dollar (about $0.30 per 1 Peruvian Sol). Make sure to check the current exchange rate before traveling. Tipping 10 percent is appropriate for formal dinners and tipping 1 or 2 sol is a nice gesture at smaller establishments. Make sure to check the bill before tipping though, as a service charge is sometimes added. You never need to tip a taxi driver, and make sure to agree on a price before getting in the cab. ", "Thanks to Lima's coastal perch, this city is a hub of culinary inspiration. It's also arguably one of the best gastronomic hot spots in the world right now. From street vendors to five-star restaurants, you'll find incredible eats at every turn. Traditional fare combines staples from the Incan culture with Spanish flavors and even Asian influences. The unofficial national dish born from this juxtaposition is ceviche – bite-sized pieces of fresh, raw fish marinated in lime juice and tossed with onions, peppers and spices. You'll find this dish everywhere, but foodies recommend heading to the Miraflores district to places like El Mercado and La Mar Cebicheria for the best sampling. If you're in the mood to indulge in something heavier, try causa. This dish combines mashed potatoes, avocado and mayonnaise, which is then mixed with a number of other ingredients, such as peppers, onions, chilies and even hard-boiled eggs or shrimp. Meat lovers are sure to gravitate toward anticuchos – skewers of marinated, grilled meats similar to kebabs that are typically inexpensive and sold by many street vendors.", "Peru can also claim the origination of Asian-fusion cuisine, thanks to an influx of Chinese and Japanese immigrants starting in the late 19th century. One of the most famous examples of this mash-up of cultures is lomo saltado, a stir-fry of beef, tomatoes, peppers, onions and pan-fried potatoes served with white rice.", "You'll find many of the best restaurants clustered in the Miraflores district, but delicious eats can be found throughout the city. A must-try for first-time visitors is the long-standing sangucheria (Peruvian sandwich) spot, El Chinito (not too far from the Plaza de Armas), which has been serving fried and roasted pork sandwiches (known as chicharrón and chanchito asado) since 1960. Meanwhile, Asian influences shine through at chifas (Chinese-Peruvian restaurants), such as Salón de la Felicidad and Chifa Wa Lok, in the historic city center and Madam Tusan in Miraflores.", "While most locals are welcoming and friendly, you’ll want to be aware of pickpockets and petty theft when traveling in Lima. Be mindful of your surroundings while exploring Lima’s diverse districts, especially at night. Avoid wearing flashy jewelry, keep your camera in a bag when not in use and be discreet with cash to avoid making yourself a target. Also, try to avoid using an ATM at night. Using common sense, and knowing a few Spanish phrases, will help you blend in. ", "The best way to get around Lima is on foot. To a first-timer, getting around Lima can be a little complicated. Not only is Lima the name of the city, but also the name of a district within the city, as well as the name of the region surrounding the city and the larger Peruvian province in which the city and district lies.", "If you're exploring the Historic Center or strolling the Malécon in Miraflores, you'll be fine on foot. There are a few transit options for traversing districts; the best one depends on how far you're going. Taxis are readily available, but you'll want to stick to prearranged rides (most hotels can call one for you) because street taxis are unregulated. The city also has multiple options for public transportation, but make sure to familiarize yourself with your route or carry a map along. You should avoid renting a car, as Limeños will tell you that it's a hassle to drive in the chaotic city.", "You'll arrive in Lima at Jorge Chávez International Airport (LIM), which is located about 7 miles northwest of the city center. The easiest way to reach your accommodations is through a taxi service (you'll find a list of licensed taxis on the airport's website) or via the Airport Express, the official airport shuttle, which you can reserve in advance. If you're continuing your Peruvian journey to Cusco in route to the famous Machu Picchu ruins, it's smart to book the connecting flight or bus months in advance as these routes tend to sell out during the Peruvian summer (December to April).  "]}