{"name": "San Antonio", "description": ["Davy Crockett may have perished at the Alamo, but San Antonio clings to the Texan pride shown by the \"King of the Wild Frontier\" and his compatriots in 1836. This modern city's history especially rears its head throughout downtown. Amongst the gleaming skyscrapers, the austere San Fernando Cathedral still stands as a testament to the city's religious past. Farther afield, you'll find several other famous missions, all of which are now a part of the San Antonio Missions National Historical Park.", "But you don't need to have a hankering for history to be thoroughly charmed by San Antonio. Families will particularly enjoy the city's theme parks, top-notch museums, professional sports teams and the famous River Walk. What's more, San Antonio is a bona fide culinary destination, with exciting fusion cuisine and upscale Southern- and European-influenced fare rounding out the traditional barbecue and Tex-Mex offerings. Considering how many ways there are to spend your day, you might have too much to do to \"Remember the Alamo.\" If you're short on time, consider signing up for one of the best San Antonio tours for a sampling of the city's history, culture and food.", "The best time to visit San Antonio is from November to April, when the weather is comfortable and the hotel rates are lower. Summer sees the largest influx of tourists from in- and out-of-state. Because of its historical significance to the state and its family-friendly theme parks, San Antonio attracts hordes of Texas families when the kids are on summer break. But the long Texan summer is close to unbearable (for most people) with humidity and temperatures exceeding 90 degrees Fahrenheit. The masses also make for more crowded attractions and higher prices at hotels. You'll enjoy the city a lot more when you are less damp, saving cash and enjoying the festivals of the winter and spring.", "An educated city San Antonio boasts several institutions of higher education – including Trinity University, San Antonio College and the University of Texas at San Antonio – that surround the downtown area.", "A true taste of Texas Every April, Fiesta San Antonio takes over the entire city for 10 days to honor Texan heroes of the past and celebrate the city's diverse cultures.", "Mexican influences Although Texas gained independence from Mexico long ago, Mexican influences abound. The current Mexican-American population is proud of its ancestry and you'll find frequent displays of it in the form of parades, artwork and local cuisine.", "Know your pronunciations Roads and neighborhoods get their names from both English and Spanish, though pronunciations are inconsistent. For example, Bexar County (the county in which San Antonio sits and named for a former Mexican municipality) is pronounced \"bear.\" Blanco Road, a major thoroughfare, is pronounced \"blank-o.\"", "Check the calendar Conventions lead to sold-out hotels across town, and these travelers likely booked months in advance. Check the city's tourism bureau website and try to avoid convention-heavy weeks and weekends.", "San Antonio contrasts the old and the new of Texas: the Alamo stands strong among contemporary skyscrapers and the banks of the San Antonio River are populated with the River Walk's burgeoning businesses and restaurants. San Antonio residents are proud of their history, with many shops selling memorabilia engraved with the words \"Remember the Alamo.\"", "Additional cultures have influenced the customs of this city over time. Mexican culture heavily shaped San Antonio as it developed. Travel experts recommend stopping by Market Square (or El Mercado) to find a variety of tasty Mexican foods, homemade goods and south of the border crafts. Mexican art is displayed everywhere you turn and Spanish is widely spoken. For a more festive taste of Tex-Mex culture, plan your trip during Fiesta in April or during the San Antonio Stock Show & Rodeo in February.", "San Antonio's cuisine has been shaped by many cultural influences, from Mexican to Native American to African American. True, barbecue and Tex-Mex are the most well-known foods, and you can find excellent smoked brisket, tacos and enchiladas nearly everywhere you turn. But Asian fusion, upscale European fare and Southern comfort food all make up the culinary fabric of the city, as well. Southtown, the River Walk, the Pearl and Alamo Heights are generally regarded as the go-to foodie neighborhoods. And you haven't been to San Antonio until you've tried a puffy taco – a crispy, fried, bubble-like tortilla stuffed with a savory filling", "Oenophiles will be happy with a trip to San Antonio, too. The nearby Texas Hill Country is where many of the state's best wines are crafted. To sample some for yourself, plan a day trip to Fredericksburg (which sits about 70 miles north of San Antonio) and sign up for a wine tour of the city.", "Compared to other U.S. cities of similar size, San Antonio is a safe place to visit. You may see more guns than you're used to thanks to lax firearm laws in Texas, but gun violence does not generally affect tourists. You should still use common sense, stick to well-lit areas after dark and keep a close eye on your valuables.", "Those who are not used to the Texas heat should take precautions against heat stroke and dehydration, especially during the summer months. Heat stroke and dehydration symptoms commonly include headaches, nausea, dizziness and fatigue. Drink plenty of water, apply sunscreen regularly and if you are participating in more strenuous activities, such as hiking or biking, make sure to rest periodically.", "Residents of Texas Hill Country share the land with numerous creepy-crawlies, including scorpions, rattlesnakes and water moccasins. While you most likely won't come face to face with these creatures within the city itself, those exploring the countryside may encounter them. Keep an eye out when walking around to avoid confrontation. If you're bitten or stung, seek medical attention immediately.", "The best way to get around San Antonio is by car, especially if you need to reach sites like Morgan's Wonderland and Six Flags Fiesta Texas. Driving through the narrow downtown streets can be difficult, however, so plan to park your car in a lot or garage and explore some of the downtown area on foot. The bus system is also a handy and relatively inexpensive way to navigate the city center. Many travelers arrive through San Antonio International Airport (SAT), about 10 miles north of downtown, where you can find a plethora of rental car agencies. Several hotels also offer courtesy shuttles to and from the airport. City bus route No. 5 also services the airport and downtown areas. Taxis from the airport to downtown San Antonio cost between $24 and $29. Using taxis downtown is unnecessary, and you'll probably have to wait for one to arrive."]}