{"name": "Sacramento", "description": ["Los Angeles has star power. San Francisco has urban culture. San Diego has to-die-for weather. So why is Sacramento the capital of California? The rationale goes back to the days of the gold rush when it was a hotbed for gold miners, and pegged as a convenient location, close to both the Pacific Coast and the Sierra Nevada range.", "The Golden State's capital is rooted in history. Before Spanish settlers claimed the land in the 1840s, the Nisenan branch of Maidu Native Americans inhabited the Sacramento Valley. With the California Gold Rush of the 1850s, the area saw the largest migration in the country's history. Nowadays, the region is known as one of the most affordable California destinations for visitors. The Sacramento region is home to plentiful outdoor activities, more than 200 parks and two rivers. It's also the self-proclaimed \"farm-to-fork capital of America,\" with a large agricultural production of grapes, dairy, pears, corn and livestock. No matter what your interest is, it's safe to say Sacramento won't leave you bored.", "The best time to visit Sacramento is from April to June or September through November. Sacramento sees most of its festivals in May and June, but the California State Fair doesn't come to town until July when California's Central Valley usually experiences extreme heat. The hotter months also bring severe to exceptional droughts to the region. You'll find less crowding and more rainfall in the winter months. The rest of the year sees pleasant temperatures with highs in the 70s, 80s and 90s with low humidity.", "More for your money Sacramento is much less expensive than California's coastal cities. While still more expensive than the national average, you'll find your money stretches further here.", "Grab some local produce As the self-proclaimed capital of farm-to-fork cuisine, taking a stroll around one of the farmers markets and purchasing some produce can help you save on snacks. If you have a vehicle, buying from roadside shops or stalls in outlying areas of Sacramento County can be even cheaper than the farmers markets.", "Embrace the great outdoors Nature lovers rejoice over the abundance of parks and the two rivers located in the city. The best part? They're free to explore. ", "As a foodie destination, Sacramento holds its own among the nation’s top gastronomic experiences. Sacramento prides itself on being America's farm-to-fork capital, and in recent years, it’s seen an influx of innovative chefs who are drawn to the region’s bounty of produce. The area is home to up to 1.5 million acres of farmland, up to 8,000 of which is considered \"boutique,\" making California the leading agricultural producer in the country. With so much local produce, the region is also home to the largest state-regulated \"certified farmers market\" as well as 40 to 50 smaller markets that have year-round offerings.", "What does that mean for travelers? Some of the freshest and highest-quality ingredients are found in local grocery stores and restaurants. The diversity of the city is reflected in the assortment of ethnic restaurants that range from upscale venues to cheap eats. Visitors should look out for seasonal menus, showcasing locally-produced food from across the region. There are highly-rated restaurants in almost all parts of the city, although Midtown and downtown feature a high concentration of popular eateries.", "The best way to get around Sacramento is by car. While the downtown area has several attractions within walking distance of one another, in order to get to Midtown or any of the surrounding suburbs you'll need your own set of wheels. The city also has an extensive bus and light rail system, but some residents say it's crowded and service can be inconsistent."]}