{"name": "St. Vincent & The Grenadines", "description": ["Imagine it: Thatched-roof cottages rise over turquoise waters; the sweet scent of tropical flowers and rum punch fills the air; bronzed sun-worshippers sprawl along isolated white sands, hemmed by shimmering waves, coral reefs and sleek yachts. The only thing luring you away from your beach towel is the intriguing network of secluded islands floating in the distance. Welcome to St. Vincent & The Grenadines.", "If you don't want to spend your days sunning along one picturesque isle (St. Lucia) or savoring conch with throngs of tourists on two (St. Kitts & Nevis), then you should venture to St. Vincent & The Grenadines. With 32 remote islands and cays boasting emerald hills, postcard-worthy harbors, and boutique hotels, this Caribbean destination makes a perfect escape. Devote a few days to exploring St. Vincent, the biggest island of the chain, before sailing to Mustique, Canouan and Bequia – some of the Grenadines' finest (and exclusive) hideaways. However, exploring this quiet, less-traveled tropical paradise requires many hours in transit (there's no direct flight from the U.S.) and a thick wallet.", "The best time to visit St. Vincent & The Grenadines is May to June and November. During these shoulder months, hotels drop their rates to attract travelers. The peak season – December through April – lures European visitors with its warm and dry Caribbean temperatures. Crowds thin out and hotel prices plummet between July and October when hurricane season threatens the archipelago. No matter which month you visit, you'll find the islands' average highs hover around 85 degrees throughout the year.", "Yes, real pirates lived here Pirates once occupied St. Vincent & The Grenadines. Today no one will pester you for loot, but if you venture to Wallilabou Bay, you can catch a glimpse of the scenic backdrop featured in the \"Pirates of the Caribbean.\"", "No, you can't sport camo Wearing camouflage attire is prohibited throughout St. Vincent & The Grenadines, as police uniforms feature a camouflage pattern.", "No, you shouldn't touch manchineel trees These unsuspecting trees are poisonous, so resist the urge to eat one of their apple-like fruits, and steer clear of their sap (a dreaded source of excruciating blisters).", "Ask about service fees You should expect to find a 10 to 15% service charge added to your hotel and restaurant bills. Ask whether gratuity is included to avoid tipping more than necessary. Of course, a little extra is always appreciated for excellent service.", "Visit in fall or spring Come during May, June or November and you'll find fewer crowds, comfortable temperatures and reduced hotel rates. Major resorts drop their rates by up to 40% in the offseason.", "Vincy culture doesn't fit Caribbean stereotypes. Though Vincentians are known for their easygoing nature and hospitality towards visitors, you shouldn't expect to see them lounging along the beach with tourists. They're more often found debating politics or promoting tourism through agricultural trade and fishing. Many Vincentians spend their Sundays in church, and stores and restaurants are open only for limited hours. When you're ready to exercise your credit card along shopping streets, you'll fit in by wearing casual, light clothing. That said, some restaurants and venues require semi-formal attire, so be sure to check beforehand to avoid appearing underdressed.", "When dining, try authentic dishes like buljol, (a breadfruit and saltfish medley), pumpkin soup and conch. Feel free to drink the local drinking water on St. Vincent – it's safe. However, it's best to stick to bottled water on The Grenadines. Also bear in mind the water on St. Vincent runs from the island's mountain reserves and can have a chlorinated taste.  ", "As a parliamentary democracy rooted under British common law, St. Vincent & The Grenadines' residents speak English. But you'll likely hear a smattering of French patois (an informal dialect of French) during your stay. The East Caribbean Dollar (EC) is St. Vincent & The Grenadines' official currency. One Eastern Caribbean dollar equals roughly $0.37. As far as tipping goes, it is considered polite to add gratuity, but most restaurants already include a 10 to 15% service charge on the bill. Major U.S. credit cards are accepted at most hotels and restaurants.", "You'll feel safe while exploring St. Vincent & The Grenadines, but be sure to keep your wits about you when interacting with local vendors (who have been known to scam unsuspecting tourists). You should also beware of manchineel trees: These seemingly innocuous trees produce poisonous sap that can cause painful blisters if touched. Some Manchineel are labeled with warning signs.", "If you're staying at a luxury resort, you'll likely find little reason to dine off the property. But if you're craving a bit of local flavor, you'll find plenty of beach bars and casual outposts on many of the most visited islands.", "If you're visiting by cruise ship and only have limited time in Kingstown, visitors say you should make time for a meal or drinks at Flow Wine Bar and Kitchen. Along with the wine list, fresh fish and pasta, the restaurant earns top marks from diners for its elegant ambiance, which includes live music.", "Visitors to Bequia will be awarded with some of the island chain's best eateries. Some of the favorite beachfront restaurants include Sugar Reef Café, Jack's Beach Bar and Firefly Bequia Plantation. For those lucky enough to spend some time on Mustique, Basil's Bar – a favorite celebrity haunt – is a must in part for its see-and-be-seen atmosphere. No matter which island you dine on, expect plenty of grilled fish and fresh vegetables.  ", "The best way to get around St. Vincent & The Grenadines is by taxi. Taxis are plentiful on St. Vincent and the bigger islands, and fares are reasonable for short trips. Taking a cab is probably the easiest way to get to your hotel from St. Vincent's E.T. Joshua Airport (SVD), located a few miles southeast of Kingstown. Renting your own set of wheels on St. Vincent, Bequia and Mustique is also an option, but it's not recommended as roads can be somewhat tough to navigate. Buses are another popular means of getting around St. Vincent, Bequia and Union Island; however, they tend to be overcrowded and cramped. To get to the Grenadines, head to St. Vincent's central harbor in Kingstown, where numerous ferry companies shuttle passengers between St. Vincent and the islands daily.", "St. Vincent & The Grenadines has five major airports. Most visitors fly into E.T. Joshua Airport (SVD), but you can also opt to fly into the small airstrips found on Canouan (CIW), Bequia (BQU), Mustique (MQS) or Union Island (UNI).", "You'll need to present a valid passport and proof of a return or ongoing ticket to enter St. Vincent & The Grenadines. For more information, visit the U.S. Department of State website."]}