{"name": "Alicante", "description": ["About 100 miles south of Valencia and along the Costa Blanca (White Coast) is Alicante, an easygoing Spanish city that's highly favored among the party set. You'll most likely find travelers congregating around the Explanada de España, donning resort wear with drink in hand and bobbing to the beat of house music. During the day, the beaches – especially San Juan Beach – are the main event. One of Spain's best shorelines, San Juan Beach is replete with soft sands, about 330 days of sunshine a year and warm waters. While the city does have cultural attractions like the acclaimed Archaeological Museum of Alicante, the main reason to visit Alicante is to relax and make merry. So, imagine the sun on your skin, sand between your toes, grilled fish on your plate, sangria in your hand, lively music in your ears and a medieval castle, Renaissance cathedral or modern fountain before your eyes… Alicante.", "The best time to visit Alicante is any time. With mild temperatures and an average of about 20 days of rain per year, Alicante is hospitable year-round. For the best beach weather, visit June through September. (Be warned, the sand will be the most crowded at this time, too.) But if you want a chilled-out vacation, visit in the winter; you'll enjoy temperatures in the 50s, as well as deals on hotel rates. ", "Alicante is a seaside city, and in turn, its culture centers on enjoying the outdoors and experiencing life at a leisurely pace. Locals and visitors alike spend a great deal of time outside, whether they're walking, biking, roller blading or just enjoying a glass of sangria at an alfresco restaurant. Surfing is a popular sport in the city, so you can expect to see many people riding the waves while you relax on the beach. Or, you can sign up for a lesson at one of the many surf schools if you want to experience it yourself. Alicante doubles as the name of the city and the name of the small eastern province it sits within. There are many other small beach towns within the Alicante province you can visit during your trip.", "In Alicante, euros are the accepted currency, and Spanish is the most widely spoken language. The euro to U.S. dollar exchange rate fluctuates, so plan to check it before your trip. Because Alicante is popular among tourists – especially those from other European countries – you'll find yourself surrounded by a mélange of different ethnicities and languages, but there is still a strong local and authentic Spanish presence. You'll find a true taste of Spain when you venture away from the crowded Rambla Méndez Núñez and look for little restaurants in the narrow streets. You can get your dose of Spanish history at the city's many museums like the Archaeological Museum of Alicante or the Bullfighting Museum where you'll learn the history behind the infamous Spanish tradition. Some tourists use Alicante as a home base from which to travel to other towns along the Costa Blanca.", "Days start late in Alicante. Most people socialize while sipping coffee around noon, eat their midday meal around 3 p.m. and don't sit for dinner until around 9 p.m. The siesta culture is a way of life in Alicante, so you may find many stores and businesses closed between 2 and 4 p.m. While you don't have to necessarily take a nap during this time, it's nice to relax and rest up for your night on the town. ", "xAs mentioned, Alicante is known for its nightlife, so you can expect lively crowds out and about once the sun goes down. The city offers diverse nightlife options from bars to clubs to massive discotecas. La Zona district and El Puerto district situated near the marina have some of the most popular bars and nightclubs; if you want to tuck in early, consider staying in a quieter area like El Campello, which is a tram ride away from downtown Alicante city. The nightlife attracts a young crowd, so expect to see many teens and young adults out and about during your stay.", "When you think Spanish food, you probably think of one thing: paella. The flavorful rice and seafood dish originated in the Valencian Community near Alicante, making this seaside city the perfect place to sample it. Travelers recommend trying paella at the Michelin-starred Monastrell, the elegant La Taberna Ibérica or the casual, but authentic La Tasca del Barrio. There are also plenty of other seafood dishes to choose from thanks to Alicante's location alongside the Mediterranean Sea. Salazones, or salted fish dishes, are popular as well as esgarraet (made with cod and red peppers) and all i pebre (a stew of baby eel, garlic and paprika). If you're not a seafood fan, don't fret: other equally delicious Alicante dishes include hearty meat stew called olla churra and anything featuring the signature alcachofas – artichokes – for which the Alicante region is known. For dessert, tuck into some turrón – a hard nougat snack famous in Alicante and influenced by the region's Arabic history.", "Of course, it's hard to pass up a glass of deep red wine on your Spanish getaway. For all the oenophiles venturing to Alicante, there is a famous wine route that stretches from the Vinalopó region just north of the city to La Marina in the south. There are plenty of organized tours that leave from Alicante and take you to various vineyards around the area. If you'd rather stay local, you can sip some vino at one of the many wine bars around the city, such as Vino y Mas, Syrah, El Colmado and Boca de Vin. ", "The best way to get around Alicante is on foot. It's not a massive or very hilly city, so walking is an easy feat. Not to mention, much of the city's charm comes from colorful buildings and secret nooks you would miss if you were driving. However, do note that many streets are cobblestone, so if you have mobility issues it may be hard to maneuver. If you don't want to or are unable to walk, you have other transportation options.", "The Alicante Airport (ALC) sits less than 10 miles south of the center of Alicante. If you're taking a cab from the airport into central Alicante, expect to pay a fixed rate of 19 to 21 euros (about $22 to $24), depending on the time of day. Radio Taxi Elche, easily identified by the green stripes on the cars, are the official taxi at the airport. If you'd rather take public transportation, you can hop on the C6 bus line, which will take you into downtown Alicante for 3.85 euros (or about $4.50)."]}