{"name": "St. Petersburg", "description": ["St. Petersburg stands at the geographic and cultural borders of the west and east. While the city's appearance was influenced by the intricate and ordered architecture of Western Europe, it is still infused with a vibrant and persevering Russian spirit. St. Petersburg largely owes its dualistic nature to its founder, Peter the Great, an unabashed lover of all things European. In the early 1700s, Peter commissioned the city's streets and architecture to resemble his favorite western cities.", "And the results of the czar's great experiment? A grand European-style city, replete with long boulevards, narrow canals and grand public squares. It's also an epicenter of distinctly Russian culture, as the place where literature and music greats like Dostoyevsky, Tchaikovsky and Prokofiev all found their voice. Moscow might be known for its luxury and decadence, but St. Petersburg offers compromise between the expensive tastes of Russia's capital and the often-overrated (and just plain crowded) cities of Western Europe.", "The best time to visit St. Petersburg is from mid-June to September. Although it's expensive, St. Petersburg's near 24 hours of sunshine and White Nights celebrations during the summer months are not to be missed. Summers are generally cool but pleasant, with low temperatures dropping to the 50s and highs hovering around 70 degrees, so be sure to pack accordingly. Traveling to St. Petersburg in the winter is rare; days are short, and temperatures will dip well below freezing into the teens.", "English is spoken in major hotels and restaurants, but you'll find mostly Russian speakers in the more local areas like the market or small inns. Some helpful Russian greetings include the informal \"hello\" (priv-EYET), the formal \"hello\" (ZDRA-stvooy-te), the informal \"goodbye\" (pah-KAH), and the formal \"goodbye\" (Dah svih-DA-nee-ye). Saying \"thank you\" (Spa-SEE-ba) is always nice as well.", "The ruble is the official currency of Russia. One U.S. dollar is equivalent to about 64 rubles. Plan to check the current exchange rate before your trip. While you might want cash for some purposes (purchasing metro tokens, for instance), you'll find that most restaurants, stores and hotels accept credit cards. Currency exchanges in airports generally offer less favorable rates than banks. ATMs are common in Russian cities, so your debit card might work (though you should check with your bank before you go regarding fees and exchange rates).", "While it's true that visitors can still find classic Russian culinary staples like borscht, stroganoff, cabbage stew and caviar on menus around the city, travelers will also enjoy more contemporary dishes as well. And fortunately for visitors, food prices are more reasonable in St. Petersburg compared to Moscow.", "You'll find hundreds of culinary hot spots in St. Petersburg, especially along Nevsky Prospekt, ranging from luxurious eateries to sprawling, local markets. If you're looking for an affordable snack on the go, try a Russian crepe, or blini. This Russian pancake is usually stuffed with butter, caviar or other fillings and is a treat for the adventurous foodie. You'll find it at street vendors around the city. To acquaint yourself with local produce, meats and cheeses, pay a visit to the Kuznechnyy Rynok (Kuznechny Market) a favorite among tourists for its honey vendors and plentiful souvenirs.", "If you're craving a classic Russian meal, consider Literary Café on Nevsky Prospekt, which once played host to the likes of Pushkin and Dostoyevsky. For a more modern take on Russian fare, head to Hamlet + Jacks for dishes like Baltic herring and Siberian venison. And for Georgian cuisine, Phali Hinkali is a top spot thanks to its hearty dishes. If you're celebrating a special occasion, or just want to treat yourself to a memorable meal, critics and travelers suggest making a reservation at Palkin, which is known for its elegant dining room and fusion of Russian and French cuisines. Other well-reviewed eateries include Probka (Italian), Bekitzer (Israeli) and Etnos Café (Georgian).", "St. Petersburg has a mixed reputation when it comes to safety, but most agree that it has improved from the chaotic time immediately following the fall of the Soviet Union. Discrimination against ethnic groups, specifically individuals of Asian or African descent, is still reportedly an issue in Russia, as is discrimination against LGBTQ individuals. Government officials warn against traveling alone at night to avoid violent confrontations.", "In October 2019, the U.S. State Department issued an advisory urging increased caution in Russia because of possible terrorism and arbitrary enforcement of laws. However, these mainly applied to specific areas (such as the North Caucasus for terrorism and occupied portion of Ukraine for abuses by authorities). With respect to St. Petersburg specifically, the State Department noted possible delays in services for U.S. citizens because of reductions in diplomatic personnel. According to the State Department, you can be detained by Russian police for not having your passport with you (police in Russia do not need to show probable cause to stop, question or detain you). Plan to carry your passport with you at all times. Visit the State Department's website for more information.", "When walking around, you'll also want to be very careful when crossing roads, as drivers don't always yield to pedestrians here. Use crosswalks and only cross when vehicles have come to a complete stop. Several travel sources advise tourists not to drink the tap water in St. Petersburg due to the antiquated pipes and high metal levels in the tap water. To avoid illness, only drink filtered or bottled water.", "The best way to get around St. Petersburg is by public transportation; otherwise, you can walk around Nevsky Prospekt, the main thoroughfare. There's an extensive bus and metro system with lines that run throughout the center and into the city's outskirts. The tram or trolley is best for short journeys through downtown. For trips to the suburbs, try the metro system. Rental cars are available at the Pulkovo Airport (LED), but acquiring the proper driving documents can be a hassle. Taxis are also a prevalent (though, at times, unsafe) way to move around.", "From the airport, a taxi can cost anywhere from 600 to 1500 rubles (or about $9.50 to $24), depending on your destination. Taxi Pulkovo is the preferred company; you'll see Taxi Pulkovo stands in the arrivals area of the airport. However, several recent travelers have been overcharged for taxi trips between the airport and the city. Many recommended relying on smartphone apps instead to ensure a fair price.", "Acquiring a visa to travel in Russia is a bit more complicated and expensive than visiting other countries. Every foreign traveler entering Russia must have a Russian-based sponsor (like a hotel, tour company, university or relative). In addition to a valid U.S. passport, you must also obtain a travel visa from a Russian embassy or consulate prior to arriving in Russia. If you plan to stay in Russia for more than seven days, you have to register your visa and migration card (the white paper document given by the border police on first entry to Russia) with the Federal Migration Service. Tourists visas start at $160 per person. You can apply for a visa up to 90 days before your intended visa start date. For more information on entry and exit requirements, visit the U.S. State Department website."]}