{"name": "Lyon", "description": ["France's third-largest city, after Paris and Marseille, is in no way third-best. In fact, many say Lyon gives travelers a taste of authentic French culture, not to mention some of the most masterful cooking in the world, which is why the city is often hailed as the gastronomic capital of France.", "Founded in 43 B.C. on the convergence of the gleaming Rhône and Saône rivers, Lyon's long history is still on view today, from its Ancient Theatre of Fourvière to its Renaissance-era district Vieux Lyon. But Lyon is a city moving forward, too: Up-and-coming neighborhoods like Confluence are evidence, as are the wide array of jampacked music clubs. And if you needed even more reason to travel here, Lyon is also the gateway to the Rhône Valley – and the hundreds of wineries that spill out across the rolling hills.", "The best time to visit Lyon is in September and October when the city empties of its summertime tourists, leaving behind crisp, cool autumn weather and colorful foliage. The months between November and April, while the coldest and darkest, are the best times to find deals on airfare or accommodations. May is another excellent month to visit, thanks to comfortable temperatures, while summertime's June, July and August are peak season in Lyon.", "More and more, Lyon's cultural cachet rivals that of Paris. Not only is Vieux Lyon a UNESCO World Heritage site, it's also Europe's largest Renaissance site after Venice. What's more, the southern city hosts more than 21,000 events a year, welcoming about 3 million tourists during its Festival of Lights event alone. ", "As is the case throughout France, locals in Lyon speak French, but those in tourist-facing businesses will speak English, too. The French are proud of their language, and travelers would do well to learn a few pleasantries, such as \"bonjour\" (hello); \"au revoir\" (goodbye); \"s'il vous plaît\" (please); and \"merci\" (thank you).", "The euro is the official currency of Lyon. One euro is equal to about $1.20, but since the exchange rate can fluctuate daily, it's best to check it before your trip. Travelers can exchange their dollars for euros at the airport or at various booths throughout Lyon. When it comes to tipping, travelers should note that restaurant or bar bills usually contain a service charge; though it's customary to round out the bill with a small tip. In addition, tipping hotel staff a few euros for their services is also customary.", "Lyon has more than 2,000 restaurants – nearly 1,000 of which show off its local cuisine. Cochonaille (or pork) features heavily into the menus of Lyonnais local establishments, so travelers should order charcuterie and try sausages, such as Rosette, Jésus de Lyon and saucisson chaud. The salade Lyonnaise, a green leafy salad of poached eggs, croutons and fried potatoes, is also served with pork lardons (small strips of bacon). Potatoes also feature into Lyonnais cooking, and travelers can try them in gratins or in the paillasson Lyonnais (which translates literally to \"doormat;\" it's a grated potato and butter pancake). ", "For a fine dining experience, travelers have an array to choose from, including the inventive Café Sillon and Le Kitchen Café, or Michelin-starred Auberge du Pont de Collonges and Auberge de L'Ile Barbe. For cafes – because cafe culture is alive and well in Lyon – try Jeannine et Suzanne or Kaova Café.", "Any foodie will appreciate a wander around Les Halles de Lyon Paul Bocuse, a gourmet market with dozens of stalls selling everything from cheese and charcuterie to spices and flowers. While here, make sure you pick up some Lyonnais cheeses, such as the soft Saint-Marcellin and Saint-Felicien cheeses, as well as the Rigotte de Condrieu goat cheese. You can also enjoy a sit-down dejeuner (meal) of shellfish and white wine – the market boasts a handful of restaurants alongside its vendors.", "The best way to get around Lyon is through a combination of walking and using Lyon's public transportation system. Getting around Lyon by car, especially during summer's peak season, can be challenging (traffic jams and parking issues abound). Taxis and the ride-hailing app Uber are an option too, though they aren't the most affordable means of getting around. ", "Most travelers fly into the Lyon–Saint-Exupéry Airport (LYS), an international hub. There are several options to traverse the 20-some miles from the airport to the city. There is a tram station connected to the airport that stops at Gare de Lyon-Part-Dieu, the city's main train station. Taxis are also plentiful and convenient; rides from the airport to the city center cost between 50 euros (around $60) and 70 euros (or about $84), depending on the time of day. Uber also operates in Lyon. Rental cars are available at the airport and within the city. ", "If you're not flying in to Lyon, you're likely arriving by high-speed train from one of several nearby cities, including Paris, Marseille, Nice or Brussels. If you're planning a daytrip to or from one of these vacation hot spots, hopping on a train (operated by TGV) is the most convenient option.", "To travel to France, you'll need a passport that's valid for at least three months beyond your departure date (though six months is recommended). To stay longer than three months, you'll need to obtain a tourist visa before you arrive in France. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}