{"name": "San Diego", "description": ["Consistently sunny weather and 70 miles of magnificent coastline are what draw active types and sun seekers alike to San Diego throughout the year: that and the mouthwatering Mexican cuisine, thriving nightlife and one of the country's favorite zoos. And then there are the beaches: Retreat to Mission Beach to catch a wave, to La Jolla to soak up the sun and to Coronado for a leisurely seaside stroll. What's more, San Diego offers some of the best California tours, including whale watching tours, boat tours and fishing charters. When you're ready to ditch your flip-flops and board shorts for more formal attire, you'll find pockets of vivacious nightlife throughout, especially near the historical Gaslamp Quarter.", "The best times to visit San Diego are March through May and September through November. You can find some great deals on travel rates during the low seasons in comparison to the peak summer season. However, because of the warm weather, which averages about 70 degrees year-round, there's never really a terrible time to visit. But that doesn't necessarily mean sunny days abound as well. During the months of May and June, overcast days occur often, so much so that locals designate the months as \"May Gray\" and \"June Gloom.\" And when it comes to rain, San Diego sees the most rainfall during the winter months, so a day at the beach is out of the question during this time (not to mention the ocean's waters are too frigid for swimming).", "Surf's up Before diving in, make sure to check the weather and surf conditions at San Diego's beaches. Heavy tides and rough waves can make a leisurely Pacific swim unpleasant and even unsafe. The San Diego Coastkeeper website offers a handy way to check which beaches are open or subject to advisories.", "Don't count on public transportation San Diego is much easier explored by car. The light rail system (trolley) has few lines and getting from point A to B via bus in this large city can yield long travel times. That said, the city does have the same array of transportation options available in other big cities, including ride-sharing, bicycling, shuttles, scooters, ferries and more.", "Beware \"May Gray\" and \"June Gloom\" If you're coming to San Diego for the sunshine alone, keep in mind that May and June are notorious for having more overcast days than other times of the year.", "Take a guided tour San Diego is chock full of guided tours, ranging from food tours to whale watches to sunset sails to Jet Ski trips and even fishing charters. Consider signing up for a guided tour to see a different side of the city with the help of a local.", "Check the calendar There are numerous events and conventions throughout the year, ushering in thousands of visitors at any given time. Plan your trip around San Diego's event calendar to avoid high hotel rates.", "Skip summer This is the peak tourist season, meaning hotel rates skyrocket while availability plummets. Instead, try for an early spring or late fall getaway.", "Hang your hat downtown Hotels along the beach or ones overlooking the bay charge hefty fees for their views. You'll find more affordable lodging the farther you are away from the water.", "San Diego's personality is a mix of Spanish, Hispanic and American influences. Juan Rodriguez Cabrillo (memorialized at the Cabrillo National Monument) was the first European explorer to touch down in San Diego (and the whole California coast) in 1542. The colonization of San Diego's Native Americans brought in a Spanish influence to the city for the first time. The first of the 21 California Missions developed by the Spaniards, Mission Basilica San Diego de Alcala, was founded here in 1769 and is considered to be the birthplace of Christianity on the West Coast. Right below the mission stands Old Town, the first permanent Spanish settlement on the West Coast. Balboa Park is another prime example of Spanish influence in San Diego. Not only is the park named after a Spanish explorer, but there are a number of Spanish-Renaissance style buildings dotted throughout.", "But the Spanish influence is more of a relic in comparison to the Hispanic influence that permeates the city today. San Diego’s eclectic nature as a border town has significantly influenced all facets of the city’s culture as well as its economy and politics. The U.S.-Mexico border lies just 17 miles south of downtown and can be accessed via the city’s trolley system (on the blue line).  The city has one of the biggest Hispanic populations in the U.S., and as such is one of the cities where Spanish is spoken the most in the country. ", "You can find Mexican eateries in just about every neighborhood you go, and if you visit a mall on the weekend (especially Fashion Valley), you’ll likely encounter wealthy Tijuana residents that came up to San Diego for the day to go shopping. Not only that, but oftentimes their kids commute into San Diego to go to school during the week. The Hispanic community has also made an impact on the city’s tourism. Old Town San Diego is the most visited state park in California and Chicano Park, located underneath the Coronado Bridge in the Barrio Logan, was given the distinction of a National Historic Landmark by the U.S. Department of the Interior in 2017. San Diego would not be the city it is today without the contributions made by the Hispanic community it calls home. ", "San Diego is also a big military town. The city is home to the fourth-largest naval base in the U.S., making it the biggest on the West Coast. There are also multiple Marine bases and training centers there as well, so don’t be surprised if you see members of the military walking about around town or training at the beach. What’s more, the world’s largest military commissary is here. ", "With the U.S.-Mexico border sitting just 17 miles south of downtown, it should come as no surprise that San Diego is home to a delicious array of top-notch Mexican food. Mexican restaurants big and small can be found everywhere you go, from more affluent areas like La Jolla and Point Loma to strip malls off the highway. If you're looking for a starting point, go to the Barrio Logan for some of the most authentic fare. Try the California burrito, which features carne asada, cheese, pico de gallo or guacamole and french fries. You should also consider indulging in some carne asada fries, which are topped with carne asada strips, cheese, salsa and beans. And, of course, you must sample the fish tacos. While the California burrito, carne asada fries and fish tacos are staples, they are hybrids. Conchas and pan dulce (or sweet bread) found at Panchita's Bakery and chamangos, smoothie or sorbet mixed with mangos and chamoy (found at Tocumbo Ice Cream), are more authentic to Mexico. ", "San Diego has also made a name for itself in the craft beer scene. The city boasts more than 150 breweries and counting. Top craft breweries, such as Karl Strauss, Stone Brewing and Ballast Point, all call San Diego home. You can find a directory of breweries on the San Diego Visitors Bureau website. Or, for a comprehensive glimpse into San Diego's love of the brew, consider planning your trip for June, when the San Diego Brewers Guild hosts its Beer Weekend. And if wine is more your speed, check out nearby Temecula on a guided wine tour.", "Seafood is another important component of San Diego's culinary character thanks to the city's close proximity to the ocean. For the best atmosphere, seek out places closest to the water, such as Point Loma Seafoods, Mitch's Seafood (also in Point Loma) and Oscar's Mexican Seafood in Pacific Beach. ", "And for a comprehensive taste of San Diego's Mexican, seafood and craft beer, head to Liberty Public Market in Point Loma. This market features produce stalls, as well as ready-made meals in addition to a few restaurants. For a crash course in the city's eclectic dining scene, sign up for a guided food tour. ", "The best way to get around San Diego is by car. You'll find that the trolley and bus routes aren't as well-connected as in other big cities, so to fully experience everything, you're better off being the one in complete control for getting to point A and B. You can rent a car at the San Diego International Airport (SAN) – located about 2 1/2 miles northwest of the city center – or you can take a taxi and then rent a car once you arrive in town. Taxi fares from the airport to downtown San Diego can fluctuate depending on traffic, but you should expect to pay about $12 to $15 for a one-way ride. ", "San Diego's world-famous surfing may have inspired the Beach Boys tune \"Surfin' USA:\" several of the spots mentioned in the iconic song are located in San Diego, including Del Mar, Trestles and Swami's."]}