{"name": "Athens", "description": ["Few cities rival Athens, Greece, when it comes to historical importance, yet the bustling capital is also fun and brimming with things to see and do. Visitors will also notice that ancient Athens feels considerably more \"lived in\" and authentic than other major European cities that are filled with vacation rentals and somewhat devoid of the unique cultural experiences many tourists crave.  ", "As the sun rises over the smooth marble monuments of the Acropolis and fills the cobblestone streets along its base, the people of Athens emerge from their homes and head to local markets or sidewalk games of chess. Life moves more slowly, as if the entire city is reveling in blissful retirement from its glory days as a political and cultural powerhouse.", "The best times to visit Athens are between March and May and from September to November. Weather during the spring and fall months is agreeable and sunshine is pretty much a guarantee. Not to mention, crowds are thinner and hotel and airfare deals are easier to come by than in summer. But if you choose to visit between December and February (Athens's winter season), don't fret. The winters in Athens are relatively mild (with temperatures that range from the low 40s to the mid-50s), thanks in part to the country's location along the Mediterranean. June through August, meanwhile, bring stifling heat and hordes of tourists, so sightseeing can be a bit uncomfortable and quite a headache at this time.", "Get there early (or late) Lines at major sites can get pretty insufferable – arriving in the early morning or shortly before closing will make them more tolerable.", "Avoid June through August You'll end up paying more for flights and rooms, plus you'll have to deal with the city's notorious summer heat and throngs of tourists.", "Walk, walk, walk Navigating around most of central Athens by foot is very doable and can actually be part of the fun, so there's no need to spend money on a car rental. Put on a pair of quality walking shoes and start exploring.", "Book early Finding cheap accommodations with little lead time is difficult any time of the year. Aim to book at least several weeks or even months in advance.", "Greeks are known for their hospitality toward visitors, and Athens is considered a friendly tourist destination. However, understanding Greek etiquette will help you interact with residents and blend in with society.", "One of the biggest challenges for visitors is the language barrier. Greek is the official language of Athens, and while it is possible to find English speakers in most tourist areas, it's always a good idea to bring a Greek phrasebook or dictionary. Understanding body language will also help you better interact with Athenians. Be aware of your gestures; for example, the hand signal for \"OK\" using the thumb and index finger is offensive in Greece, and Greeks indicate \"yes\" – a slight downward nod – and \"no\" – a slight upward nod – differently than Americans.", "For the most part, dress is casual; however, take into account your surroundings. When hiking to the Acropolis, it's acceptable to wear shorts and a T-shirt, but you should dress more formally when touring churches and other religious sites. If you're traveling to Athens on business, it is best to bring conservative attire: a dark-colored suit or a dress that covers the knees.", "When dining out in Athens, keep in mind that most Athenians do not sit down to dinner until later in the evening, typically around 9 or 10 p.m. Although it's rude to have your elbows on the table, it's polite to keep both hands above the table and not in your lap. Tipping is not necessary, although it is customary to round up to the nearest currency note when paying with cash. Including a tip for exceptional service is also common.", "The official currency of Athens is the euro. Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.  ", "Central Athens is home to everything from traditional mom and pop restaurants – generally located in the older districts at the base of the Acropolis – to high-end establishments in Kolonaki. If you're looking for a great meal away from the tourist crowd, head to some of the quieter neighborhoods like Koukaki, Mets or Pangrati. Keep in mind that Athenians generally don't sit down to dinner until 9 or 10 p.m.", "Wherever and whenever you dine, be sure to sample authentic Greek cuisine. Some of the more traditional dishes include moussaka (lamb and eggplant in bechamel sauce), souvlaki (skewered and grilled lamb, pork or goat wrapped in pita and commonly topped with lettuce, tomato and a yogurt-based sauce called tzatziki) and baklava (crushed nuts and honey in phyllo dough). ", "Seafood is also a staple of Athens' cuisine. While many central Athens restaurants have seafood on the menu, some of the best seafood-focused eateries are located in Piraeus by the Mikrolimano fishing harbor.", "Pickpockets regularly target tourists on public transportation and in high-traffic areas, so it's best to leave valuables in your hotel safe and to stay alert at all times. Racially motivated harassment is common as well, especially at night in Omonia and Exarchia, so consider bypassing these neighborhoods once the sun goes down. Also, several domestic terrorist incidents have taken place in Athens in the last few years outside area embassies and by Syntagma Square. These areas are generally safe during the day, but exercise caution when visiting and be sure to avoid political protests, which are prone to violence. Public demonstrations occur annually on May 1, Nov. 17 and Dec. 6. For more details about security concerns in Greece, visit the U.S. State Department's website.", "The best way to get around Athens is on foot and by metro; most of the city's major attractions are located within walking distance or a short metro ride of one another. In fact, renting a car is little more than a nuisance, as traffic is heavy and parking is hard to find. When coming from Athens International Airport (ATH), located just 23 miles southeast, you can ride the metro's Line 3 or one of four EXPRESS airport buses. To get to Athens from other parts of Greece, plan on taking the train or one of the country's buses. And if you're arriving by ship from other Mediterranean destinations like Crete, Santorini or the Saronic Islands, you'll most likely dock in the port town of Piraeus, meaning you can take a short cab or metro ride to reach central Athens.", "You'll need a passport that's valid for at least six months past your departure date to visit Athens or anywhere else in Greece. Americans who stay in Greece for less than 90 days do not need a visa. To learn more about entry and exit requirements for Greece, visit the U.S. State Department's website.", "One of the best times to visit Athens is in the spring when temperatures are mild and flowers are in bloom around must-visit sights like the Parthenon."]}