{"name": "Memphis", "description": ["Memphis is constantly grooving, either to the songs of Elvis echoing throughout the city or to the tunes of up-and-coming musicians along Beale Street. Graceland is the major draw for many; however, audiophiles who come only for Elvis will be pleased to find out that Memphis has much more to offer. Johnny Cash, Isaac Hayes and B.B. King also nurtured their unique sounds in Memphis bars and recording studios. Along with the significant role Memphis played in music history, this city also serves as a poignant reminder of the civil rights movement. It was here that Martin Luther King Jr. petitioned for the equal rights of Black sanitation workers in 1968. After leading a peaceful protest in March, King returned to the city on April 3 only to be assassinated a day later at the Lorraine Motel, now the site of the National Civil Rights Museum.", "There's a third, sometimes overlooked reason to plan a Memphis visit. The \"Cradle of American Music\" delivers good eats, as well as good tunes and good history lessons. Consider a spring or fall trip (the summer heat here is staggering) to try out a few culinary – and distinctly Southern – favorites. The region's finger-lickin' barbecue and buttery grits should be at the top of any aspiring foodie's list. For more information on the city's history, food and tunes, sign up for one of the best Memphis tours.", "The best times to visit Memphis are April and May or October and November. These short seasons are brief reliefs from the uncomfortable (and long) summer and winter seasons. Average summer highs often climb above 90 degrees with high humidity. However, the summer remains Memphis' peak tourism season because of school vacations.", "You'll experience traffic The city's highways can morph into parking lots within minutes. Stay off the roads between 7 and 9 a.m., and again between 4 and 6:30 p.m.", "You'll experience Elvis mania The King has been dead for several decades now, but the citizens of Memphis have had a difficult time letting him go (especially since his legacy is integral to their tourism industry). Many tourists get irritated by the onslaught of Elvis memorabilia.", "You'll experience heat exhaustion This condition is a frequent one for tourists in the summer. While seeing the sights, drink lots of water and take breaks indoors.", "Avoid a summer visit The air is muggy with high temps and humidity, and hotel rates are high. Save some money and enjoy more pleasant weather by visiting in the fall or spring.", "Opt for the Backstage Pass If you plan to visit the Memphis Rock 'n' Soul Museum, Sun Studio, Graceland and the Stax Museum of American Soul Music, consider purchasing the Backstage Pass. It grants you access to all four attractions for $89.", "Enjoy the freebies Several attractions are extremely cost effective (in other words: free). The duck march at The Peabody Memphis and the art museum at the University of Memphis are just a couple of the no-cost-to-you activities. For even more free ideas, visit the Memphis Visitors Bureau website.", "Traditional Memphis cuisine is not for the faint of stomach. Though Memphis boasts many types of restaurants, the city's culinary delight is barbecue. It's some of the best in the country – and each of the city's 100 or so barbecue joints offers its own individual recipe. Memphis specializes in pork; whether it's slow-smoked ribs or pulled and stuffed into a bun, you'll find a variety of dry rubs and tangy and sweet sauces to tantalize your taste buds. Central BBQ is one of the most popular spots in the city, but Corky's BBQ, Cozy Corner BBQ and Interstate Barbecue also come highly recommended by visitors and locals alike. Visitors also say The Four Way is a must-stop, as it's the city's oldest soul food restaurant. Evelyn & Olive also offers delectable Jamaican and Southern cuisine alongside live music. Barbecue aficionados will not want to miss the city's annual World Championship Barbecue Cooking Contest, which takes place every year in May. For help navigating the city's top barbecue joints, sign up for one of the best food tours.", "What pairs nicely with a plate of ribs? Local beer, of course. To get a taste of the city's suds scene, check out the many craft breweries and pubs. Don't miss your chance to sample some of the city's other traditional treats, such as fried pickles, meatloaf and fried peanut-butter-and-banana sandwiches (the only sandwich fit for \"the King\"). If deep-fried isn't really your taste, you can enjoy some of the city's other dining options, which offer everything from Japanese cuisine to Mexican favorites.", "You'll find the widest variety of restaurant options in downtown Memphis. However, stumbling upon a barbecue joint in the surrounding areas is not a difficult feat, and hole-in-the-wall spots are both tasty and easy on the wallet.", "Memphis is generally a safe city for tourists. You'll notice a lot of police presence downtown (especially around Beale Street) in both the day and night, but travelers should still exercise caution in tourist areas, which are known to have a high concentration of panhandlers. Watch your belongings and avoid going out at night alone. Those who are not used to the Southern climate should also take precautions against heat stroke, particularly during the summer months. The most common symptoms of heat stroke include headaches, dizziness, fatigue and nausea. Drink plenty of water and apply sunscreen regularly.", "The best way to get around Memphis is by car. Attractions pepper the city, making \"Walking in Memphis\" a challenging feat – with or without your blue suede shoes. If you don't want to deal with Memphis traffic, you can instead rely on the Memphis Area Transit Authority's fleet of buses and trolleys or the city's new bike-share program. ", "Travelers who don't road-trip here arrive through Memphis International Airport (MEM), positioned about 10 miles southeast of downtown. To get to downtown Memphis from the airport, you can rent a car, take a cab (which costs about $30) or use your hotel's complimentary airport shuttle (the Memphis airport lists all of the area hotels that offer shuttle service on its website). Uber and Lyft also service the airport."]}