{"name": "Bruges", "description": ["Swans swim its canals; medieval buildings shadow its cobblestones; willow trees weep over its lake; rich chocolates peer from behind its windows; pints of Belgian blondes sit on its cafe tables; and carillon chimes fill its air with music: This is Bruges (or Brugge in Dutch). This idyllic city in northern Belgium is more touristy and yet more quaint than the capital city of Brussels. Plan a trip to Bruges for a taste of medieval Europe in the 21st century, for a friendly small-town feel with world-class charms (the Historic Centre of Brugge, to name one) and, of course, for the beer, fries and chocolate. Whatever your reason for coming to Bruges, you'll be charmed.", "The best time to visit Bruges is from June to August, when the weather is mild, and the trees are green. Still, the weather year-round is characterized as chilly and damp – summer temps usually don't climb higher than the 70s. Spring and fall are considered shoulder seasons that see fewer tourists and cooler temperatures, with average highs hovering in the 50s. In the winter, temperatures drop but don't reach freezing, and the city offers a variety of holiday events, including its famous Christmas markets. Fall and winter also bring the greatest chance of rain, so keep an umbrella at the ready.", "Hop on a boat tour Canal tours are a great way to get an overview of Bruges. You'll easily find boat operators departing from jetties around the city offering 30- to 45-minute tours. The famous Rozenhoedkaai is a popular spot to hop on a tour.", "Indulge in some chocolate Belgium is known for the sweet stuff, so be sure to pause for a chocolate break at a well-known chocolate maker like The Chocolate Line or Sukerbuyc.", "Get a Discover Bruges Card If you stay at a Hotels Regio Brugge member hotel, you have access to a free card, which offers discounts on area attractions and shops.", "Get a Musea Brugge Card This card grants you access to a variety of museums, including the Groeningemuseum, over a period of three days for 28 euros (or about $31).", "Once a hub for artists of the Flemish Primitive style of painting, art is front and center in Bruges. There are numerous museums with artwork, as well as churches, convents and even a medieval hospital that each boast their own collection of impressive works.", "Make sure to bring some euros with you, which is the currency of Belgium. When eating out, it's unlikely you'll need to tip, as it's included as part of the restaurant bill, and restaurant workers earn better compensation than those in the U.S. It's OK to leave a few euros for excellent service, but generally not more than 10% of your bill.", "Residents of Bruges love their beer, Belgian fries and chocolate – Bruges even has its own official city chocolate: the Bruges swan, or Brugsch Swaentje. Bruges offers plentiful chocolate shops, pubs and a handful of breweries, as well as attractions that tell the story of each of the country's celebrated foods, including the Bruges Beer Experience, Choco-Story and Frietmuseum. But the dining scene in Bruges is much vaster than these three staples.", "Gruuthuse Hof, which has been open since the mid-1700s, is popular with tourists and serves traditional Belgian dishes like beef stew and duck, and waffles for dessert. For a casual meal, the De Halve Maan Brewery also has a restaurant on the premises with a limited menu if you want a bite with your beer.", "If you're celebrating a special occasion or just in the mood to splurge, consider Le Mystique, which serves a blend of French and Flemish cuisine. The restaurant is historic as well, dating to 1869. Dishes with a Flemish touch include beef with braised chicory and seafood, including sea bass and oysters. Flemish cuisine is known for its fries and waffles, as well as beef stew, Belgian endive, and of course, Brussels sprouts. A meal at Bistro Refter is equally indulgent as it's headed by Michelin-starred chef Geert Van Hecke, who offers a contemporary take on Belgian cuisine with dishes like roasted cockerel, fish, steak and, of course, fries.", "When it comes to safety, Bruges generally has a low crime rate, is clean and safe for traveling alone, though as in any tourist destination, be aware of pickpocketing and traveling by yourself at night. The State Department does encourage citizens to exercise extreme caution when visiting Belgium due to terrorist groups continuing to plot possible attacks there.", "The best way to get around Bruges is on foot. The city is small – in fact, you can walk from one end to the other in about 30 minutes. Biking is the second-best way to get around. There's also a bus system, but it's most useful in getting from the train station to the city center rather than for exploring the city. Cars are not recommended, since Bruges' streets are narrow and webbed with canals. You can also hire taxis at several taxi stands. The closest major airport is Brussels Airport (BRU), so most visitors take the train into Bruges. The ride from the airport to Bruges is about 90 minutes; tickets start at 21 euros (or around $23). According to the tourism office, taxis from the airport to Bruges cost a flat rate of 200 euros (or about $222). The train station is located just southeast of the city center, about a 20-minute walk from the historic city center or a five-minute bus ride.", "A valid passport is required for citizens of the United States to travel to Belgium. U.S. citizens can stay for up to 90 days without obtaining a visa. At customs, you'll have to present a return airline ticket, as well as a passport that is valid for at least three months after the date of your departure. If you're planning to stay in Belgium for more than 90 days, you'll have to obtain the proper visa before leaving the U.S. Keep in mind: The U.S. Department of State issued an advisory for travel in Belgium in December 2018 due to terrorism, warning travelers of potential terror attacks. The State Department recommends registering for the Smart Traveler Enrollment Program (STEP) so that you'll receive alerts and be easier to locate in the event of an emergency. For more information, visit the State Department's website.", "Considered one of the most photographed areas of Bruges, Rozenhoedkaai, or Quay of the Rosary, is a picturesque spot where the Dijver and Groenerei canals meet."]}