{"name": "Florence", "description": ["This little city, tucked amid the Tuscan hills, casts a long shadow through history. The wellspring of the Renaissance, Firenze (or Florence) sheltered the powerful Medici family and inspired artists like Michelangelo (David) and Brunelleschi (the Duomo). If it weren't for the fashionable Italians and chic shops lining Via Tornabuoni, you might think you had traveled back in time to the 14th century. But Renaissance art is not the only reason to come: You also visit Florence for its gorgeous sunsets, its Italian cooking and its romantic charm. Make the most of your time in the city by letting a local show you around on one of Florence's best tours.", "The best time to visit Florence is between May and September when warm weather ushers in art festivals, open-air dining and the kind of Italian sunshine that inspired the Renaissance painters. Unfortunately, it also brings sweltering weather, tourist swarms and high hotel rates. If you visit in late fall or winter, you'll enjoy lower room rates and much shorter lines at the Uffizi. But the meteorological conditions won't be as hospitable, with low temperatures dropping into the mid-30s Fahrenheit.", "Say no to knockoffs In Florence, it's illegal to buy knockoff designer bags. If the authorities catch you purchasing a fake item, you can be fined thousands of dollars.", "Reserve ahead The lines outside the Uffizi and the Galleria dell'Accademia are almost always tortuously long. Spend a few extra euro, and make your museum reservation in advance or sign up for a tour to skip the bulk of the line.", "Book a hotel on the outskirts For a somewhat more authentic (not to mention, cost-efficient) experience, book a hotel on the outskirts. You'll get to wake up to the glory of the Tuscan hills, and you're simply a quick train ride from Renaissance central.", "Consider the Firenzecard This card, which costs 85 euros (or about $95) and has 72 hours of validity, grants you admission into several of the city's top attractions, including the Uffizi and Galleria dell'Accademia, for one price.", "Dine smart Stay away from the tourist attractions when you're hungry – restaurants are generally overpriced here. In and around Mercato Centrale Firenze is a good place to find cheaper Italian food.", "The idea of la bella figura is one that is extremely important in Italian culture. Literally translated as \"the beautiful figure,\" la bella figura covers everything from a person's dress to his or her actions and manners – to Italians, all of life should be beautiful.", "Picking up a few Italian phrases is helpful and even attempting the language will win you points with Italians, who are usually more than willing to help if they see you trying. In any kind of store or restaurant, it is appropriate to greet and say goodbye to employees even if you do not purchase anything. A buongiorno on your way in and an arrivederci on your way out should cover it. Ciao is also acceptable but is less formal. Like in America, please (per favore) and thank you (grazie) will go a long way.", "Many establishments – restaurants, grocery stores and tourist attractions – close on Sundays. And although Florence attractions tend to open at a normal hour, many will take a midday siesta after the lunch hour. And some Florence attractions are closed an additional day a week (besides Sunday), so research attractions' hours before making your itinerary.", "In comparison to the United States, Italians have a less strict sense of personal space. Do not be surprised if they go further than a handshake at first meetings. Cheek-to-cheek and mouth-to-cheek kisses are not unusual. Follow their lead and note: Reciprocation is bella figura; to pull away would be rude. Speaking of rude, you should avoid pointing with your index finger, as most Italians point using all four fingers. And never point at something with just your index and pinky together; it's considered vulgar.", "Finally, Italy's official currency is the euro. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "Florence is known not only for its famous art, but also for its simple yet delicious cuisine, as well as its wine from neighboring towns in Tuscany. While restaurants tend to be overpriced, you can do as the Italians do and head to Mercato Centrale Firenze for fresh produce, bread, cheese and meat and create your own meal. Several of the top tours in Florence can also help you navigate the market and learn how to cook like an Italian. If you'd rather eat out, recent travelers praised the delectable Italian food and warm ambiance of Pitti Gola e Cantina and the Osteria del Cinghiale Bianco, near the Boboli Gardens. For a romantic dinner, make a reservation at Ristorante La Giostra, an intimate restaurant known for its gourmet cuisine, extensive wine list (bottles fill every nook and cranny of the restaurant) and as being the former resting place of the Salvemini Square carousel.", "Tuscan cuisine is all about simplicity. Hearty pastas flavored only with a few ingredients are still somehow rich and multi-faceted. Fish and meats are also well-represented in the Tuscan repertoire. Like most of the Mediterranean, olive oil is an important ingredient in almost every dish.", "Florence is also filled with a multitude of gelato stands. The pistachio flavor is the key to differentiating between the good ones from the not-so-great ones (the darker the color, the better). You'll find authentic gelaterias with pistachio gelato around the Piazza di Santa Croce and in Oltrarno.", "While in Florence, your greatest safety concern will be pickpockets. The Santa Maria Novella train station tends to see a lot of pickpocket action, as do the city's buses. Exercising caution and keeping an eye on your purse or wallet will help keep pickpockets at bay. Other than pickpockets, there are several other scams to be wary of when walking around Florence, especially around heavily-trafficked areas, such as the Duomo. People may approach you and offer to give you an item (such as a bracelet or a small trinket). They may force it in your hand or around your wrist and then ask you for payment. If anyone approaches you offering a \"free\" gift, politely (but firmly) move on.", "The best way to get around Florence is by foot. In fact, you can walk from one end of the city to the other in about 30 minutes, passing many recognizable sites along the way. Hopping aboard an ATAF bus is another option. To get into the city, many travelers fly into Galileo Galilei Airport (PSA) in Pisa, making a pit stop at its Leaning Tower before taking the train to the main station, Stazione di Firenze Santa Maria Novella. You can also fly into the small Amerigo Vespucci Airport (FLR) in Florence and take a bus or taxi to the city center. Renting a car is not recommended because skinny, one-way streets make driving a nightmare and many areas are relegated pedestrians or authorized traffic only.", "You'll need a valid passport with at least two blank pages to travel to Italy from the United States. In Italy, U.S. citizens have to have a passport that is valid for at least six months beyond the period of stay, but you can stay in Italy for up to 90 days without a visa. Those who wish to stay for a longer period should contact the Italian Embassy or a Consulate. For more information, visit the U.S. State Department's website."]}