{"name": "Puerto Plata", "description": ["Established in 1502, Puerto Plata earned its name, Port of Silver, from the glistening silver color of its coast at sunset. The seaside city served as the last stop for ships carrying goods back to the Old World. Today, Puerto Plata welcomes those taking a different type of journey: from hectic real life to tranquil, all-inclusive decadence.", "Its beach-town neighbor to the east, Punta Cana, offers the coddling comforts of the all-inclusive but with very little authenticity. Puerto Plata's appeal, however, is in fusing the two. In addition to the spectacular beaches of the Dominican Republic's north coast or the activities along the lively Malecón boardwalk, there's also the crumbling, yet majestic colonial architecture of the historic district or the breathtaking views atop Mount Isabel de Torres in the morning. In short, Puerto Plata's virtues include plenty of off-resort activities to placate the curious and plenty of all-inclusive activities to entertain the laid-back – and for a reasonable price. Need even more diversions? This Port of Silver is just a quick flight away from the DR's capital, Santo Domingo, and the thriving nightlife, shopping and burgeoning food scene found there.", "The best time to visit Puerto Plata is May and June, when hotel rates take a dive for the impending rainy season. In general, the city's weather is warm with average highs ranging from 80 degrees Fahrenheit in the winter to about 90 degrees in the summer. The region does experience a large amount of precipitation with an average of 50 to 60 inches of rainfall each year, with almost 10 inches alone on average in November.", "Most travelers stick close to the resorts to catch up on R&R at the beach, pool or spa, not to mention all-inclusive perks. But, for at least one day, you should try to get a sense of the Dominican Republic's history and culture. Your hotel can help steer you in the right direction, but buggy adventures and boat rides are some of the most common, and fun, ways to explore outside your resort.", "The official language is Spanish; however, tourism is such a large industry that English-speaking travelers should have no trouble communicating. And though the official currency is the Dominican peso, many of the area resorts accept United States dollars, as well as all major credit cards. One American dollar equates to about 58 Dominican pesos, but you'll want to check the current exchange rate before your trip.", "Even if you're enjoying a prepaid food plan, you shouldn't pass up the chance to sample some DR cuisine. La bandara – the national dish of red beans, stewed meats, rice and fried green plantains – is a must-try, and samaná's pescado con coco (fish with coconut sauce) will be appreciated by any seafood lover. Caffeine addicts will have no problem finding their fix in this city: The Dominican Republic as a whole is known for its coffee bean production, and you can expect your Puerto Plata cup of joe to taste fresh and flavorful. Delicious tropical fruit juices are plentiful, often made into fruit milkshakes or batidas, and include passion fruit, guava, pineapple, orange, strawberry, mango, mandarin and papaya.", "Other popular dishes include chicharrón (pork rinds), locrio de pollo (fried rice with chicken), mofongo (a plantain mound with deep-fried pork or shrimp) and sancocho (a seven-meat stew accompanied by avocado slices) for dinner. You'll also want to indulge in tasty Dominican desserts like grated coconut in cream, milk sweets, papaya and pineapple desserts, and guava and cashew paste soaked in syrup.", "Crime is uncommon in the hotel zone, though visitors should always use common sense with valuables, avoid secluded places when alone and not leave the resort area with strangers. And without a few pointers on local customs – especially concerning transportation – tourists venturing away from Puerto Plata's hotel zone can become the target of misadventure. For example, police pullovers are commonplace for rental cars; if stopped, visitors should calmly ask the officer for his/her rank, a citation for the offense and the amount to be paid. Do not hand over your license: Scam artists sometimes pose as police officers and steal tourists' identification in exchange for cash.", "According the Dominican Republic tourism website, it is not safe to drink the tap water in the DR, as it is not purified. Always drink bottled water, available at your resort or in local stores and supermarkets.", "Some warn against the popular motoconchos, or taxi motorcycles, that are available throughout the central plaza. Many DR roads are in poor shape, driving patterns are irregular and few cyclists provide a helmet for passengers. Taxis are more expensive, but they offer a better chance at getting to your destination in one unsullied piece.", "The U.S. Department of State also warns of rape and sexual assault of Americans throughout the Dominican Republic, including at major resorts and hotels. Visit the State Department's website for more details and resources available to travelers.", "The best way to get around Puerto Plata is by taxi. They're cheap – your average ride costs about 150 to 250 pesos ($3 to $5) – and drivers are willing to bargain to an even lower price. Minibuses are another popular (and negotiable) way to get around and can get you as far as Sosúa, a town east of Puerto Plata on the coast. Rental cars, although expensive, are available from the three major airports: Gregorio Luperón International Airport (POP) is about 10 miles east of central Puerto Plata, the Las Américas International Airport (SDQ) is around 100 miles southeast and the Punta Cana International Airport (PUJ) is about 150 miles southeast. Uber is also available in Puerta Plata, saving you the hassle of trying to explain your destination if you don't understand Spanish.", "All United States citizens must travel with a passport with at least six months remaining validity to enter the Dominican Republic. No visa is required for stays shorter than 30 days. For more information on entry and exit requirements, visit the U.S. Department of State's site."]}