{"name": "Yellowstone National Park", "description": ["With dramatic peaks and pristine lakes, Yellowstone National Park is an outdoor enthusiast's paradise. Multicolored pools swirl around hot springs; verdant forests weave past expansive meadows; and volatile geysers launch streams of steaming water toward the sky. With so much unspoiled natural beauty, it's no wonder why everyone suspected John Colter (a scout for explorers Lewis and Clark) was embellishing when he first described Yellowstone's geothermal curiosities in 1807. Nowadays, there's no doubt that the park is indeed extraordinary. While you traverse its 3,000-plus square miles of mountains, canyons, geysers and waterfalls, be prepared to share the trails with permanent residents like buffalo, elk and sometimes even grizzlies. ", "Although Yellowstone attracts more than 4 million visitors every year, chances are – unless you spend your entire trip at Old Faithful – you won't see much of them. Yellowstone's 2.2 million acres creep from the northwest corner of Wyoming into the edges of Idaho and Montana, offering plenty of untouched territory to explore. Carve out a day or two to take in the view at Yellowstone Lake and Mammoth Hot Springs. But save some time for the trails through lesser-known regions, like the hot springs of the West Thumb Geyser Basin and the untamed wildlife dotting the Lewis River Channel and Dogshead Loop. While the sheer number of trails and wildlife-watching opportunities may seem daunting at first, remember: You can always come back.", "The best times to visit Yellowstone National Park are from late April to May as well as September through early October. These shoulder months offer mild weather, fewer crowds and little to no road closures. July and August are the most popular months to visit: The kids are out of school, and the weather is warm enough to sleep outside. However, this park is no stranger to the cold. Temperatures have been known to drop into the 30s during the summer in the higher elevation areas of the park. During the winter, expect a wide range of temps, spanning from subzero digits to the high 20s. Don't let that stop you: There's nothing quite like seeing plumes of steam rise from beneath a thick blanket of snow and ice.", "Beware of bears All of Yellowstone is a bear habitat. To avoid an attack, make plenty of noise when hiking to avoid surprise encounters, bring bear spray and secure any food items before calling it a night.", "In winter, services are limited Except for those found at the park's headquarters near Mammoth Hot Springs, the majority of Yellowstone's facilities and roads close during the winter.", "Don't forget your permit If you are looking to camp outside the designated camping areas, you will need to obtain a permit from one of the visitor centers or ranger stations.", "There's an entrance fee Entry to Yellowstone costs $20 for visitors who enter on foot or by bike, $30 for those arriving by motorcycle and $35 for travelers with a car. All park passes are valid for seven consecutive days.", "BYOB Bring your own bed. A space in a campground is much cheaper than a room at one of the park's lodges. Plus, many campgrounds come equipped with showers, flushing toilets and even laundry facilities.", "Skip the summer Because summer witnesses the largest influx of tourists, hotel rates tend to rise. You'll spend less if you visit during the offseason.", "Do your own cooking Yellowstone does feature several sit-down restaurants, but they can end up putting quite a dent in your savings. Consider bringing your own food.", "Compared to other national parks around the country, Yellowstone has a lot of dining options. Inside the park, you'll find general stores, canteens, snack shops and even bars. Yellowstone is also home to a handful of sit-down restaurants, most of which are located by popular attractions such as Mammoth Hot Springs, Old Faithful and Yellowstone Lake. In-park canteens tend to serve casual fare like sandwiches, while high-end restaurants like the Lake Hotel Dining Room and the Mammoth Hotel Dining Room provide selections of game meats (including bison, elk and trout).", "Although there are a handful of dining options within the borders of Yellowstone National Park, consider bringing along a cooler with lunch items and snacks so you don't have to worry about staying near one of the park's more developed areas. Remember, it could take hours to get from one attraction to the other in Yellowstone. Other eateries can be found in the small towns surrounding the park. In Cody, Wyoming, previous visitors suggested dining at The Local and The Cody Cattle Company, while past travelers who visited West Yellowstone, Montana, raved about the dishes served at Wild West Pizzeria and Running Bear Pancake House.", "Safety hazards in Yellowstone range from headaches to severe hazards, such as animal attacks. Headaches may come as a result of the change in altitude. Yellowstone's elevation ranges from 5,282 to 11,358 feet above sea level. Although altitude sickness tends to occur after exposure to environments above 8,000 feet, any sudden, major change in altitude can result in one feeling sick, with symptoms including headaches, tiredness, dizziness and more. Even if you aren't planning to go to higher elevation areas in the park, or do a lot of hiking, or both, consider taking it easy for 24 hours to adjust to the environment.", "When sightseeing in the park, keep in mind that many of the geothermal attractions, such as the geysers and mud pots, are dangerous due to their extremely hot temperatures. Likewise, you should stay a safe distance from animals at all times. The National Park Service suggests putting at least 100 yards between you and wolves and bears, and about 25 yards or more between you and all other wildlife. Most of the park's established campsites generally are not at risk for animal attacks, but campers must keep all food and garbage out of reach from bears and other critters. Animals who have access to food and garbage from humans often become dependent and then aggressive towards humans to get it, and as a result, may have to be put down. ", "If you can help it, avoid wandering off on your own: 91% of bear attacks in Yellowstone were from visitors who went hiking by themeslves (remember that the entirety of Yellowstone is considered bear country). Regardless of whether you are by yourself or with others, make plenty of noise (the NPS recommends periodic yelling) to warn animals of your presence. Carrying a can of bear spray (a repellent used to ward off charging bears) is highly recommended. If you do encounter a bear on the trails, do not run, as it will trigger a chase response in the bear. Instead, back away slowly and don't make any noise as not to startle the bear. To find out more about how to protect yourself from bears, visit NPS' Bear Safety page. For more information on how to respond to other animals in the park, visit Yellowstone's Safety page. ", "The best way to get around Yellowstone National Park is by car; there is no public transportation system in the park. You can rent a car at any of the nearby airports, including Yellowstone Regional Airport (COD) in Cody, Wyoming; Jackson Hole Airport (JAC) in Jackson, Wyoming; Yellowstone Airport (WYS) in West Yellowstone, Montana; and Bozeman Yellowstone International Airport (BZN) in Bozeman, Montana. Parking is available throughout the park but depending on the time of year and day, it can be a challenge to secure. Guided tours of the park are also available."]}