{"name": "Puerto Rico", "description": ["Puerto Rico is rich in charm and character with a dash of the familiar. Less than a three-hour flight from Miami, Puerto Rico is a U.S. commonwealth (in case your high school history class didn't teach you that). So, when you're shopping in San Juan, the capital city (or anywhere else), you can pay for your souvenirs with American dollars. But don't be mistaken: This isn't quite a home away from home. Puerto Rico has both 20-foot waves for surfers and calm, clear waters for families. It's a stroll back through time (El Morro) and an up-close look at the contemporary (Calle del Cristo). It's an exhilarating mix of landscapes, from the serpentine jungle of El Yunque to brilliant beaches like Condado in metropolitan San Juan and the high-energy Crash Boat in Aguadilla on the west coast. And if you want to get further away from civilization, you can ferry over to the secluded – not to mention jaw-droppingly gorgeous – islands of Vieques and Culebra.", "In 2017, Puerto Rico was pummeled by Hurricane Maria and Hurricane Irma, which combined claimed thousands of lives, destroyed hundreds of thousands of buildings, and left much of the island without power for months. More than five years later, some basic infrastructure has been restored, but reconstruction efforts are ongoing. However, traveling to Puerto Rico is safe, and tourism will help the island in its recovery efforts. So, go ahead and book your flight; a world of natural enchantment, delicious food and historic experiences await.", "The best time to visit Puerto Rico is from mid-April to June, right after the busy winter season and just before the rainy summer (August is the month with the most rainfall). Spring weather is also very pleasant, barely escaping the mid-80s on most days. The island sees its best weather in winter – which is partly why this is the most crowded and expensive time to visit – but with careful planning you might uncover a pretty good discount during those months as well, particularly if you travel in the weeks between Thanksgiving and Christmas. You could also plan an enjoyable and affordable trip for the fall, when lodging can sometimes be found for under $200 per night. However, keep in mind that fall is also the peak of the Atlantic hurricane season, which runs from June to November.", "It's open for tourism Puerto Rico is safe and ready for visitors. Tourism is a vital part of the island's economy and traveling there is a great way to help Puerto Rico recover from natural disasters.", "It's got a great food scene From traditional foods like mofongo (plantains mashed with garlic and topped with meat, fish, vegetables, or other ingredients), arroz con gandules (rice and pigeon peas) and tostones (fried plantains) to staple drinks like rum and coffee, sampling the food of Puerto Rico is a must. Sign up for one of the best tours in Puerto Rico for help navigating the local food scene.", "The sound is the coquí The coquí (pronounced ko-KEE) is a tiny tree frog. It's a symbol of the island and is indigenous to Puerto Rico. You'll hear the males singing nightly throughout the island.", "Take an Eastern Caribbean cruise Puerto Rico really should be explored over several days. But if you're short on time, you can get your fill during a shore excursion to San Juan.", "Dine local Panaderías in Puerto Rico are far more than simple bakeries: they're also where locals gather for gossip, coffee, and inexpensive meals for breakfast or lunch. Food trucks and stands selling popular street food like alcapurrias (plantain and yucca mash stuffed with meat and deep fried), empanadillas, and bacalaitos (fish fritters) are another low-cost but delicious and authentic alternative to expensive restaurant meals.", "Ride the Públicos If you want to travel like locals do, and at minimal cost, hail a ride from a público, which are transit vans that have specific routes and inexpensive fares (which you can only pay in cash). But, low fares come at a cost: Traveling via público can take a lot of time.  ", "Much of Puerto Rican culture, from the food to the music, represents the island's combined North American, Caribbean, Spanish and indigenous Taíno heritage. In Old San Juan you can grab comida criolla (traditional Puerto Rican meals of pork, rice and beans) just a stone's throw from Calle del Cristo's Coach and Tommy Hilfiger factory outlets.", "Speaking of clothes, you're on vacation in the tropics and you're going to want to dress informally. But it's a good idea to cover up your swimsuits with clothing unless you're at the pool or the beach. Also pay special attention to your attire before enjoying Puerto Rico's nightlife – only tourists go out dressing like they're at a barbecue. If you want to blend in at the bar, smart casual attire (slacks or dark jeans for men and dresses with heels or statement flats for women) is a must.", "Many Puerto Ricans speak English, but Spanish is the language of daily life. Know some basic phrases such as \"hola\" (hello), \"gracias\" (thank you), \"por favor\" (please) and \"de nada\" (you're welcome). As you move farther outside San Juan, you'll likely meet fewer people who know English fluently. Pack a Spanish phrasebook, and know that Puerto Ricans welcome your efforts to converse with them in Spanish. In addition, you'll find that chatting with locals may mean carrying on several conversations at once or being interrupted. You may also find Puerto Ricans will stand closer to you when they meet you or reach for a handshake or hug when greeting you.", "Since Puerto Rico is part of the United States, the island's currency is the U.S. dollar and credit cards are widely accepted. Tipping etiquette is the same here as in other parts of the United States; 15 to 20% is considered the standard, but more is appreciated for exceptional service.", "Dining in Puerto Rico reflects the island's mixture of Caribbean, Latin, North American and indigenous Taíno influences. No matter where you dine, make sure you get a taste of some of Puerto Rico's most authentic eats: asopao is a traditional stew often made with chicken or beef; mofongo consists of seafood, meat or vegetables atop mashed plantains; pasteles are made of mashed banana (or yucca) and stuffed with pork, chicken or cod; and lechón is smoky, roasted suckling pig. Other items to try include tostones (fried plantains), arroz con gandules (rice and pigeon peas). For something sweet, try tembleque (a coconut custard), pastelitos de guayaba (a guava-filled pastry) or mantecaditos (a Puerto Rican shortbread cookie).", "Drinks in Puerto Rico are a huge part of the island's dining culture, too. Coffee and rum are its two best-known beverages. Puerto Rico's climate makes it perfect for growing coffee, so you'll find lots of local growers and no shortage of places to enjoy a great cup. You can also visit one of the haciendas for tours of the coffee farms or to enjoy a warm drink.", "You won't want to leave the island without trying local rum. Start with a piña colada, which was first created in Puerto Rico (specifically at the Caribe Hilton Hotel) and is the island's national drink. If you'd rather do a tasting, pop by the Bacardí or Ron del Barrilito distilleries. Each distillery offers tours of its facilities, tastings and mixology classes. And if you visit around the holidays, be sure to sample coquito, a coconut-based drink akin to eggnog.", "If you're staying in the northeast, you can expect a quieter dining experience along Luquillo or Fajardo beaches. The kiosks in Luquillo are a must-visit in the area, as you can sample a range of different cuisines. If you want to try some of the best eats in the area, Puerto Rico's tourism board has put together a list of food trails themed around island staples like pork, coffee and rum.", "Puerto Rico sees some violent drug-related crime as well as thefts in San Juan and Ponce, but it's usually not directed toward tourists. Still, watch out for pickpockets, especially on the beach, and don't leave your property unattended or it might be swiped. Steer clear of certain areas in San Juan at night, such as La Perla and portions of Santurce, as these towns are prone to drug activity and violence.", "The best way to get around Puerto Rico is by car if you want to see more than the city in which you're staying, you'll need your own vehicle as intercity train service doesn't exist and intercity bus service is time-consuming and uncomfortable. Unfortunately, driving is a courageous pursuit carried out on snaking roads, and you'll need to carry spare change for the occasional toll.", "In San Juan, you can likely get around without a car with careful planning. Parking can be expensive and traffic often is a nightmare in the city, so relying on the bus and your own feet are likely your best bet during your time in the capital. Uber is also available in the city.", "You'll likely fly in to Luis Muñoz Marín International Airport (SJU), which is about 8 miles east of Old San Juan. You can pick up a rental car here or you can take a taxi to your destination. Taxis from the airport charge a fixed rate to different destinations around the island. The airport's website provides the fare list", "Puerto Rico has smaller airports: Mercedita International Airport (PSE) on the southern coast (about 3.5 miles east of Ponce) and Rafael Hernández Airport (BQN) on the west coast in Aguadilla. Check the flight schedule for airlines like Spirit, United and JetBlue that fly into either of those hubs.", "You don't need a passport to enter Puerto Rico, as it's a United States territory. However, if you are traveling onward to another Caribbean destination (other than the U.S. Virgin Islands) from Puerto Rico, you will need to present your passport. Visit the U.S. State Department's website for more information on entry and exit requirements."]}