{"name": "New York City", "description": ["Cool, cosmopolitan, crowded, constantly evolving … the Big Apple blends big city splendor with small-town charm. Amid New York's iconic landmarks and towering skyscrapers, you'll experience a vibrant culture permeating each of the city's distinctive neighborhoods and boroughs. Follow trendsetters to the East Village and Brooklyn to check out indie boutiques, iconic bakeries and trendy coffee shops. Afterward, peruse the racks of the sleek shops lining Fifth Avenue, admire the cutting-edge art collections at the MoMA and the Met, catch a memorable show on Broadway or sit down for a meal at the latest \"it\" restaurant.", "As the most populous city in the U.S. – set at the forefront of food, fashion and the arts – NYC requires stamina. But don't let the Big Apple's frenetic sights and sounds intimidate you from soaking up its grandeur. Enlist the help of a local to help you navigate it all. Wander through the concrete jungle and you'll discover roaring taxis zipping down bustling blocks, fast-paced pedestrians strolling past on their way to marquee galleries and trendy cocktail bars, and Times Square's neon lights flickering at all hours. And yet, the city's twinkling lights and chaotic corners also invite you to embrace every New York minute, explore every enclave and create your own urban adventure. There are endless ways to spend your time in the city that never sleeps, but before you leave, stop and look around – what's here today will be transformed into something bigger and better tomorrow.", "The best time to visit New York is anytime. Each season in Gotham offers visitors plenty of reasons to visit. Early fall offers crisp breezes, bright sun and comfortable temperatures while late fall and winter make merry with the Macy's Thanksgiving Day Parade and holiday decorations. Deep winter – January and February – is cold, but that also means cheaper hotel rates. Spring is glorious and New Yorkers celebrate the thaw by taking to the streets, shopping at outdoor markets, frolicking in Central Park and dining outside. Summer is hot, but hey, so are lots of places, and at least this is New York. No matter when you decide to visit New York City, consider travel protection – such as a travel insurance policy or a cancel for any reason plan – in the event you encounter weather issues or trip delays.", "Exercise shopping smarts If you're a high roller with a thick wallet, Fifth and Madison avenues are your shopping strips. Bargain-hunters should stick to SoHo and Chinatown.", "Enter the subway with caution Many subway stations have different platforms for trains going uptown and downtown. Make sure you enter the correct platform before swiping your ticket through the turnstiles. ", "Skip the train If you live in a major East Coast city, chances are you'll be able to reach New York City for a relatively affordable price by hopping on the BoltBus or Megabus, two companies that transfer visitors to NYC for cheap.", "Take a tour Seeing all of the Big Apple's top sights can be a challenge, which is why signing up for a guided tour may be a smart idea. Whether you're looking for a walking tour, a food tour, a boat tour, a helicopter tour or a bus tour, you'll find a variety of experiences to choose from.", "Say no to cabs A cab here, a cab there … pretty soon, you'll find that cabs have eaten up all your spending cash. Yes, they're convenient but cost-efficient they are not. Learn the subway system instead, or try Uber or Lyft.", "Say yes to street vendors Eat some cheap meals on the street at vendors, especially the ones with \"Vendy Awards\" posted, and you can put the money you would've spent on an expensive lunch toward your MoMA admission.", "Say maybe to the TKTS booth If you're willing to spend an hour of your New York City vacation waiting in the half-price ticket booth in Times Square, you could save some serious money on a Broadway show.", "New York City is one of the most densely populated cities in the world. So it should come as no surprise that it's also one of the most diverse. The city is known for its ethnic neighborhoods, as well as its status as the country's trendsetter, making it difficult to define one specific \"culture\" of the Big Apple. As home to the most vibrant theater and fashions scenes in the country and a large contingent of schools and Wall Street on top of that, NYC also shelters a large gay community as well as many students, artists, fashionistas, writers, businessmen and so on. ", "Stereotypically, New Yorkers are portrayed as brash and rude. But as TripAdvisor explains, \"New Yorkers are unfailingly proud of their great city, and this pride can, at times, come off as arrogance.\" Contrary to popular belief, most New Yorkers are happy to help you explore their home.", "It's fitting that New York's most popular nickname includes a reference to food. Experts say that the city is jam-packed with delicious places to eat, from the high-end celebrity chef hot spots to cozy eateries. When you're in this cosmopolitan city, you'll have to sample some of its specialties. Most people associate NYC with pizza: New York-style pizza consists of hand-tossed thin crust, a light layer of tomato sauce, plenty of mozzarella cheese and an assortment of toppings. There are dozens of pizzerias dishing out traditional pies across the city, but locals say Joe's Pizza and Grimaldi's Pizzeria are two of the top spots to grab a slice of pizza. Another New York staple? Bagels. The large, soft, doughy bagels can be topped with thick cream cheese (often you can choose from various schmear flavors), lox or your favorite breakfast sandwich accoutrements. Experts say you can't go wrong with a bagel from Ess-a-Bagel, Bagel Bob's or Tompkins Square Bagels.", "In addition to its casual eateries, New York City has a vibrant food market (visit Chelsea Market and Gotham West Market) and farmers market scene. And of course, the Big Apple is home to numerous upscale restaurants highlighting cuisine from around the world. The list of must-try restaurants is constantly changing, but those looking to enjoy an exquisite multicourse meal should make reservations (well in advance) at Eleven Madison Park, Le Bernadin or Daniel. If you'd like to explore fine dining restaurants with more reasonable price tags, Butter, Scarpetta and Marc Forgione are a few celebrity chef-helmed eateries that won't completely bust your budget. The wealth of food options in the city is also part of why New York City consistently lands on the U.S. News ranking of the Best Foodie Cities in the USA. For a comprehensive understanding of the city's dining scene, take one of the Big Apple's top food tours.", "What's more, New York City isn't only home to fantastic restaurants, but also to several stand-out bars and breweries. When the weather warms up, locals and travelers alike love heading to the top rooftop bars around the city to soak up the skyline views.", "In the past, New York City has owned a reputation for being a rough and dangerous city, but now it's one of the safest large cities in the country. As a tourist, you're not likely to encounter any serious crimes, but you should still use common sense when exploring the city. In the evenings, stick to well-lit areas with other people and keep a close eye on valuables. To discourage pickpockets, keep your wallet in your front pocket and your purses zipped closed.", "Like other large cities, New York City is filled with its own group of eclectic personalities. Should someone out of the ordinary approach you, follow many New Yorkers' leads and simply walk away. Be particularly wary in places like Manhattan's Lower East Side and parts of boroughs Queens, Brooklyn and especially the Bronx. Central Park can also get seedy at night.", "Despite what people may think, the subway in New York City is safer now than it has ever been. That said, you should be particularly watchful of your belongings while riding, especially when the trains are packed and crowded. Stay near the ticket booths and get into cars with more people or with the conductor, who will normally stick his head out when the train stops. Consider taking a cab at night if you are alone.", "The best way to get around New York City is on foot as traffic is fairly heavy around-the-clock. That said, the subway system is a convenient option, too, and it extends throughout Manhattan and into the other New York boroughs. Buses are another affordable way to get around, but keep in mind they traverse streets clogged with weaving cars and cabs. Picking up a car isn't the best mode of transportation, as traffic is heavy. To get from the two main airports – LaGuardia (LGA) and John F. Kennedy International (JFK) – into the city, you'll likely want to take a taxi or ride-hailing service like Lyft or Uber. If you'd like to mix in a little sightseeing with your transportation, consider a bus tour or a boat tour.", "Many East Coast travelers tend to arrive in New York City on one of the bus services like FlixBus or Megabus. Amtrak is another popular way of getting into the city and trains roll into Penn Station daily."]}