{"description": ["In the heart of the South, Atlanta has a decidedly cosmopolitan and fast-paced ambiance, attracting visitors with its thriving restaurant scene and abundant cultural attractions. People from all over the country have relocated to this commercial hub, contributing to the city's unique feel. The new Atlanta is progressive and eclectic: Museums and performance venues bring in the culture hounds, just as verdant parks attract outdoorsy types. Meanwhile, families flock to the city's larger-than-life aquarium and World of Coca-Cola.", "Whatever your preferred vacation, you could easily spend the bulk of a two- or three-day trip in the downtown area, exploring the most popular and best things to do. In the evening, migrate to the trendy Buckhead and Westside neighborhoods for a taste of Atlanta's vibrant restaurant scene and hopping nightlife. If you're short on time, sign up on for one of the best Atlanta tours for a crash course in the city's top sights.", "The best time to visit Atlanta is from March to May, when you can take advantage of mild weather while enjoying the city's concerts and outdoor activities. Though you'll also have access to various events between June and August, Atlanta summers are notoriously hot and humid, and room rates are at their highest. To save a few bucks, try planning a trip in winter when hotel prices dive and cooler temperatures drive visitors away. Foodies will especially love late winter's events. You may also find a good deal in September, October or November when one of Atlanta's large music festivals isn't taking place, but like summer, autumn falls during the Atlantic hurricane season, so you may encounter weather issues if a storm passes through.", "Hot, hot, hot The Hotlanta nickname is well earned (if much maligned). Atlanta's summers can be sweltering, so dress accordingly and drink lots of water.", "The suits reign Atlanta hosts hundreds of conventions each year, so hotels tend to fill up early. You'll need to book your room at least three weeks in advance.", "Invest in an Atlanta CityPASS If you plan on visiting popular sights like the Georgia Aquarium, Zoo Atlanta or World of Coca-Cola, the CityPASS will save you big bucks on your total cost of admission.", "Buy in bulk MARTA's $2.50 flat-rate fare is pretty reasonable, but if you'll be hopping on and off public transport, buy day passes instead. Day passes start at just $9, with weekly passes costing around $24.", "Although Atlanta is situated in the Deep South, it lacks the typical Southern charm that you find in cities like Savannah or Charleston. Rather, Atlanta is big, bustling and mostly occupied by professionals who have moved into the city for business. As part of the effort to become one of the most progressive cities in the South, these new residents chose to build up a modern skyline. Atlanta now has one of the tallest buildings in the U.S. (the Bank of America Plaza) and hosts major companies like Coca-Cola, UPS and Home Depot. ", "Atlanta also a stronghold in show business, as the headquarters of Turner Broadcasting, CNN and several hip-hop record companies like BME Recordings, So So Def Recordings and Grand Hustle Records. What's more, many artists have called Atlanta home, including Usher, Ludacris, T.I. and Lil Jon. Several popular movies and television shows (think: \"The Vampire Diaries,\" \"The Blind Side\" and \"Zombieland\") have been filmed in the area as well.", "But the city's culture is still tied to its roots, particularly in the country's civil rights movement. Atlanta was the birth city of Martin Luther King Jr., and it holds a large contingent of influential groups like the Southern Christian Leadership Conference. Once a city with its fair share of racial tensions and protests, Atlanta is now the \"city too busy to hate,\" a label a growing mix of residents proudly stand by. The city also has an active gay community and hosts one of the largest gay pride parades in the country every October.", "Atlanta may be quickly climbing the country's culinary ranks, but that doesn't mean it's left its traditional Southern roots behind. The Big Peach is known for hearty comfort foods like fried okra, fried chicken and sweet tea, but a growing immigrant population is broadening the playing field. For everything from Korean to Peruvian, head to Buckhead, where most of Atlanta's top dining spots are located. Also save time for one of Atlanta's up-and-coming foodie neighborhoods: West Midtown. There, you'll find everything from dimly lit date night restaurants like Marcel to bustling brunch spots like West Egg Cafe.", "If you're looking for a more upscale meal, travelers recommend steakhouses like Bones and The Capital Grille and contemporary American establishments, such as Canoe and The Optimist. But if want to grab a more casual (and affordable) bite to eat, Fat Matt's Rib Shack, the Atlanta Breakfast Club and Fox Bros. Bar-B-Q are favorites, as are international options like Aviva by Kameel,  El Viñedo Local and Desta Ethiopian Kitchen. Meanwhile, visitors suggest quenching your thirst at the Prohibition-style speak-easy Red Phone Booth. For more guidance in navigating the local dining scene, sign up for one of the best Atlanta tours.", "As in any large U.S. city, violent crime is an issue in Atlanta. Recent years have seen sharp increases in homicides and shootings. The Downtown and Midtown areas have been most affected. (Indeed, the problem has intensified the efforts of some residents of the affluent Buckhead neighborhood to break away from Atlanta and form a separate city of their own.) At the same time, other types of crime, including robbery, have decreased. All the same, be aware of your surroundings and take the appropriate safety precautions.", "The best way to get around Atlanta is by MARTA, Atlanta's public transportation system. MARTA operates both bus and rail lines throughout the city and into nearby suburbs. For $2.50 per person, you can take the Red or Gold train from Hartsfield-Jackson Atlanta International Airport (ATL), which sits about 10 miles south of downtown. You can also use the Atlanta Streetcar, but this system only stops by select downtown and Eastside attractions. Driving – though notoriously hectic here – is another option, and you'll find a rental car center in the airport. Taxis and ride-hailing apps are available as well, but expect high rates due to time spent sitting in traffic.", "If you're flying in or out of Atlanta, chances are you'll find yourself at the Hartsfield-Jackson Atlanta International Airport; it's the most popular airport in the city and one of the busiest airports in the world. Serving as the main hub for Delta, the airport has a domestic and an international terminal, with the former sitting on the west side and the latter on the east. The Plane Train connects the two terminals and the seven concourses, so visitors can move between areas with ease. Once you're through security, there are all sorts of dining and shopping options, along with Delta Sky Club lounges.", "U.S. News Insider Tip: The classic rule about getting to the airport two hours before your flight really applies here. Security lines can get backed up, and the airport is expansive, so aim to be on-site well before your flight boards. - Christina Maggitas, Editor"]}