{"name": "Cusco", "description": ["Cusco, known as the archaeological capital of the Americas, is home to a storied history that included the rise and fall of the Inca Empire followed by the invasion of Spanish conquistadors in the early 1500s. Today, remnants of both eras share the narrow city streets – from centuries-old baroque cathedrals to exquisite stone masonry – creating a rare collision of Andean and Spanish styles that makes Cusco like no other place on earth.", "The city has come out of the shadow of Peru’s capital, Lima, in recent decades. Millions of tourists make the pilgrimage from Cusco and the Sacred Valley to get a glimpse of South America's greatest spectacle: Machu Picchu. Discovered by American explorer Hiram Bingham in the early 20th century, the fabled ruins are one of the most impressive architectural feats of the ancient world. If you're planning a visit to Machu Picchu while in Cusco, make the most of your time with these tips. But don't let this UNESCO World Heritage Site be the only thing you see while in Cusco. This enchanting city offers more: from the glimmering Qorikancha (Temple of the Sun) to the scrumptious Andean cuisine. It only takes a day to be charmed by this significant Peruvian city and all its wonders. ", "The best time to visit Cusco is from June to mid-September. Though temperatures hover in the mid- to upper 60s throughout the year, the city sees fewer rain showers during its winter months. Still, this is peak tourist season, so expect plenty of fellow trekkers beside you as marvel at iconic sites. To escape swells of tourists and high room rates, visit during May or between late September and early November. Avoid visiting between late November and April, when heavy downpours delay and dampen exploration. Whenever you decide to plan your trip, bring warm clothing to arm yourself from the chilly nighttime temperatures, which dip into the low 30s and 40s.", "In A.D. 1200, Cusco (known as the \"navel of the world\") served as the epicenter of the Inca Empire and anchored a vast political and military network that extended to Ecuador, Bolivia and Chile. After Spanish conquistador Francisco Pizarro seized the city in 1533, the Spanish established a new fortress, utilizing the Incan foundations. Today, the city showcases a rich infusion of Inca and Spanish heritage.", "Now home to about 350,000 people, Cusco's culture is best seen during its lively outdoor festivals like the Festival of the Sun when thousands of revelers gather to celebrate fiestas and dance to pre-Columbian music. The majority of Cusco's population identifies as Roman Catholic, however, a variety of other religions are practiced and very few residents identify as atheist or agnostic. Catholic saint days, Andean ceremonies and Incan festivities are observed throughout the year.", "Dress is generally casual in Cusco, but those planning to visit the Inca ruins should remember to bring waterproof clothing, sturdy hiking shoes and warm layers as the high altitude ushers in cooler temperatures at night. Keep in mind that Cusco's streets are cobbled, so you'll want to bring comfortable walking shoes for exploring the city by day and participating in the lively night scene after dark. Also, as you're wandering Cusco, remember to keep your wits about you. Petty thieves frequent Plaza de Armas, and pickpocketing happens to unsuspecting tourists.", "The official language of Peru is Spanish, but you'll hear a mingling of Spanish, Aymara and Quechua (the official language of the Inca Empire). Cusco Quechua is its own distinct dialect, which varies greatly from Quechua spoken in other regions in Peru. English-speakers can be hard to find, so come prepared with a basic book of key Spanish phrases and plenty of patience.  ", "The Peruvian Sol (PEN) is the official currency of Peru, which has a very favorable exchange rate to the U.S. dollar (about $0.30 per 1 Peruvian Sol). Make sure to check the current exchange rate before traveling. ", "In recent years, Peruvian cuisine has gained popularity in the world’s culinary landscape, but for the freshest (and most authentic) specialty dishes, Cusco will not disappoint. Most Peruvian dishes carry big flavor not seen in other Latin and South American fare. You may have already tried popular dishes like ceviche (a cold dish of fresh raw fish with spicy citrus flavors) or lomo saltado (stir fried beef with fries). If you’re feeling a bit more adventurous, try cuy (roasted guinea pig – yes, the American household pet) or charbroiled alpaca (also known as llama). Other delicious traditional dishes include adobo (a pork stew with corn beer), tamales, choclo con queso (boiled corn with local cheese) and the vegetarian stew capchi de setas. As far as vegetables go, Peru produces more than 4,000 varieties of potato, so you’ll find many dishes centered on them like papas a la huancaina (boiled potatoes with a spicy cheese sauce) and causa (a potato casserole with a variety of meat). Other staple veggies include corn and avocados. If your mouth isn't watering yet, check your pulse. ", "For a taste of traditional dishes, head to Pachapapa or the award-winning Chicha (visitors and locals recommend getting reservations well in advance). Peruvian cuisine often mingles with Asian influences, inspired by the culture brought by indentured servants and immigrants who came to Peru dating back to the original Spanish rule in the country. For a sampling of the Asian/Peruvian fusion cuisine, visit LIMO.  If you're really looking to splurge on a fine dining experience, try MAP Cafe. Located in the courtyard of the Pre-Columbian Art Museum in a glass shipping container, the fare is more contemporary Peruvian cuisine. You can also kick-start your day with coffee and breakfast at Jack's Cafe, which serves breakfast all day. Many of the most popular restaurants are centrally located near Plaza de Armas. ", "The best way to get around Cusco is on foot. The Plaza da Armas serves as the historic center of the city and colorful cobbled pedestrian-only streets extend outward to many of the city's top attractions. That said, at an altitude of more than 11,000 feet, exploring Cusco requires stamina. Should you need to catch your breath, it's easy to flag down a taxi. Buses, often called colectivos or combis, are a more affordable way to get around, but the time schedules and limited routes can be less convenient than hailing a cab. For longer journeys to the Sacred Valley, you'll want to rent a car, but heavy pedestrian traffic can clog the narrow street, so driving in Cusco proper is not recommended.", "When you're ready to journey to Machu Picchu, you'll want to snag a seat on one of PeruRail's daily trains from Estación Poroy (15 minutes from downtown Cusco) to Aguas Calientes, a station located at the base of Machu Picchu. A tour company can also arrange transportation for you; learn how here.", "Most visitors fly into Cusco's Alejandro Velasco Astete International Airport (CUZ) – located about 4 miles southeast of the downtown area – via the one-hour flight from Lima's Jorge Chavez International Airport (LIM). Peruvian Airlines and LAN Airlines offer daily flights between Lima and Cusco. ", "A valid passport is required for entry into Peru. U.S. travelers can stay for up to 90 days without obtaining a visa as long as they possess documentation of return or continued travel. Staying beyond 90 days is prohibited without applying for a special visa prior to arrival. Peru requires an international departure tax of $30.74 per person, which is either included in the cost of your plane ticket or must be paid in cash upon departure from the airport. If you're flying domestically within Peru, expect to pay $10.68 in taxes. Although Peru does not require immunizations before entry, vaccination against yellow fever is highly recommended. For more information, check out the U.S. Department of State's website."]}