{"name": "Providence", "description": ["Long overshadowed by Boston, Providence holds its own as a historical heavyweight. Founded by banished Massachusetts Bay colonist Roger Williams in 1636, this Rhode Island city was the country's first experiment in a secular democracy (the separation of church and state). Today, Providence is a true college town, home to Brown University, Johnson & Wales, Providence College and Rhode Island School of Design. There's even a high concentration of dedicated Red Sox and Patriots fans in town, leading some to believe that it’s a copycat of the Massachusetts capital. But there's a more relaxed vibe to Providence – not to mention more affordable hotel rates and fewer crowds – that draws even loyal Bostonians into the city for the weekend.", "The best time to visit Providence is between June and August and from September to November. Summer can be an expensive time to visit, with the year's highest hotel rates and lots of crowds. But the comfortable temperatures and full event calendar make it difficult to resist. Fall is another great time to visit thanks to the gorgeous fall foliage adorning the region's trees. Though peak season tourist crowds will have departed after Labor Day, the city won't feel empty thanks to the bevy of college and university students returning for the fall semester. If you don't mind walking around Providence with a heavy coat, you might want to consider coming in the winter or early spring, when Rhode Island's capital sees fewer crowds. Keep in mind, Providence's hotel rates stay fairly consistent all year with minor spikes around peak times and holidays: Plan on spending about $150 to $200 per night.", "Sample the quahogs Like most New England towns, Providence boasts plenty of quality seafood. But it's especially famous for its quahogs (\"kwah-hog\"), large clams that are often served steamed or – if you're eating like the purists do – icy and raw.", "Don't miss WaterFire This fire sculpture installation on the three rivers in downtown Providence takes places between March and November every year. It's a beloved event that draws both locals and visitors.", "Avoid commencement weekend Mid-May college graduations slam the capital city. If you're hoping to visit in May, plan around commencement to dodge spiked hotel rates and packed restaurants.", "Make the most of free attractions Several of Providence's top things to do are free to enjoy, such as the State House, Benefit Street and the RISD Museum (on Sundays and the third Thursday of every month).", "Take a self-guided walking tour Use this map created by the Providence Warwick Convention & Visitors Bureau to learn all about the history that pervades Rhode Island's capital.", "Ditch the hotel for a bed-and-breakfast Providence boasts a bevy of charming B&Bs, some occupying mansions and homes from the late 19th and early 20th centuries. Bonus: Many of them are cheaper than the city's brand-backed hotels.", "Though Providence's culinary chops are often outshined by other East Coast foodie cities like New York City and Washington, D.C., Rhode Island's capital remains a favorite among discerning foodies. Oysters (and seafood in general) aren't hard to come by in Providence, but if you've got your own set of wheels and are willing to make the trek, consider driving about 40 miles south to South Kingstown, Rhode Island. Here you'll find the Matunuck Oyster Bar, an oyster farm that expanded to a full restaurant serving a mouthwatering array of seafood dishes (best enjoyed on the waterfront patio, according to recent diners).", "If you'd rather stick closer to Providence, Birch, Oberlin (both new American) and Tallulah's Taqueria (Mexican) are all recommended by recent visitors. Another traveler and local favorite: The Eddy. Come here for snacks and inventive cocktails (and if you're not picky about your liquor, consider leaving your drink order in the bartender's hands). Nicks on Broadway is another favorite, especially for breakfast. If you're celebrating a special occasion, you can't go wrong with The Dorrance. Though reviewers praised the European-influenced fare on the menu, visitors were most impressed with the restaurant's interiors. The Dorrance is housed in the building formerly occupied by the Federal Reserve Bank and features dramatic high ceilings, stained-glass windows and marble floors.", "For light bites (and other goods and entertainment), head to the Providence Flea. Amid all of the troubadours, vintage wares and artists, you'll find plenty of food trucks lined up along the waterfront."]}