{"name": "Fort Lauderdale", "description": ["To the citizens of Fort Lauderdale, their home offers quintessential Florida – beaches, palm trees, shopping and relaxation – without the see-and-be-seen attitude of the state's other beachside cities. You can judge if they're right, but certainly expect a different atmosphere than their close rival Miami Beach. Fort Lauderdale's wide stretches of white sand surpass those of its southern neighbor and, to some, are the best shores statewide. And when you consider its fantastic scenery, great dining options and range of things to do, Fort Lauderdale is also somewhat affordable compared to similar vacation spots. The \"Venice of America,\" nicknamed for its 165 miles of waterways and canals, is slowly but surely climbing the ranks of top beach destinations to the cheer of its residents.", "The best time to visit Fort Lauderdale is between December and April. Yes, anytime in that whole half of the year. The warm climate (between the high 50s and mid-80s) makes it an ideal getaway for anyone looking to escape bitter winter temperatures. For this reason, many from the north flock to the south, making December through April Fort Lauderdale's high season, so expect some crowds. Summer and fall are susceptible to rain and hurricanes, with the official hurricane season running from June 1 to Nov. 30. If you're traveling at that time (particularly the summer), pack light clothing, a hat, an umbrella and plenty of sunscreen. Also consider travel insurance in the event bad weather forces you to change your vacation plans.", "It's all in the name The city's confusing thoroughfares adhere to one strange bit of logic – naming. \"Avenues\" and \"drives\" run north-south, and \"streets,\" \"boulevards\" and \"roads\" run east-west.", "It's unbelievably close You would suspect that Florida's large size corresponds to great distances between cities and attractions. South Florida dismisses this notion with West Palm Beach, Fort Lauderdale and Miami all within 75 miles (less than 1½ hours, sans traffic) of one another.", "Its peak season is winter Thousands of snowbirds (older temporary residents) move here every winter to escape the cold and snow in their home states. As such, roads are often congested this time of year, so be extra alert while driving. On the highway, slower vehicles usually stick to the right lane.", "Broaden your flight search South Florida's density makes it easy to get here from multiple airports, including those in Fort Lauderdale, West Palm Beach and Miami.", "Check the tourism board The Greater Fort Lauderdale Convention & Visitors Bureau offers discounts to various attractions, tours and hotels on the LauderDEALS page of its website.", "Head to the beach Fort Lauderdale's beaches are its best and cheapest attractions. Can't-miss stretches of sand include Fort Lauderdale Beach and Las Olas Beach.", "Though Fort Lauderdale's dining scene isn't as well-known as those found in other destinations, it does boast a variety of options. Everything from Italian to Argentinean to Mediterranean is served at eateries around the city, including traveler favorites like Dolce Salato Pizza & Gelato, Premiere Cafe & Bar and Mini Pita. For more upscale ethnic meals, visitors suggest dining at the Italian-inspired La Dolce Vita and the Spanish-influenced Café Seville.", "Most restaurants in Fort Lauderdale specialize in casual American fare and dishes made with fresh, local seafood. Popular American joints include Laspadas Original Hoagies and Gilbert's 17th Street Grill, while Wild Sea Oyster Bar & Grille and OCEAN2000 feature Florida staples such as grouper, wahoo, mahimahi, spiny lobster and conch.", "A few breweries are also available in the area for those keen on sipping a cold one. The German-style Khoffner Brewery is a great option for beer lovers browsing Las Olas Boulevard's shops and restaurants, which sit only 2 miles south. Meanwhile, LauderAle's location between Port Everglades and Fort Lauderdale–Hollywood International Airport makes it convenient for travelers waiting on a cruise or flight.", "Having (mostly) moved past the days of spring break debauchery, Fort Lauderdale is a relatively safe place to visit. But you still shouldn't let your guard down. Vehicle burglary is quite common, so make sure to lock your car doors and close the windows all the way. Don't leave any valuables in your car, including laptops and cell phones; even loose change should be hidden, since instances have involved transients looking for a couple of coins.", "Also, travel in groups at night, especially if you're a women and particularly during spring break. Although Fort Lauderdale isn't as popular among college kids these days, evenings can still get a little rowdy. Be on guard after dark, and avoid walking around alone. Exercise extra caution when visiting the west, northwest and southwest parts of the city.", "The best way to get around Fort Lauderdale is by car. Despite an extensive network of waterways, the roads are still faster. In fact, the canals can be confusing. As you travel closer toward the coast, streets may curve or simply end at waterways. Away from the Atlantic, much of the city adheres to a grid. Tired of driving? Take a water taxi to your next downtown destination. And if not by land or by sea, then arrive in Fort Lauderdale by air. Making the city easily accessible, the Fort Lauderdale–Hollywood International Airport (FLL) is just a 5-mile drive south of downtown Fort Lauderdale and welcomes many commercial airlines. You can also fly into Miami International Airport (MIA), located about 30 miles south of downtown Fort Lauderdale, or Palm Beach International Airport (PBI), approximately 45 miles north of Fort Lauderdale. Rental cars are available at all three airports."]}