{"name": "Acapulco", "description": ["In the 1950s – long before the rise of Cancún and Cabo – Acapulco was the go-to Mexican vacation destination. During its heyday, the \"Pearl of the Pacific\" attracted the likes of Elizabeth Taylor, Frank Sinatra, Judy Garland and even John F. Kennedy with its amber beaches and pulsating nightlife. Acapulco's former beauty was celebrated on the big screen in films like Elvis Presley's \"Fun in Acapulco\" and the hit TV series, \"The Love Boat.\" But as the 20th century wore on, Acapulco's glorious reputation tarnished as the city succumbed to overcrowding, pollution and drug trafficking.", "Several decades after its fall from beach-destination grace, Acapulco is steadily reviving. It's a popular weekend getaway for many Mexican vacationers, not to mention a prevailing hideaway for European travelers, so you'll find the ambience is more international than the Americanized Cancún. Dance to the live music along the Zócalo, hunt down some of Mexico's best ceviche downtown or escape from the tourist hubbub in Punta Diamante's swank nightclubs – you can still hear echoes of the glamour and glitz of the city's Hollywood heyday. However, travelers should note that the U.S. Department of State issued a travel advisory for several states in Mexico, including Guerrero, where Acapulco is located. Citing widespread crime and violence, the State Department advises U.S. travelers, including government employees, against visiting Guerrero.", "The best times to visit Acapulco are April, May, October and November. The weather is consistently sunny, hot and humid during these months, and deals abound. Dry season runs from November through May, while the rainy season spans June through September. Average highs throughout the year rest in the upper 80s and lower 90s, while the average lows hover above 70 degrees Fahrenheit.", "The dress code in Acapulco is informal during the day; standard beach apparel is acceptable. During the night, \"dressy casual\" is the norm, and many clubs prohibit jeans, T-shirts, sneakers or shorts.", "English is a common language spoken in Acapulco, but you'll win over local citizens if you try to speak some Spanish. Common phrases include hola (hello), adios (goodbye), por favor (please), and gracias (thank you). The official currency in Mexico is the peso. Since the peso to U.S. dollar exchange rate fluctuates, check the current rate before your trip.", "The Zocalo offers more than enough options for dining, with plenty of choices for every taste. On any beach you might find yourself, seafood restaurants are plentiful, and you won’t find a menu without ceviche – a specialty in the region.", "For more upscale options, head to Diamante or the hotels south of Acapulco Bay. Zona Dorada is known for its variety of both Mexican and international cuisine.", "Acapulco has been the scene of several high-profile shootings related to the ongoing battle between drug cartels and the Mexican government. According to the U.S. State Department, the violence is not directed toward Americans. However, the Guerrero state, where Acapulco is located, is designated a \"level four\" alert by the state department. This means U.S. citizens should not travel there due to crime. If you do decide to travel to the Guerrero state, make sure you enroll in STEP, the state department's Smart Traveler Enrollment Program, which can help you stay up to date on information from the embassy, as well as help family and friends reach you in an emergency. The destinations along Riviera Maya in the east, including Cancún, Cozumel and Tulum, currently remain safer alternatives to Mexico's west coast.", "Another safety concern in Acapulco is turbulent water. Avoid the rough surf at Playa Revolcadero and stick to the beaches in front of the hotels along the Costera, most of which are supervised by lifeguards. When going out at night, be sure to stay in the tourist zones and avoid dark side streets. Generally, taxis are safer than rental cars, experts say.", "The best way to get around Acapulco is by bus or taxi, since driving yourself can be a hassle thanks to heavy congestion and poor road conditions. Taxis are prevalent and affordable throughout the city, including to and from the General Juan N. Álvarez International Airport (ACA), which is located about 20 to 30 minutes east of the hotel zone.", "Nonstop flights from Houston and Dallas are available during the winter season from United and American airlines. During the rest of the year, your best bet is to fly into Mexico City and then take a regional airline, such as Aeroméxico or Interjet, to Acapulco.", "A passport is required for entry into Mexico. Travelers must also carry a Mexican tourist permit (known as a Forma Migratoria Multiple or FMM), which is usually issued free of charge upon arrival. If there is a fee, it is usually absorbed in your airfare cost. Be sure to hold on to the tourist card throughout the trip, as you will need to present it upon departing the country. For more information on entry and exit requirements, visit the U.S. State Department's website."]}