{"name": "Cozumel", "description": ["Cozumel's clear turquoise waters and powdery sands coax travelers from cold winter climates to this relatively small island off the coast of Playa del Carmen along Mexico's Yucatán Peninsula. Cruise ships are a constant feature of Cozumel's coastal views, and the atmosphere on this charming island is often interrupted by tourist chatter. In fact, Cozumel's charms are so effective that the shopping plazas and eateries along the waterfront stay congested much of the year – especially during the day when several huge cruise ships are in port at once.", "But crowds shouldn't deter you from discovering what this island has to offer, especially as Cozumel's real allure is far away from the downtown area. You can charter a fishing or diving boat to discover the shallow reefs along the coast (this is arguably one of the best diving destinations in the world), take a glass-bottom boat on a tour around the island or simply find a quiet beach where you can relax and do nothing. Once the cruise ships clear out, head down to a local bar for some live music and the real skinny on this slice of paradise.", "Also, keep in mind that Cozumel’s compact size (just 29 miles long and 9 miles wide) means you can see quite a bit of the island over the span of a weeklong vacation. Many travelers wind up doing exactly that by renting a golf cart (the most common option), scooter or small car for a few days or their entire trip.", "The best time to visit Cozumel is from March to June, when the island enjoys daytime highs around 90 degrees Fahrenheit and nighttime temperatures in the mid-70s. Winters can be slightly cooler, with temperatures ranging between the upper 60s and the lower 80s, so it is best to pack layers. However, winter months can also see highs in the 90s, depending on the year. Summer and early fall mark the rainy season, and hurricanes have been known to wreak havoc on the island. Even though Cozumel is unlikely to take a direct hit from a hurricane, rough seas and rain from local weather system can ruin a beach vacation in a hurry.", "Protect your feet Some of Cozumel's beaches are littered with rocks, and coral reefs have been known to snag a tourist toe or two, so be sure to bring your swim shoes.", "Say no to tap water Cozumel's water filtration system pales in comparison to U.S. standards. To avoid unnecessary illness, drink bottled water. Always make sure your bottled water is sealed, your ice has been tested for purity and your food has been prepared with bottled water.", "Steer clear of the piers The major cruise lines unload at Cozumel's piers, so avoid them at all costs – it's one expensive tourist trap. If you must shop, head into San Miguel where the souvenirs are cheaper.", "Pack your sunscreen You can buy your sunblock in Cozumel, but you'll probably pay dearly. Purchase it at home and make sure it's reef-safe. Don't forget the sunglasses, hats and bug spray, either!", "Spanish is the primary language spoken, but many residents – especially those who work in the tourist zone – speak English. It may be both helpful and respectful to know some basic Spanish vocabulary, such as hello (hola), goodbye (adíos), please (por favor) and thank you (gracias).", "Cozumel's official currency is the Mexican peso. Since the Mexican peso to U.S. dollar exchange rate fluctuates, be sure to check the conversion before you go. American dollars are, however, widely accepted in Cozumel, though you may get change back in pesos. You also might get a better deal on goods and services if you pay in pesos.", "Thanks to the abundance of all-inclusive resorts in Cozumel (which commonly include the cost of food and alcoholic beverages in the room rate), many tourists find little need to explore the island's dining scene. But if you're willing to venture beyond your hotel digs, you'll find a bevy of delicious (often affordable) eateries.  ", "Meals in Cozumel are built on a foundation of shellfish, seafood and common Mexican staples like tacos and ceviche (fresh seafood marinated in lime). Many of the best restaurants in town offer local seafood, including affordable lobster dishes. Most can be found in downtown San Miguel, in addition to a number of local food stands that offer cheap, local fare that is ideal for a quick snack.", "Cozumel – San Miguel in particular – experiences relatively little crime. Still, if you need help, special tourist police can assist you with any safety concerns. Travelers' main concerns should regard food and water safety. Never drink the tap water in Cozumel; drink bottled water instead. According to local sources, most restaurants prepare their food with bottled water, but you should confirm this with your server before eating. If you have a sensitive stomach or you’re worried about getting sick, you should also skip drinks made with ice and order bottled beverages instead. Be sure to wash all produce thoroughly with bottled water before consuming. You should brush your teeth with bottled water, as well.", "The best way to get around in Cozumel is on foot or via a golf cart, as most of the attractions are centrally located. Moped and scooter rentals are popular, but they can be dangerous for novice drivers. Although you can easily rent cars in San Miguel through many hotels and at the Cozumel International Airport (CZM), we recommend taking one of the many taxis. They're cheap and government regulated, so you won't have to barter for the fare.", "You'll need a passport to visit Mexico, and you’ll also need to pay a new tourist tax that applies to visits in Quintana Roo. This tax is $19.90 per person, including children. Visitors can pay the tax online ahead of time here or pay at the airport before their departure. For additional information, visit the U.S. State Department's website."]}