{"name": "Merida", "description": ["Mérida may be known as the \"white city\" for its collection of white stone mansions, but its colorful culture and rich heritage tell another story. Stroll along the tree-lined Paseo de Montejo or peruse a vibrant Sunday market for a taste of old-world Mexico. Or, indulge in the Yucatan capital's more modern comforts: Plaza Grande, the main public square of Mérida, offers free Wi-Fi access, and you'll have your pick of luxurious boutique hotels and Instagram-worthy rental homes.", "Museum and art enthusiasts will find their place here, too; the El Gran Museo del Mundo Maya de Mérida is considered a must-see to understand the history of Mérida, while art galleries and local murals abound. When it's time to dine, savor traditional Mayan fare like cochinita pibil, the national dish of the Yucatan consisting of slow-cooked pork marinated in sour orange and a variety of spices. No matter what time of year you choose to visit, you should expect to dress in light, airy clothes and leave with a golden tan, a full stomach and a deeper understanding of this one-of-a-kind Mayan destination.", "The best time to visit Mérida is between December and March if you're looking for dry weather and lots of things to do. Opt for a January trip to experience Mérida Fest, a huge annual celebration that honors the founding of the city. Temperatures in April and May are some of the hottest of the year (around 100 degrees every day), but you'll still find many festivals and celebrations around the Easter holidays. June through November is humid and rainy, but you may want to brave the wet weather to experience Mexico's renowned Día de los Muertos festival at the beginning of November. Just be sure to purchase some travel insurance to keep hurricane season from raining on your parade.", "The primary language in Mérida is Spanish. Unlike more tourist-heavy areas of Mexico (like Cancun and Tulum), you'll encounter a number of people across the service industry in Mérida who are not fluent in English. For this reason, you should make sure to study up on a few helpful Spanish words and phrases – especially those that will help you navigate from place to place via taxi. (Think: \"derecho\" for right, \"izquierda\" for left, \"baño\" for bathroom and the names of basic foods and drinks.) Many hotel concierges speak a good amount of English, so you should be able to rely on them for recommendations and reservations.", "Additionally, most residents of Mérida practice Catholicism, so you can expect lots of crowds and events around major Christian holidays like Easter and Christmas. When it comes to money, the current exchange rate between the U.S. dollar and the peso is about $1 for every 20 pesos. So, while you may experience sticker shock at first when your dinner tab comes out to 400 pesos for two people, rest assured that the equivalent is just $20 – a steal by American standards.", "When dining in Mérida, you'll find a mix of traditional Mayan dishes and sophisticated international cuisines. One of Mérida's most notable delicacies is cochinita pibil (the national dish of the Yucatan). It is made of tender, slow-cooked pork marinated in sour orange and a variety of spices. Another pork staple is poc chuc: thinly sliced and marinated meat soaked in the same juices, then grilled to perfection. Sopa de lima, which translates literally to lime soup, is a hearty broth loaded with shredded turkey or chicken and tangy lime juice. Queso relleno is yet another popular dish you should make time to try – it is a hollowed-out ball of edam cheese stuffed with ground pork and smothered in gravy.", "Highly regarded restaurant options throughout Mérida include Ku'uk, which serves up gourmet, contemporary Yucatecan cuisine in a historic home on Paseo de Montejo. Inventive menu items include Creole suckling pig, Mayan octopus chicharrón and black ceviche. Wayan'e is an unassuming but popular pick for its mouthwatering tacos and delicious breakfast, consisting of staples like crispy pork belly and fresh juices. Even vegetarians will find tasty options here, like the huevo con xkatic tacos, which contain eggs and chili peppers.", "The best way to get around Mérida is either on foot or by car (whether that's your own car, an Uber or a taxi). English speakers will likely find it easiest to travel via Uber when they aren't walking, as they won't have to translate their destination to a taxi driver or figure out where they're going with Spanish road signs. Alternatively, visitors are welcome to use local buses, though they are mainly used by locals and therefore may be confusing for vacationers who haven't done some research ahead of time.", "You can fly nonstop into Mérida International Airport (MID) from Miami International Airport (MIA) and Houston's George Bush Intercontinental Airport (IAH). Meanwhile, flights with one connection are available from Los Angeles, New York City and San Francisco. In contrast, some vacationers choose to fly into Cancun and then take a luxury bus into Mérida.", "U.S. citizens need a passport to travel to Mexico. You'll receive a Mexico tourist card on your flight (or at the border, if you are driving), which allows you to stay in Mexico no more than 180 days. You'll also be given an exit ticket upon arrival – hang onto this slip during your visit, or you will have to pay a fee when you hop on your return flight. For more information, visit the U.S. State Department's website.", "Stretching almost 4 miles long, Paseo de Montejo is lined with mansions dating back to Mérida's old aristocracy, as well as some restaurants and cafes."]}