{"name": "Copenhagen", "description": ["While some Europeans revel in haute couture and haute cuisine, the Danes relish what they believe to be the height of importance: hygge. Defined as \"comfort\" or \"coziness,\" hygge is a value reflected throughout Copenhagen, from the skillfully restored antique furniture to the hearty meals served in traditional Danish restaurants. Quality of life is a given: After all, the Danes have frequently been named the happiest people in the world. So go ahead, experience life as the Danes do: Hop on a bike and tour Indre By, visit the squatters in Christiania, munch on a Danish pastry in Vesterbro or simply wander around and see for yourself why this is one of the most livable cities in Europe.", "Whether visiting Copenhagen to frolic in Tivoli Gardens, pay a visit to The Little Mermaid statue, or shop for antiques along Strøget – there's no shortage of fun to be had. Although many of the city's top museums, parks and royal palaces are clustered in or around Indre By, you shouldn't be afraid to branch out. There's gallery-hopping in Vesterbro's Meatpacking District, beer sampling near Frederiksberg Have and soccer-watching at Telia Parken in Østerbro. Just take it easy; it's the Danish way.", "The best time to visit Copenhagen is from March to May or between June and August – depending on what you're looking for. While the summer brings the warmest weather and a number of popular, large-scale events, those looking for lower rates and fewer crowds can still enjoy the mild weather in the spring. From May through September, the streets come alive as cafes spill to the sidewalks and festivals fill the air with music. Beginning in October, the city goes into hibernation for the winter; the only exception is December, when hotels fill for holiday celebrations.  ", "Summer is high season Yes, there will be tons of tourists and you'll have to pay more for your room, but the pleasant weather will make it well worth it.", "Take a walking tour Though you can easily get around Copenhagen on your own, for a dose of history and local insight, consider signing up for a free walking tour.", "Buy a Copenhagen Card Purchase this card and you'll enjoy free admission to more than 80 attractions, as well as complimentary rides on public transportation. You'll also have access to discounts at select restaurants and entertainment venues.", "Visit in the offseason While Copenhagen is at its best in the summer, you'll pay a premium on flights and hotels for planning your trip during the high season.", "Danes are known for propriety, which is demonstrated in almost every aspect of their culture. Although dress is casual, make sure your clothes are clean and neat; if you're dining out, jeans are generally not acceptable.", "Denmark's official language is Danish, though you'll find that many Danes living in Copenhagen – particularly the city center – speak English. To avoid a language barrier in other parts of the city, pack a Danish phrasebook or dictionary. Key words and phrases worth remembering include \"hej\" (hello), \"tak\" (thank you), \"Taler du engelsk?\" (Do you speak English?) and \"farvel\" (goodbye).", "Although Denmark is a member of the European Union, it does not use the euro. Instead, the country's official currency is the Danish kroner. One Danish krone equals about 15 cents, but you'll want to check the latest exchange rate before you visit. Euros and dollars are also accepted at some vendors, but the exchange rate is not as favorable, so it is best to use kroner. ATMs are located throughout the city, and many travelers say that ATMs offer better exchange rates than most banks and hotels.", "Like other European cities, tipping is not expected in Copenhagen. Service charges are generally included in restaurant bills, hotel prices and taxi rates. However, if you feel you've received exceptional service, you can round up your bill or leave a 10% tip.", "Though Denmark's cuisine is not as world-renowned as what you'll find in other European countries like Italy and France, the country does feature a few must-try specialties. For a casual lunch, order a smørrebrød (an open-faced sandwich topped with ingredients like raw herring and hard-boiled eggs) or a pølser (a Danish-style hot dog commonly served with ketchup, mustard, fried onions and pickles). Both items are available at stands throughout Copenhagen. Other must-try items range from frikadeller (pan-fried meatballs) to aebleskiver (small, round pancakes stuffed with apples and served with marmalade) to local blue, danbo, samsø and havarti cheeses.", "Copenhagen is relatively safe, but as with any urban area, you should still keep an eye out for pickpockets – especially in tourist areas and on public transportation. In Christiania, clashes between locals and police officers have occurred in recent years, but the area still sees plenty of visitors on a regular basis.  Residents do not permit photography around Pusher Street, where cannabis is sold. There have been cases of assault and robbery against tourists who have attempted to snap photos here, so if you plan on exploring this area, keep your camera stowed.", "Additionally, terrorist attacks have become more common throughout Europe, and multiple terrorist plots have occurred or been thwarted in Copenhagen in the past few years. Terrorist attacks generally target crowded areas (such as malls, transportation hubs, popular attractions and major sporting events), so stay aware of your surroundings when in crowded areas. You'll want to keep up-to-date on current events as well. Consult the U.S. State Department's website to learn more about security concerns and safety tips for Denmark.", "The best way to get around Copenhagen is on foot and by bike, especially when the weather is cooperating. If you're tired (or cold), you'll find a modern public transportation system that features metro lines, extensive bus routes and an easy-to-navigate train network. Taxis are plentiful but come at a cost.", "To get between the city center and Copenhagen Airport (CPH), you can use any form of public transportation or hail a taxi. If you don't fly into the airport, you can also reach Copenhagen by train or boat. The Central Station services destinations around Denmark and provides access to Austria, Germany, Norway and Sweden. Meanwhile, passenger ferries transport both travelers and cars to Copenhagen from Germany, Norway and Poland. Copenhagen is also a popular port of call for cruise lines.", "To enter Denmark, Americans must have a passport with two blank pages that is valid for at least six months after your trip. Americans can stay up to 90 days in Denmark, as well as in Greenland and the Faroe Islands (both of which are Danish territories), without obtaining a visa. Visit the U.S. State Department's website for more information on entry and exit requirements."]}