{"name": "Little Rock", "description": ["Little Rock is perhaps best known for the Little Rock Nine, a group of Black students who enrolled in the historically all-white Little Rock Central High School in 1957. The students' enrollment, which followed the Supreme Court decision that deemed segregation of schools unconstitutional, brought civil rights to the national spotlight. Little Rock honors its place in the civil rights movement with monuments and exhibits scattered throughout the city's parks and museums.", "Today, you'll have much more than civil rights history to sink your teeth into. Sure, there are plenty of museums detailing the lives of frontier-era Arkansas residents and former President Bill Clinton, but there's much more to Little Rock than its educational attractions. There are plenty of outdoor activities, from scrambling up a mountain to taking an easy walk across Big Dam Bridge. Social butterflies will be happy here, too. Little Rock hosts annual events to suit any traveler and comes alive nightly at the River Market Entertainment District. So, pack your bags and head on down. There's something for everyone in Little Rock.", "The best time to visit Little Rock is from March through May and from September to October, when daytime highs hover between the mid-60s and low 80s. You'll also score slightly lower hotel rates in spring and fall than you will during the busy summer season. Not only does summer welcome more tourists since the kids are out of school, but it also means sweltering temps that can reach the low 90s. Winter experiences cooler temperatures that barely reach 55 degrees for daytime highs. Little Rock sees a fair amount of precipitation year-round; so, no matter when you visit, bring an umbrella and a raincoat along.  ", "North Little Rock is different Across the Arkansas River sits North Little Rock, an entirely separate city from Little Rock. Here, you'll find the Old Mill, best known for its appearance in the classic film \"Gone with the Wind,\" along with Argenta Plaza, a bustling arts district, among other cool sites. To check out all it has to offer, save at least one day of your itinerary to explore North Little Rock.", "Former President Bill Clinton is from here Well, not specifically Little Rock, but he is from Arkansas. He served as the state's attorney general and its governor before becoming president in 1993. As such, several sites in Little Rock bear the Clinton name.", "Hot Springs is nearby Hot Springs, an Arkansas city renowned for its thermal waters and outdoor adventures, sits 55 miles southwest of Little Rock. It's a great option for a daytrip.   ", "Take advantage of free attractions From cultural landmarks like Little Rock Central High School to historic sites like the Arkansas State Capitol to museums like Heifer International, Little Rock has plenty of things to see and do that won't cost you a dime.", "Tour on your own The Little Rock Visitors Bureau created four different audio and walking tours. These tours explore Little Rock's civil rights and political histories, as well as its murals and sculptures. The tours are free; maps and audio files are available on the visitor bureau's website.", "Get a pass Little Rock's bus and streetcar systems can take users to several of Little Rock's attractions, such as the Clinton Presidential Center and the Museum of Discovery. You can buy a 10-ride pass for $11.50."]}