{"name": "Turks & Caicos", "description": ["The Turks & Caicos Islands have the perfect antidote for your hectic lifestyle: blindingly white sand fringed by shimmering azure water, colorful coral reefs, crispy conch fritters and an easygoing vibe – despite its knack for attracting the rich and famous to its shores. Turks & Caicos holds tight to its reputation as an exclusive and secluded getaway, and regular vacationers to these skinny strips of alabaster sand will tell you that they wouldn't have it any other way.", "Of the roughly 100 islands and cays, only nine are inhabited, with three receiving the bulk of tourist interest. There's glamorous Providenciales, or \"Provo,\" which shelters a bevy of luxurious hotels. Laid-back Grand Turk – once the landing point for John Glenn’s Friendship 7 space capsule – is a cruise ship hub, and the archipelago’s historic and cultural nucleus, best seen in the Turks & Caicos National Museum or along the shores of Cockburn Town. Turks & Caicos is home to one of the largest reef systems in the world, and tiny, flat Salt Cay is one of the best places to explore it thanks to its exceptional wall dives.", "The best time to visit Turks & Caicos is April and May, a sweet spot that promises lower prices and fewer crowds compared to the winter high season. The weather is pleasant year-round with average highs that hover in the 80s and lows that rarely dip below 70 degrees, but these islands do experience a rainy season, and the threat of hurricanes lingers from June to November. Statistically, hurricanes are most likely to disrupt the island's tranquility between mid-August and September. Similar to other destinations in the Caribbean, Turks & Caicos' peak travel period lasts from December to March. ", "Keep your cash handy Even though Turks & Caicos is considered a British overseas territory, the official currency is the U.S. dollar. Keep in mind that the smaller islands and cays may have a limited number of debit and credit card machines.", "Try the local cuisine Popular dishes like crispy conch fritters and steamed Caribbean lobster are best enjoyed at the local seafood spots. Other traditional dishes include peas and grits, hominy, and okra and rice, which is often enjoyed  with steamed lobster or fish.", "Pack an umbrella Hotels and airlines discount their prices by as much as 40% during the islands' rainy season (June to November). Since this period also falls during the Atlantic hurricane season, you may also want to purchase travel insurance.", "Stay on a Turks island The inns and guesthouses Grand Turk and Salt Cay are generally more budget friendly than the boutique and luxury resorts on Providenciales, Pine or Parrot cays.", "Book early If you do want to visit during the peak season (December to April), booking a year in advance can mean substantial savings on your hotel bill.", "Because the islands' restaurants rely heavily on imported food products, dining in Turks & Caicos can be expensive. Providenciales is home to a wide variety of eateries serving everything from Asian cuisine to Mexican favorites. But if you want to eat cheaply, try mom and pop restaurants and order seafood (conch in particular). Regional favorites include crispy conch fritters and creamy conch chowder. A popular place to try conch, as well as see how conch is harvested, is at the traveler-approved Da Conch Shack. Caicos Cafe is another favorite among past travelers, with many making repeat visits during their vacations for the daily fish special and roasted octopus. If you're on the hunt for traditional Caribbean dishes with a side of amazing views, plan to enjoy a meal or a sunset drink at the Rickie’s Flamingo Cafe, which enjoys a picturesque spot along Grace Bay.", "If you're arriving to Turks & Caicos via cruise, keep in mind that most of the restaurants within reach of the port focus on lunch and have more of a tourist feel (Margaritaville, for example). If you're only on the island for one meal, consider heading into Cockburn Town to dine at local favorites like Sandbar Restaurant or Jack's Shack.", "Crime is relatively rare in Turks & Caicos (though you shouldn't leave your valuables unattended), but as with any destination, you should exercise sensible precautions. Don’t travel alone at night and never answer your door without knowing who is there. According to the Turks and Caicos tourism bureau, Providenciales sees the most crime, and more crime is likely to occur around rental villas and properties (versus hotel properties).", "You will definitely want to take precautions for the tropical weather. Drink plenty of water while outside and apply sunscreen at regular intervals. You may want to avoid strenuous outdoor activity for the first day of your trip, so that you can adjust to the heat.", "The Turks & Caicos Islands are popular for diving, but there are risks. Make sure to receive proper training, check the weather conditions and never dive alone – preferably, dive with an instructor. Also, be careful when ascending from a deep dive. Decompression sickness, or \"the bends,\" can occur when divers come to the surface too quickly. A speeding resurface can cause nitrogen bubbles to form in the blood and tissue, resulting in joint pain, swelling, confusion and shortness of breath. Ascend slowly (no more than 30 feet per minute) and take breaks when surfacing after deeper dives.", "The best way to get around Turks & Caicos is either by rental car or taxi. There is no public transportation on the islands, and as the attractions, restaurants and hotels are spread out, walking is not an option. You can rent a car at the Providenciales International Airport (PLS) on Provo. If you choose to island hop, you'll need to head to one of the many smaller airports, like Grand Turks' JAGS McCartney International Airport (GDT). Note that the only way to get to Provo from Grand Turk is by plane; if you’re on a cruise, Grand Turk is likely the only island you’ll visit. Cheaper ferries are also available by charter to travel select islands.", "You'll need a valid passport to travel to Turks & Caicos by air or sea. But be sure to keep your document safe – given the islands' remote location, the nearest emergency U.S. passport office is a flight away. For stays longer than 90 days, inquire with the U.S. consulate on obtaining a visa. Read the U.S. Department of State's Turks & Caicos travel guidelines for more information."]}