{"name": "Great Barrier Reef", "description": ["As one of the original Seven Natural Wonders of the World, the Great Barrier Reef holds a spot on every traveler's bucket list. Hugging the east coast of Queensland, Australia, the Great Barrier Reef extends from Cape York in the north all the way to Bundaberg in the south – more than 1,800 miles. With roughly 2,900 coral reefs, 600 islands and 1,500-plus species of fish, the reef leaves its 2 million annual visitors enchanted.", "But before diving in, it's important to get your bearings. The northern part of the reef runs from the Cape York Peninsula to Cairns, a popular home base for many reef visitors. Not only does Cairns provide the closest reef access from the mainland, but it also boasts a few attractions of its own, such as the Kuranda Scenic Railway and the Cairns Botanic Gardens. Other sights like Hartley's Crocodile Adventures and the Wildlife Habitat Port Douglas are also situated by the reef's northernmost section. Travel farther down the coast and you'll run into the central part of the reef, which includes Townsville and the Whitsunday Islands, where Hamilton Island and Whitehaven Beach reside. And between the Capricorn Coast (along the Tropic of Capricorn) and Fraser Island, you'll find Airlie Beach and the only section of reef that has not been impacted by severe coral bleaching events.", "Wherever you decide to hang your hat, the Great Barrier Reef is a treasure trove of once-in-a-lifetime experiences. Whether you're gazing at marine life through a scuba mask, letting the tropical breeze unfurl your sail or taking in the reef from a plane, the possibilities for exploration are nearly limitless.", "The best time to visit the Great Barrier Reef is from June to October. This peak season offers some key advantages for travelers. Temperatures hover in the low 60s to mid-80s, and rainfall is uncommon, which means clearer waters and better diving conditions. Along with the ideal weather, these winter and spring months offer cheaper prices at hotels near the central and southern parts of the reef, but keep in mind that accommodations and diving excursions in Cairns tend to fill up quickly due to the influx of tourists to the region. Meanwhile, the area's low season (known locally as the wet or stinger season) takes place between November and May and brings more rain, resulting in poorer water visibility and an abundance of deadly box jellyfish.", "It's big Remember: Astronauts can see the Great Barrier Reef from space. There's no way to see all of its 132,974 square miles in one trip, so create an itinerary based on your must-see attractions.", "Bring an underwater camera Since much of your time will be spent below the sea's surface, consider buying or renting an underwater camera. The reef's waters are notoriously clear, allowing for spectacular photos.", "Follow responsible reef practices The Great Barrier Reef is a World Heritage site, and there are strict guidelines for visitors. Read up on the Great Barrier Reef Marine Park Authority's reef-friendly practices before exploring.", "Set up camp Roughing it on one of the Great Barrier Reef's secluded isles is actually a popular (and affordable) way to immerse yourself in the region's spectacular environment. Reserve your camping permit and read up on camping guidelines on the Queensland government website.", "Explore on your own While guided diving trips can take you to some of the reef's most secluded locales, they can also put a major dent in your vacation budget. To keep costs down, consider venturing solo. Just be sure to take a look at a zoning map – you can incur hefty fines if you're in a no-dive area.", "Bed down on the mainland Island accommodations are more expensive than the mainland's hotels. Unless you're planning to camp or stay in a hostel, you'll enjoy more budget-friendly choices in Cairns or Port Douglas.", "Protecting the Great Barrier Reef and all its inhabitants is as much a part of the region's culture as it is the law. For Aborigines and Torres Strait Islanders (two indigenous ethnic groups), the Great Barrier Reef is home to significant cultural and spiritual sites, meaning respect for the land is essential. More than 70 Aborigine and Torres Strait Islander Traditional Owner groups are situated along the Queensland coast, from the northern Torres Strait Islands to southern Bundaberg. Because each group values the land for different reasons, be it cultural, spiritual, economic or social, it's important for visitors to follow responsible reef practices.", "By being mindful of your environment, you can avoid some of the common dangers associated with exploring the Great Barrier Reef. If you're swimming or diving near the Queensland mainland during the reef's rainy season (November through May), be aware of deadly box jellyfish – wear a stinger or Lycra wetsuit to avoid any jellyfish stings. And always remember that you're entering an animal's natural habitat, so try not to disturb its environment. Also, keep in mind that it's against the law to damage or collect coral, alive or not. But that's not the only reason you should avoid coral's sharp polyps: Cuts can quickly turn into infections due to the Great Barrier Reef's thermal climate.", "When you're not sporting your wetsuit, feel free to embrace the region's casual seaside disposition by wearing loose, comfortable clothing (and don't forget the SPF!). While you won't have to worry about a language barrier here (English is the primary language), Aussies are known for their sarcasm and using slang terms like \"g'day\" (hello), \"ripper\" (great) and \"reckon\" (for sure), so study your Aussie slang before arriving. Another thing to keep in mind: The official currency is the Australian dollar, which is roughly equivalent to $0.74, and tips are not given unless exceptional service is provided. And remember, Aussies calculate distances in kilometers and drive on the left side of the road, so you should look right, then left and then right again before crossing the street.", "Most visitors head to Cairns when they want to explore the reef, so it's hardly surprising that one of Queensland's most diverse dining scenes can be found here. Popular eateries include the French-inspired C'est Bon Restaurant Français, the Indonesian-focused Bayleaf Balinese Restaurant and Tha Fish Restaurant, where local seafood staples like fish and chips, seared tiger prawns and grilled Moreton Bay bugs (small lobsters) are on the menu. Travelers can also enjoy an array of local brews at Cairns' Barrier Reef Brewing Co.", "For those who plan to linger farther south in Townsville, Australian restaurants like A Touch of Salt, JAM and IMC Steak House are available. Aussie dishes served throughout the city include grilled barramundi (a type of seabass native to Australia) and roasted lamb, and craft brews can be savored at Townsville Brewing Co. A few specialty restaurants, such as Chico Rio (a Brazilian dining venue) and GYO Japanese Tapas Bar Restaurant, are located in Townsville as well.", "Travelers visiting the Whitsundays will find the bulk of the islands' eateries on Hamilton Island. Because of its proximity to the water, Hamilton Island offers a variety of seafood-focused restaurants, including Bommie (which is part of the Hamilton Island Yacht Club) and Mariners Restaurant (located within the Hamilton Island Marina complex). Australian pub grub and Asian and Italian fare are also available.", "The best way to get around the Great Barrier Reef is by car or boat, depending on where you plan to spend the majority of your time. If you're on the mainland, renting a car is the best way to get to and from the attractions in and around Cairns. But if you're planning to spend your vacation on one of the reef's more remote areas, like the Whitsunday Islands or Lizard Island, then catching a boat is your best bet. Because Cairns is the tourist hub of Queensland (and a convenient point from which to explore the reef), many Great Barrier Reef visitors fly into Cairns Airport (CNS). Keep in mind, though, that you'll have to change planes in Sydney or Brisbane to get to Cairns from the U.S. If you're flying directly to one of the islands on the reef, you'll likely fly into the Great Barrier Reef Airport (HTI) on Hamilton Island. This airport welcomes flights from Cairns, Brisbane, Sydney and Melbourne provided by carriers like Virgin Australia Airlines, Jetstar Airways and Qantas. From Hamilton Island, you can easily hop on a plane or boat to explore the reef's neighboring islands.", "A visa and a valid U.S. passport are required to enter Australia. Americans who will be in Australia for less than 90 days are required to have an Electronic Travel Authority (ETA), which is an electronic, label-free visa. You can acquire one online through the Australian Government Department of Immigration and Border Protection website. Airline and travel agents can also apply for an ETA on your behalf. For more information, visit the U.S. State Department's website."]}