{"name": "Greenville, SC", "description": ["With more than 30 cities and towns in the United States named Greenville, it's no wonder the tourism slogan for Greenville, South Carolina, is \"yeah, that Greenville.\" Founded in 1786, that Greenville is the oldest of the group, the third-largest urban area in the state and one that is known nationally as one of the fastest-growing cities in the South. From families and foodies to cyclists and culture lovers, visitors will find an array of people, attractions and activities, many of them centered in the compact downtown district. ", "Start your exploration at NOMA Square – an outdoor plaza at the corner of North Main Street and Beattie Place – and see if you can spot the nine bronze mice sculptures hidden throughout the neighborhood. Both kids and adults will enjoy the works on display at the Greenville County Museum of Art and the fun, interactive exhibits at the Children's Museum of the Upstate, both located on the Heritage Green campus within three blocks of the shops and restaurants on the Main Street corridor. Meanwhile, outdoor enthusiasts can access the nearly 20-mile-long GHS Swamp Rabbit Trail from four different points downtown or just relax at Falls Park on the Reedy, a pastoral oasis in the heart of Greenville.", "The best times to visit Greenville are from September to November and from March to May. Temperatures are relatively mild, without the intense humidity of the summer, and crowds are smaller at local attractions. Fall is a beautiful time of year for hikers and bikers when the foliage in the foothills of the Blue Ridge Mountains bursts into color, and spring brings lush green trees and colorful blooms. You may see some rain in September, but October and November are relatively dry. April is the driest month in the spring. Fall and spring are also both shoulder seasons, so rates drop on accommodations.", "Make way for bikes Cycling is popular in Greenville, especially on the GHS Swamp Rabbit Trail. If you're walking or hiking, pay attention and stay to the right on paved paths.", "Greenville loves kids In addition to parks and bike trails, attractions like Runway Park at the downtown airport and the Children's Museum of the Upstate offer hours of play for children.", "Ditch the car Many of Greenville's top attractions and restaurants are concentrated in the downtown area, meaning a car isn't necessary unless you plan to travel beyond the city. Plus, if your feet get tired, you can hop on the free trolley or solar-powered shuttle that loops throughout the central business district.", "Take advantage of discounts Visit Greenville SC offers coupons and deals on its website for everything from accommodations to tours. Check to see if any align with your trip.", "Plan a winter visit Winters in Greenville are mild, with low temperatures hovering in the 30s or 40s and highs in the 50s or 60s. If you don't mind the cooler climes, you'll be rewarded with some of the lowest accommodation rates of the year. ", "Zagat calls Greenville \"an under-the-radar\" food destination that's a combination of Charleston's Southern sensibilities and Asheville's hip farm-to-table food scene. More than 100 restaurants line the nearly 2-mile-long Main Street corridor offering everything from contemporary Southern cuisine to French fare and Mediterranean flavors, as well as the local favorites like barbecue, biscuits and sweet potato pie.", "Soby's is often credited with initiating the city's thriving culinary scene. The contemporary Southern cuisine includes sophisticated interpretations of classics, such as she-crab soup, shrimp and grits and fried green tomatoes. If you're craving steak, Rick Erwin's West End Grill is another local favorite.", "Another hot spot: Roost, helmed by chef Trevor Higgins. Everything from protein to produce (and even the beer) is sourced locally. Feeling continental? Passerelle Bistro in Falls Park dishes up traditional French favorites like cassoulet, steak frites and salade niçoise for lunch and dinner. And when the weather allows, you can dine on the patio overlooking the falls. If you prefer a river view, head to The Lazy Goat, which takes you to the Mediterranean with Spanish cheese, fine charcuterie and braised pork belly.", "When you're ready to satisfy your sweet tooth, sample the sweet potato pie at the Brick Street Café or the salted caramel banana pudding at The Chocolate Moose. ", "The best way to get around Greenville is on foot, by bike or by hopping on the free trolley, which runs year-round Thursday through Sunday. Greenville is easily accessible by car from Interstate 85, which runs right through the city; the Greenville-Spartanburg International Airport (GSP) welcomes flights from five major carriers. While there are several car rental services (including Hertz, Budget and Avis) and one taxi company that provide transportation to and from the airport, taxi service in the city itself is limited. Rideshare services like Lyft are also available."]}