{"name": "Maldives", "description": ["You've seen photos of the Maldives before: picture-perfect private villas suspended over striking blue waters, alabaster white sand beaches and spectacular sunsets dipping into the horizon. The scenic beauty of the Maldives is something to behold, something you can't quite understand until you're there in person.", "The island nation of the Maldives is popular with honeymooners looking for seclusion and adventurers looking to explore the depths of the sea on a scuba diving or snorkeling excursion. If you don't fall into either category, consider that the Maldives' appeal has broadened in recent years. Today, honeymooners and divers are joined by a more diverse mix of families, groups of friends, and even solo travelers seeking wellness retreats or \"budget\" vacations in guesthouses rather than resorts. Travelers seeking the ultimate in relaxation can unwind at one of the many superb resort spas and all visitors should certainly spend an afternoon exploring an inhabited island village to get a snapshot of typical island life. The resorts in this region are also spectacular, ranging from underwater hotels to overwater bungalows to incredibly beautiful resorts. However, getting to and staying in this tropical paradise requires patience (there are no direct flights from the United States) and plentiful cash. Located in the Indian Ocean, roughly 600 miles southwest of Sri Lanka, the Maldives is about as isolated as you can get – and that's just one of its many allures.", "The best time to visit the Maldives is from November to April, when there is little precipitation and warm temperatures, ranging between the high 70s and mid-80s. The island nation is warm and sunny year-round, but it does experience a dry season and a rainy season, and there are pros and cons to each. Though the period between November and April promises the best weather, this is also the busiest time of year and, as such, the room rates at resorts are expensive. However, since each resort inhabits its own island, you won't have to contend with the same intensity of crowds like you might during the high season in another tropical destination with more public facilities. Check the number of villas and size of the island before you go, so you can get an idea of how tranquil the island will be.", "May to October is considered the rainy season, with the southern atolls experiencing the most rain. During this time, islands see between 7 and 8 inches of precipitation monthly and often strong winds. However, showers tend to be short and punctuated by sunshine. Some days, it only rains overnight, while there can be many hours of sunshine through the day, if you're lucky. Some travelers find the better deals available during rainy season make it worth the gamble of visiting, although July and August are the riskiest months. However, the term \"deal\" is relative, since the Maldives is a pricey location year-round. This time of year is also popular with surfers because the area sees bigger waves and better swells for surfing during these months.", "Note that the private resorts are permitted to celebrate non-Islamic holidays, including Christmas, Easter and Diwali, but you will not find them celebrated on inhabited islands.", "Tap water is desalinated This treated water is fine for showering and brushing teeth. Some resort islands have their own desalination plants (as the sea is too deep for a national water pipeline between islands), but many resorts offer bottled water instead. Bottled water is sometimes free, but can also be pretty expensive at some resorts. Normally, the resorts with their own desalination plants provide water for free.", "It's hot These islands are located near the equator, meaning the temperatures are warm year-round and the sun is strong. Make sure to apply a liberal amount of sunscreen to protect your skin from the sun's UV rays.", "Islamic tradition is important The Maldives is an Islamic nation, meaning it adheres to Islamic traditions and practices. However, because the resorts are on private islands, resort guests do not have to obey local cultural restrictions, meaning travelers can consume items normally banned, such as alcohol and pork, and are free to wear swimsuits. Beyond the resorts' borders, you'll find plenty of mosques and no alcohol. It's advised that women cover their shoulders, chest and knees unless they are at the airport or on a resort island (out of respect for the local culture rather than for their safety).", "Adjust your expectations Visiting the Maldives on a budget is unlike visiting other travel destinations like Mexico or Asia on a budget, where you may be able to get by spending less than $50 to $100 a day. There are some ways to save, but overall, a trip here is pretty pricey in comparison, even if you're staying in a guesthouse and taking local ferries.", "Choose flights wisely Airfare from the United States is incredibly expensive. If you can pair a vacation here with one in Sri Lanka, the Middle East or Europe (where you can catch a direct flight), the cost will be less ludicrous. Or, consider signing up for a travel credit card and use airline and hotel loyalty points to book a vacation here.", "Pick accommodations carefully Weigh the pros and cons of a \"budget\" hotel (known locally as \"guesthouses\") versus choosing a cheap resort. Guesthouses are normally in better condition than many of the cheapest (and oldest) resorts, since this form of tourism has only been permitted since 2010, and despite the term \"guesthouse,\" they are often more like boutique hotels than budget lodgings. However, due to the fact that guesthouses are not on private islands, alcohol and skimpy swimwear are not permitted.", "The Maldives has been an Islamic nation since the 12th century, but was previously Buddhist and Hindu. As an important trading post on the ancient Spice Route between East Asia and the Middle East, there are influences from China, Malaysia, Indonesia, Africa and the Arab world in Maldivian culture. It includes crafts like lacquerware, pottery, matt weaving, Bandiyya Jehun dancing inspired by Indian pot dances, and a form of drumming and dancing known as Boduberu (\"big drum\"), which is reminiscent of African drumming.", "With this rich heritage, you'll find religious traditions entrenched in the culture on inhabited islands, while by contrast, resort islands are their own kingdoms far removed from the local way of life. Mosques are on every inhabited island, and you'll see women dressed in  headscarves, normally with jeans and flip-flops. Should you wish to visit an inhabited island, you too should dress reasonably conservatively out of respect for the local culture, and to avoid too many stares. Some inhabited islands are more liberal than others, so it's best to inquire locally, but as a general rule, men shouldn't wear sleeveless tops or short shorts, while women should cover their shoulders, chest and knees on inhabited islands.", "If you're swimming or sunbathing on an inhabited island that doesn't have a tourist beach, be aware that bikinis and skimpy swimwear are illegal and travelers have been detained by police for it in the past. The simplest workaround is to wear boardshorts and a rash shirt, which also helps prevent sunburn.", "Travelers are permitted to go inside some mosques, but it's best to ask a local first, as some mosques are closed to non-Muslims. On the inhabited islands, you'll also notice the sound of the \"call to prayer\" and sometimes even people praying in public at certain times throughout the day. Be respectful by lowering your voice and not walking in front of those who are praying. This is also the time of day when shops close, too. You can download a free prayer time smartphone app if you're spending a lot of time on an inhabited island so you don't get caught tripped up everything closing several times a day.", "During Ramadan, don't eat or drink on the street on inhabited islands, because Maldivians fast during the day, and also be aware that most restaurants and cafes will not open until after sunset for anyone.", "Public displays of affection, such as kissing or hand-holding, are illegal on inhabited islands. Again, you won't need to comply with any of this if you're staying on a resort island or liveaboard. Homosexuality is illegal in this island nation, but many resorts are gay-friendly, particularly the international brands and higher end resorts.", "Alcohol and pork are also illegal on inhabited islands, although it is readily available on resort islands. If you're staying in the local island community and are craving a glass of wine, your guesthouse can normally arrange a day trip to a resort or a liveaboard so you can have a drink. You can also find alcoholic drinks at Hulhule Island Hotel, which is a quick, free shuttle ride from Velana International Airport.", "With close to 200 resort islands, tourism is the dominant industry that draws on a large portion of the workforce and has elevated the country from the United Nations' Least Developed Country designation to Middle Income Country status in just 40 years. The other major industry is fishing using traditional methods, and this island nation exports its dolphin-safe tuna to countries across the world.", "The Maldivian currency is the rufiyaa (MVR) and it is pegged to the US dollar; $1 equals about 13 to 15 rufiyaa. However, the exchange rate can fluctuate, so be sure to check it before you travel. The official language of the Maldives is Dhivehi, though most Maldivians speak and understand English and sometimes a third language too, especially those working at resorts.", "You'll be able to find all kinds of international cuisine in the Maldives. Norwegian salmon, Japanese wagyu and Australian lamb are transported from all corners of the world to suit the demands of international guests. If you're attempting to have an eco-conscious vacation, you might want to check out an eco-friendly resort that cuts some of the air miles out of your dinner by growing some of its own fruit and vegetables and working with local farmers and fishermen, such as resorts like Soneva Fushi and Amilla Fushi.", "Resorts have a main restaurant and a handful of specialty restaurants, with Italian, Thai and Japanese being some of the most popular cuisines. Many resorts also offer theme nights, such as \"Maldivian Night,\" \"Seafood Night\" and \"BBQ Night.\" If you're staying a week or more, consider a resort with at least three or four restaurants so you don't end up eating the same meals twice. Some of the cheaper resorts only offer buffets, the standards of which are variable, so checking recent reviews is a safe bet. A few of the high-end resorts cater to special diets like ketogenic, Paleolithic, gluten-free and vegan – you'll see this promoted on the resort websites.", "Cafes and restaurants on inhabited islands don't offer such a broad range of cuisine as resorts, but you will find plenty of tasty Maldivian, Sri Lankan and Indian fare, as well as international classics like spaghetti bolognese, burgers, pasta and pizza. Maldivian cuisine relies heavily on the region's available ingredients, which means seafood, coconut and chilis feature prominently in most dishes. Tuna, wahoo and mahi mahi are a few of the local types of fish you can expect to find on menus in the Maldives. Other popular dishes include hedika (a kind of Maldivian tapas featuring savory fillings like fish, spiced potatoes and vegetables), fish curries and barbecued fish.", "Keep in mind, because the Maldives is an Islamic nation, the local population is not allowed to drink alcohol, so there are no bars on inhabited islands. However, you will be able to enjoy alcoholic beverages at all resorts and liveaboards, and at the airport hotel (Hulhule Island Hotel), but not anywhere at the airport.", "The best way to get around the Maldives depends on what kind of island you're on, although most visitors will stick to their chosen resort island. The majority of islands in the Maldives range in size between 0.3 and 0.7 square miles, which means they don't take long to navigate. Many resorts offer bicycles or chauffeured golf buggies to make getting around in the humidity easier, while if you're in a local town, your guesthouse might offer you a bicycle. In the capital city of Malé and in Hulhumalé, walking, buses or taxis are the main transportation options.", "Note that if you have mobility issues, you may find this country can be trickier to get around due to the speedboat/seaplane transfers, large areas of sand and (normally) unpaved paths at resorts and on many inhabited islands. There's no air bridge at the international airport, but if you inform your airline in advance, it can make arrangements for a lifting device. A few resorts, such as Baros, Kuramathi and Adaaran Select Meedhupparu, have been recommended by travelers with mobility issues. Amilla Fushi is the only resort in the Maldives that has been officially designated an IncluCare-certified resort (even the dive center teams are trained to assist travelers with disabilities). IncluCare is a U.K.-based tourism organization specializing in inclusive and accessible travel training, assessment and accreditation.", "The Maldives requires that international visitors have a passport that's valid for six months from the expected departure date, in addition to proof of sufficient funds and an onward travel plan. You will automatically be granted a 30-day visa on arrival, which can be extended to 90 days if requested. Vaccinations for hepatitis A and typhoid are recommended prior to arrival. For more information, check out the U.S. State Department's website."]}