{"name": "Ocean City, MD", "description": ["Affordable and kid-friendly too, Ocean City, specializes in the classic American beach vacation. Stroll along the boardwalk and you'll find adrenaline-pumping amusement park rides, far stretches of powdery sand and plenty of souvenir shops. The main draw of a vacation here is the beach – the wide shoreline means there's plenty of room for visitors of all ages to sunbathe, search for seashells and play in the surf. When you need a bit time away from the sand, try parasailing or Jet Skiing across the water, play a round of mini-golf or head to Northside Park for some outdoor fun. Adults looking for a way to unwind can check out the iconic beach bar Seacrets for tropical drinks and live music or sample craft beer at local brewery Burley Oak. And a trip to the beach isn't complete until you've had a meal of delicious steamed crabs and an ice cold beverage. ", "The best time to visit Ocean City is from late May to early September, just be prepared for average highs in the mid-80s and a little humidity. There will also be a lot of crowds, and hotel rates that are double the cost of visiting in spring, so you'll want to book your accommodations several months in advance. Budget travelers might want to consider the shoulder seasons of spring or fall, or the winters: Average low temperatures are in the lower 30s, keeping room rates low. But forewarning, many local hotels and inns close down for the offseason between October and April.", "Schedules are limited after Labor Day After Labor Day, everyone in Ocean City alters their schedules. Restaurants, attractions and public transport run on limited hours until visitors return after Memorial Day.", "Dangerous riptides abound If you find yourself caught in a powerful current, swim parallel to the beach until the waters are mild enough for you to get back to the shore.", "Beware the pests Jellyfish, \"sea lice,\" sand flies and grasshoppers are a few pests that you'll occasionally encounter in Ocean City either in the water or on the sand. Pack bug spray to prevent bites, hydrocortisone cream to treat any stings and antihistimates to relieve itching.", "Pack your own goods Rental stands along the beach offer umbrellas, boogie boards and towels, but they overcharge for the convenience. Save yourself some dough and bring your own gear.", "Clip your own coupons Before you head for a round of mini-golf or some go-kart racing, check with the visitor center and the local newspapers for discounts and coupons.", "The best way to get around Ocean City is on foot or by bus. Most of the top things to do are centrally located on Coastal Highway, an easy 10-mile north-to-south thoroughfare. The buses and boardwalk trams can get you to the destinations that are farther away at affordable fares. Car rentals are available at Salisbury Regional Airport (SBY), although most visitors opt to drive to Ocean City, not fly. "]}