{"name": "Ann Arbor", "description": ["When you think of Ann Arbor, you likely think of the University of Michigan. In some ways, the two are synonymous; you're bound to bump shoulders with students along Main Street when class is in session, and it's impossible not to feel the buzz in the air when football season arrives. But in other ways, Ann Arbor has an identity all its own. The city has a certain quirkiness to it, evidenced by its secret fairy doors and unique festivals like Apple Daze in the fall and FestiFools in the spring. Ann Arbor has the goods to impress foodies as well – even former President Barack Obama devoured the famous Reuben sandwich at Zingerman's Deli. And the town isn't nicknamed the \"City of Trees\" for nothing; visitors can paddle and hike their way down the lush Huron River Water Trail or behold the glory of peony season at the Matthaei Botanical Garden in early summer. No matter what time of year you visit, you're likely to discover a side of Ann Arbor you didn't know was there – and wonder why you didn't book a trip to this Michigan gem sooner.", "The best time to visit Ann Arbor is between May and September, when temperatures rest comfortably in the 70s and 80s and activities abound. It is the perfect time to get outside and experience Ann Arbor's beloved outdoor spaces, like the Huron River and Matthaei Botanical Gardens. If a fall or winter trip tickles your fancy, you will still find plenty to do. College football season runs from September to November, so that's a great time to visit if you'd like to catch a game at Michigan Stadium. In the colder months, spend time in Ann Arbor's many indoor museums or enjoying special holiday events, like KindleFest. Just remember to pack several layers of clothing for the bone-chilling temperatures of early spring – especially if you plan to spend time outdoors.", "College football is big Though Ann Arbor isn't strictly a college town, a general appreciation of football can go a long way. The University of Michigan Wolverines hold the title for the most all-time wins in college football history, so it should come as no surprise that school spirit runs high. Consider picking up a Michigan T-shirt or hat to commemorate your visit (unless, of course, your loyalties lie with Michigan State or Ohio State – the U-M's biggest rivals).", "Ann Arbor is LGBTQ-friendly This city prides itself on its inclusivity and celebrates the LGBTQ community with events throughout the year, from drag queen bingo nights to Ann Arbor Pride in August. Braun Court, an area of restaurants and bars in the Kerrytown neighborhood, is known as an LGBTQ hot spot, and Ann Arbor also has a number of Travel Advocacy Group-approved hotels. Kathy Kozachenko, the first openly gay elected official in the U.S., calls the city home.", "Look out for the fairy doors In the early 1990s, the first of Ann Arbor's fairy doors appeared as part of an art installation. Over the next two decades, more pint-sized portals into the fairy world (some not even affiliated with the project) began popping up at buildings downtown. See if you can spot them as you meander the city (hint: well-known locations include the Red Shoes home goods shop, Sweetwaters Coffee & Tea on Washington Street and Nicola's Books).", "Take advantage of free attractions Several of Ann Arbor's top things to do won't cost you a penny – especially if they are affiliated with the University of Michigan. Sites include the Museum of Natural History and Matthaei Botanical Gardens.", "Eat where the locals do Many hole-in-the-wall eateries are frequented by college students and therefore keep their prices reasonable to appeal to the masses. Take a break from chain restaurants and grab dinner at casual local gems like the NeoPapalis pizza joint or Chela's Restaurant & Taqueria instead.", "Walk, walk, walk Downtown Ann Arbor is a very walkable area. In fact, maneuvering and parking a car is often more hassle than it is worth. By getting around on your own two feet, you will not only get a better feel for the town but also save money that would've otherwise been spent on a rental car or taxi rides.  "]}