{"name": "Philadelphia", "description": ["With its rich historical heritage, Philadelphia is one of the United States' most visited cities. After all, both the Declaration of Independence and the United States Constitution were signed here in Independence Hall. Renaissance man Benjamin Franklin once called this city home. And before Washington, D.C. usurped its role, Philadelphia served as the country's capital. Yet the city is far from being stuck in its glorious past. The Philly of today is filled with notable museums, a bumping nightlife, beloved sports teams and a thriving restaurant scene that encompasses more than just the ubiquitous cheesesteak. Not sure where to start your visit? Sign up for a guided tour and let a local show you around.", "The best time to visit Philadelphia is from March to May, when the city thaws from the cold winter and moderate room rates can be found at the hotels. Plus, a spring visit will yield a burst of photogenic cherry blossoms around the city. Fall and winter are the coldest and cheapest seasons to visit the City of Brotherly Love (but with the possibility of snowstorms, you might want to look at some cheap travel insurance policies just in case). Peak season is the summer when multitudes of tourists swarm sites like Independence Hall and the Philadelphia Zoo.", "Nice neighborhoods sidle not-so-nice ones If you're planning on touring Philly by foot, make sure to carry a good map and be aware of your surroundings.", "America's birthday is crazy Unless you want to be enveloped in the crowds, festivals, fireworks and overall madness that define July 4, steer clear of Independence Day.", "Take a tour Whether you want an in-depth look at Philadelphia history or have a craving for the best cheesesteak in the city, there's a tour for you. We rounded up 16 of the city's best.", "Cash in on the free attractions Several of the most popular attractions, like the Liberty Bell Center, Independence Hall and Rittenhouse Square are absolutely free to tour. And for those that aren't, you can nab some impressive discounts by purchasing the Philadelphia Pass or Philadelphia CityPASS.", "Head to the theater for free or discounted tickets The Kimmel Center offers a series of free shows, and the Walnut Street Theatre often offers $35 standby tickets for same-day shows.", "Buy a SEPTA family pass If you're planning to rely on Philadelphia's public transportation system and you're traveling with a family, consider the SEPTA family pass. The $30 pass covers unlimited, one-day travel throughout SEPTA's system for up to five family members.", "Philadelphia is known for having a laid-back vibe and a very diverse and accepting atmosphere. It's not called the City of Brotherly Love for nothing. Philly is home to a huge number of ethnic neighborhoods and one of the largest gay communities in the U.S. In fact, one of the first gay rights protests in the country occurred outside of Independence Hall; the tourism board once had a \"Get Your History Straight and Your Nightlife Gay\" campaign. The local \"gayborhood,\" the heart of the community, sits in Center City in a block bordered by Chestnut, Pine, 11th and Broad Streets.", "While you're in town, be sure to step back and admire some of the city's unique collection of public art, including everything from sculptures to fountains to murals. Graffiti murals are sometimes commissioned in an attempt to make Philadelphia a \"museum without walls.\" The endeavor is a prime example of the city's well-known grassroots culture. Perhaps as a vestige of Philly's storied revolutionary history, residents here have a reputation for being very involved in their communities and local activities.", "Philadelphia's dining scene has experienced a culinary makeover in recent decades, with new dining establishments rapidly popping up all over the city. The pricier restaurants are concentrated around trendy Old City and Rittenhouse Square (Parc, The Dandelion and The Love are two relatively new favorites). Meanwhile, you can enjoy French, Indian and Japanese fare in Center City. Head to South Philly or Center City for simple Italian and farm-to-table cuisine (Talula's Garden is a hit with both critics and visitors).", "But no trip to Philly would be complete without tasting a soft pretzel or a Philadelphia cheesesteak. A hoagie-like sandwich made with thin slices of steak and cheese and often accented with onions, peppers and mushrooms, Philly's trademark sandwich is best experienced in South Philly. Recent travelers specifically recommend the area's Italian Market for your own customized cheesesteak, but Pat's King of Steaks and Geno's Steaks are also popular stops. Another great place to sample a variety of foods is the Reading Terminal Market.", "BYOB (bring your own bottle) establishments abound in Philly and can help keep you within budget, since you can pick up your own libations and take them to the restaurant. Call ahead if you're unsure about a certain establishment's BYOB policies.", "Although the main tourist areas of Philadelphia like Center City are generally safe, frequent travelers say other parts of the city (like South, North or West Philly) can be very dangerous. Use common sense during your stay: Keep your valuables near you (and preferably hidden from view) at all times. If you're unsure about how to get to a certain destination, take a cab or drive, especially at night.", "The best way to get around Philadelphia is by foot or PHLASH bus. Although some attractions like the Philadelphia Zoo require some other mode of transport, most sightseeing is centered in the Old City, Rittenhouse Square and Society Hill areas, all of which are very pedestrian-friendly. To get from Philadelphia International Airport (PHL) and around the city, you can use a tangle of trolleys, buses and subways. A cab ride from the airport to Center City costs a flat rate of $28.50. From March to December, you can also get around via the purple PHLASH buses. Hailing a cab is also an option, but the cost of the rides can add up quickly, or you can use a ride-hailing service like Uber or Lyft. And if you – like the majority of Philly travelers – come to the city by car, you should invest in a good map and be prepared for some driving and parking frustrations.", "If you're traveling to Philadelphia from a nearby city, you might want to take Amtrak into the 30th Street Station. For New York travelers, you'll save some money by taking a combination of New Jersey Transit and SEPTA trains."]}