{"name": "Pensacola", "description": ["For a dose of Southern culture in a tropical paradise, look no further than Pensacola, Florida. This Gulf of Mexico spot, which sits on the Florida Panhandle, is only about 15 miles from the Alabama border – and only a three-hour drive east of New Orleans, which means the friendliness and hospitality characteristic of the Deep South are found here. But Pensacola's powdery white sands and glittering emerald waters give its coastal attractions an almost Caribbean feel. ", "A fierce patriotism and love for the military are also of note here. And indeed, Pensacola's military presence can be felt throughout the area – including discounts for retired and active military members at some of the best things to do, such as the Pensacola Lighthouse, and at local restaurants and businesses.  ", "The best time to visit Pensacola is between mid-September and October when both spring breakers and family vacationers have departed the city, leaving the beaches, attractions and restaurants devoid of peak season crowds. The weather is still moderate this time of year, and the risk of hurricanes wanes, too. The late fall and winter months of November through February are considered low season, with temperatures and room rates dropping. Heavy crowds of students and families swarm the city and its beaches in early spring and summer, peak season, to take advantage of the prime beach weather. ", "It's home to the Blue Angels You'll see the Blue Angels, a U.S. Navy flight demonstration squadron, practicing aerobatics in the skies in their signature F/A-18 Blue Hornet planes.", "Rent a house with a kitchen Dining out will be one of the biggest expenses. You can mitigate those costs by renting accommodations with a kitchen, so you can cook your own food.", "Book in the offseason Room rates spike during late spring and summer when spring breakers and family vacationers flock to Pensacola. Book in late fall or winter to score a deal on your room.", "With its Gulf location, Pensacola's dining scene is understandably heavy on fresh seafood, and most restaurants plate local shrimp, oysters, flounder, grouper and more in casual, down-home settings. For instance, Just Fish and Grits is a no-frills spot that earns high marks from recent diners for its simple yet tasty dishes. Fisherman's Corner and The Fish House also receive rave reviews from recent travelers, as does The Oar House and Captain Joey Patti's Seafood Restaurant. ", "Pensacola also has its own hometown cocktail called the Bushwacker, and you'd be remiss if you didn't try one. You can sip this blend of coconut cream, Kahlua, dark rum, crème de cacao and milk at the Sandshaker Lounge, where it originated, or you can ask just about any bartender in town to mix you one. ", "As a souvenir, you should pick up some of Florida's Tupelo honey, sold in a number of local shops, as well as the Palafox Market. This market, which is open on Saturdays from 9 a.m. to 2 p.m. in downtown Pensacola on the Martin Luther King, Jr. Plaza, contains dozens of booths hawking local crafts and eats.", "The best way to get around Pensacola is by car, especially if you want to bounce between beaches and other top things to do on your own timetable. If you'd rather rely on public transportation, you can take an ECAT bus or seasonal trolley, which operates for free on Santa Rosa Island, but keep in mind that its routes and hours of operation are limited. Taxis are another option, but they're not the most affordable way to get around. ", "Many visitors to Pensacola make the drive from their hometowns to this spot on the Gulf Coast, but you can also fly into Pensacola International Airport (PNS), located about 5 miles northeast of the city center. A rental car or a taxi are good options for reaching your accommodations. "]}