{"name": "Monterey", "description": ["Monterey County is different from any other part of California. Here, time slows, the architecture is humble (with the exception of the homes in Pebble Beach), and the lifestyle is the perfect synthesis of SoCal laid-back and NorCal sophisticated. Colorful crops are displayed like jewels among the farm stands of inland Monterey—an area known to many as \"The Salad Bowl of the World\"—while farther south, Carmel-by-the-Sea dazzles with its air of easygoing opulence. Tremendous price tags on real estate help maintain the small-community atmosphere along Monterey's jaw-dropping coastline.", "This area makes for an ideal family getaway or a romantic weekend stay. And did we mention the golf courses? This stretch of the California coastline boasts some of the most coveted fairways in the world. Plus, it's a year-round whale watching destination that's also home to some of the best California tours. Add to that an abundance of natural wonders, luxury resorts and seafood restaurants, and Monterey might just be the perfect destination for your next vacation.", "The best time to visit Monterey is between April and early June. Spring offers warmer temperatures, fewer crowds and food festivals dishing out delectable eats, including Pebble Beach Food & Wine and the Artichoke Festival. Summer is the most popular time to visit the Monterey Peninsula, but be forewarned: Although the sun's rays are at their strongest, Monterey can still be chilly. Located right on the ocean, the region experiences nippy winds, so bring a sweater regardless of the season. Fall is another good time to visit, but the likelihood of rain increases starting in November. Monterey's central California location subjects it to mild temperatures during the winter, with the average low reaching 44 degrees. Winter also brings lower hotel prices and the celebrity-heavy AT&T Pebble Beach Pro-Am event held in February, making Monterey an attractive destination year-round.", "There is more than one golf course Of course, you want to play the famed Pebble Beach Golf Links. But lofty prices and high demand can make teeing up here challenging. The good news is Monterey has other equally stunning courses that are less expensive, including The Links at Spanish Bay.", "Inland Monterey is worth exploring Many people only consider hotel properties on the water. But hotels in the Carmel Valley – like the Bernardus Lodge & Spa – provide a taste of California wine country.", "Getting here can be expensive You can fly into Monterey Regional Airport (MRY), but tickets can be pricey. Look to fly into the San José Mineta International (SJC) or San Francisco International (SFO) and take a Groome Transportation shuttle down.", "Consider alternative lodging While the area is home to numerous boutique hotels and luxury resorts, you can typically save some cash by booking a vacation rental or a room at a bed-and-breakfast.", "Because of Monterey's location along the Pacific Ocean, fresh seafood is, of course, a staple on menus throughout the area. Old Fisherman's Wharf is often the first choice of those looking to sample Monterey's famous clam chowder, but, to break from the crowds and sample better seafood, walk one pier over to Municipal Wharf 2 for cheaper chowder and an authentic atmosphere. Serious seafood lovers will want to seek out Monterey Bay cioppino, a tomato-based seafood stew that is loaded with fresh finds and catches of the day, anytime it appears on a menu. You can find some great versions out in Moss Landing, just 20 miles north of Monterey, or at the many waterfront restaurants along Cannery Row.", "Don't miss the chance to sample local artichokes from Castroville or wine from the Santa Lucia Highlands while in town, and plan to rise early to stand in line with locals at the numerous Parisian-inspired patisseries that have recently opened in downtown Monterey. Head south to Carmel-by-the-Sea where a ban on chain restaurants has left room for mom-and-pop bistros and cafes to thrive. Those looking for a fine dining experience should book a table in advance while dining in Carmel, as the popular Michelin-star rated restaurants have a wait list a few weeks out."]}