{"name": "Mazatlan", "description": ["Mazatlán has a long history as a coveted beach escape, though often flying under the radar. The sidewalk cafes and scenic Malecón are just as busy as they were when film stars like John Wayne and Gary Cooper used to come to town. While this \"Pearl of the Pacific,\" as it is known, definitely experienced a low point in the 1970s and 1980s, those in the know have rediscovered the charms of the city. And locals support and enjoy the revitalization efforts of the Centro Histórico and the refurbished museums and theaters just as much as the tourists. You should do the same.", "Mazatlán may never be the celebrity playground that it once was (that distinction now belongs to Cabo San Lucas), and its beaches aren't quite as golden as Puerto Vallarta's gorgeous strip. But for that you can be thankful. Instead, this city has carved a niche for unpretentious travelers who want to enjoy the beach on a budget.", "The best time to visit Mazatlán is the fall, specifically October or November. The rainy months of summer are over, and the expensive, hectic winter travel season has yet to start. Beginning your search early is crucial; if you're lucky you could book a weeklong trip to Mazatlán for less than $700 per person (airfare, hotel and taxes included). You can also save a buck by visiting in April or May. ", "There's beer Mazatlán is known for Pacifico, a pilsner brewed right in town. You can order it in any area restaurant, or sample some on a brewery tour.", "There's fishing According to legend, John Wayne liked to sport fish in the Sea of Cortez. Even today, this is a nice area for deep-sea catches like blue and black marlin, dorado and swordfish.", "There's opera Mazatlán is the only coastal vacation spot in Mexico to boast an opera house. Check out the city's culture website for information on upcoming performances.", "Hail an taxi instead of a pulmonia Catching a ride on one of those open-air golf carts (the pulmonias) is a must-do when going to Mazatlán, but they do cost more than the regular taxis. ", "Mazatlán, located on the Central Pacific Coast, is one of the closest Mexican beach resort destinations to the United States. While it is very much a tourist hot spot, it still retains its Mexican traditions and atmosphere, offering a laid-back vibe. When it comes to dress code, keep in mind that standard beachwear is permissible during the day; dressy casual is preferred for dinner hour and in nightclubs.", "Many workers in Mazatlán's tourism industry speak English, but it is both helpful and respectful to know some basic Spanish vocabulary, such as \"hello\" (hola), \"goodbye\" (adios), \"please\" (por favor), and \"thank you\" (gracias).", "Matzatlán's official currency is the Mexican peso, though U.S. dollars are usually accepted here as well. You're better off converting your cash to pesos, however, as you'll get a better price for your items if you pay in pesos. Typically, the best place to exchange your dollars to pesos in Mexico is at a local bank. The U.S. dollar to peso exchange rate varies, so be sure to confirm the rate before you go.", "Located in Sinaloa on Mexico's northwest side, Mazatlán's surrounding area has been plagued with narcotics-related crime. Currently, the U.S. Department of State has issued a Level 4 Travel Advisory for Sinaloa, advising travelers not to visit the state. Visit the State Department's website for more information before you travel.", "As a seaside town, Mazatlan features seafood, especially shrimp, on many of its menus. Try fish tacos, ceviche and fresh fish cooked in any number of ways. Wander through the historic district to see what food carts or outdoor cafes catch your eye.  ", "La Costa Marinera is a popular spot in the Golden Zone, known for its coconut shrimp. El Presidio Restaurant, in the historic district, is another well-reviewed spot, both upscale and romantic. Locals also love Claussen Restaurant, located on the waterfront, which is known for its ceviche. If you still can't decide, ask a local for some tips.", "As for drinks, Pacífico Beer was launched here, so you'll see lots of it on menus, as well as michelada, a drink composed of beer, tomato juice, lime and spices.", "The best way to get around Mazatlán is by car or bus. While you can navigate Old Mazatlán and its neighboring attractions on foot with relative ease, getting to other attractions (such as Playa Brujas) will require wheels.", "Luckily, you won't need to rent a vehicle of your own. The city has ample eco-taxis (which are regular sedans) to take you to where you need to go. Fares vary depending on where you need to go, but fares cost around 100 pesos (about $4) for a single ride. Alternatively, you can take one of the iconic pulmonias. These open-air golf carts provide a unique way to get to your destination, but are generally more expensive than a regular taxi as there are more upkeep costs for drivers.", "Alternatively, you can take the bus. Mazatlán's bus system covers many of the top sights in the city, including the Golden Zone and El Faro. Fares are much less expensive at around 8 pesos (about $0.33). Know that the buses aren't as tourist-friendly as other transportation options, so you're better off knowing some Spanish to navigate your way around. Before you set off, check with your hotel for an updated bus map.   ", "Mazatlán International Airport (MZT) is serviced not only by Aeromexico but also carriers like American and Alaska. The airport is around 14 miles west of the city's historic center. You can rent a car from the airport or hop in a taxi to get to your hotel. Visit the airport's website for more information.", "Mexico does not require U.S. citizens to obtain a visa if visiting Mexico for less than 180 days. However, citizens must carry a valid passport book if arriving by air; travelers with only a passport card may be denied entry to Mexico if arriving by air. Visit Mexico's National Institute of Migration website for more information."]}