{"name": "Santa Barbara", "description": ["In the early 20th century when Flying \"A\" Studios opened its doors, Santa Barbara was slated to become the epicenter of America's movie-making industry. But the movie stars moved south to Los Angeles, and today's Santa Barbarans wouldn't want it any other way. On the \"American Riviera,\" Santa Barbara aspires for a casual, yet fashionable elegance. Just take a look at the well-dressed pedestrians on State Street to comprehend the city's understated indulgence. Oenophiles will particularly appreciate Santa Barbara's proximity to the Santa Ynez Valley, which is speckled with vineyards. Explore the local wine scene with one of Santa Barbara's best wine tours.", "Though Santa Barbara is often associated with Montecito, its celebrity-studded, leisure-loving neighbor, Santa Barbara is much more attainable for the average vacationer. After all, some of America's budget-friendly favorites – like Motel 6 and the McDonald's Egg McMuffin – have their origins here. Plus, with its abundance of colleges and universities, including the University of California–Santa Barbara, the city appeals to a student budget. You can certainly splurge, especially at the area's luxurious resorts, but a robust budget isn't a prerequisite for a vacation here.", "The best time to visit Santa Barbara is from March to May or from September to November. Temperatures are fairly mild year-round, hovering in the 60s and 70s, but traveling in early spring or fall ensures you won't be fighting crowds and rates will be less expensive. Summer welcomes most of the city's annual events and it's also peak season if you're looking for a beach vacation, but you'll have to contend with more crowds. If you're traveling during the winter months, make sure to pack an umbrella because Santa Barbara sees most of its rainfall between December and February. No matter when you decide to visit, pack layers as the morning and late evening temperatures tend to be much cooler than the daytime highs. ", "SB is for active beachgoers There is almost always something happening on one of Santa Barbara's beaches, whether there's an art walk or a volleyball game on East Beach. Join in the fun and rent a bike or surfboard at a beachside shop.", "Consider a whale watching tour If you're visiting Santa Barbara in the winter, sign up for a whale watching cruise if you're hoping to spot the variety of species that pass through Santa Barbara's nutrient-rich waters. ", "Pack layers You may be at the beach, but that doesn't come with a sunny guarantee. The mornings are usually foggy and cool until the afternoon, when the clouds leave, and temperatures rise.", "Enjoy the freebies Some of Santa Barbara's best things to do, including East Beach, the State Street Promenade, Stearns Wharf and the Santa Barbara County Courthouse, do not charge admission fees. ", "Sample the vino Santa Barbara Compared to its northern neighbors like Napa Valley and Sonoma, Santa Barbara offers oenophiles the chance to enjoy area wineries at a fraction of the cost. Most tasting fees start at $15 to $20. For help navigating the region's vineyards, consider signing up for one of the best Santa Barbara wine tours.", "Snack at farmers markets There is no shortage of farmers markets in Santa Barbara, so grab a fresh snack from local growers and artisans while strolling downtown. Top spots for picnics include the Alice Keck Park Memorial Garden, East Beach and Old Mission Santa Barbara.", "Fresh local produce is a staple in Santa Barbara, thanks to a climate that's conducive to a year-round growing season. While you're walking downtown and along the waterfront, you're likely to run into multiple farmers markets, but for the ultimate experience check out the Public Market.", "With its beachfront location, some of the most popular restaurants in town, including The Hungry Cat and The Lark, have seafood prominently features on their menus. If fish isn't your thing, try some of the artisan California-Italian cuisine at places like Olio Pizzeria. For a more romantic setting with views of the ocean, reserve a table at Toma.", "No matter what cuisine type you choose and where you decide to dine, you're sure to find an extensive wine list. Santa Barbara County is known for being part of wine country. Just a short drive outside the city and you'll find an abundance of small vineyards and wineries that inspire the local cuisine. If you'd like to enlist the help of a local, sign up for one of Santa Barbara's best wine tours. While you're in town, check out the area known as the Funk Zone, where you'll happen upon several wine bars and art galleries. ", "The best way to get around Santa Barbara is on foot. Most of the main attractions, shops and restaurants are all located within a 3-mile radius in the downtown area. Santa Barbara is also known for its green transportation options and car free program that provides walking maps and alternative means of transportation like the various bus and shuttle systems around the city.", "To get to Santa Barbara, there are a few options. The closest major airport is Los Angeles International (LAX), about 90 miles southeast of the city. Santa Barbara also has a regional airport (SBA) that receives flights from a few major airlines through a handful of major cities, including Phoenix, Las Vegas, San Diego, San Francisco and Dallas, among others. Amtrak also runs two routes through Santa Barbara. The city is also relatively easy to get to by car, too, since it's right off the U.S. Highway 101, also known as the Pacific Coast Highway.", "No matter which mode of transportation you take to get into town, whether it be bus, train or car, the public transportation station and the Pacific Coast Highway run right through downtown."]}