{"name": "Mykonos", "description": ["Nothing says \"Greek island\" more than the cube-shaped buildings and whitewashed exteriors of Mykonos. Winding roads twist through the main city center of Chora, past well-appointed storefronts and minimalist Orthodox churches that give the island a grounded sense of tradition. But Mykonos is far from conservative – known for its hedonistic beach parties and vibrant nightlife, in the \"Ibiza of Greece,\" you're never far from a rave-up.", "Beyond the bar and club scene, Mykonos' silky sand beaches are the biggest draw. Vacationers come to see and be seen – at times in the nude. This laissez-faire attitude particularly appeals to those who love a ruckus; Psarou and Paradise beaches start jumping early in the afternoon and don't clear out until sunrise. Don't worry, early birds, there are also plenty daytime sights like the Cycladic-style buildings of Chora, the windmills of Kato Myli and the ancient ruins of Delos. Here, you'll discover the perfect Greek mix of sophistication, relaxation and jubilation. As the Greeks say, \"Live your life!\"", "The best time to visit Mykonos is September and October. Sitting in the Aegean Sea, this island's weather permits a year-round flow of tourists, but in September and October you'll see that the large crowds have left, the water remains warm and the hotel rates descend back into a reasonable range. The spring, before the summer rush comes, is also a great (and affordable) vacation time. Mykonos experiences a typical Mediterranean winter: mild with temps that dip to the mid-50s. June, July and August are especially busy; temperatures average in the upper 70s and 80s, and there are nonstop parties and pricey hotel rates.", "How to eat like a Greek Greeks eat dinner much later than Americans – as late as 10 p.m. Oftentimes, they'll only have a snack at lunch to save room for a gigantic supper that can easily last more than two hours.", "How to dress like a Greek Attire is beach casual at most places, but be sure to dress more conservatively at religious sites and gussy up for the nightlife.", "How to get around like a Greek Mykonos residents are used to walking most places, so buy yourself a sturdy pair of sandals or rent a moped to ride into the sunset. ", "Limit your alcohol consumption It's not uncommon for restaurants, bars and clubs to charge around 20 euros (about $22) per alcoholic beverage, especially at a bar with a view. If you wish to imbibe (and certainly try Greek ouzo), purchase alcohol at a local grocery to enjoy in your accommodations. Note that in Greece, you must be at least 18 years of age to purchase alcohol or drink in public.", "Consider a shoulder season trip Winter is Mykonos' slowest tourism season, so you'll find the best deals during this time. Keep in mind that some of the island's cultural attractions will operate on limited hours during the colder months. Shoulder season (spring and autumn) will also give you better value than Mykonos in the summer.", "Shop elsewhere Mykonos' stores cater to its wealthy clientele and carry overpriced items and clothing. If you must, purchase a souvenir. But save your heavy-duty shopping for the mainland.", "Bring your own beach towels and umbrellas Make a picnic out of it! Renting beach chairs and umbrellas can get exorbitant, especially from June to August. The price ranges between 15 euros (about $16) to more than 75 euros (around $83) per person in high season. Bring your own gear and find a free beach to sunbathe and swim at. Although know that for Greeks, renting a deck chair and umbrella is common practice and included in one's beach budget. ", "Rent a scooter or ATV If the bus route or schedule is not convenient for you, getting your own wheels for $30 to $35 per day will save you the taxi fare, which hovers at $35 per ride.", "The official language on Mykonos is Greek. However, because it is such a touristy island, you will be fine speaking English. If you have trouble communicating or getting around, you'll find locals are generally patient and willing to help you find your way or overcome the language barrier.", "Remember that Mykonos is a liberal, LGBT-friendly island, and you might encounter topless swimming and sunbathing, or full on nudity in some designated beaches. Do your research before getting naked, or getting offended.", "Drinking on the streets is permitted in Greece, but locals view it unfavorably; the same goes for getting drunk in public. For Greeks, having fun is important, so is respecting yourself and others – so enjoy yourself by all means, but keep it under control.", "The official currency is the euro. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards and mobile payments are accepted at most restaurants and shops (though few may accept paper money or coins only). When eating at a restaurant, a service charge may be included. ", "Cuisine in Mykonos is unsurprisingly heavy on seafood, yet it does ooze with Greek flavors. Olive oil and olives are featured in many dishes. They serve to enhance the fresh local cheeses and produce, which are also heavily represented in Mykonos restaurant menus. On the more casual end, street vendors sell gyros, or Greek sandwiches, which are also relatively inexpensive.", "Unfortunately, it's all too easy to find mediocre food in Mykonos, which nonetheless costs a lot. To find the best options, experienced travelers suggest following the island's residents to a taverna – a small and casual restaurant – for authentic Greek cuisine (Kiki's Tavern is frequently mentioned). Little Venice is a popular option for those looking to grab a bite to eat. ", "Take general precautions in Mykonos and it'll be unlikely that you will encounter any problems. Two quick tips: Don't leave any of your possessions unattended on the beach, and be extra cautious if exploring the Mykonos nightlife solo.", "The best way to get around Mykonos is the bus – the island has a system that connects many towns and attractions. Motor vehicles are banned in Chora, so everyone gets around on foot. We advise against renting a car if you're staying in town – they're expensive to rent, and parking is a pain. However, if you're staying outside Chora and don't plan to come into town much, it could make sense. Taxis are available, but expensive; however, you might consider using one to get to your hotel from Mykonos International Airport (JMK). Many travelers arrive via ferry to the Mykonos New Port from other Greek islands or the mainland.", "U.S. citizens traveling to Greece will need a passport with at least six months remaining validity. Visas are not required for stays less than 90 days. Visit the U.S. Department of State website for more information."]}