{"name": "Washington, D.C.", "description": ["With its marbled monuments and high-profile politicos, Washington, D.C., has long been saddled with a reputation as a stuffy government-driven town. A \"city of southern efficiency and northern charm,\" as John F. Kennedy once described it, Washington is often seen by outsiders as slow and inefficient. But these days, our nation's capital is awash with a new energy, transforming itself into an exciting, faster-paced East Coast vacation destination. Although the government is still the sun around which this city orbits, the District also offers a host of renowned museums and interesting neighborhoods. And with an explosion of restaurants, cafes, boutiques and clubs, D.C. has become a thriving cultural hub. ", "You can choose a traditional D.C. adventure, filled with tours of classic attractions like the White House and the Washington Monument, the U.S. Capitol and the Smithsonian National Museum of Natural History. And there's no better way to experience iconic D.C. than with a stroll around the Tidal Basin. (Plan to visit in late March or early April – just in time for the National Cherry Blossom Festival – and you'll be rewarded with a canopy of beautiful pink blooms.) But if you've already seen the national landmarks, get a feel for the city's more youthful ambiance, highlighted by its urban neighborhoods, marquee art galleries and vibrant farmers markets. While you'll only need a few days to see the city as you know it from your history book, it could take months to experience the Washington that today's locals know and love. ", "The best times to visit Washington, D.C., are from September to November and March to May. In the autumn, the sweltering summer is gone, taking with it most of the high season tourists. All that's left are crisp breezes and changing leaves, which, by the way, look great against all those marble monuments. Second to fall is spring, which is also a mini high season thanks to the National Cherry Blossom Festival in late March and early April. Summer in D.C. is hot and sticky, making less than ideal conditions for exploring the great outdoors. That said, many museums blast air conditioning, so if you can stand the heat, you'll find plenty of free attractions to keep you entertained. Winter is definitely low season. Although the chance to find lower hotel rates is high and the weather is mild compared to other destinations along the East Coast, the city is prone to freezing cold temperatures and snowstorms. For this reason, travel insurance is recommended for anyone planning a winter visit to D.C.", "Make restaurant reservations in advance Popular dining establishments tend to fill up quickly, so ensure your place by making a dinner reservation on OpenTable weeks ahead of time.", "Walk or take public transit – don't drive Metro trains and buses can take you anywhere you want to go without the hassle of fighting your way through D.C.'s congested streets.", "Stroll the markets D.C. hosts several weekend markets where you can get a feel for the local art and culinary scene. Check out Eastern Market and the vibrant markets in the Dupont Circle and Columbia Heights areas.", "Take a tour Whether you want to bike or bus around the monuments, or taste your way through Georgetown, there's a tour for you. We rounded up all of the city's best tours.", "Visit the Smithsonians Admission to this magnificent host of museums – and the Smithsonian's National Zoo & Conservation Biology Institute – is free, making it a very economical option for visiting families and solo travelers. The Castle, the institution's national headquarters, serves as an excellent starting point for gathering additional information about each Smithsonian outpost.", "Check out the U.S. Capitol Get in touch with your congressman and schedule a free tour of the U.S. Capitol. While you're at it, saunter over to the Library of Congress' three iconic buildings, which are also free to enter Monday through Saturday.", "Skip the street vendors These kiosks provide overpriced (and mediocre) drinks and treats. Bring your own water bottle and snacks while touring the National Mall's monuments and museums.", "The District has long attracted lobbyists, petitioners, history buffs and power players, but these days it's growing a diverse population thanks to its resurging neighborhoods and unfolding restaurant, shopping and nightlife scenes. The city also beckons to people from all parts of the country and places around the world due to its high-power jobs and universities.", "During your time in the nation's capital – regardless of whether you're a D.C. transplant or tourist – there are certain unspoken customs to follow. For example, if you don't want to stick out as a visitor while using the metro, remember that the right side of the escalator is for standing; leaving the left side open for those who want to hurry up or down.", "D.C. also has deep roots in black history and the civil rights movement. Since the Revolutionary War, the city has always had a large black population, as freed slaves from the Upper South would move here to find work. This has since influenced much of Washingtonian culture, as people like Frederick Douglass and Duke Ellington both called D.C. home. Ellington was a major player in shaping the city's music scene, playing jazz in venues along the U Street Corridor. Several attractions, including the Smithsonian National Museum of African American History & Culture and the Martin Luther King, Jr. Memorial, also pay homage to the city's civil rights ties.", "A variety of music, art, nature, food and cultural festivals take place throughout the year in and around the District. For an up-to-date list of current events taking place in the city, consult the DC Cool page of Visit DC's website.", "As the epicenter for American politics and nonprofits, Washington, D.C., attracts a diverse clientele – and the restaurant scene reflects this melting pot of ethnicities and cultures. Wander the streets of Georgetown and Dupont Circle and you'll find plenty of interesting eateries, from white tablecloth restaurants to trendy tapas joints plating everything from zesty Spanish bites to succulent oyster shooters. Or, head to the U Street Corridor or Florida Avenue, where you'll discover some of the district's best Black-owned dining establishments, including Ben's Chili Bowl and Oohh's & Aahh's on U street, and Florida Avenue Grill and HalfSmoke on Florida Avenue. Additionally, a strip of ethnic restaurants on H Street Northeast in the Atlas District offers Belgian fare, Japanese cuisine and more. For a crash course in the city's varied dining scene, consider booking a guided tour.", "The city also appeals to gourmands who revel in haute cuisine. For a sophisticated meal at a high-end restaurant, try José Andrés' collection of restaurants, including Zaytinya, Oyamel Cocina Mexicana and minibar by José Andrés. If you'd rather get a traditional taste of Washington, make reservations at tried and true spots like Old Ebbitt Grill and 1789.", "Farmers markets have also become a major staple in the district. On any given Saturday or Sunday, you'll find Washingtonians perusing the stalls for healthy and organic fruits and veggies at colorful markets. Local favorites include FRESHFARM's market in Dupont Circle, Eastern Market and Union Market. At these bustling markets, you can pick up everything from pickles to sweet peaches to buttery pastries. Breweries and brewpubs have become a popular mainstay here, too, and a trip to the nation's capital wouldn't be complete without enjoying one of the best brunches the city has to offer.", "While you probably will not encounter any major crime as a tourist in D.C., it is still wise to be vigilant when exploring the city. Use common sense when walking around – avoid quiet side streets, especially when you are alone or don't really know where you are going, and be sure to keep your purse and wallet secure. Travelers should be particularly wary in the Capitol Hill, Atlas District and Southwest areas at night.", "The best way to get around Washington, D.C., is via the clean, safe and efficient Washington Metropolitan Area Transit Authority (WMATA) public transportation system. Most travelers (and residents) use a combination of the Metro trains, the buses and their own two feet to get around. You can even take a Metro train or bus into the city from the closest of the area's three airports: Ronald Reagan Washington National Airport (DCA) in Arlington, Virginia. Renting a car isn't advised; D.C. is regularly ranked as one of America's worst cities for driving. If you must have your own wheels, you should primarily keep them parked at your hotel. You can also traverse the capital city by taxi, but it'll cost you.", "In addition to Reagan Airport, Washington, D.C., is serviced by Washington Dulles International Airport (IAD), located about 31 miles northwest of the city. Another airport, Baltimore/Washington International Thurgood Marshall Airport (BWI), sits just south of Baltimore. The best way to get from Baltimore/Washington Airport into the city is to take a MARC Train from Union Station. For travel between Reagan Airport and D.C., plan on taking the Metro. And to get to the city from Dulles Airport, use the 5A bus or ride the Silver Line Express Bus to the Silver Line's Wiehle-Reston East station before transferring to a Metro train. Taxis and rental cars are available from all airports."]}