{"name": "Moco Museum Amsterdam", "description": "Dedicated to modern art, contemporary art, and street art, this independent museum in Amsterdam's Museumplein is a favorite amongst the youth.", "category": "Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Moco Museum Amsterdam"], "hours": "9:00 AM - 9:00 PM", "duration": "Duration: 1-2 hours", "address": "Honthorststraat 20 Next To Van Gogh Museum, 1071 DE Amsterdam The Netherlands", "neighborhood": "Neighborhood: Museum Quarter (Museumkwartier)", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Unexpectedly one of the best art museums in Amsterdam!", "review": "The museum was full of surprises. We loved all the exhibition rooms, which are all different. Kids loved learning about Banksy, KAWS, Hirst, Kusama - list goes on and on. The interactive outdoor garden was great too. 3D component through the app is a delight. I recommend visiting Moco 100% when in Amsterdam!", "rating": 5.0, "visited": "September 2023"}, {"title": "Great exhibition", "review": "Exhibition was great. Loved all the modern art and installations that we saw but unfortunately it was so unpleasantly hot in the house with the unseasonably hot weather and no effective cooling system, that we didn’t spend as much time as we would have liked there. Thought provoking art there certainly.", "rating": 5.0, "visited": "September 2023"}, {"title": "Amazing! A Must-Visit!!", "review": "The best modern Art and most thought provoking! The contrast of hosting location being in the very traditional building and the hosted art being the most forefront of our society today, highlight the long lasting effect Art has on us. In Art We Trust! We need more Moco in the world!", "rating": 5.0, "visited": "October 2023"}, {"title": "small museum but worth a visit", "review": "Small but great exposition of some wonderfull art. Great collection. In the basement some great surprises. Especially the lights in the last room on the right caught my attention. Giftshop is a bit expensive though.", "rating": 5.0, "visited": "September 2023"}, {"title": "Cheerful museum in Amsterdam", "review": "I love it. Made me smile see all artworks especially Banksy. Highly recommended. May need to book in advance. It was queue when I got in and the Dutch building is a big house but it’s gorgeous.", "rating": 5.0, "visited": "September 2023"}, {"title": "Vibrant and colourful exhibits", "review": "Did not plan to visit but came out of Rijksmuseum and saw there was no queue as walked past & it was included on our I Amsterdam card. Worth the stop, interesting, colourful and totally more so than I’d expected. If you have the city card then worth stopping off at.", "rating": 5.0, "visited": "October 2023"}, {"title": "Rare, Like Rocking Horse Sh#te", "review": "Art is in the eye of the beholder, from the reviews I get it that some may not like it, but we’ve visited a lot of galleries- seen the headline acts and this wee museum did not disappoint. Yes some exhibits I don’t understand, NFT’s, but others I can certainly appreciate, I try to keep an open mind on art and try - as Public Enemy say “Don’t Believe The Hype”. I can appreciate the artist’s message, their thought and the presentation within this gallery. There were some highlights, I was pleased to see, and found the descriptions provided by the gallery entirely adequate. My “Higher Art” (one for the Scots readers’) teachers would be proud, I’m sure. If you’re looking for still life paintings, or fine portraiture this ain’t for you, but there were plenty happy faces around, plenty people taking their time to take in the art to say good on you Moco… AND, oh and there’s a huge rocking horse to climb up on and get a photo taken!", "rating": 5.0, "visited": "October 2023"}, {"title": "Great, intimate museum", "review": "I really enjoyed this museum. It was easier to reserve a ticket here, compared to other museums in Amsterdam, but that’s not the only reason to visit it. When I was there, I saw a wonderful Banksy exhibit, and many other great artworks. I also appreciated the digital art exhibit as well as the outdoor sculptures. Highly recommended!", "rating": 5.0, "visited": "July 2023"}, {"title": "Modern art gem", "review": "A fantastic museum, well worth a visit. Full of contemporary artwork, beautifully collated and displayed. The building itself is lovely and leads you through the different works of art seamlessly. I haven’t been anywhere like it, it was all very intimate in its display. Staff were friendly and helpful too.", "rating": 5.0, "visited": "December 2023"}, {"title": "Enjoyable Modern Art Museum", "review": "This is an excellent modern art museum with a varied collection. It’s housed in a an older building, which creates a fun and interesting contrast to the modern art (the building was unexpected, as in our experience most modern art museums are modern buildings, themselves). Would highly recommend. It’s a smaller museum, so don’t expect to be spending multiple hours here. But even so, it exceeded our expectations and made for an enjoyable visit.", "rating": 5.0, "visited": "January 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/c2/a0/36/digital-immersive-art.jpg"]}
{"name": "Madame Tussauds Amsterdam", "description": "Pose beside the wax figures of a bevy of international stars, world leaders, and Dutch household names like King Willem-Alexander and Johan Cruyff.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Madame Tussauds Amsterdam"], "hours": "10:00 AM - 8:00 PM", "duration": "", "address": "Dam 20, 1012 Amsterdam The Netherlands", "neighborhood": "Neighborhood: Burgwallen-Nieuwe Zijde", "rating": 0, "getting_there": ["Nieuwmarkt • 8 min walk", "Centraal Station • 10 min walk"], "top_reviews": [{"title": "Pictures bad quality!", "review": "Nice wax statues but the pictures they made from our family are totally unacceptable!!! All pictures are too dark, not sharp and some people are cut and are shown half. POOR QUALITY AT ALL! So €20,- in the garbage!! Advice: Renew your apparatus and train your staff.", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing experience. The best place to make nice pictures", "review": "Amazing experience! Very friendly attitude from the whole team from the beginning till the end of visit. I visited it by myself , but still was a lot of fun. I was planning to visit it just for 1 hour, but as it has a lot to do , it took me more time . So put nice clothes, don’t bring heavy stuff with with you, because there is no locker or wardrobe , and enjoy it . And one more advise , don’t put green color clothes, if you want to make a lot of pictures on special rooms , like the famous stands with Amsterdam signs , Van Gogh portrait . Because you will get a shadow on the photo. But at least for video with charly Chaplin works everything, as it black and white. You can have some nice coffee or beer in karaoke bar inside. Special thanks for Cheyen. Don’t loose this museum if you are in Amsterdam ;)", "rating": 5.0, "visited": "October 2023"}, {"title": "Visiting Madame Tussauds in a wheelchair", "review": "I was most impressed by the kindness of all the staff there, particularly Rob, thanks to whom Christopher, who is in a wheelchair, was able to use the staff lifts to get to the various floors. We had a most enjoyable visit indeed. So glad we got photographs taken - a lovely souvenir to take back to France with us on 14th December. Thank you all for such a lovely experience.", "rating": 5.0, "visited": "December 2023"}, {"title": "Fantastic fun.", "review": "A visit to Madame Tussauds is a very fun time spent in great company. You get to have fun, laugh and take lots of cool photos with famous people and more. If you take 2 hours and visit this magical place, you definitely won't regret it. Definitely recommended.", "rating": 5.0, "visited": "May 2024"}, {"title": "Great experience!", "review": "I very much enjoyed visiting Madame Tussauds last week! I especially liked the interactive parts (photos and videos) organized by the museum. I would recommend this visit to outgoing people who like celebrities", "rating": 5.0, "visited": "May 2024"}, {"title": "Disappointment", "review": "The museum experience was good, but I think the museum is not the same to be exaggerated. There is a high fee to buy digital copies of the photographs at the exit of the museum. The museum fee is appropriate, but paying such a high fee at the exit of the museum spoils the whole ambiance. Also, although some videos were taken inside the museum, only photos were shared for a fee. Unfortunately, considering the whole experience and our expenses, I can say it was a bad experience.", "rating": 5.0, "visited": "June 2024"}, {"title": "Definitely check Madame Tussauds Out. We were glad we did.", "review": "Had a lot of fun during the tour. If you have been to a Madame Tussauds, remember they are all different regarding who is featured in the museum. Worth visiting and letting loose with the fun things you can be a part of in the museum. You'll see what I mean. Go & Have A Fun Filled Time.", "rating": 5.0, "visited": "May 2024"}, {"title": "Great Place. Had a good couple of hours with the family.", "review": "Very well planned, lovely layout and great staff as usual. If it is your first visit, then definitely a must see at Amsterdam.. If you've seen the others in London or the US, this exhibit is definitely smaller.. so just be prepared with your expectations.", "rating": 5.0, "visited": "July 2024"}, {"title": "Always A Good Time", "review": "It’s my mission to visit every Madame Tussaud’s on the planet and this was a very good one! Some figure are old and slightly out of date and some are brand new and excellently crafted. It’s always interesting to see which ‘areas’ each museum has and this one was excellent. Lots of immersive activities as well scattered around which you don’t always see. Very reasonably priced I thought at about €25 each. We went late afternoon on a weekday and it wasn’t busy at all. Would recommend.", "rating": 5.0, "visited": "July 2024"}, {"title": "Having fun interacting with the wax figures at Madame Tussauds", "review": "We had never been to a Madame Tussauds before, but were pleasantly surprised. My Mum was reluctant to go in thinking there were probably better things to do in Amsterdam, but she was soon into it interacting with the wax models. Definitely fun and a great thing to do. Pretty life like figures and some fun ones to interact with.", "rating": 5.0, "visited": "April 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/35/41/96/vincent-van-gogh-is-waiting.jpg"]}
{"name": "Herengracht", "description": "", "category": "Bodies of Water", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Herengracht"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Grachtengordel-West", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/5b/e9/48/caption.jpg"]}
{"name": "Amsterdam Museum", "description": "Over the next few years, our main location at the Burgerweeshuis on the Kalverstraat will be undergoing renovation. In the meantime, we can be found at Amstel 51, online, and at other locations in Amsterdam.", "category": "History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Amsterdam Museum"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Amstel 51, 1018 EJ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 3 min walk", "Weesperplein • 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/6d/ff/30/amsterdam-museum-aan.jpg"]}
{"name": "Centraal Station", "description": "Completed in 1889 and located in the heart of town, this neo-Renaissance rail station was designed by P.J.H. Cuypers, the same person who designed the famous Rijksmuseum.", "category": "Points of Interest & Landmarks Architectural Buildings Public Transportation Systems", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Centraal Station"], "hours": "", "duration": "", "address": "Stationsplein, 1012 AB Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Centraal Station • 1 min walk", "Amsterdam Centraal Station • 2 min walk"], "top_reviews": [{"title": "Convenient location in the city center", "review": "Our acquaintance with the city began from here. The building has its own long history. In the very center, quite convenient transport interchange. The Centraal Station building is one of the architectural landmarks of the city. It was built in 1889 by the architect Peter Kuipers. By the way, he designed the Rijksmuseum building. Both buildings are very similar to each other, but are located at opposite ends of the historical center of Amsterdam.", "rating": 5.0, "visited": "December 2023"}, {"title": "Main transportation hub", "review": "Centraal Station is busy, noisy, hustling and bustling with energy but surprisingly efficient. The signage to the trains and metro lines are very easy to flow, the ticket checkpoints work like a charm (charge directly to your credit card, use ApplePay, or IAmsterdam card). There are long walks from one metro line to another on occasion, but noting to worry about. The station is very clean and has plenty of places to grab a snack.", "rating": 5.0, "visited": "October 2023"}, {"title": "A Modern Transport Hub in an Attractive Old Shell", "review": "Lovely iconic building in central Amsterdam. A good point for bus and train connections. Nice to view across the water. There's plenty of shops, eateries and luggage storage and plenty of information boards. A modern hub in an old shell.", "rating": 5.0, "visited": "September 2023"}, {"title": "Similar to another creation by Pierre Cuypers- the Rijksmuseum", "review": "On this visit, like the previous one, I went straight from the train station to the Rijksmuseum and experienced deja vu. These buildings are so similar. This is not surprising, because they were built by one architect Pierre Cuypers, and in parallel. The municipality chose the places for construction from two options. The second was Leidenplein. The current building, built in 1889, separated the city from the harbor, which many did not like, because it contradicted the history and spirit of Amsterdam. Now, instead of ships from the Dutch West Indies, America and Japan, trains arrived here. At the same time, the station itself was built on an artificial island of 8,700 piles, which is not surprising for the Netherlands. There are 6 platforms at the station from which 150 thousand passengers leave and arrive daily (in 2019 there were 213 thousand). At the same time, Amsterdam station is only the second in the country in terms of traffic, second only to Utrecht. Needless to say, the station is very convenient inside: cafes, shops, escalators. Everything is like at all major railway stations in the country. ..", "rating": 5.0, "visited": "May 2023"}, {"title": "fantastic station! 🚂", "review": "Really pretty railway station, steeped in history. Great for the history nerd, train spotter or anyone who is fascinated in architecture. Has an array of shops, toilets, and the concourse is busy but always moving due to the open space", "rating": 5.0, "visited": "February 2024"}, {"title": "Good to visit at both day and night time", "review": "It's good to visit with friends. It's looks beautiful in the night as the lights reflect off the water. The air is also fresh and refreshing alongside the river. You can visit with friends at night and have drinks along side the shore.", "rating": 5.0, "visited": "November 2023"}, {"title": "A vibrant city", "review": "We got there pretty late in the afternoon. It was dark already when we took a train from airport hotel to downtown. We can feel the Christmas atmosphere. Tourist boat in the canal is running. A public event was ongoing near the Centraal on Palestine human right. It is such a vibrant city.", "rating": 5.0, "visited": "November 2023"}, {"title": "Very Impressive Building", "review": "A very impressive station building dominating the area at the end of the Damrak. It’s close to the cruise terminal, with transport links via trams, canal boats, ferry boats, and Eurostar trains too. It was extremely busy and once outside, the cyclists rules do take care as their speeds are impressive if not dangerous!", "rating": 5.0, "visited": "May 2024"}, {"title": "Essential to this Country", "review": "We passed through this big busy train station many times. The Netherlands is famous for excellent public transport, so there are trains everywhere. In Amsterdam they arrive at this big station, which can be very crowded and chaotic. Many of the city trams come here. It is not pretty, but it functions well and is essential.", "rating": 5.0, "visited": "June 2024"}, {"title": "Central Station Amsterdam", "review": "A visit to Central Station in Amsterdam is an automatic for those traveling to or from the airport by train. We found the train station lovely as well as easy to use the tap to pay method to get to where we wanted to go by train. Amsterdam is very walkable, so once out of the train station, it only takes a few minutes to get out of the hustle and bustle of the city before you're wandering through the quiet canals.", "rating": 5.0, "visited": "July 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/dc/55/b6/centraal-station.jpg"]}
{"name": "Molen Van Sloten", "description": "The Sloten Windmill is a functioning draining mill and at the same time the only windmill in Amsterdam which is open daily to the public. The Mill is situated in the outskirts of Amsterdam not far from Schiphol Airport. It controls the water level in the western part of Amsterdam. This area is situated more than 2 meters below sea level. The Sloten Windmill is a rebuilt mill, dating from 1847. The whole year long the Mill can be visited daily (except Jan. 1st, April 27th and December 25 and 26). The windmill is a non-profit organisation, run by volunteers. Knowledgeable guides will gladly explain the working of the mill during a guided tour. And if possible the miller will demonstrate how the top of the mill is turned, or how to stop the mill.", "category": "Speciality Museums History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Molen Van Sloten"], "hours": "9:00 AM - 5:00 PM", "duration": "Duration: < 1 hour", "address": "Akersluis, 10, 1066 EZ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Sloten En Riekerpolder", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Great people and very interesting", "review": "We had a great time at this cute mill. The two ladies there were especially nice and even gave us a private tour in German, without us having to ask for it. I loved learning about mills in general and this one in peticular. It is a great activity if you need to escape the loud and busy city for a few hours.", "rating": 5.0, "visited": "July 2023"}, {"title": "Fascinating insight into the area and how the 17th century engineering is still relevant today.", "review": "Many thanks to Olaf and the team for their hospitality. This is a little off the beaten track but well worth the trip if you want to understand how the Netherlands works in terms of water management. Olaf was a great guide, very knowledgeable and engaging.", "rating": 5.0, "visited": "October 2023"}, {"title": "Excellent tour", "review": "The tour guide, a young man (can’t recall his name) was knowledgeable, friendly, and a delight to spend time with. His stories were quite interesting. He made us feel very welcome! I highly recommend this fascinating tour", "rating": 5.0, "visited": "December 2022"}, {"title": "A lovely and informative tour", "review": "Decided to check out a working windmill on a rainy day in Amsterdam. Was amazed by all that i learnt in the hour and so cool getting to see the inside workings. Fred was a great tour guide and very enthusiastic about what he does. Would certainly recommend!", "rating": 5.0, "visited": "November 2023"}, {"title": "Amsterdam in a nutshell", "review": "The best windmill tour I have ever attended. So much history and an inclusive experience of artefacts, mechanical engineering and artistry. The tour explained in details hows the windmill operated since 1847 and how it is still of use in these present times. The souvenir shop is amazing and the prices are the cheapest you could find in the whole of Amsterdam. Definitely a very highly recommended experience.", "rating": 5.0, "visited": "January 2024"}, {"title": "Absolutely worth a visit", "review": "Having lived in the area for a year, finally visited and wish had gone before. The Guide was truly illuminating, thank you! Tour encompasses the history of NL, and 'the 'Dam', water levels, polders etc. The windmill itself is a rare fully functioning working model, used in the the area to control the water levels. Together with working models of their evolution in NL, you get to see the whole structure, with original parts, sails under way etc. Engineers will love! With insights into how NL built itself into one of the most powerful European countries, the 'mills played a major part - and learn the secret \"sails\" language too. Get out of Amsterdam for a day and away from tourists! There's a cheese house and brewery adjacent to the Molen, a new fish restaurant nearby, and quaint Sloten village itself (older than Amsterdam), plus decent local restaurants too for lunch/dinner ('Later on the Water'/Kirksizcht - (the former with canal side tables) - and an amazing (tiny) ice cream house (IJshoeve Sloten) which makes wonderful grapefruit sorbet.", "rating": 5.0, "visited": "January 2024"}, {"title": "Such Charisma and Grace", "review": "Absolutely fantastic. From London, lovely landlmark. I was with my buddy, we loved the tour, the man spoke so eloquently. 10/10 would RECOMMEND. P.s my friend w/o the glasses, made me go all the way to Amsterdam to see Molen Van Sloten", "rating": 5.0, "visited": "November 2023"}, {"title": "Must-see windmill experience!", "review": "In English, because we don’t speak Dutch, unfortunately! We stumbled on the windmill while exploring the area and wanted to find out more, so booked a tour. We were greeted by the tour guide who was very enthusiastic and knowledgable, making us excited for the experience. The tour itself was very insightful, giving us a comprehensive understanding of the history and importance of windmills to The Netherlands. We were shown maps, models, parts of the windmill and inside (which was pretty awesome!). We saw how the windmill operates and and how it relates to the surrounding landscape. From the top, there was a stunning birds eye view of the town. The tour was a very fair price, the guide was fantastic and extremely well-educated on the topic. She answered all our questions, and even made us a coffee! We’re so glad we stumbled on this fantastic windmill and would recommend to anyone in the area. Thank you so much for the experience! From England and Egypt 🏴󠁧󠁢󠁥󠁮󠁧󠁿🇪🇬", "rating": 5.0, "visited": "March 2024"}, {"title": "Great experience", "review": "The tour was great and the guide amazing. He was one of the best storytellers I met. Emphasizing his words the windmill showed a lot of fascinating sides. We even could climb on one part of the mill.", "rating": 5.0, "visited": "March 2024"}, {"title": "Excellent", "review": "Very interesting and informative tour. Kept adults and children engaged. The tour guide was friendly and professional. Highly reccomended!! Thank you to the team. Great value for money and the Rembrandt audio visual story was an added bonus that we weren’t expecting. Thank you !!", "rating": 5.0, "visited": "April 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/ba/b5/c4/de-molen-van-sloten.jpg"]}
{"name": "Red Light District", "description": "Amsterdam’s De Wallen area is home to one of the world’s most famous red light districts. Take a stroll to soak up the rousing yet beautiful lights, or visit the Red Lights Secrets Museum to learn more about Amsterdam’s sex work profession. The district is also known for its trendy coffee shops, bars, and clubs. The best time to see the district is in the early evening or at night, when the lights begin to illuminate the narrow streets. The area is safe, but it can get very busy, and taking photos or videos of workers is illegal. – Tripadvisor", "category": "Neighborhoods", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Red Light District"], "hours": "12:00 AM - 11:59 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Nieuwmarkt • 3 min walk", "Centraal Station • 7 min walk"], "top_reviews": [{"title": "Super interesting perspective of the red light area", "review": "Pablo Pascal was the best tour guide. This tour is set in a context of an historic introduction into Amsterdam central areas including an informed view of the red light district. Pablo was so informed and so interesting to listen to. I hope you are lucky enough to get him.", "rating": 5.0, "visited": "October 2023"}, {"title": "Adult tourism activities with friends", "review": "I stayed there for say about a week, it was a fun travel for recreation and sightseeing and much with friends. It is a open display of world about alternate fun in a healthy way. Alot of shops about sex toy, alcohol, marijuana and other smoke, paid fun ladies, crowd with similar vibe. I made few new friends who shared about their personal intimate experience at Delhi India with Omyale Pippa an Companion (nice and friendly crowd from all over the world), Kind of average experience.", "rating": 5.0, "visited": "October 2023"}, {"title": "Sexy Girls and excellent service", "review": "Better than other places many exotic provider from various countries (may be i was lucky enough), met one asian girl (shared contact of Ojasvi Love from Delhi, Indie) from and another european both were talented and beautiful. Cindrella from Latvia was another good contact, Blisha from Holland is too welcoming. I must go place to try your luck about flings! I really liked the service, crowd, toy shopping and food. Solo traveller never feel like solo here, so many things to keep you busy. A must try for seekers looking for Adult open-ness.", "rating": 5.0, "visited": "October 2023"}, {"title": "Awesome Holland!!", "review": "What a fabulous city Amsterdam is.. history..Modern-day..easy to move around ( watch out for the Bikes though..so much to see and do. A wonderful place if you want to bade and visit some of the other countries..Paris.. 4 hrs away..Brussels 3 ish hrs away..easily accessible. The Trains were comfortable/clean. I felt safe walking the city.. cant wait to get back and explore more of the city and countryside..", "rating": 5.0, "visited": "October 2023"}, {"title": "Sexy Beautiful Red Lights", "review": "We visited Amsterdam with an open mind, unsure what to expect. Well. It was great. The city is beautiful with its canals, buildings and bars. The red light disitrict is in the heart of the city, easy to get to and 15-20 min walk from Central station. We had a giggle in the sex shops but our first place was the Sex museum opposite the Central Station. It was brilliant with diaplays and history through the years with some eye ( watering ) openers too. We had a good laugh in there. Not as much window shopping as we had expected, dont laugh or point at the girls, its frowned upon. We went in the sex palace several times for the peep show at 2 euros a go. Think my wife enjoyed it more than i did. Lokking at minge as she called it. Again, a laugh and a giggle, tongue in cheek. Some of the girls ( ladies ) were entertaining, smiling, some of the older ones didnt look to happy to be there. Expect to pay between 6 and 10 euro for a beer. 10 to 15 for gins/mixers, irish coffee etc. Paid 8 euro for a spliff and 9 euro for a space cake. No more than felt a bit floaty, happy. Giggly. Stay away from the street sellers. They're easy to spot a mile off.", "rating": 5.0, "visited": "October 2023"}, {"title": "Still has a real buzz to it.", "review": "As people watching is one of our favourite pass times this was right up our alley so to speak. Went there both during the day and night, noting it stretches beyond the one street during the day there were lots of families strolling around and had a family atmosphere about it. Night time bit busier windows full. There are lots of places to eat and drink in and around it and we found prices reasonable. Recommended for nearly all ages especially if you have not seen or experienced any thing like this before. Was there 40 years ago and doesn't seemed to have changed much", "rating": 5.0, "visited": "October 2023"}, {"title": "Worth a look.", "review": "We walked the Red light district and to be honest it’s quite a dirty area. A lot of rubbish on the side of the canal. The smell of weed was nice mind. I don’t use it but it’s a nice smell. Busy area and plenty of things to see 🫣", "rating": 5.0, "visited": "December 2023"}, {"title": "Now that was different…", "review": "Had heard all about this part of town but you’ve just got to experience it to believe it.. Not as dirty and gross as you’d probably imagine it to be. Very interesting and it got old quite quick. The women in the windows were quite amusing and would get very angry with you fast if you weren’t a customer. Glad we made the stroll and can now say that we’ve been there.", "rating": 5.0, "visited": "December 2023"}, {"title": "It’s what Amsterdam is about right?", "review": "A must visit when you come to Amsterdam, it is all part of the culture! The canals are beautiful and the actual area itself is nice. This is where you will see the various small “windows” where the ladies are within. It does have that strange feeling, however the general atmosphere was good. Definitely worth a visit.", "rating": 5.0, "visited": "February 2024"}, {"title": "Worth a visit", "review": "You cannot go to the dam and not visit the red light district But be very warned be aware of your belongings and people around you ! Look out for small groups of males hanging around on corners If you get approached do not engage at all …. IGNORE IGNORE IGNORE Also the working girls don’t like being waved at as I found out Have a look but be discreet Casa Rosa sex show was funny and defo worth a visit inside 😂", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/ac/e0/b4/red-light-district.jpg"]}
{"name": "Singel", "description": "", "category": "Bodies of Water", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Singel"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Grachtengordel-West", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/5e/00/e1/caption.jpg"]}
{"name": "A'dam Lookout", "description": "LOOKOUT 360º Amsterdam + sensational swing An iconic viewing point in The Netherlands - A’DAM LOOKOUT, has joined the Eiffel Tower, the Fernsehturm and the London Eye. For the daredevils among us, LOOKOUT also has a further adrenalin kick in store. On the roof is Europe’s highest swing. You swing over the edge of the tower at a thrilling height of almost 100 metres above the ground. Highlights: - The most spectacular view of Amsterdam and the surrounding area - A Bird’s-eye view of Amsterdam from the highest swing in Europe - Access to the indoor interactive state-of-the-art Amsterdam exhibition - Free digital photo of your visit to LOOKOUT - Enjoy coffee, breakfast, lunch, dinner and/or cocktails in Madam Restaurant & Sky Bar - Free WIFI available Payments with cards only.", "category": "Observation Decks & Towers", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "A'dam Lookout"], "hours": "10:00 AM - 10:00 PM", "duration": "Duration: 1-2 hours", "address": "Overhoeksplein 5, 1031 KS Amsterdam The Netherlands", "neighborhood": "Neighborhood: Noordelijke IJ-oevers", "rating": 0, "getting_there": ["Amsterdam Centraal • 7 min walk", "Amsterdam Centraal Station • 7 min walk"], "top_reviews": [{"title": "A Swinging Time!", "review": "Just a short ferry ride from Centraal Station, we had a beautiful, sunny day for our trip to the lookout. The experience begins with a Techno-enhanced lift ride to the top, complete with a thrilling light show. Once on top, there are two lookout platforms to help take photos above the screen fence. For the more adventurous, there is \"Over The Edge\", Europe's highest swing. I will tell you that I am not a fan of roller coasters, or heights, or swinging over the edge of a building, but I wanted to experience it for myself. It is as thrilling and scary as you think it is. I chose to keep my eyes shut for most of it, but feel free to look around (and straight down). It only runs a minute, which was just long enough for me! Afterwards, we enjoyed a drink and soaked in the views. Highly recommended!", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing attraction", "review": "We visited the A’dam lookout and throughly enjoyed ourself. The panoramic view all over the city is incredible. We enjoyed the added VR experience and the swing. The staff were very nice and helpful. We will definitely be visiting again in the future", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing afternoon with amazing views", "review": "Me and my friend visit whilst on holiday in Amsterdam. We didn’t know about A’DAM LOOKOUT until we got off the train at Amsterdam Centraal. My friend booked the tickets online, which included The Swing, The VR rollercoaster and 2 drinks. Staff we’re all very friendly and helpful. The ride up to the 20th floor in the elevator was unique and fun. The swing was just amazing, such great views. The VR rollercoaster was fun and we enjoyed our drinks (and some Bitterballen) in the bar with some fantastic views across Amsterdam. The audio tour on the Skydeck was very good and gave lots of interesting facts. We will definitely be returning next time we are in Amsterdam.", "rating": 5.0, "visited": "August 2023"}, {"title": "Good date idea or a night out with friends.", "review": "The view was amazing! There are 2 levels with bars, one indoor, one outdoor, and on each you can walk around and see the city from all directions. My only real complaint, and it's a personal opinion, is that the music wasn't too enjoyable. Was upbeat, but I didn't really recognize any of it. Otherwise, very cool vibe with a mostly young crowd.", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing! Made Amsterdam for us", "review": "Amazing! Really made our holiday! We didn’t know anything about this place, it’s sad that even the hotel don’t advertise here. The staff are all fantastic! I’m disabled and everyone above and beyond to make sure I didn’t miss anything and was treated the same as everyone else which is hard to find in Dam as there is so many stairs in attractions. I didn’t go on the swings but if you can I would highly recommend it but if you can’t still come here. The views are amazing, the bar is lovely, really busy but I can see why.", "rating": 5.0, "visited": "October 2023"}, {"title": "Stunning views", "review": "Really cool place to visit. Me and my other half didn’t go for the swing but the views were stunning and you can even get a picture of yourself on a horse on the roof!!!!!!!!! Easy to get to from Amsterdam train station you just get a ferry from behind the station which is free and constantly running so you aren’t waiting around. Definitely recommended for anybody to see you will get some great views and pictures !", "rating": 5.0, "visited": "November 2023"}, {"title": "Very fun experience overlooking beautiful Amsterdam!", "review": "Visited this fun attraction while staying in the Adam building during our trip to Amsterdam. The view is perfect, and fairly reasonably priced at around €22 for the view and experience. You also get some free photos and a video to download at the end of the experience. Definitely recommend if you want to see Amsterdam in a different and unique way!", "rating": 5.0, "visited": "December 2023"}, {"title": "Food, views, swings & VR!", "review": "Perfect way to spend a couple of hours. We booked the lunch experience at Moon, plus the swings and VR. Food was delicious, and really enjoyed the experience of the rotating rstaurant and changing view. Swings were better again, and got some great photos and video after. Finally, the VR!! Make sure your headset is on securely, but other than that it's awesome! So silly but lots of fun. Easy to get to from behind the main station, the ferry is free and runs constantly (at least during the day). 100% worth the visit", "rating": 5.0, "visited": "November 2023"}, {"title": "Great experience!!", "review": "Worth the visit, as we don't really like the busy life in Amsterdam, we enjoyed the view, the kids got on the Swing and the VR rollercoaster. The Restaurant and bar at the rooftop had excellent service! Highly recommended!!!", "rating": 5.0, "visited": "December 2023"}, {"title": "Gaint Swing and VR Ride.", "review": "Adam Lookout's Sky Deck offers an absolutely worth-it experience with unparalleled views. The Giant Swing adds an awesome thrill, while the Moon Restaurant enhances the charm with a 360-degree view. Breath-taking scenes unfold, making every moment memorable. Dining high above Amsterdam creates an unforgettable, panoramic perspective of the city's beauty.", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/86/36/7c/photo9jpg.jpg"]}
{"name": "Our Lord in the Attic Museum Ons' Lieve Heer op Solder", "description": "Hidden in the heart of the city centre of Amsterdam is a small wonder: Our Lord in the Attic Museum. Visitors will be going on a journey in a unique well-preserved canal house from the 17th century. Narrow corridors and stairs lead to historically decorated living quarters, kitchens and bedsteads, ending in what is literally the highlight of the museum: a complete church in the attic.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Our Lord in the Attic Museum Ons' Lieve Heer op Solder"], "hours": "10:00 AM - 6:00 PM", "duration": "Duration: 1-2 hours", "address": "Oudezijds Voorburgwal 38-40, 1012 GD Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Centraal Station • 4 min walk", "Nieuwmarkt • 5 min walk"], "top_reviews": [{"title": "Exceeded our expectations, must do!", "review": "I was hesitating whether to visit or not, and didn't know what to expect. So glad that we did. The visit takes roughly an hour, and there's a lot to take in from history, culture and religion. The place is very well preserved, and definitely worth the time!", "rating": 5.0, "visited": "August 2023"}, {"title": "Lovely atmospheric museum/house", "review": "A very well set out canal house museum. It is lit in such a way as to recreate how the house would’ve been in the living areas, basically not light at all. The church in the attic is quite staggering in terms the effort gone to in creating it. Some excellent views across the city from the higher windows. Do use the audio guide and take the time to sit and go through the short 3 min introduction as well as looking at the model of the house. Well worth the visit.", "rating": 5.0, "visited": "October 2023"}, {"title": "Enchanting well preserved “hidden” church", "review": "Historic Catholic Church built 250 years ago on top of three homes on the canal. The exhibits are superb and the church itself is mesmerizing. An audio tour takes you through the history and background. I found this fascinating…. Takes st least one hour with many narrow and difficult staircases", "rating": 5.0, "visited": "October 2023"}, {"title": "Hidden Gem! Not to miss! Learn secular traditions of families who lived here, and the sanctuary hidden upstairs.", "review": "This museum is a hidden gem. It is a home that is hundreds of years old, which hid a secret Catholic chapel in it’s attic. You will receive a small recorder in your language which corresponds to displays in every room. Point and listen. The history of traditions and customs is fascinating. There are artifacts from secular living of families who lived there, as well as sacred spaces. Please know that there are lots of little rooms to investigate, and some stairs are more like ladders, but original to the home. Free lockers and a coat room are also provided.", "rating": 5.0, "visited": "October 2023"}, {"title": "Interesting!", "review": "Extremely interesting! It is definitely worth the visit!!! Not only do you see the church in the attic, but you visit various rooms in the home that display the way of life at that time. Highly recommend. It is something quite different.", "rating": 5.0, "visited": "November 2023"}, {"title": "A fabulous museum for our family", "review": "My kids didn't want to go to museums on our vacation, but even this one they enjoyed. It's very cool to go inside an Amsterdam home. The handheld audio tour is excellent with just enough information of interest, but not so much that kids get bored. The chapel is beautiful. Definitely one of the best stops on our trip. There are free lockers for your personal items. You have to be able to go up and down steep steps.", "rating": 5.0, "visited": "December 2023"}, {"title": "Surprisingly interesting church within a house.", "review": "Surprisingly, interesting museum that illustrates the early history in the 1600s when Catholic churches were banned by William the Orange of the Netherlands, forcing Catholic worshipers to create churches within their homes. This preserved home and church gives an intimate view of worship life at that time. A comprehensive audio tour helps to understand the shrine. A word of caution. Steep spiral stairs will limit some who have difficulty with climbing stairs.", "rating": 5.0, "visited": "January 2024"}, {"title": "HIdden jewel house in Amsterdam", "review": "Before visiting Museum Ons’Lieve Heer op Solden I had visited another channel house in Amsterdam, so I had an idea of what I could see. Anyway, what I experimented was beyond my expectations. The aacuracy on the 16th - 17th centuries furniture and ambiances, the architecture solutions to merge 3 houses and build a church for a 100 parishioners, keeping the funcionallity of the houses. It is not the first priority of an Amsterdam’s visitor, but after my expreience I think it is worth spending 90’ of your visit to this gorgeous city in this cute museum.", "rating": 5.0, "visited": "January 2024"}, {"title": "Worth a visit", "review": "This museum was an excellent find recommended by a friend. A really interesting and very well preserved and presented museum. Navigating around the Museum was easy and the recorded guide easy to use and very informative. We only interacted with staff at the reception desk but they were friendly, efficient and helpful. It took about 60-90mins for our group to complete a tour of the museum.", "rating": 5.0, "visited": "January 2024"}, {"title": "400 years of Amsterdam history in a one hour tour", "review": "I very much enjoyed touring the house on the way up the church. The church itself is lovely and very interesting. The audioguide was very good and provided an interesting view of Amsterdam city life over several centuries. Definitely worth the price of admission!", "rating": 5.0, "visited": "January 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/01/57/84/museum-ons-lieve-heer.jpg"]}
{"name": "Albert Cuyp Market", "description": "The city's largest street market is just south of the city center.", "category": "Flea & Street Markets", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Albert Cuyp Market"], "hours": "9:30 AM - 5:00 PM", "duration": "Duration: 2-3 hours", "address": "Albert Cuypstraat, 1073BD Amsterdam The Netherlands", "neighborhood": "Neighborhood: De Pijp", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Well worth a visit.", "review": "Visited this market a couple of times whilst we were in Amsterdam. Great to walk through end to end with lots to see. Great variety of stalls with all sorts to eat. Lovely fresh fish stalls that cook it to order as well.", "rating": 5.0, "visited": "October 2023"}, {"title": "Big, fun outdoor market in Amsterdan", "review": "Big, fun outdoor market. Check-out the Shwarma stalls and also go visit the stall selling brownies (excellent). Ex-pat American making his own dark chocolate brownies, really good!", "rating": 5.0, "visited": "October 2023"}, {"title": "We visited for Rudi's Stroopwafels!", "review": "I am grateful that everything in the sprawling downtown area of Amsterdam is within walking distance, including the Albert Cuyp Outdoor Market. We wanted to try the best Stroopwafels in Amsterdam (Rudi's), and we were not disappointed! We also enjoyed wandering through the length of the market, appreciating the other vendors and their varied offerings.", "rating": 5.0, "visited": "October 2023"}, {"title": "Loads of variety", "review": "We visited on a cold wet Tuesday in January - so probably not representative of how the place really is. However, the market was fully operational and impressive with the variety of items for sale. The locals obviously purchase food and edibles there, and then there are stalls aimed at tourists. The food options were very varied, ranging from fruit and veg to fresh fish, artisan cheeses and even a stall specialising in game birds and meat. There were lots of hot food options also, obviously including the Dutch fries, which you just have to try! Along the outside of the market are some wonderful individual shops which would have occupied us far more if the weather had been kinder. Would definitely return", "rating": 5.0, "visited": "January 2024"}, {"title": "Worth the visit", "review": "Heard about this market from virtually every guide to Amsterdam I looked at. Strangely smaller than expected. We visited after a morning at a nearby museum and thought we’d try out the street food for lunch. Not every stall or space was occupied, but we found enough to keep us happy. The grilled cheese sandwich place was really good as were the fries from the chap at the very end of the market. We couldn’t miss Rudi’s Stroop wafels and bought lots as gifts too. For us, the best and cheapest you’ll find. For the rest of the market, there are a few cheap souvenir shops which were good for bits and pieces and definitely the best prices for clog slippers (the airports prices were almost double). The cheese stalls were very well priced too and seemed more genuine to the more glossy branded cheese shops on the Damrak and in central Amsterdam. There are of course other stalls selling various other goods ranging from from toiletries to cheap clothes and household items. Overall a very nice experience which served its purpose. Definitely recommend.", "rating": 5.0, "visited": "February 2024"}, {"title": "Amsterdam's hidden gem", "review": "Good market off the usual tourist routes with a selection of everything whether you're a local looking for fresh food or a stray tourist looking for an original souvenir. If you want an honest bite to eat in a proper Dutch cafe then try 'Cafe Koffiehuis \"De Cuyp.\" (See picture)' It's definitely a locals place but the owner was really friendly and welcomes everyone. The food isn't flash nor expensive but, trust me, it's good. The apple pancake especially.", "rating": 5.0, "visited": "February 2024"}, {"title": "Street market", "review": "A plethora of stalls serving food, souvenirs, clothes, bags and nicknacks. We only purchased edibles starting with a workman favourite - the mackerel roll. Wandered along a bit and stopped for a homemade stroopwaffle. Since the weather was a bit cold & wet we then finished with a cone of frites (& mayo) to warm us up.", "rating": 5.0, "visited": "February 2024"}, {"title": "Outdoor market with selection of goods", "review": "A mixture a stalls at this open air market. Easy to access via tram or metro. From souvenirs, jewellery, fabric, food, produce, clothing and much more this market has something for everyone. The area has lots of cafes and restaurants but there is a good selection of “local” food in the market itself. Not an essential must see in Amsterdam but it is worth a visit if you have time.", "rating": 5.0, "visited": "March 2024"}, {"title": "Great Street Market", "review": "We had excellent pita and sticky stroopwaffelen here. Also bought a few souvenirs and the prices were a lot better than the gift shops in the town. Definitely worth a visit and easy to get to as it has it's own stop on the tram line number 4.", "rating": 5.0, "visited": "April 2024"}, {"title": "Rude Baker", "review": "we heard about this venue and decided to check it out. There was a stall which has a variety of breads. The man at the stall wasn't very pleasant, in fact, i'm of the opinion that he is rude and not courteous to Asian tourists. It ruined our day. Will hesitate to visit again.", "rating": 5.0, "visited": "April 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/03/54/b0/img-20190617-234911-741.jpg"]}
{"name": "Begijnhof", "description": "Tucked away just off Spui, this delightful collection of houses arranged around an open court is well worth searching out.", "category": "Historic Sites Historic Walking Areas", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Begijnhof"], "hours": "9:30 AM - 6:00 PM", "duration": "Duration: < 1 hour", "address": "Begijnhof 1, 1012 WS Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Nieuwmarkt • 10 min walk"], "top_reviews": [{"title": "Worth the time", "review": "Pretty cool. Quick visit, but a little piece of Amsterdam history. Nice get away from the city noise and hustle n bustle. Good place to rest and take a break from city activity", "rating": 5.0, "visited": "November 2023"}, {"title": "A treasure, not to be missed !", "review": "This is an amazing place to visit, dot in the middle of old Amsterdam. Begijnhofje houses homes and churches for elderly ladies in the 16/17th century; and still today. You'll find the oldest house in Amsterdam, the absolutely stunningly beautiful catholic hidden church and the English church. You need to be quiet, but you can walk around easily, although some parts are closed for the public. Highly recommended !", "rating": 5.0, "visited": "November 2023"}, {"title": "A complete 100% must visit", "review": "Been to Amsterdam a few times and cant believe we've never been here. What a calm and serene delight and its free too. Absolutely no idea why people would complain about times as people live here so just go during normal day hours. Lovely old chapels and oldest wooden house in Amsterdam. A 100% must visit", "rating": 5.0, "visited": "April 2024"}, {"title": "A must see. Delightful.", "review": "Just off one of the busy main streets is this haven of tranquillity, which is immaculately kept. Apart from the houses there are 2 churches, one English (closed) and the other Catholic, which we were able to visit. Some parts are cordoned off, which is entirely understandable as people are living there. There is no entrance fee, so it can get a little busy, though I believe visitor numbers are controlled by wardens. Not to be missed.", "rating": 5.0, "visited": "April 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/6d/5a/51/photo0jpg.jpg"]}
{"name": "De Gooyer Windmill", "description": "", "category": "Points of Interest & Landmarks Architectural Buildings", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "De Gooyer Windmill"], "hours": "", "duration": "", "address": "Funenkade 5, 1018 AL Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Muiderpoort • 10 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/8f/ed/f9/windmill-with-no-blades.jpg"]}
{"name": "De 9 Straatjes", "description": "This neighborhhod of \"nine little streets\" is full of quirky stores selling clothing, books, art, food and lots more.", "category": "Neighborhoods Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "De 9 Straatjes"], "hours": "", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Grachtengordel-West", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/6e/7f/17/layout-of-the-nine-streets.jpg"]}
{"name": "H'ART Museum", "description": "As the Hermitage Amsterdam, and now as H’ART Museum, we have always housed some of the most unique and famous art, from present day to antiquity. Connecting the art world in new ways and bringing it to Amsterdam for everyone to enjoy. Now we form a unique global art collective together with world-renowned international partners The British Museum, Centre Pompidou, and SAAM (Smithsonian American Art Museum), which brings the UK, France, USA, and the Netherlands together as never before. We want to inspire people through powerful, relevant, and heartfelt art.", "category": "Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "H'ART Museum"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Amstel 51, 1018 DR Amsterdam The Netherlands", "neighborhood": "Neighborhood: Weesperbuurt", "rating": 0, "getting_there": ["Waterlooplein • 3 min walk", "Weesperplein • 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/91/5c/56/h-art-museum-exterior.jpg"]}
{"name": "Amsterdamse Bos", "description": "Covering an area of almost 1000 hectares, the Amsterdamse Bos is one of the largest city parks in Europe. It contains 150 indigenous species of trees and over 200 species of birds. The park sits to the South of central Amsterdam and can easily be reached by bike, tram or metro from the city center.", "category": "Parks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Amsterdamse Bos"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: More than 3 hours ", "address": "Bosbaanweg 5, 1182 DA Amsterdam The Netherlands", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/7d/94/28/bos.jpg"]}
{"name": "Body Worlds", "description": "Gunther von Hagens’ BODY WORLDS: The Happiness Project in the heart of Amsterdam tells the amazing story of our own body and the impact of happiness on our health. More than 200 anatomical specimens of real human bodies show the complexity, resilience and vulnerability of the body. Join the 40 million people around the world who have already seen the exhibition and been on this fascinating voyage of discovery through the human body.", "category": "Speciality Museums Science Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Body Worlds"], "hours": "10:00 AM - 10:00 PM", "duration": "Duration: 1-2 hours", "address": "Damrak 66, 1012 LM Amsterdam The Netherlands", "neighborhood": "Neighborhood: Damrak", "rating": 0, "getting_there": ["Centraal Station • 7 min walk", "Nieuwmarkt • 7 min walk"], "top_reviews": [{"title": "Interesting and fun learning experience", "review": "Very interesting and great way to get to experience the human body. We enjoyed seeing the insides of our fellow man. Didn't think it was gory or grotesque and I would take my kids here if they were with. Only minus is there could have been more, we were definitely not \"done\" after walking through the entire exhibit.", "rating": 5.0, "visited": "December 2023"}, {"title": "Incredible - Eye opening!", "review": "Incredible exhibit with really eye opening displays. Taking the time to read all of the information really takes the purpose of this place to another level. Only point to note - my partner and I read all the information and were here for about 1.5 hours so don’t plan to make a visit for a whole morning or afternoon.", "rating": 5.0, "visited": "December 2023"}, {"title": "Really interesting!", "review": "Really interesting and informative exhibition! We were worried it was going to be quite gimmicky but it was the complete opposite! Each floor had different focus points and a good variety of plastinations to view and written information. I would definitely recommend a visit here when Amsterdam.", "rating": 5.0, "visited": "December 2023"}, {"title": "Very interesting", "review": "My friend and I came across Bodyworld whilst walking through Amsterdam, I had heard of this place and wanted to take a look. Arjen on the door was very likeable and funny, he encouraged us to go inside and very glad we did, it was very informative. We took a lift up to the sixth floor and worked our way down through the floors. I learned how the brain deteriorates through dementia, saw the workings of new hip joints and knee joints, the difference between an ordinary spleen and an enlarged spleen, and how important it is not to smoke, to be healthy and most importantly, to be happy! Very interesting place, there's something for everyone to learn", "rating": 5.0, "visited": "November 2023"}, {"title": "Great for all ages.", "review": "We visited Body Worlds with our kids (aged 9, 13, 14, 15, 16). It was interesting for all of us! Beautiful and intriguing. The body scan at the end was a great addition. Tks Arjen for your recommendation.", "rating": 5.0, "visited": "December 2023"}, {"title": "Informative and Fascinating", "review": "We were here in September and just turned up and got tickets on the door, no queue and not busy inside. A great exhibition that is well presented and very informative, take as long as you want with each floor explaining a different aspect of the body. Take time to read the inspirational quotes and don't forget to do the body analysis at the end and get your free print out.", "rating": 5.0, "visited": "September 2023"}, {"title": "Amazingly insightful, interesting, informative. Recommend for all ages.", "review": "Such a fun-tastic tour of the museum! I expected much less, and I was amazed to see how much I didn't know, how much I've learned a out the human body, thing I should have known a long time ago. Thank you, Arjen, for recommending us to go inside. Thank you!", "rating": 5.0, "visited": "November 2023"}, {"title": "Fascinating and educational", "review": "Both my partner and I loved our visit. It was so interesting to see so much of the inner workings of the human body, and the size and shape of numerous organs, blood vessels etc. It was sometimes annoyingly rowdy in some rooms with people talking loudly so we hovered at displays waiting for quieter times as there’s a lot to read and absorb. Grateful thanks to people/families who donated bodies to provide a learning experience for us. We spent 2 hours in the museum as we had somewhere else to be, but would’ve stayed longer had we been able to.", "rating": 5.0, "visited": "January 2024"}, {"title": "Eye opening", "review": "Visited Body Worlds as part of our Amsterdam trip. We had one of these in London but it suddenly closed down so never got to visit it. The price of our visit was £19.21 each. The experience it self is amazing and definitely an eye opener. You can see the multiple working ways of the human body from the veins, the nervous system to the brain. The way the bodies have been positioned is amazing and very interesting to see. A word of warning, there is a part within here with shows bodies of babies and the functions of pregnancy etc. There are also examples of a foetus from 9 weeks through the end of pregnancy. I know some people may find this distressing; as i witnessed whilst i was there however it is also very interesting to see but i guess it’s worth knowing as that is not really advertised. When i visited once i don’t think i would visit again unless a new exhibition opens.", "rating": 5.0, "visited": "February 2024"}, {"title": "Fantastic experience with my mum", "review": "Had an amazing experience!!!! It said the average experience is 1 hr or an 1hr and a half, we spent 3 hrs in there as there was just so much to read and see!!! If you're into science and how the body works this is defiantly something you should see. I probably wouldn't take kids with me as they'd get bored but it all depends on what you've got planned for the day. ARJEN answered all queries and discoveries we had adding to the experience further.", "rating": 5.0, "visited": "December 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/11/7c/fe/70/caption.jpg"]}
{"name": "St. Nicholas Basilica", "description": "", "category": "Historic Sites Religious Sites Churches & Cathedrals", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "St. Nicholas Basilica"], "hours": "12:00 PM - 3:00 PM", "duration": "Duration: 1-2 hours", "address": "Prins Hendrikkade 73, 1012 AD Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Centraal Station • 2 min walk", "Amsterdam Centraal Station • 4 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/4f/95/81/st-nicholas-basilica.jpg"]}
{"name": "Concertgebouw", "description": "The Royal Concertgebouw is one of the world's most famous concert halls renowned for its exceptional acoustics. With 700 concerts a year the Concertgebouw offers a varied programme featuring leading international musicians, orchestras, and conductors. The hall functions as a home base for the Royal Concertgebouw Orchestra, one of the very best orchestras in the world. Time and time again, critics have lauded its unique sound, which clearly stands out among thousands of others. Behind-the-scenes tours provide a look into the concert hall's rich history. There are scheduled tours three times a week and for groups available on request. From September to June at 12:30pm. Every Wednesday, there is a free 30 minute concert in the Concertgebouw. Due to the popularity of these concerts it is recommended to arrive at least 45min before the concert.", "category": "Concerts Historic Sites Theaters", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Concertgebouw"], "hours": "10:00 AM - 7:00 PM", "duration": "Duration: < 1 hour", "address": "Concertgebouwplein 10 Museum Quarter, 1071 LN Amsterdam The Netherlands", "neighborhood": "Neighborhood: Museum Quarter (Museumkwartier)", "rating": 0, "getting_there": [], "top_reviews": [{"title": "A must do in Amsterdam for concert lovers", "review": "Concert was fantastic. Seats -4 th row orchestra were inexpensive for where they were as compared to Lincoln center. Dinner at Lies beforehand was superb and we just walked internally to the concert. Price fixed three course dinner is highly recommended.", "rating": 5.0, "visited": "September 2023"}, {"title": "Christmas is coming soon!!!", "review": "I like to come here for a concert every now and then, sometimes alone or otherwise with my partner. To sit here, enjoying a nice concert, i find it to be a great and wonderful cultural experience. I would definitely recommend this place, purely as a devoted classical music fan. For me personally, the classical music scene in Amsterdam is one of the highlights of this, if i may say so, really great and still very open minded world-class city!!!", "rating": 5.0, "visited": "December 2023"}, {"title": "Great concert space", "review": "Number 3 concert hall in the world for acoustics and it is clear that it deserves the rating. Beautiful architecture and well laid out space with plenty of areas to congregate and each to access and depart. No bad sight lines or columns to interfere with the view. Highly recommend attending a performance if you have the chance.", "rating": 5.0, "visited": "June 2024"}, {"title": "The Big Concert Hall", "review": "This big classical music concert hall is located on the Amstel River and looks splendid both day and night. It is one of the most memorable buildings in town, seen well from bridges and from canal boats. If you take a canal cruise, you will see it.", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/11/d3/e0/concertgebouw.jpg"]}
{"name": "RAI Amsterdam", "description": "Bringing people together, connecting and inspiring them by organising and facilitating meaningful encounters. We do this from our multifunctional exhibition and conference centre on Europaplein in Amsterdam, as well as elsewhere in the world where we operate.", "category": "Theaters Convention Centers", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "RAI Amsterdam"], "hours": "", "duration": "", "address": "Europaplein 22, 1078 GZ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Zuidas", "rating": 0, "getting_there": ["Amsterdam RAI • 3 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/56/3a/9e/rai-amsterdam.jpg"]}
{"name": "Museum Vrolik", "description": "The Museum Vrolikianum was the private anatomical collection of the Amsterdam anatomists Gerard (1775-1859) and Willem Vrolik (1801-1863). After their deaths, the collection was further expanded by other Amsterdam anatomists. The human body is the central focus in Museum Vrolik. What do we look like on the inside? What diseases did people suffer from in the past? Skeletons and wet specimens show the devastating effects of diseases like rickets (English disease), TBC and syphilis. Congenital malformations are also on display, such as cyclopia and conjoined twins. Museum Vrolik has a large collection of animal anatomy as well.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Museum Vrolik"], "hours": "", "duration": "Duration: 1-2 hours", "address": "Meibergdreef 15, 1105 AZ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Amsterdam South-East", "rating": 0, "getting_there": ["Amsterdam Holendrecht • 5 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/b1/86/d8/kyphosis-and-much-much.jpg"]}
{"name": "WONDR Experience", "description": "WONDR is an immersive pop-up experience that blends visual magic with boundless creativity. A confetti- sprinkled playground of color and sensation designed by some of Amsterdam's most creative minds. Our interactive exhibit is a place for people of all ages to connect with each other and explore: dance, sing, paint, swim, make new friends and have a great time.", "category": "Art Galleries Speciality Museums Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "WONDR Experience"], "hours": "11:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Meeuwenlaan 88, 1021 JK Amsterdam The Netherlands", "neighborhood": "Neighborhood: Oud Noord", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/ed/90/09/wondr-experience.jpg"]}
{"name": "Dam Square", "description": "All roads lead to Dam Square, the real heart of Amsterdam, where The Royal Palace, the Nieuwe Kerk and the War Memorial overlook this vast and bustling open space.", "category": "Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Dam Square"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Burgwallen-Nieuwe Zijde", "rating": 0, "getting_there": ["Nieuwmarkt • 8 min walk", "Centraal Station • 10 min walk"], "top_reviews": [{"title": "It Is a Dam Large Square!!", "review": "Dam Square and Dam Palace lie in the heart of Amsterdam, at the original location of the dam in the Amstel River. It is a large, bustling square where people gather, and there are numerous shops and cafes that line the square. There is also a National Monument an important memorial to World War II. Dam Palace, Dam Square, Dam pictures and YES, my husband had to make some dam jokes!", "rating": 5.0, "visited": "November 2023"}, {"title": "Busy", "review": "Dam Square is like the Times Square of Amsterdam, minus all the crappy traffic and people. It's a gorgeous, wide open area with several popular places such as Royal Palace, Madame Tussauds, and Bijenkorf. There are many shops and places to eat/drink. There is also easy access to a lot of the major trams that spreads throughout the city. This is a great place to walk in the middle of and just take it all in. The people, the birds, and sometimes performances (even soccer games!) are just brings a great vibe and gives you that \"I'm Here\" feeling.", "rating": 5.0, "visited": "December 2023"}, {"title": "Not my favorite spot in Amsterdam, but iconic nonetheless", "review": "Always busy, always crowded, but iconic nonetheless. The facade of the Royal Palace is impressive as well as the grand dame of Amsterdam hotels, Grand Hotel Krasnopolsky, facing the National Monument, which is not exactly a masterpiece. My favorite corner in Dam Square is the beautiful austere 15th-century Gothic revival masterpiece, the Nieuwe Kerk, which is one of the oldest churches in Amsterdam.", "rating": 5.0, "visited": "October 2023"}, {"title": "Amsterdam was founded on this site.", "review": "In the XIII century, there was no square here, but there was an empty place where freshly caught fish were sold. Around 1270, local fishermen built a dam and a lock on the Amstel, and a fishing village of a dozen houses was named Amsteledamme. Now it is the symbolic center of Amsterdam. The square has two dominants facing each other - the Royal Palace and the national monument in honor of those killed in World War II. Despite the name, King Willem-Alexander does not live here, his residence is in The Hague. However, official events with his participation may take place here. But the weddings of the monarchs take place in the neighboring building- the Nieuwe Kerk, facing the square from the side. On the opposite side, where the national monument is located, there is a large department store De Bijenkorf, the Madame Tussaud Museum, the Grand Hotel Krasnapolsky and Hotel Twenty Seven. All these buildings were built at different times in different styles, but strangely enough, such eclecticism doesn`t spoil the Dam Square...", "rating": 5.0, "visited": "May 2023"}, {"title": "Unassuming square", "review": "There is an ambience about the space as people hustle and bustle by. The Riyal Palace is being cleaned and looks underwhelming which takes something from the square. There are shops and restaurants dotted around but it lacked any real wow factor.", "rating": 5.0, "visited": "March 2024"}, {"title": "Busy place central Amsterdam", "review": "We have been in a hotel directly a the Dam Place. From here you can walk in all directions and all streets will ending finally at the Dam. ( like all streets leading to Rome ) The Dam has the royal palace, the war monument, shops, coffees and at the other side the red light district. Always a lot of people there.", "rating": 5.0, "visited": "May 2024"}, {"title": "Very Busy Square", "review": "A very busy but central square on the Damrak. You’ll find the Royal Palace, NienweKerk and National Monument here and all are architecturally impressive. Madame Tussaud’s is also here along with numerous shops and restaurants, hence the busy nature. Well worth a visit!", "rating": 5.0, "visited": "May 2024"}, {"title": "Classic town square", "review": "Nice open space near the Royal Palace. Always crowds and always some forms of entertainment going on. The historic significance of the square is really not fully evident unless you tour the adjacent sites and hear about their relationship to the square.", "rating": 5.0, "visited": "June 2024"}, {"title": "Can Be Chaotic", "review": "One of the centers of the city and you will surely pass through here. Several important buildings are here and you are in the middle of all the shopping. But this is also the middle of all the tourism, so be prepared for wandering crowds. Some construction going on during our visit, making it a bit of chaos.", "rating": 5.0, "visited": "June 2024"}, {"title": "Okay but no wow factor", "review": "Square itself was reasonably quite but surrounding street were particularly busy. Nothing special but surrounded by historic buildings, would probably have been more interesting for us if we'd been part of a tour. Felt the square was let down by having two burger vans plying their trade at opposite corners of the square.", "rating": 5.0, "visited": "August 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/11/37/7e/station-in-view.jpg"]}
{"name": "Royal Palace Amsterdam", "description": "The Royal Palace Amsterdam is in use by the Dutch Royal House. Most of the year, the Royal Palace is alsof open for visitors. You are welcome to discover the rich history and interior of this magnificent building in the heart of Amsterdam. Visitors are welcome to discover the building's rich past and legacies left by it's successive occupants - as Amsterdam's Town Hall for 150 years, the French Royal and Imperial Palace for 5 years and the Palace of the House of Orange for the past two centuries. The Royal Palace was built in the seventeenth century as the Town Hall of Amsterdam, after a design by Jacob van Campen. It's paintings and sculptures were made by some of the most distinguished artists of the time and allude to the city's influence and prosperity in the Dutch Golden Age. In 1808 Louis Napoleon, brother of the French Emperor Napoleon Bonaparte, became King of Holland and converted the Town Hall into a Palace. The superb collection of Empire furniture, clocks and chandeliers date from that period. The collection of Empire furniture is one of the best preserved and most complete collections in the world. The rooms in the Palace are decorated with artworks from the collection of the House of Orange-Nassau Historic Collections Trust. Many paintings show the various members of the family of Orange-Nassau", "category": "Architectural Buildings Government Buildings", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Royal Palace Amsterdam"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Nieuwezijds Voorburgwal 147, 1012 RJ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Burgwallen-Nieuwe Zijde", "rating": 0, "getting_there": ["Nieuwmarkt • 9 min walk", "Centraal Station • 10 min walk"], "top_reviews": [{"title": "Clever guided Tour", "review": "We really enjoyed the tour. The guided digital tour is amazing and you can go at your own pace listening and watching in as much detail as you like. Fascinating to see the rooms used by world leaders as well as the history and amazing art especially the sculptures. This is so integral to Dutch history and Dam Square so a clever tour to let you see so much when it’s not in Royal use. Stunning.", "rating": 5.0, "visited": "October 2023"}, {"title": "Interesting Visit", "review": "Well worth a visit when in Amsterdam. The central hall upstairs is an impressive highlight and the audio guide is interesting and informative. The only thing that was slightly annoying was that you had to wait in queues to look in rooms behind plastic screens but we visited on Xmas eve so quite busy so maybe at quieter times it’s not as noticeable.", "rating": 5.0, "visited": "December 2023"}, {"title": "Great Palace visit", "review": "A lovely Royal Pace that was formerly a City Hall. Good audio guide that you can do key bits or whole Palace. The entrance hall is especially good as ate the bedrooms and throne room.", "rating": 5.0, "visited": "February 2024"}, {"title": "Underwhelming", "review": "Audio guide tour was included in a very reasonable ticket of 12 euro. The whole tour was about an hour. Lots of rooms were peak-inside only through the door; no entry. Audio guide was quite minimalistic. If you run out of things to do it’s a good place to visit. This is our fourth trip to Amsterdam and first time we did it.", "rating": 5.0, "visited": "March 2024"}, {"title": "Interesting", "review": "The visit with the audio guide, free and essential, is very interesting. No need to really book, you can come at any time, and you are very well received. 23 pieces to see, it takes an hour and a half. There is a cloakroom downstairs, free, but not self-service.", "rating": 5.0, "visited": "February 2024"}, {"title": "Excellent value fascinating tour", "review": "This is a must see in Amsterdam. Although the exterior looks a little worn, the interior is a fascinating tour of the history of the palace and Dutch history. You actually get to see the famous balcony, throne rooms and where the transfer of power between Dutch monarchs takes place. I was over two hours going around. At 12.50 euros it represents excellent value for money. This and a canal boat tour would make for a lovely day in Amsterdam.", "rating": 5.0, "visited": "March 2024"}, {"title": "A must see!", "review": "The most amazing thing I got to experience in Amsterdam was The Palace. Beautiful! Absolutely lost for words. Very affordable ticket prices! You are also able to get a headset for free which you defiantly need as there is no other information at the palace. You have to leave your bags etc however, they hold them for free. No eating/drinking. You can take photos but with no flash and video recording is not allowed.", "rating": 5.0, "visited": "March 2024"}, {"title": "Very interesting", "review": "Felt this was worth a visit. The audio tour made it better, and more interesting then perhaps just looking would have (is included in the ticket) and they are slick getting you set up in your preferred language. Talks about the architecture, sculptures, flooring, rooms, furniture, paintings including up to modern day with King William. Definitely a good visit", "rating": 5.0, "visited": "April 2024"}, {"title": "Far exceeded my expectations", "review": "This palace was once known as the 8th Wonder of the World. When looking at it from the outside, while in the City Center Square, the exterior looks like it needs some power washing or something. But once you go inside and pay the ticket fee and get your audio tour guide, it is filled with extraordinary architecture, art and history. I would definitely recommend visiting the Royal Palace and Amsterdam.", "rating": 5.0, "visited": "March 2024"}, {"title": "An enjoyable way to spend an hour", "review": "I had an hour to kill before catching the Eurostar from Centraal Station so I took a tour of the Royal Palace in Dam Square. As with everywhere I visited in the Netherlands there is really good bag storage. You really need the audio tour, as there are no labels on things and you can only see some rooms from a barrier at the door. In spite of this I found the tour quite enjoyable. The audio tour is very well done and for most rooms there are additional sections specifically for the paintings. The highlight is the final room on the tour, where the judges used to sit and punishments were dealt out. Good for an hour or so.", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/f2/25/d6/night-view.jpg"]}
{"name": "Hortus Botanicus", "description": "", "category": "Gardens", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Hortus Botanicus"], "hours": "10:00 AM - 5:00 PM", "duration": "", "address": "Plantage Middenlaan 2A, 1018 DD Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 5 min walk", "Weesperplein • 8 min walk"], "top_reviews": [{"title": "Beautiful well appointed botanical garden", "review": "Hortus Botanicus is not huge, but the hothouses full of lush tropical greenery are lovely. One hothouse even has butterflies. The garden is more beautiful in spring of course, when its beautiful flowers are in full bloom. As planned, I went to their cafe, where I enjoyed sublime apple crumb cake with raisins and a cup of turmeric tea in gorgeous surroundings.", "rating": 5.0, "visited": "October 2023"}, {"title": "An oasis of calm!", "review": "A lovely, small botanical gardens. Beautiful glasshouse with three climate zones. Went in winter so the outside gardens were not doing much but I’m sure would be lovely in the spring. Very nice cafe/restaurant too. Very peaceful place.", "rating": 5.0, "visited": "February 2024"}, {"title": "A botanical wonderland!", "review": "It is truly a botanical wonderland! As I walked through the different sections of the garden, I was amazed by the variety of plants from all over the world. From tropical rainforests to arid deserts, the garden has recreated different ecosystems, making it a truly immersive experience. Apart from the impressive flora, the hortus botanicus also boasts a stunning butterfly greenhouse. Walking through this enclosed space, surrounded by a multitude of colorful butterflies, felt like a magical journey. Not only is the hortus botanicus a romantic spot for a first date, especially in the evening with its illuminated pathways and hot chocolate, but it is also a perfect destination for families. The enchanting atmosphere of the garden gives me the tingles, and I am already looking forward to my next visit.", "rating": 5.0, "visited": "January 2024"}, {"title": "Quiet and Lovely Botanical Garden", "review": "A perfect place to visit for peace and quiet. Although I visited in February (and am sure it's even more amazing in the summer and fall), I was impressed by the careful layout of the grounds and the variety of flora and fauna. There's a lovely gift shop and cafe and several greenhouses.", "rating": 5.0, "visited": "February 2024"}, {"title": "Small well manicured garden", "review": "The botanical garden was interesting but smaller than I expected. They are working on a significant greenhouse expansion that will definitely increase the size of the garden. The palm greenhouse was unique with some palms you don’t frequently see and some that are really old. My wife especially enjoyed the butterfly greenhouse. There were about 4 species of butterflies active.", "rating": 5.0, "visited": "April 2024"}, {"title": "Interesting history", "review": "After visiting Kuekenhof gardens, this was a little underwhelming. The best part was the cool glasshouse with tropical plants. The building is really magical. The gardens were pleasant to walk through. Nothing was in English so I didn’t know what I was looking at. I did appreciate it for its historical significance.", "rating": 5.0, "visited": "May 2024"}, {"title": "Nice way to spend a couple of hours", "review": "Lovely gardend with plenty to see and information on each area of the garden. There were some beautiful Tulip displays which were definitely one of the highlights. The greenhouse is under renovation but you can walk around parts of it. We also had a lovely lunch in the cafe and that is definitely worth visiting alongside the gardens.", "rating": 5.0, "visited": "April 2024"}, {"title": "A nice respite", "review": "Very nice compact gardens. Perfect for a walk around with children or alone. No admission charge with the IAmsterdam card. Loved the butterfly area and the fact that most plants were labelled. Located very near a stop on Tram 14", "rating": 5.0, "visited": "June 2024"}, {"title": "For the butterflies 🦋🦋 alone it's worth the visit!!! Beautiful botanical gardens!", "review": "What a BEAUTIFUL place!! The plants and the butterfly enclosure were so lovely. Allow at least an hour if tight for time. Went here after dropping luggage off in Centraal station, caught the 14 tram to Hortus Botanical garden. So glad we did!!!", "rating": 5.0, "visited": "July 2024"}, {"title": "Visit to Hortus Botanicus", "review": "We had very high expectations and so initially we had a bit of disappointment. It's made in a very small area and so sprawling gardens were missing there. But then it had amazing varieties of plants few of which were very old. We also saw carnivorous plants like pitcher plant etc.about which we had only read in books. Then we enjoyed the soup in the Cafe there, which is set amidst beautiful green plants. Overall we enjoyed the visit.", "rating": 5.0, "visited": "July 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/5f/73/c2/botanical-garden-hortus.jpg"]}
{"name": "Willet-Holthuysen Museum", "description": "Visitors can tour this 17th-century canal-side house in Amsterdam, which is filled with furnished period rooms and works of art that were donated by the owner Louisa Willet-Holthuysen to the city in 1895.", "category": "Historic Sites Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Willet-Holthuysen Museum"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: < 1 hour", "address": "Herengracht 605, 1017 CE Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 4 min walk", "Nieuwmarkt • 9 min walk"], "top_reviews": [{"title": "Lovely private home museum and gardens in the middle of the town.", "review": "Lovely small museum that is a private home preserved and also offers rotating museum exhibits within the home and gardens. It's easy to see in less than an hour and interesting to see how the family lived and the detail of the building, the art and the gardens. If you want a smaller experience than the huge museums and like seeing historically preserved homes, this is a must see!", "rating": 5.0, "visited": "August 2023"}, {"title": "Unexpected tour", "review": "Stumbled across this house on our way to rembrandtplein. Decided to go in and enjoyed looking around. Audio is a must. Can’t beat a good tour. Interesting that a previous curator seems to have got rid of a few things 🤔🤔", "rating": 5.0, "visited": "November 2023"}, {"title": "Beautiful mansion and garden", "review": "After the Stromma cruise I felt rested enough to walk very fast to the Huis Willet Holthuysen from the Rijksmuseum and see the beautiful mansion in 45 minutes before closing. It was so worth it! The interior and the garden are truly spectacular, but to say that the ANONHI exhibit “She who saw beautiful things” impressed me would be a lie: this is not my type of art.", "rating": 5.0, "visited": "October 2023"}, {"title": "Behind the house facade", "review": "Get inside an 18th century Holland house? This house is a great opportunity:) Take your audio guide and enjoy the whole house from the garden behind the house, to the kitchen, and to the luxury apartments on top. For teens up to 18 the entrance is free.", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/28/82/0c/museum-willet-holthuysen.jpg"]}
{"name": "Amsterdam Pipe Museum", "description": "", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Amsterdam Pipe Museum"], "hours": "12:00 PM - 6:00 PM", "duration": "Duration: < 1 hour", "address": "Prinsengracht 488, 1017 KH Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "A unique museum in Amsterdam", "review": "I went on a weekend trip to Amsterdam and didn't plan my stay. When I searched for interesting places near my hostel I found the pipe museum. Even as someone who just started pipe smoking it was a very interesting visit. I felt very welcome. The museum itself is a collection of pipes, there is nothing to read so someone was there to guide me. The tour through the small house was very interesting and the guide was very helpful in answering questions also talking about his own experiences and preferences concerning pipes which made the tour more of a dialogue which I really enjoyed. All in all I had a great time and would recommend ta visit. Since it is also very central and not a big museum you don't have to plan your whole day around it.", "rating": 5.0, "visited": "March 2024"}, {"title": "Our visit to the Pipe museum", "review": "What an absolute gem of a place! The diversity, history and artwork of the pipes is stunning. For a small fee you get to see the museum on the 1st floor where the curator will talk you through the different areas that the pipes came from, what they are made of and their significance socially. It was extremely interesting.", "rating": 5.0, "visited": "May 2024"}, {"title": "A hidden gem", "review": "My friend and I were looking to visit a less famous museum in Amsterdam as we've been here numerous times. We came across this museum without expecting much but we were surprised by how interesting it is! We had a guided tour in french which made the experence much better as we had the full explanation about the history of pipes. Definitely worth the visit.", "rating": 5.0, "visited": "June 2024"}, {"title": "Interesting guided tour around the museum floor, beautiful collection.", "review": "I came in the late afternoon hours ans started the guided tour at the upper floor. The pipe collection spans from the ancient civilizations and cultures of different ethnic groups and people, through the industrial and the colonial eras and to these days. You will here stories about pipe related rituals and what it symbolizes each one of them. You can take pictures inside, and even have a photo with a giant smoking pipe. It is fun and interesting history-wise, even for a non-smoker like me.", "rating": 5.0, "visited": "May 2024"}, {"title": "Smoking my pipe", "review": "I really enjoyed visiting the museum. The staff was very nice and friendly. My guide was a very professional young man. The diplay is very nice and also the house where the museum actually is. I think they should promote this museum much more. A pity that some books are only in dutch, but most of their materials it's in english. Some would say they promote 'bad habit', but smoking it's something concerning our culture and mankind.Anyway I would say a visit to this museum it is a must. It's located in one of the nicest canal in Amsterdam and it won't take you much time to visit it. At 12 o'clock I was the first visitor, and I took some great photos. Nice postcards and books are available for sell.", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/5b/89/27/amsterdam-pipe-museum.jpg"]}
{"name": "The Jordaan", "description": "This charming neighborhood is Amsterdam's Greenwich Village, with its narrow alleys, leafy canals lined with 17th-century houses, quirky specialty shops, cafes and designer boutiques.", "category": "Neighborhoods", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "The Jordaan"], "hours": "", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Charming walks", "review": "Lovely shops, charming strolls around to see the neighbourhood. Great restaurants and places to eat. Easy to walk out and hop on a tram or bus to go elsewhere in the city. We stopped in the mechanical toy store with our kids and they loved it - spent quite a while playing with toys there.", "rating": 5.0, "visited": "October 2023"}, {"title": "Beauty, history, and culture", "review": "The Jordaan is a charming neighborhood in Amsterdam with picturesque canals, historic buildings, and a lively local vibe. Highlights include the Noordermarkt, Anne Frank House, and numerous cafes and art galleries. Don’t miss the Dutch apple pie and local cheeses. A must-visit for its beauty, history, and culture.", "rating": 5.0, "visited": "May 2024"}, {"title": "Upscale, Charming, Quiet", "review": "This is the cool neighborhood, a great place to stay in a hotel or to live. Charming canal houses and some very good restaurants. It is clean and safe and a bit away from the honky tonk areas that are clogged with tourists. Come and take a stroll, have a coffee.", "rating": 5.0, "visited": "June 2024"}, {"title": "Lovely stroll", "review": "While exploring Amsterdam by use of a hop-on-hop-off bus and boat, it was easy to get to a number of places to explore on foot. The Jordaan neighborhood was very beautiful, and we were able to explore many streets. As other reviewers have said, it is much quieter than Amsterdam city center, and it is even a little more picturesque. We were lucky to be there on a clear, sunny day with no agenda. Great walk.", "rating": 5.0, "visited": "July 2024"}, {"title": "Best to explore if you need quiet", "review": "Although this was the best spot in the central Amsterdam, I still was not as impressed as in Leiden. The worst are cars parked along the canals. But if you're there for the first time, visit the Jordaan: it's quiet, clean and cozy.", "rating": 5.0, "visited": "August 2023"}, {"title": "Must-Visit Neighborhood in Amsterdam", "review": "The Jordaan is a beautiful and charming part of Amsterdam. With its picturesque canals, historic buildings, and cozy cafes, it offers a true local experience. Wandering the narrow streets and discovering hidden courtyards was a highlight of my trip. The neighborhood has great shops, markets, and delicious food options. It's a perfect spot to explore and enjoy the city's authentic vibe.", "rating": 5.0, "visited": "August 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/23/f2/68/jordaan-amsterdam.jpg"]}
{"name": "Anne Frank House", "description": "The Anne Frank House (Dutch: Anne Frank Huis) is a museum dedicated to Jewish wartime diarist Anne Frank. The building is located on a canal called the Prinsengracht, close to the Westerkerk, in central Amsterdam in the Netherlands. As a visitor, you experience this story through a audio tour (there is also one especially for children), quotes, photos, videos, and original items. The Anne Frank House can only be visited with an online ticket for a specific date and time. These are only on sale through the website of the Anne Frank House: https://www.annefrank.org Please note that many invalid tickets are offered online. Also via URLs and websites similar to the one of the Anne Frank House. Commercial parties offering Anne Frank House tours do not provide access to the Anne Frank House.", "category": "Speciality Museums History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Anne Frank House"], "hours": "9:00 AM - 10:00 PM", "duration": "Duration: 1-2 hours", "address": "Prinsengracht 263 - 267 Museum Entrance Westermarkt 20, 1016 DK Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "This place must be on your bucket list. If you have any humanity at all.", "review": "I had read the book, seen documentaries and films both good and bad, now I wanted to see where it all happened. First challenge was booking a ticket. The slots fill up very quickly and can only be booked online so DO NOT HANG AROUND! The day we were there was completely sold out. You get a perspective on why the Franks decided to hide. \"Jews must turn in their bikes. Jews are not allowed to ride on Trams. Jews are not allowed in swimming pools. Jews must do their shopping between 1500 and 1700 each day. Jews are not allowed to sit in their gardens after 2000. Jews are not allowed to carry flowers. Jews are not allowed in Cinemas\"...the list goes on. Without any spoilers you get a flavour of the characters of the people. The most important and moving part was they fully acknowledged the part and the tremendous risks taken by the helpers, Johanes Kleinman, Jan Gies, Miep Gies, Bep Voskuil and Victor Kugler. If they had been caught they would have been shot if they were lucky. I thought I knew the story. I was wrong. It was incredibly moving. Most of all it showed the power of hope, and the strength of the human spirit in adversity. If you don't come out of there a different person you are not a human being.", "rating": 5.0, "visited": "October 2023"}, {"title": "Must see!!", "review": "We booked the group tour on the Anne Frank House website. Very moving and emotional experience. I would suggest to watch the new series \"A Small Light\", watching this before our visit was a real insight to this tragic story.", "rating": 5.0, "visited": "October 2023"}, {"title": "A Solemn Glimpse into History at Anne Frank House", "review": "Visiting Anne Frank House in Amsterdam was deeply moving. It's not just a museum, but a silent witness to a heartbreaking history. Walking through the rooms, you can picture the fear and hope that once lived within these walls. It’s beautifully kept and tells a story that we all need to hear, to remember the dark times and ensure they never happen again. However, some review I've read are madness! This isn’t a place for thrill-seekers or fun photos. It’s a place to quietly reflect on a young girl’s life and the terrible events of the past. Make sure to book your tickets well in advance, it will be sold out weeks in advance and \"walk-ins\" don't happen.", "rating": 5.0, "visited": "October 2023"}, {"title": "A Must See", "review": "The Anne Frank House was a bucket list for me, as I taught the Diary of Anne Frank for many years. The experience was so sad, knowing what these people had to endure. I recommend this experience to everyone, as it is a very important part of our history.", "rating": 5.0, "visited": "September 2023"}, {"title": "An “Attraction” Worth the Wait", "review": "Feels a bit disrespectful writing a review of this “attraction”, but really wanted to make this visit. Yes there is a new visitor centre built next door I assume to cope with the visitor numbers, of which we added 3 people to those numbers. Bags and coats can be stored in lockers, included in the entrance charge. The inevitable queuing system works well and gives you time to read the captions and listen to the audio tours, included in the cost. I found the tour moving, Anne’s story was a story I’ve heard all my life, this was a bit of a pilgrimage of sorts. We later found out on a separate unrelated tour that the Gestapo headquarters in Amsterdam were, in WWII, just around the corner on the same block… History helps us avoid the mistakes of the past.", "rating": 5.0, "visited": "October 2023"}, {"title": "Haunting", "review": "The Anne Frank House Tour was a deeply moving and educational experience. Walking through the historic annex where Anne Frank and her family hid during World War II was both poignant and thought-provoking. The tour was well-organized, and our guide was knowledgeable, providing insightful commentary about Anne's diary and the events of that time. This visit was a powerful reminder of the importance of tolerance, understanding, and the need to remember history. A must-visit for anyone interested in the human story behind the Holocaust.", "rating": 5.0, "visited": "October 2023"}, {"title": "Anne Frank Hiuse: So earring and Interesting Experience", "review": "I was surprised at the modern facade. Behind this building is the actual “house” in which the Frank family took refuge. I learned a lot about their ordeal and the facts of their 2 year hiding. The house is not wheel chair accessible or for the disabled. Their are a lot of stairs and at least one is similar to a ladder. There is a bookstore/gift shop at the end with bathrooms plus a small cafe. Cloakroom is free. You won’t be comfortable going up all the stairs with your coats and large bags.", "rating": 5.0, "visited": "October 2023"}, {"title": "Sobering. Well preserved. Actual notebooks can be viewed.", "review": "This museum is a sobering reminder of how badly a society can deteriorate when driven by a philosophy of hate. I am grateful that the house/annex has been so well preserved and that our visit allowed us to see a few of Anne Frank's actual notebooks. Climbing the same steep, narrow steps, holding the same handrails, and walking the same floors where the family hid for those years was inspiring for us. It is difficult to imagine the fear and anxiety that permeated those rooms during 1942-4.", "rating": 5.0, "visited": "October 2023"}, {"title": "A sobering journey", "review": "A sobering journey of a young girls life, or lack of. The narrative told the story well. Some steep stair cases to climb so take care. The original features take you back to the time Anne and her family lived here and made you imagine them being used. I would have given it 5 stars but I was a bit disappointed that photographs were not permitted. Allow 1.5 hours.", "rating": 5.0, "visited": "October 2023"}, {"title": "A must visit while in amsterdam", "review": "This was an experience my husband wanted to do while in Amsterdam. As a mother with a 14 and 6 year old I was worried it would be a bit boring. How wrong was I. Everyone including my youngest enjoyed the tour. You are given head sets to talk you through each room you visit it's not overcrowded and you walk at your own pace. We all learnt alot and I would highly recommend doing this while in amsterdam. Not allowed to take photos so can't share any.", "rating": 5.0, "visited": "November 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/6d/ca/f9/cris-toala-olivares.jpg"]}
{"name": "Rembrandts Amsterdam Experience", "description": "Rembrandt is one of the most famous painters in the world. Step back in time to 1663 and visit his last studio. Rembrandt and his family take you on a fascinating journey through the painters’ life. You will be completely immersed into Amsterdam of the 17th century with the use of video projections, scents, music and 5D effects. Available in English and 7 other languages.", "category": "Speciality Museums Art Museums History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Rembrandts Amsterdam Experience"], "hours": "11:00 AM - 7:00 PM", "duration": "Duration: < 1 hour", "address": "Weteringschans 2, 1017 SG Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Well presented", "review": "Very well planned. Audio device worked well and you could pause and resume easily throughout the tour to suit yourself. The house has been designed to replicate the original with well maintained artefacts to make it life like. The etching demonstration was well worth taking part in. Well priced at €17.", "rating": 5.0, "visited": "October 2023"}, {"title": "Thorough introduction to Rembrandt", "review": "We enjoyed this much more than we expected. The audio tour was very thorough and interesting, easy to use and you could pause it whenever you wanted or revisit areas. We saw Rembrandt’s paintings in the Rijkmuseum as well, but this audio tour gave me a much better idea of the techniques he used and even how he mixed his paints. It was also interesting to focus on his etchings, which I would probably not have bothered to look at otherwise. A good introduction to his life as well. Highly recommended.", "rating": 5.0, "visited": "September 2023"}, {"title": "A great introduction to the artist and city if you don’t know much about either.", "review": "This was a fun, little experience! It’s about 25mins and I felt that the price was appropriate. I did the VIP ticket which allowed me to choose a time 15 mins before the actual opening time. It included a little sweet snack and drink (water, soda, or juice. The experience includes two rooms that are immersive, but note it is not interactive. It was a great way to learn a little more about Rembrandt’s life within the context of the historical city of Amsterdam. It was very creative and well orchestrated. I recommend attending this towards the beginning of your stay as it will give you a basic level context and the history of 1600s Amsterdam. When you walk out and explore the canals and tight streets, you can start to imagine how it was during those times. And it did not take long, so you can really squeeze it into a larger itinerary, which is how I planned it.", "rating": 5.0, "visited": "October 2023"}, {"title": "Everything Rembrandt!", "review": "We purchased the Combo Reservation for the Rembrandt’s Amsterdam Experience and the Rembrandthuis Museum. Earlier in the morning, we had an interesting and informative tour at the museum. We weren't sure what to expect from the Rembrandt Experience. It is a well-done visual synopsis os Rembrandt’s life. It takes place in two rooms which envelope and draw you into his life. I will add that while we enjoyed it - it is very short, and I am not sure that it is worth the cost if you had not purchased the combo ticket.", "rating": 5.0, "visited": "October 2023"}, {"title": "Short but educational and great 5D experience. Totally worth it!!!", "review": "It was my very first trip to Amsterdam, from 26.12 - 28.12 and hopefully not my last one. So many places to visit and interesting things to see. My schedule was already full and I couldn't make it to Rembrandt's house. But Rembrandt's Experience was a great alternative and I'm glad that I choose this place. In a short amount of time (20-30 minutes), you'll learn the most important things about Rembrandt's life and family. The 5D experience will leave you speechless, especially if you haven't already experienced something similar before like me. Very educational, with great effects and setup that it will bring you with a short Time travel back to the Dutch Golden Age.", "rating": 5.0, "visited": "December 2023"}, {"title": "A fun experience!", "review": "We very much enjoyed our time at the Rembrandt’s Amsterdam experience. It is not a museum, it is more like an experience that you can immerse yourself in and enjoy the dramatic performance of Rembrandt and his story. At the end there was an option to create some fun AI Rembrandt style artwork, which we look back on with fondness. It was a great 1 hour fun which we were able to slot in whilst we were waiting for a restaurant booking. Thank you for the great experience.", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/22/ad/af/a9/explore-the-magical-transforma.jpg"]}
{"name": "Leiden Square (Leidseplein)", "description": "Planning a night out in Amsterdam? Head down to Leiden Square (Leidseplein,) which is known as the center of nightlife where you can choose from hundreds of bars, clubs, restaurants and discos that would suit every style and taste.", "category": "Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Leiden Square (Leidseplein)"], "hours": "", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/fc/f7/a5/leidseplein.jpg"]}
{"name": "Straat Museum", "description": "STRAAT is the museum for street art and graffiti. In an enormous warehouse on the NDSM terrain in Amsterdam, more than 160 gigantic artworks are shown. These were created on-site by international artists. The collection is constantly growing, giving visitors the chance to catch artists painting live.", "category": "Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Straat Museum"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "NDSM-Plein 1, 1033 WC Amsterdam The Netherlands", "neighborhood": "Neighborhood: Noordelijke IJ-oevers", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Not to be missed", "review": "Wow what an experience that shouldn’t be missed of anyone’s list visiting Amsterdam ! The adventure begins getting to the place, short ferry ride across from Amsterdam central station We have visited many graffiti exhibitions all over the world and this one stands close at the top as one of our favourites! The size of each piece of art is amazing and how it is displayed in the building A large variety of artwork to view and so much information shared on each piece We didn’t take a guided tour, we chose to work our way a round the exhibition by ourselves. It’s one of the first exhibitions visited not to have a big display of Banksy but in reality it has so many other artists artworks that’s just as incredible it wasn’t missed. The vibe is so relaxed and open it was an enjoyable visit Cafe was welcoming and in style to the exhibition Amazing visit and we will be back next time in the city.", "rating": 5.0, "visited": "November 2023"}, {"title": "Fabulous", "review": "This has got to be the best place to see this art form.. I can honestly say it's the longest I've stayed at a gallery. We loved it. Easy to hop on the free ferry at the back of the train station. Head for the building with the mural of Anne Frank on he side. A large factory building,well laid out. Some seating benches as you walk round and plenty of information as you walk round. Toilets on upper level as is the street food cafe.", "rating": 5.0, "visited": "June 2024"}, {"title": "Beautiful museum in unique setting", "review": "Even though I'm not crazy about graffiti art - visiting this museum was a great experience. The huge artworks, the unique space, and the colorfulness of everything made for a fantastic visual experience. I did not read the explanations of all the works, but the free phone-based audio tour gives some interesting explanations, and some large signs provide interesting clarifications about types of graffiti work, about the influence of graffiti on social campaigns etc.", "rating": 5.0, "visited": "August 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2d/a0/df/0c/caption.jpg"]}
{"name": "Buiksloterweg Ferry", "description": "", "category": "Ferries", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Buiksloterweg Ferry"], "hours": "", "duration": "Duration: 1-2 hours", "address": "", "neighborhood": "Neighborhood: Van der Pekbuurt", "rating": 0, "getting_there": ["Amsterdam Centraal • 5 min walk", "Amsterdam Centraal Station • 5 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/ea/34/56/free-ferry-heading-the.jpg"]}
{"name": "De Krijtberg - Sint Franciscus Xaveriuskerk", "description": "Neo-gothic church from the 19th century, with a history that goes back to the 17thcentury era when the catholic was underground in the Netherlands.", "category": "Architectural Buildings Religious Sites Churches & Cathedrals", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "De Krijtberg - Sint Franciscus Xaveriuskerk"], "hours": "2:00 PM - 5:00 PM", "duration": "", "address": "Singel 448, 1017 AV Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/08/6c/be/1c/caption.jpg"]}
{"name": "Heineken Experience", "description": "Go on a interactive journey at The Heineken Experience at Heineken's oldest brewery. The tour is mostly self-guided, with guides at certain key points. Here, you can learn about the history, gain insight into the brewing process, and customise your own Heineken bottle or glass at the souvenir shop. At the end of the tour, enjoy two Heinekens, and even get the chance to pour your own draught. – Tripadvisor", "category": "Breweries", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Heineken Experience"], "hours": "10:30 AM - 9:00 PM", "duration": "Duration: 1-2 hours", "address": "Stadhouderskade 78, 1072 AE Amsterdam The Netherlands", "neighborhood": "Neighborhood: De Pijp", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Really helpful staff", "review": "Arrived with my 78 year old mum after she'd walked some distance across Amsterdam as part of a tour. The queue to enter was huge and my mum was exhausted. The security guard approached us and found somewhere for mum to sit and rest. She was too tired to take the tour, but I was given priority entry so she didn't have to wait too long for me (we'd already got tickets ahead of the day). I have to say that the staff were excellent at this venue and I appreciated them being so accommodating. It's not easy travelling with an elderly relative and they made my visit so much easier. Thank you to you all.", "rating": 5.0, "visited": "October 2023"}, {"title": "The best time!!!!", "review": "Julieta is amazing she was so lovely and told us many facts and was so sweet to us!!! As was Valentina (I think that was her name) she game my friend who’s birthday it was a free drink! We love to see it! But either way. Great fun and such lovely staff!! So sweet. Highly recommend!!", "rating": 5.0, "visited": "October 2023"}, {"title": "First impressions count", "review": "First impressions were not good. Its quite badly organised and we were 30mins late into getting underway on the tour. However, things improved drastically and it turned out to be a really fun experience on our holiday. Even as a non-beer drinker, I really enjoyed the whole experience. The staff were great.", "rating": 5.0, "visited": "October 2023"}, {"title": "Touristy but actually a lot of fun (for two brothers in their 20s)", "review": "Had a great afternoon being guided through Heineken's history and the brewing process of its world-famous beer. Lots of opportunities for novelty photos and souvenirs. Some really good interactive/hands on moments. Definitely recommend matching with the canal cruise tour where you can sit back with a beer and learn more about Amsterdam from a fantastic guide.", "rating": 5.0, "visited": "August 2023"}, {"title": "I'm usually not a beer drinker but I had the best time on this tour", "review": "My family and I decided to do the VIP tour and it was the best decision! You get a personalized Heineken bottle with your name printed on it to take home with you, you have a tour guide taking you around so you can learn everything there is to know as well as avoid the huge crowds, and you get a private tasting in this very cool hidden room! You learn all about the brewing process and how the Heineken brand came to be, there are all of these interactive rooms throughout the tour, and at the end you also get another two free Heineken beers of your choice! Definitely a fun activity to do in Amsterdam.", "rating": 5.0, "visited": "July 2023"}, {"title": "Nice way to spend an afternoon and recommend rooftop bar", "review": "I’m not a beer drinker and was travelling on my own, yet I still enjoyed my experience here. I bought my ticket direct online from the website and arrived at the given time, you’ll still need to wait around 10-15 mins in the queue to get this scanned and get your tokens - in addition to the tokens you also get a free taster mid tiur. There are friendly and highly enthusiastic tour guides in key areas, lots of signage and things to look at with some history to Heineken thrown in. The ride isn’t a ride, it’s standing in a roo with big projections over screens and is a visual experience. The rooftop bar is worth it as you get lots of space to yourself and great views of the city, and it’s not crowded up there", "rating": 5.0, "visited": "October 2023"}, {"title": "Great time, and the rooftop bar was awesome", "review": "During my trip, I kept passing by and seeing this Heineken building. I had some time on my last day in Amsterdam, and decided to get tickets and give it a try. I'm so glad I did - this was so much fun! I thought it was really cool learning about the history of Heineken and seeing the traditional ways of brewing beer. The giant copper containers looked very steampunk to me. The electronic \"ride\" was a little cheesy, but afterward they gave us a beer tasting, which was neat. I got a ticket that included the rooftop bar. I'm not a big drinker, or a bar person, but the rooftop was really cool. They made cocktails out of the beer, and gave me tokens so I could relax there and try different drinks. Great vibes and great time overall. This ended up being one of my favorite things I did in Amsterdam!", "rating": 5.0, "visited": "October 2023"}, {"title": "Quick tour bed", "review": "My partner and I were able to snag tickets for the first tour of the day. We had a blast with all the interactive parts and enjoyed learning about the history and process of brewing beer. Highly recommend if you’ve got a few hours in the city and enjoy Heineken", "rating": 5.0, "visited": "January 2023"}, {"title": "Three Beer Tour", "review": "Went after recommendation, been to a few distillery tours so thought might be the same, but this brewery doesn’t brew beer here any more. The tour runs through the bowels of the old brewery, with a lot of self promotion (obviously) but still gives you a taste of what once went on. Three beers included at the price, one during the tour and two tokens to use at the bar. Top tip Heineken Silver has less alcohol, so stick to full fat Heineken… joking apart zero alcohol is available too. Took the rooftop experience, which gives great views. Of city from high up in a city/country with no hills. Only issue was, junior decided he only wanted to spend one token, not give it to me, and save beer token as a souvenir!", "rating": 5.0, "visited": "October 2023"}, {"title": "VIP Tour is the way to go!", "review": "We had fun on this private VIP Tour hosted by tour guide Maria from Athens. It’s not an active brewery but the history was interesting and there was only about 10-12 people on this 2 hour tour. The 2nd hour we went to a private bar (just our small group) for beer tastings with snacks. We tasted about 4 full glasses of beer and they give you two tokens to go to the crowded (not private) bar after the tour is over. Glad we paid extra for this tour. Worth the extra money.", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/2e/7b/7d/heineken-experience-heinekenr.jpg"]}
{"name": "Westerpark", "description": "", "category": "Neighborhoods", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Westerpark"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Amsterdam West", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/03/ed/a6/caption.jpg"]}
{"name": "The Amsterdam Dungeon", "description": "Amsterdam's murky past comes to life at the Amsterdam Dungeon * walk through Amsterdam’s sinister past * 500 years of history brought to you in about 80 minutes * meet our witch hunter, soul merchant and many other mouth breathers * go deep into the dungeon with (max) 29 other sinners * you are part of the show (or push another victim forward) * Scary True Stories and 'orrible Actors * English spoken… but also available in Dutch…. If you want to brag! * 10 years or younger? We wouldn’t do it, but that’s just an advise * Don’t tell anyone, but you can leave if you can’t take it anymore", "category": "Speciality Museums Game & Entertainment Centers", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "The Amsterdam Dungeon"], "hours": "11:00 AM - 7:00 PM", "duration": "", "address": "Rokin 78, 1012 KW Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Nieuwmarkt • 9 min walk", "Waterlooplein • 10 min walk"], "top_reviews": [{"title": "Went here right after the wax museum, with wife and daughter.", "review": "The people putting this down are have unreasonable expectations. This is a show. It’s entertainment. This isn’t a history lesson. It’s a full 90 minute show. Compared to Madame Tussaud, this was a far better deal. We spent a whole 40 minutes at the wax museum. This was fun entertainment. Lots of laughs. Lots of fun. Lots of jump scares. They include people. Just be sure your English is good or some other language they provide tours for. Free glass of beer at the end.", "rating": 5.0, "visited": "November 2023"}, {"title": "That was Dam Scary 😰", "review": "Myself and my partner went here to experience the dark side of Amsterdam, we were not disappointed! From the start they set the mood and it only gets better from there! I screamed so loud in the Dutch mans scene! Would recommened to anyone who loves dark and scary experiences 😖", "rating": 5.0, "visited": "November 2023"}, {"title": "Amazing!", "review": "I totally loved it! My boyfriend isn’t really into scary stuff but he enjoyed it as well! It was funny and scary and we enjoyed a cup of Pop or Beer at the end. It’s an hour long and you get to do a lot as well. The characters involve you as well which makes this even better.", "rating": 5.0, "visited": "January 2024"}, {"title": "Meh", "review": "Having been to the ones in Edinburgh, London and Berlin previously we thought we would give this one a visit whilst we were there. Once you’ve been to one or two of them then a lot of the script is very similar if not the same so was a bit boring in parts - not really the actors/staff fault as they were pretty decent at what they do. Also compared to previous ones we have visited it just felt a little duller and lacking something. If you’ve been to others then I’d probably not bother but if you haven’t then it’s maybe worth a visit.", "rating": 5.0, "visited": "February 2024"}, {"title": "Amazing experience", "review": "It was an amazing experience, a little scary but not too much just perfect. The photos turned out amazing. It's great to buy them all in digital as me and my partner did. We really enjoyed our trip there, i think it was one of the greatest things we visited in Amsterdam. We loved it.", "rating": 5.0, "visited": "January 2024"}, {"title": "Great experience at Amsterdam Dungeon", "review": "The attraction was absolute fun. The actors were professional, funny and scary at the same time. The interactive show was hilarious. Plus we also managed to learn about Amsterdam's history!. My 13 years old daughter was literally glowing through the entire tour. I highly recommend it!", "rating": 5.0, "visited": "April 2024"}, {"title": "A must if you are in Amsterdam", "review": "It is a must if you are in Amsterdam. It is not scary at all if you enter with the mindset that it is a safe experience and nothing will happen to you. It is a funny, unexpecetd and really amazing experience. There are well prepared actors who are dressed according to the show and are very good at what they do. You pass from one room to another and live a different advenure in every room. It is an interactive experience where the public(visitors) are included, and is better enjoyed if everyone plays the part according to instructions they give you. The only bad thing is that it is not allowed to take photos or videos of your own inside, but at the entrance they take some funny pictures of you that you can purchase at the end of the experience.", "rating": 5.0, "visited": "May 2024"}, {"title": "I loved it - and I don't like horror", "review": "Hilariously funny. I thoroughly enjoyed this whole experience. There are parts where it is very dark, but the only thing tgat was scary was the thought of tripping in the dark. The rest is all entertaining fun. Great experience - worth every penny.", "rating": 5.0, "visited": "May 2024"}, {"title": "Fun time for most it's worth a stop to see", "review": "Fun time and they do a good job. It's a fun way to learn a little history and have some fun too. I've done these in several different cities they are all kind of the same but there's still fun to be had.", "rating": 5.0, "visited": "May 2024"}, {"title": "Spooky, Wry and Intense", "review": "From the moment I stepped inside the building, I could feel I was in for an adventure. The non-acting staff made sure of it. They had a peculiar sense of dry and dark humour which oddly enough, made me feel welcome. The set-up was brilliant. It was dark and eerie. The actors were incredibly talented. It was like I was transported to a different time. Jumpscares abound (I am an adrenaline junkie but the mild kind; I get spooked easily but I keep on wanting more. This is the perfect place for that). It was interactive-you get to be a part of the whole set which makes the experience even more unique and interesting. I absolutely loved it.", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/04/8e/6c/37/the-amsterdam-dungeon.jpg"]}
{"name": "Portuguese Synagogue", "description": "", "category": "Historic Sites Architectural Buildings Religious Sites", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Portuguese Synagogue"], "hours": "", "duration": "", "address": "Mr. Visserplein 3, 1011 RD Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 3 min walk", "Nieuwmarkt • 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/ea/6f/d3/portuguese-synagogue.jpg"]}
{"name": "Van Gogh Museum", "description": "Discover the world's largest collection of works by Dutch painter Vincent van Gogh, featuring masterpieces such as Sunflowers, The Potato Eaters, Almond Blossom and The Bedroom. Book your tickets online. Please consult the museum website for current opening hours.", "category": "Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Van Gogh Museum"], "hours": "9:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Museumplein 6, 1071 DJ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Museum Quarter (Museumkwartier)", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Don’t miss Van Gogh museum", "review": "Wonderful museum. Beautiful art and lots of fascinating information on the artist. I did not know the depth of his mental illness, it’s sad that such a brilliant artist suffered so deeply. You have to buy your tickets in advance and select a time slot, but that enables you to enjoy the the art without the museum being overcrowded.", "rating": 5.0, "visited": "August 2023"}, {"title": "Emotional and iconic", "review": "I don't often review such iconic attractions because it seems obvious and it is, but it's so nicely laid out and entrance well managed too, good value for money and so so moving. Merchandise in the shop was excellent, and the Pokemon cross over exhibition wall is inspired, and hilarious. Having read about Vincent, I'm sure he'd love it too. We got offered 200 euro for our tickets, any pokemon fans reading this- do book in advance!", "rating": 5.0, "visited": "September 2023"}, {"title": "Very nice museum", "review": "This museum is such a beautiful build and is one of the best modern museums. It houses the paintings done by master artist Vincent Van Gogh and is mind-boggling. Each and every work of him has been displayed carefully, and one can appreciate the artefacts and the efforts of the museum. If one is travelling in Amsterdam, then it's a must visit place.", "rating": 5.0, "visited": "September 2023"}, {"title": "Van Gogh and go", "review": "Not to be overlooked ! When in Amsterdam this is a must see . The art of Vincent Van Gogh still is inspiring . Some of his work is like a small child with a box of crayons . While others are awe inspiring . Beauty is in the eye …….. Worth the time to learn about an artist who gave so much . A painting a day . More to learn than look . The art lives the artist passes .", "rating": 5.0, "visited": "October 2023"}, {"title": "Spectacular trip to Van Gogh Museum", "review": "Fortunately we reserved tickets well in advance. We had an ecstatic trip to the Van Gogh Museum. We also ate there: good coffee, bitterballen and shakshuka and mint tea with fresh mint. It is a lovely light-filled space and the paintings are beautifully displayed. To our great sorrow, we could not procure tickets to go again before we had to go home.", "rating": 5.0, "visited": "October 2023"}, {"title": "A Must GOGH!", "review": "We knew we wanted to experience the Van Gogh museum and it did not disappoint (but if you are looking for Starry Night - she is at the MOMA in NY). Learned a great deal about Van Gogh's life, his inspirations and his struggles. Such an inspiring day! Go EARLY to avoid huge crowds and make sure you buy a ticket in advance. I highly suggest doing the self guided audio tour - so much insight and information but at your own pace! Lots of great museums to explore while in Amsterdam!", "rating": 5.0, "visited": "September 2023"}, {"title": "A must-gogh!", "review": "I was pretty impressed with this museum. The facilities are great (free lockers for your bag) and headsets included for the self-guided tour. The tour was very informative and interesting. Highly recommend booking in advance as it seems to sell out pretty quickly.", "rating": 5.0, "visited": "October 2023"}, {"title": "A must see for art lovers", "review": "If you like Van Goch then this is a must. It has a great selection of Van Goch's works along with some of his contemporaries. Make sure you book as tickets sell out quickly & maybe book an early slot as it probably won't be so crowded. Despite it being busy, there was plenty of room to see all the wonderful paintings. We did not pay for the audio, there are plenty of information signs for each exhibit. A must see for art lovers.", "rating": 5.0, "visited": "October 2023"}, {"title": "Early time is quiet and peaceful. Look for tickets online the night before", "review": "Snagged a ticket online the evening prior to admission…. If possible get there early in the day… opens at 9. The AV rental ( 3.5 euros) well worth it and enhances your understanding. Take about two to three hours to see it all. When busy after 1030 the museum takes on a different ambience and becomes noisy and much harder to pause and view the artwork. There are two cafes..one serving lunch Well worth the visit.", "rating": 5.0, "visited": "October 2023"}, {"title": "Extensive collection of Van Gogh's Work", "review": "Excellent museum. Extensive collection of Van Gogh's work. Highly recommend buying tickets ahead of time as they were sold out on the day we went. Fortunately, we purchased our tickets a couple of months ahead.", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/48/51/81/van-gogh-museum-foto.jpg"]}
{"name": "Ripley's Believe It or Not!", "description": "Ripley's Believe It or Not! Amsterdam is the home of the bizarre and unbelievable! Over 500 crazy, yet true items that will for sure make you question your senses! Take a break from all the craziness in our Ripley's Lounge. Just a few minutes walking distance from The Central Station.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Ripley's Believe It or Not!"], "hours": "10:00 AM - 10:00 PM", "duration": "Duration: 1-2 hours", "address": "Dam 21 Dam Square, 1012 JS Amsterdam The Netherlands", "neighborhood": "Neighborhood: Red Light District (De Wallen)", "rating": 0, "getting_there": ["Nieuwmarkt • 7 min walk", "Centraal Station • 10 min walk"], "top_reviews": [{"title": "Most interesting museum I've been to", "review": "Absolutely amazing museum! Full of so many random facts and artifacts that are genuinely interesting!!! We spent HOURS in this place... First time I've ever been to a museum and looked at literally everything. Highly recommend if you're in Amsterdam for a few days and want to do something different! Only downfall is there sheer amount of stairs, but that's Amsererdam for you.", "rating": 5.0, "visited": "October 2023"}, {"title": "Ripley’s", "review": "Probably the best thing that I done whilst in Amsterdam. Booked tickets online to beat the queues and went first thing before it got busy. I think all together we spent about three hours looking around all the attractions and exhibits. Well worth the money and would highly recommend visiting", "rating": 5.0, "visited": "July 2023"}, {"title": "Believe it or not - I loved this place", "review": "Went here as we had a couple of hours to spare. So glad we did, the exhibits are amazing in fact some are jaw dropping, couple of inter-actives didn’t work but that didn’t spoil the fun. Really interesting place and could easily spend more time there. Great gift shop too", "rating": 5.0, "visited": "November 2023"}, {"title": "Good", "review": "Was a last minute booking due to the weather! Expensive but glad we booked. Kids absolutely loved it! So much to see and do. Some of the exhibits weren’t working so that does need addressed and the girl at the beginning wasn’t the friendliest. However I would go back again.", "rating": 5.0, "visited": "January 2024"}, {"title": "A fabulous afternoon", "review": "We absolutely adored our time here and spent a very lengthy amount of time wandering around. You can really take it at your own pace and we actually learned loads about lots of different topics. The pictures we took here are really fond memories actually and it's an incredibly interactive exhibit with a lovely cafe at the top to relax afterwards. We would 100% recommend this place to anyone visiting Amsterdam - it was truly one of our highlights!", "rating": 5.0, "visited": "February 2024"}, {"title": "Excellent way to spend a couple of hours", "review": "This was our first activity when we arrived in Amsterdam. So in all fairness we were buzzing to go. This place didn't disappoint. I had pre booked tickets before I left the UK, so it was just a case of scanning my phone. There is so much to see and do here with quite a bit of interaction too. I was with my 12 year old grandson and he thought it was great. I was just surprised how many different floors there are! Everything is so well laid out, so even when its busy its easy to view all the exhibits. Highly recommend this place....even more so if its a wet miserable day", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/45/5a/4b/freakshow.jpg"]}
{"name": "Hash Marihuana & Hemp Museum", "description": "Established by Ben Dronkers in 1985, the Hash, Marihuana &Hemp Museum is a tribute to the history of hemp and cannabis. What the museum offers its visitors is an insight into the history of one of the world's most commonly used drugs. The Hash, Marihuana & Hemp Museum also holds a carefully chosen selection of items from the world's largest collection of cannabis-related objects, the result of over a decade of collecting different kinds of objects associated with the cannabis plant. The Museum is not only of interest to cannabis users, but caters to those who are interested in learning about the plant, and even those who are simply curious about the relationship between its industrial and psychoactive varieties. With this extra-ordinary exhibition, the Hash, Marihuana & Hemp Museum definitely makes the list of Amsterdam attractions that tourists should not miss visiting.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Hash Marihuana & Hemp Museum"], "hours": "10:00 AM - 10:00 PM", "duration": "Duration: 1-2 hours", "address": "Oudezijdsachterburgwal 148, 1012 DV Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Nieuwmarkt • 4 min walk", "Waterlooplein • 8 min walk"], "top_reviews": [{"title": "⭐⭐⭐⭐⭐", "review": "An unconventional yet captivating experience, this museum offers a rare glimpse into the storied past of cannabis. While much of the subject matter may seem taboo, the exhibits thoughtfully unveil an array of insights seldom explored in mainstream historical accounts. From cultivation methods to cultural impacts across eras, the museum's meticulously curated displays shed light on a topic often obscured or oversimplified. An educational treasure trove for the curious mind, a visit promises to broaden perspectives and challenge preconceptions about a plant that has profoundly influenced human society. For those seeking an enlightening detour from conventional museums, this unique institution is a must-visit destination.", "rating": 5.0, "visited": "May 2024"}, {"title": "Geared Towards Beginners", "review": "The Hash Marihuana & Hemp Museum provides access to the museum next door. It's educational for newcomers to cannabis but lacks interactive features. Seasoned enthusiasts might find it less engaging and may prefer to skip this visit.", "rating": 5.0, "visited": "June 2024"}, {"title": "Interesting but small museum.", "review": "Very small museum, interesting and informative about the history of weed and hash. You get an audio guide at the start which makes walking around the small museum a lot more informative than just wondering around - so definitely grab one. Your ticket also gives you entry to the gallery down the road - this talks about the uses of Hash. This was very interesting and talks about the helpful and interesting ways the plant can be used in every day life. Overall informative and interesting museum.", "rating": 5.0, "visited": "August 2024"}, {"title": "Good, but not great.", "review": "Not sure what we expected, but there was A LOT more reading and listening than we anticipated. Learned a lot, but almost “too much” and ended up with “information overload”. We went with another couple who loved it, though, and they are much more involved in the “culture” than we are.", "rating": 5.0, "visited": "July 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/21/7f/53/7a/the-hash-marihuana-hemp.jpg"]}
{"name": "Museum of the Canals", "description": "Grachtenmuseum Amsterdam (The Museum of the Canals) is the starting point for visitors to Amsterdam! It is located in one of the most beautiful canalside houses. Grachtenmuseum Amsterdam introduces visitors to one of the best city development projects in the world: the 17th-century canals of Amsterdam. During your visit to the multimedia, interactive exhibition, you will travel in 40 minutes through 400 years of history.", "category": "Speciality Museums Art Museums History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Museum of the Canals"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: < 1 hour", "address": "Herengracht 386, 1016 CJ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Interesting insights into the canals that define Amsterdam", "review": "The museum is in a house that is Tucktaway in one of the neighborhoods of Amsterdam. It takes about an hour for the entire tour, and it is self guided with audio assistive devices. I found the information to three dimensionalize the canals. How and why they were developed and what the current and future challenges will be for the canal system in Amsterdam Cost is about €17", "rating": 5.0, "visited": "October 2023"}, {"title": "A little gem of a museum", "review": "Visited the Canal museum on a rainy day with my 13 year old daughter. Was not as busy as many of the other museums we visited in Amsterdam which was refreshing. It is set in a stunning building with a beautiful garden. We both absolutely loved our visit, especially the interactive displays and innovative journey you are taken on through the history of Amsterdam. Highly recommend.", "rating": 5.0, "visited": "October 2023"}, {"title": "Clever bite-sized museum", "review": "Informative, bite-size museum that explains how Amsterdam was built. Unusual format for a museum. Money well spent on this museum. Try the quiz in the lobby waiting area before you go on the tour.", "rating": 5.0, "visited": "December 2023"}, {"title": "Great immersive museum", "review": "What a find! Really informative and immersive history of Amsterdam and its canals. We spent an hour there and thoroughly enjoyed it. Well worth spending the time and the money. It’s not large but really well thought out with models of houses and canals.", "rating": 5.0, "visited": "December 2023"}, {"title": "Charming and informative museum", "review": "This little museum tells the story of Amsterdam’s canals and its beautiful houses. The museum has some very well done virtual displays, informative videos, and interactive models. This is my third visit to Amsterdam, and I feel as though I learned more in the hour I spent here at this museum, than on other tours previously.", "rating": 5.0, "visited": "January 2024"}, {"title": "Lovely little museum", "review": "Lovely little museum takes about 1 hour 15 to see everything. Everything is present in a really innovative way. Not a huge amount of information but I really enjoy it. Helpful staff. Do the quiz in the waiting room while you wait.", "rating": 5.0, "visited": "January 2024"}, {"title": "An essential museum for any visitor to amsterdam.", "review": "An essential museum for any visitor to Amsterdam. We were told about this at the Houseboat museum otherwise would have completely missed this. It’s a very informative guided presentation that helps explain the history of the canals and then helps you to machinâtes and find your way around Amsterdam a lot better as a result!", "rating": 5.0, "visited": "February 2024"}, {"title": "Great way to understand Amsterdam’s historical development", "review": "This museum provides a great overview of the city and the canals that made her famous. Visitors are led from one room to the next, covering a variety of topics, to include the history of the building that houses the museum. If you’re at all interested in the history of Amsterdam, the Netherlands, and/or canals/inland shipping then you should add this museum to your visit list. Note: visitors are provided an audio guide in a variety of languages, so language barriers are not an issue.", "rating": 5.0, "visited": "April 2024"}, {"title": "Absolutely fascinating !", "review": "I wanted to try and understand the construction of the canals and the reclamation of land, that allowed Amsterdam to happen. Really interesting tour. It was quiet, I found it so fascinating, I asked if I could go back through for a second time .....", "rating": 5.0, "visited": "April 2024"}, {"title": "Fascinating - more museums should be like this", "review": "This little museum is great. It's not so much a history of the canals, more the history of Amsterdam through the story of the canals. We learnt so much about the history of the city. The exhibits are all audio visual. The large model house is intricate and beautiful. There are 5 guided rooms. Really recommend this.", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/8e/6f/9f/museum-of-the-canals.jpg"]}
{"name": "Damrak", "description": "From bars and bicycles to cafes and erotic entertainment, you can find it all on this picturesque main street of Amsterdam.", "category": "Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Damrak"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Damrak", "rating": 0, "getting_there": ["Centraal Station • 6 min walk", "Nieuwmarkt • 7 min walk"], "top_reviews": [{"title": "Picturesque 'rak' in central Amsterdam", "review": "When arriving at Amsterdam Central Station it is the first main street on the city side. It used to be a canal or rather a \"rak\" in Dutch meaning a straight part of waterway in this case connecting Dam (square) with 'het IJ', the old harbour area. VOC ships used to moor here. Nowadays the \"rak\" is partly filled in to enable construction (Berlage Beurs and Bijenkorf supermarket), but closer to the station it is still open water where canal tours are on offer. A pity that most business is now geared to tourists like the Venus temple and many fast food outlets and restaurants.", "rating": 5.0, "visited": "April 2024"}, {"title": "Very Crowded Major Street", "review": "It's the major wide street that leads to and from the Central train station. There was some construction going on that created pedestrian traffic jams. So many tourists walking down the street, shopping and eating. For some reason, the frite stands were the most popular. We were eager to get away from the crowds.", "rating": 5.0, "visited": "June 2024"}, {"title": "Red carpet into the city centre", "review": "As the main avenue that connects the Amsterdam Central Station to Dam Square, Damrak is effectively the red carpet laid out to usher visitors arriving on trains into the city centre. Originally the mouth of the Amstel River that has been partially filled in the 19th century, today it is one of the main tram routes in the city and is also probably the city's busiest thoroughfare in terms of pedestrian traffic. Lined with vibrant restaurants, shops and hotels, this bustling street is undoubtedly a gaudy tourist trap, but nevertheless it's also the one street that visitors to the city could never avoid. Damrak showcases the 2 extreme sides of the city. On the northern-end closer to the central train station, you will come across probably the most picturesque view that you ever find in the city, ie. that of the canal water mirroring the gabled houses backing it. As you walk south towards Dam Square, especially towards the later part of the day, you will also find garbage accumulated on the sidewalks - a definite eyesore and disrepute to the city.", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/22/4d/67/damrak.jpg"]}
{"name": "Dutch National Opera & Ballet", "description": "Dutch National Opera & Ballet creates, produces and presents both traditional and innovative opera and ballet productions of the highest quality. As one of the largest cultural organisations in the Netherlands, Dutch National Opera & Ballet brings all aspects of the ballet and opera world’s artistry, technique and craftsmanship together in its own specialised workshops and rehearsal rooms.", "category": "Ballets Operas Theaters", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Dutch National Opera & Ballet"], "hours": "12:00 PM - 12:00 AM", "duration": "Duration: 2-3 hours", "address": "Amstel 3, 1011 PN Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 2 min walk", "Nieuwmarkt • 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/78/4c/75/dutch-national-opera.jpg"]}
{"name": "Het Scheepvaartmuseum| The National Maritime Museum", "description": "The National Maritime Museum holds one of the world's largest and most notable maritime collections including paintings, ship models, navigation instruments and sea charts. Discover 500 years of Dutch maritime history and its strong link to society of today and tomorrow.", "category": "History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Het Scheepvaartmuseum| The National Maritime Museum"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Kattenburgerplein 1 Community Marineterrein, 1018 KK Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Lovely covered courtyard", "review": "Must confess we were pretty museum’d out by the time we visited but still enjoyed it. Entry included with our I Amsterdam card so we went. If you walk there, as you cross the bridge heading towards museum from centraal station direction, look across to the right and you can see the only windmill in Amsterdam city in the distance. The building is fabulous, make sure you go down to the bathrooms as the vaulted area down there is impressive. We didn’t look at everything. We took the audio guide on offer but found we read the info boards rather than listening to the guide. The replica sailing ship is well presented, quite tricky to move around if you’re not too mobile and as you’d expect, mind your head! Favourite museum displays were those related to navigation in a starlit section and the section on books/maps. Fascinating to see these early “travel guides” with their depictions of local scenes and people’s. Do sit in the courtyard area which is a lovely space, wait until there’s a burst of sunshine and see the effect of the roof line shadows across the walls because it’s beautiful.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great history and current exhibits", "review": "Beautiful building. Exhibits are very interesting for adults. Varied exhibits about the city as a port, its growth, past and current use, and the broader Dutch maritime history. We learned a lot. Special exhibit on whaling was great for kids to understand that history. The audio guides are free with tickets and were helpful to understand more. Cafe had some good food and wasn’t too expensive. They have a kids menu.", "rating": 5.0, "visited": "October 2023"}, {"title": "A good insight into the VOC and all things nautical", "review": "A very large building with a stunning courtyard, very relaxed feel. Lots to see in various galleries but not overhwhelming, nicely curated exhibitions on various different aspects such as navigation history, where our food comes from, old maps, and the VOC as you'd expect. The day we arrived the large reconstructed ship was away, the steward at the desk very kindly told us BEFORE we bought our tickets, so we had the choice to return a day later and see it - really glad we did as it was quite stunning and gave you an inkling into what it might have been like as a sailor back in the day. Rather complicated lockers were the only downside!", "rating": 5.0, "visited": "March 2024"}, {"title": "Decent Nautical Museum", "review": "The Maritime museum is located around a mile away from Amsterdam Centraal station on foot. Alternatively you can take bus 22 from Centraal to Kattenburgerplein which is a short walk from the museum. It is housed in a fine building with a courtyard in a dock area. Due to time constraints I had only an hour to look around but there was plenty of interesting content. I enjoyed the Rescuers at Sea exhibition which featured many interesting stories of volunteers working for KNRM (Dutch Lifeboat Service). There are many good nautical paintings on display covering the golden age when the Netherlands was a major seafaring force. The Food for Thought exhibition was informative and dealt with food production and waste. The Netherlands is the second largest exporter of agricultural produce (USA is the first). Unfortunately the old ships normally anchored in the dock were away for restoration so couldn’t be viewed. Overall, an enjoyable experience at a cost of €18.50.", "rating": 5.0, "visited": "March 2024"}, {"title": "Maritime history you don’t know!", "review": "Beautiful 14th, 15th and 16th century paintings of ships and battles. The map room was especially interesting. It was surprising to see that Dutch sailors trading with China and Japan in the 14th century. Take a tour of the replica of a ship; that’s probably the most interesting thing for kids. The courtyard has tables and chairs where you can rest and a restaurant to buy food and drinks.", "rating": 5.0, "visited": "April 2024"}, {"title": "A really huge museum", "review": "I must admit this museum was much larger than I expected. Some sections were easy to anticipate, but others really astonished me. Probably the most attractive ones are about whales and waling, as well as the ship East Indiaman Amsterdam. There were three more ships to visit for an additional payment, but I skipped that and yet was exhausted after exploring all exhibitions. Plan to have more than 3 hours for a visit. A disclaimer: I was there in August, 2023, not September.", "rating": 5.0, "visited": "September 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/21/c6/5d/05/the-national-maritime.jpg"]}
{"name": "Haarlemmerstraat", "description": "", "category": "Neighborhoods Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Haarlemmerstraat"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Amsterdam Centraal • 8 min walk", "Amsterdam Centraal Station • 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/05/88/91/haarlemmerstraat.jpg"]}
{"name": "Westerkerk", "description": "This magnificent Renaissance church (circa 1620) is identified by its high tower (more than 245 feet high,) and is the site of Rembrandt's grave who was buried here in 1669.", "category": "Religious Sites Churches & Cathedrals", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Westerkerk"], "hours": "", "duration": "Duration: < 1 hour", "address": "Prinsengracht 279-281, 1016 GW Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/3c/d3/d4/west-church-westerkerk.jpg"]}
{"name": "King's Day", "description": "", "category": "Cultural Events", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "King's Day"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Nieuwmarkt • 6 min walk", "Waterlooplein • 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/1b/79/34/photo1jpg.jpg"]}
{"name": "Koninklijk Theater Carre", "description": "", "category": "Theaters", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Koninklijk Theater Carre"], "hours": "", "duration": "", "address": "Amstel 115-125, 1018 EM Amsterdam The Netherlands", "neighborhood": "Neighborhood: Weesperbuurt", "rating": 0, "getting_there": ["Weesperplein • 4 min walk", "Waterlooplein • 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/8c/42/0f/photo2jpg.jpg"]}
{"name": "Museum Van Loon", "description": "In the heart of Amsterdam on the Keizersgracht the house of the Amsterdam regent family Van Loon can still be seen. Seven days a week the family opens their home and collection to the public. Get a glimpse of the life of the Amsterdam Van Loon family in one of the finest canal houses of the city. Due to corona measures, the museum is temporarily closed on Mondays and Tuesdays (but still open for private tours and rental opportunities).", "category": "Historic Sites History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Museum Van Loon"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Keizersgracht 672, 1017 ET Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 9 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/81/54/28/binnentuin-met-zicht.jpg"]}
{"name": "Bridge of 15 Bridges", "description": "There is one bridge in Amsterdam’s central canal belt that gives a view of no less than 15 bridges. This unusual sight is found at the bridge crossing of the Reguliersgracht with the Herengracht, on the side with odd numbers. Standing on this bridge with your back to the Thorbeckeplein, you will see six arched bridges in a row. To the left you will find six more over the Herengracht and on the right you will see the next two. The 15th is the bridge you are standing on. It is particularly worth coming here at night as the bridges are illuminated giving one of the most beautiful and romantic views in Amsterdam.", "category": "Points of Interest & Landmarks Bridges", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Bridge of 15 Bridges"], "hours": "", "duration": "Duration: < 1 hour", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Amsterdam Centraal Station • 6 min walk", "Amsterdam Centraal • 6 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0b/de/16/bc/brigde-of-15-brigdes.jpg"]}
{"name": "De Hallen Amsterdam", "description": "De Hallen, a cultural hub with a social heart located in Amsterdam-West since 2014 in a former tramdepot. National monument. A vibrant center for fashion, art, culture, hospitality and crafts. Eat & Drink In the FoodHallen you will find a collection of the most tasteful and varied cuisines. Right behind is the Kanarie Club, a spacious restaurant with a lovely terrace, and Remise47, the restaurant of Hotel de Hallen. Enjoy a delicious cup of coffee and a good book in the Belcampo reading café, the living room of the neighborhood. Art & Culture De Filmhallen with its 9 screens is a must-see for every film lover. Opposite you’ll find Beeldend Gesproken, a gallery for contemporary art. Right across is thr public library (OBA). Recycle is a bike shop/workshop training people in bike repair. At the Maker Market you will find cool local brands. Denim City connects denim experts and includes Jean School, partnering with top brands. Kinki Academy trains future hairdressers.", "category": "Convention Centers", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "De Hallen Amsterdam"], "hours": "7:00 AM - 1:00 AM", "duration": "Duration: 2-3 hours", "address": "Hannie Dankbaarpassage 47, 1053 RT Amsterdam The Netherlands", "neighborhood": "Neighborhood: Amsterdam West", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Great for foodies !", "review": "Great mixed food hall with a brilliant variety of reasonably priced food types. Finding a table can be a challenge but once seated the experience is really good. Drinks were not overpriced either, would highly recommend.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great burgers in the food hallen", "review": "We were staying at the hotel next door so visited a couple of times. The shops were expensive and quite niche and wouldn’t bring me here again. However we did love the food Hallen! The Butcher burgers were amazing. The wait was quite long but it was worth it. They were juicy and really tasty. I’d say it was the best burger I’ve had!", "rating": 5.0, "visited": "November 2023"}, {"title": "Good variety of food", "review": "Good place with lots of variety of food, hard to get a a table during busy periods but a good atmosphere. We went as a large group so was good as there was options for everyone. Food prices were a bit pricey but food was all tasty.", "rating": 5.0, "visited": "November 2023"}, {"title": "A Good Start", "review": "On several previous trips to Europe, we typically gravitate towards town markets and food halls. Our first visit here. Luv the variety of cuisine and the ease in picking our choices. We were a party of 4 about to start a 3-week holiday. Luv the place. We will be back!", "rating": 5.0, "visited": "January 2024"}, {"title": "Lots of Food Options!", "review": "Lots of great food options from all around the world and lots of seating available. Can get busy and feel slightly crowded but adds the experience. A tram station very close by and is easily accessible. The burger in the picture is from ‘the butcher’ stall and is prepared right in front of you.", "rating": 5.0, "visited": "February 2024"}, {"title": "Lovely atmosphere and spot for variety of lunch choices", "review": "We came across this in the rain and wanted somewhere to have a look inside. Really enjoyed the atmosphere. Very busy. Lots of choice for food from around the world. No gluten free though so I watched the family eating (story of my life anyway) and they then had some lovely looking desserts. Some shops too which had artistic vibes. Some lovely jewellery.", "rating": 5.0, "visited": "April 2024"}, {"title": "Nice", "review": "With its array of international food stalls and a couple of bars, it's a hub of excitement. Visiting on a bustling Saturday lunchtime meant it was packed, making finding a seat a bit of a challenge—but totally worth it! It's not your average fast-food center (but still fast-food); it's a lively spot bursting with flavor. It reminded me of a place I visited in Ghent not so long ago.", "rating": 5.0, "visited": "April 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/f0/f4/f1/entrata.jpg"]}
{"name": "De Poezenboot", "description": "", "category": "Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "De Poezenboot"], "hours": "Closed until further notice", "duration": "Duration: < 1 hour ", "address": "Singel 38 G, 1015 AB Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Amsterdam Centraal Station • 7 min walk", "Amsterdam Centraal • 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/03/57/e6/49/de-poezenboot.jpg"]}
{"name": "HEMA", "description": "There are more than twelve Hema department stores around Amsterdam that offer everything from soup to nuts.", "category": "Department Stores", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "HEMA"], "hours": "9:00 AM - 7:00 PM", "duration": "", "address": "Kalverstraat 212, 1012 XH Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/93/f4/8f/caption.jpg"]}
{"name": "Rembrandtplein", "description": "One of Amsterdam's main squares, this is an ideal place to sit on one of the many terraces and watch the world go by.", "category": "Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Rembrandtplein"], "hours": "", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 5 min walk", "Nieuwmarkt • 9 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/de/72/d2/photo2jpg.jpg"]}
{"name": "Museum Quarter", "description": "", "category": "Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Museum Quarter"], "hours": "", "duration": "", "address": "Nicolaas Maesstraat 2D, 1071 RA Amsterdam The Netherlands", "neighborhood": "Neighborhood: Museum Quarter (Museumkwartier)", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/f2/97/bc/museumplein.jpg"]}
{"name": "Johan Cruyff Arena", "description": "The largest stadium in the Netherlands and home to the Ajax football team, it has played host to legendary sporting matches and music concerts.", "category": "Arenas & Stadiums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Johan Cruyff Arena"], "hours": "", "duration": "Duration: 1-2 hours", "address": "Johan Cruijff Boulevard 1, 1100 Amsterdam The Netherlands", "neighborhood": "Neighborhood: Amsterdam South-East", "rating": 0, "getting_there": ["Strandvliet • 6 min walk", "Amsterdam Bijlmer ArenA • 6 min walk"], "top_reviews": [{"title": "Stadium Tour", "review": "Went on the stadium tour during the summer whilst in Amsterdam. Stadium is very easy to get to via public transport and train station is right outside the stadium. Tour guide was very knowledgeable with some great information about Ajax and the stadium. Answered any questions too. Only disappointment on the tour was not being able to see the pitch as it was covered up for a concert but I knew about this in advance. Club shop is also very good and because we booked tickets in advance they gave a discount on items bought in the shop.", "rating": 5.0, "visited": "July 2023"}, {"title": "VIP tour", "review": "VIP tour was nice. Tour guide spoke in English, answered questions, took photographs at different stages of the tour. Enjoyable experience even for non-football fans. Pleasant staff.", "rating": 5.0, "visited": "January 2024"}, {"title": "Quicker than expected", "review": "Smaller than expected so didn't take long...bar on site was nice! Staff very knowledgeable, we didn't book a guided tour but still made time to talk to us. 10% discount in shop with ticket doesn't mean much as so much on sale and discount not available with sale goods", "rating": 5.0, "visited": "February 2024"}, {"title": "Best tour guide in the Netherlands", "review": "Getting to the entrance to buy the tickets and start the tour was bit of an adventure but we found it. One tour guide on Friday 21st of June took it upon himself to add to what would have been a very basic experience and he made it memorable. Highly recommended.", "rating": 5.0, "visited": "June 2024"}, {"title": "Iconic Stadium", "review": "We always go to tour football stadiums whenever we visit another country and have been looking forward to this one for years. We were advised that we would not be able to go onto the pitch which we though was completely understandable but when we got to the pitch we realised that this was because there was some sort of game show being filmed. The rest of the tour was very quick but still an amazing stadium and I'm glad we've been to see it in person.", "rating": 5.0, "visited": "June 2024"}, {"title": "Tour", "review": "Was in Amsterdam for weekend and was hoping that. Ajax would be at home but they weren’t. So decided to book a tour stadium. You might be better off to get an Uber to the ground. The tour lasted almost 2 hours. You got to see everything. Dressing rooms, boxes sit in dug out, press room. The tour guide we had Archie was really good and knew his stuff a very good knowledge.", "rating": 5.0, "visited": "August 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/90/6e/1a/20160310-132715-largejpg.jpg"]}
{"name": "ARTIS Amsterdam Royal Zoo", "description": "Stroll among the shady trees, admire the diversity of plants and animals, travel to the stars, enjoy our heritage. Visit ARTIS Amsterdam Royal Zoo and experience nature right in the city centre.", "category": "Zoos", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "ARTIS Amsterdam Royal Zoo"], "hours": "9:00 AM - 6:00 PM", "duration": "Duration: 2-3 hours ", "address": "Plantage Kerklaan 38-40, 1018 CZ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Weesperplein • 9 min walk", "Waterlooplein • 10 min walk"], "top_reviews": [{"title": "ARTIS ZOO AMSTERDAM VIST", "review": "This is the second time we have visited Artis Zoo , going 2 years in a row. Zoo is excellent, many different animals to see laid out in a spacious, well kept and easy to get round. Manged to see and get up close to animals such as, Black Panther, Giraffe, Red Panda, Chimpanzees Gorilla, Zebra and many many more. The indoor rain forest, Insectariium and Planiterium are all again excellent and very informative. Staff very friendly and helpful Weather was also great both times we went, which helped. Would 100% recommend if you are in Amsterdam!! The Clarks from Scotland .", "rating": 5.0, "visited": "October 2023"}, {"title": "Great couple hours", "review": "Reasonably price zoo with a variety of different species of animals. Well kept and managed to a high standard. But there’s also a lot of upgrading to certain enclosures so not as much to see as they would normally be", "rating": 5.0, "visited": "November 2023"}, {"title": "Brilliant Zoo", "review": "Brilliant zoo, loads of cool animals and attractions. Although it was December and cold, most of the animals could easily be seen. Butterfly house and the seals were easily our favourite's, could watch them for hours. Reasonably priced, would definitely return again.", "rating": 5.0, "visited": "December 2023"}, {"title": "A worthwhile visit to this small and lovely zoo.", "review": "A lovely small and gorgeous zoo. It was lightly raining but it was still fairly crowded. The animals seemed happy and had space to roam. It was small and well designed. We were happy to be staying where we could walk over and enjoy this special place on our last day. It's worth a visit!", "rating": 5.0, "visited": "August 2023"}, {"title": "Pleasant", "review": "The partner and I enjoyed our time here. Plenty of Animals to be seen who were very socialable. They were not afraid to make themselves seen or heard. The layout was surprisingly good. I felt like I managed to see everything without having to go back on myself or go in different directions. The staff on hand were helpful. They even kindly held our bags somewhere safe so we could explore. Elephants and Giraffes were a fun highlight.", "rating": 5.0, "visited": "October 2023"}, {"title": "Lovely city centre zoo.", "review": "I'm glad we visited this zoo. It's small but well laid out. On the day we visited it was raining rather heavily, so it wasn't too busy. There are lots of animals to see, and the ones we saw all looked well cared for and happy. Because of the weather there were some 'no shows' but who can blame them for not wanting to come outside in the rain! The aquarium is undergoing renovation atm, so that wasn't open. We took shelter in the small mammals walk through, which didn't disappoint. We had lunch too, which was reasonable and filling. All in all I would definitely recommend this zoo for a visit. Good value for money.", "rating": 5.0, "visited": "February 2024"}, {"title": "Decent Zoo", "review": "Going in the winter isn't brilliant. Also went not long after opening time which was probably a mistake. A lot of the animals still indoors and there's no access to the public for most of the enclosures. Spent a couple of hours there and was only able to see about 50% of the animals. But most importantly, they all looked well cared for and had a good amount of space to move around.", "rating": 5.0, "visited": "February 2024"}, {"title": "Go visit - you won’t be disappointed!", "review": "We spent a couple of hours walking round the zoo and it really was a delight. There are lots of animals, all in a fabulous setting. We enjoyed watching the gorilla’s, they were content in eating their way into their enrichment. It must have been some kind of sweet/savoury liquid, it was encased in a flat tube and they had to use a piece of stick to get to their reward. The jaguar gave us a right fright as we walked down a dark passageway to see it walking towards us! We couldn’t see the glass, but were very happy when we did! We would have stayed longer but it absolutely chucked it down. Definitely recommend. And what a great idea of the little pull along trucks for little ones to sit in whilst going round the zoo! Genius!", "rating": 5.0, "visited": "February 2024"}, {"title": "Well worth a visit", "review": "A great range of animals, some of which are not on display in many other zoos. Some areas looked a little neglected or not overly-friendly to the actual animals on display (time to make it more about the animals and less about the visitors). We went in winter and the selection of food available was somewhat disappointing (not all cafes were open).", "rating": 5.0, "visited": "January 2024"}, {"title": "A stimulating day out.", "review": "An excellent collection of animals, insects, etc. All housed in interesting and suitable conditions. Overall the collection was in well kept and historic parkland. Choice of eating facilities, enjoyed both lunch and a final cup of tea and cake. The zoo particularly appeared to cater for families, discovery activities, etc. A playground for children within the zoo offered relaxing fun.", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/37/80/43/photo1jpg.jpg"]}
{"name": "Fabrique des Lumières", "description": "See art come to life in the largest immersive digital art centre in the Netherlands - Fabrique des Lumières - located in the former 19th century gas plant in Westergas area, Amsterdam. A large industrial space with walls up to 17 meters high hosts immersive exhibits by classical, modern and contemporary artists. The stunning artworks are brought to life with advanced technology, through 100+ state-of-the-art projectors and accompanying music. From the 10th of March 2023, step into a new world and experience an ode to two spanish masters! During this visual and musical spectacle, the most famous psychedelic works of Salvador Dalí will come to life to the rhythm of the music of the legendary band Pink Floyd. The works of Catalan architect Antoni Gaudí - a great inspiration for Dalí - completes the overall immersive experience.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Fabrique des Lumières"], "hours": "10:00 AM - 5:00 PM, 5:15 PM - 8:00 PM", "duration": "Duration: 1-2 hours", "address": "Pazzanistraat 37, 1014 DB Amsterdam The Netherlands", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Beautiful", "review": "We saw the incredible ‘Destination Cosmos’ exhibition on my birthday and it was wonderful. The visuals were paired really well with music and it was totally immersive. Spent about an hour in the room, moving to new locations and different seats.", "rating": 5.0, "visited": "December 2023"}, {"title": "Gaudi, Dali and Pink Floyd", "review": "We walked, just turned up and purchased tickets on the door. A superb audio and visual delight combining Gaudi, Dali and Pink Floyd. Sit , stroll and enjoy the experience at your own pace. Don't forget to visit the mirrored room and small gallery for a few extra treats.", "rating": 5.0, "visited": "September 2023"}, {"title": "Great experience with friends, better if you have prior knowledge about topic", "review": "The place was easy to find, you can walk or take the bus there. I had a really good time at the show, but I couldn't help but wish there was more info available. Even though I know quite a bit about space, it would've been nice to learn more about the different parts of the show. All in all good experience, and really fun to do with friends.", "rating": 5.0, "visited": "October 2023"}, {"title": "A WOW! experience.", "review": "We were looking for something to do during our last minute trip to Amsterdam and came across Fabrique des Lumières and we were so glad we did! It is truly an amazing experience if you are a fan of the magnificent art work of Van Gogh and Mondrian among others. The artwork is projected around the room and every wall showed a different element of each piece. It was a fully immersive and fantastic experience and we would highly recommend a visit.", "rating": 5.0, "visited": "March 2024"}, {"title": "A hypnotic display of art", "review": "We were bowled over by this attraction. The display of works of art was hypnotic, accompanied by great music which was mostly classical but with some jazz too. The pictures in the main room were animated and constantly moving but there was a Side room where you could see a continuous display showing the actual pictures. There are other rooms with different types of display, all worth seeing. Difficult to describe, but we loved it.", "rating": 5.0, "visited": "April 2024"}, {"title": "A new way to experience", "review": "What an intense and wonderful experience! Certainly nothing like any art exhibition we have visited before, the show (which it felt more like) was absolutely captivating. Would be interesting to see the landscape project in the larger room!", "rating": 5.0, "visited": "April 2024"}, {"title": "Magical", "review": "My visit to « Fabrique des lumières in Amsterdam » was truly magical and exceptional. I was amazed by the moving paintings and I left feeling inspired the creativity and innovation on display. It was a truly unforgettable experience that I would highly recommend to anyone interested in the world of Art.", "rating": 5.0, "visited": "May 2024"}, {"title": "Brilliant! A relaxing and mesmerising experience!", "review": "One of the best things we’ve done in Amsterdam! I thought we would spend about 30 mins in there, but ended up staying an hour and a half as the art is so mesmerising. It’s such a wonderful experience and a unique way to experience art. The accompanying music is also so relaxing! There are some love bars and restaurants surrounding it. We went towards the end of the day and it was quite quiet. Absolutely worth a visit!", "rating": 5.0, "visited": "June 2024"}, {"title": "Excellent Art Show for Couples", "review": "Wonderful, dynamic presentation in a beautiful and historic venue. The Dutch Masters show was excellent. We pre-purchased our tickets for a Friday evening, not too crowded and no lines. One of the highlights of our trip to Amsterdam.", "rating": 5.0, "visited": "June 2024"}, {"title": "Mesmerising art experience!", "review": "I enjoyed this way more than I thought I would. The immersive experience was amazing. I sat on the side and watched both shows that were offered back to back. The choice of music with each piece of art is spectacular! I really enjoyed this and would definitely go to another experience like this again. The only reason it is 4 stars is because the building is generally far from all other amenities. Our flight got delayed on the first day so we couldnt visit it, but they gladly swapped the tickets for us, great customer service!", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/24/5f/ed/dali-the-endless-enigma.jpg"]}
{"name": "Artis Micropia", "description": "", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Artis Micropia"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 2-3 hours", "address": "Plantage Kerklaan 38-40 Artis, 1018 CZ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Weesperplein • 9 min walk", "Waterlooplein • 10 min walk"], "top_reviews": [{"title": "great museum", "review": "as a microbiology student, this place was amazing!! i could have spent all day here. absolutely attend one of the daily talks if you can, it was fascinating. there is a ton of information and unusual microbes, plus rate opportunities to look down microscopes at microbes such as unusual algae - something i particularly enjoyed! even if you aren't particularly interested in micro you will still enjoy an hour or more visiting here. :)", "rating": 5.0, "visited": "July 2023"}, {"title": "Interactive and interesting museum", "review": "Great museum! Very interesting content displayed in an interactive and visually pleasing way. You could see live microbes under microscopes that you could operate yourself. A fun afternoon out for adults and kids alike!", "rating": 5.0, "visited": "February 2024"}, {"title": "Very interesting museum!", "review": "We visited this on our first full day in Amsterdam. There are so many interesting exhibits to look at and the interactive exhibits really add to the experience (as well as being able to collect stamps as you go round!). We have recommended this to friends and family too!", "rating": 5.0, "visited": "April 2024"}, {"title": "A zoo for microbes!", "review": "Great attraction, suitable for adults, teens and young kids with interactive exhibits and tons of microbes to learn more about. You can scan your body, analyse a kiss, and study life under a microscope. Everyone working there was super friendly and happy to help too. A fun and unique experience.", "rating": 5.0, "visited": "July 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/1a/e2/ae/img-20170422-wa0028-largejpg.jpg"]}
{"name": "Verzetsmuseum Amsterdam", "description": "Explore true stories and destinies of everyday people during World War II in the Netherlands. What did life look like? What choices did you have to make? Step back in time at the Resistance Museum.", "category": "Children's Museums History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Verzetsmuseum Amsterdam"], "hours": "11:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Plantage Kerklaan 61, 1018 CX Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 10 min walk", "Weesperplein • 10 min walk"], "top_reviews": [{"title": "absolutely worth a visit (with kids)", "review": "Went with three kids aged 8-9-9 (Dutch), in order to see the children's-section. Very well told, in four stories. Kids learned more about WOII, from different perspectives. Combined our visit to Amsterdam with Anne Frank House.", "rating": 5.0, "visited": "October 2023"}, {"title": "Resistance museum.", "review": "Although it was a bit difficult to locate we got a friendly greeting and very helpful staff. The museum.does have audio devices to help for those of us who couldn't speak Dutch to save our lives Easily used and the displays put a very \"human face\" to the occupation of the Netherlands. Learnt a lot of things and they didn't 'gloss' over the dark parts of this history. Anyone with a historical interest would be advised to add this to their Amsterdam itinery.", "rating": 5.0, "visited": "October 2023"}, {"title": "Terrific experience at Verzetsmuseum (WW II Dutch Resisistance Museum) in Amsterdam", "review": "We started our tour when the museum opened so it was less busy than later. The arrangement of the exhibits, the personal stories that lend color to the broader events and especially the very easy to use audio guide (point at number on wall and it plays the appropriate segment) made it an outstanding visit. Well done to the museum for such an outstanding experience.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great Museum!", "review": "We visited this museum on a very rainy day and were so glad we did. We learned a great deal about the brave men and women who tried to fight against the Nazi repression in Amsterdam during WW2 and also about what it was like to live in the Netherlands during that very difficult time. Your museum admission includes an audio guide that works very well. But if you would prefer to read the descriptions, they exactly reflect the audio.", "rating": 5.0, "visited": "October 2023"}, {"title": "Powerful, well thought out exhibits", "review": "We found this a really powerful experience and the exhibits were very well curated. It focuses on the people involved in World War Two and the resistance. Fascinating, inspiring, and sad stories. The audio tour was helpful and there are plenty of panels with additional information. The exhibits were very well designed and different from each other. There is a special kids exhibit that our kids really liked and so did we as adults. We spent over two hours here.", "rating": 5.0, "visited": "October 2023"}, {"title": "Glad we added this to our trip", "review": "Very clean, well laid out museum. Extremely interesting. The audio boxes worked really well. We had watched A Small Light about Miep Gies and her role helping the Franks during the German invasion. The museum has many, many more stories of the Dutch resistance and how they helped other humans. Experiencing this place inspires reflection that is needed now.", "rating": 5.0, "visited": "October 2023"}, {"title": "Excellent, well designed museum", "review": "We are so glad that we devoted 90 minutes to this museum. It tells the story of Dutch resistance during the Nazi era, and does it with appropriate detail, nuance and personalization. Having walked by the Anne Frank House, we actually opted for this museum instead of the tour there. And are glad we did, feeling we got a more expansive view of that horrific period. The Resistance Museum is extremely well and logically designed and curated. Further, it avoids easy, black-and-white answers fitting the history of that period in which the Dutch were trapped with no good or obvious options.", "rating": 5.0, "visited": "November 2023"}, {"title": "Powerful, emotional and well constructed museum about Dutch resistance to the Nazis", "review": "This is an outstanding museum, telling the story of Dutch resistance to Nazi occupation. The personal stories, audio and visual resources and items on display are wonderful. I would definitely recommend this museum to any visitor to Amsterdam.", "rating": 5.0, "visited": "July 2023"}, {"title": "Brilliant, fantastic . I cannot praise it enough", "review": "We pencilled in up to two hours for this visit but we stayed for four hours . From the start to finish was amazing. You have an audio guide that was second to none. You can do it in the order you want and if you miss a bit you can go back and point your audio gadget at he piece you have missed and listen to it . Real people's stories from the time, photographs and short films. I went in with very little knowledge and came out with a wealth of knowledge and a thirst to learn even more. The best museum I have been in for a long time.", "rating": 5.0, "visited": "November 2023"}, {"title": "Underrated!", "review": "I started this day with a self-mapped walk of the Jewish quarter, then came here right when this museum opened at 10am. This was completely worth it. I'm a social justice activist myself, and I've been absolutely horrified at the the things happening in the world. I'm also a holocaust history nerd (enthusiast seems crass here), and I've always struggled to understand how something like this could happen in the Netherlands. This museum really helped me understand this history. I went through it very slowly, interacting with some of the exhibits as much as possible, listening to everything I could on the audioguide, and really trying to be present with the information. It's a lot, and it can certainly overwhelm you--I have a feeling a lot of people need to pick and choose what they engage with, and it's fine. I ended up spending about 2.5 hours here, and it was totally worth it. I'm so glad I went. I think this was the most underrated spot I went to in all of Amsterdam", "rating": 5.0, "visited": "September 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/a5/58/8e/the-resistance-museum.jpg"]}
{"name": "Brouwersgracht", "description": "", "category": "Bodies of Water Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Brouwersgracht"], "hours": "", "duration": "Duration: 1-2 hours", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0b/ed/f4/83/brouwersgracht.jpg"]}
{"name": "Magere Brug", "description": "Famous \"flat\" bridge over the Amstel River", "category": "Historic Sites Bridges", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Magere Brug"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Weesperbuurt", "rating": 0, "getting_there": ["Waterlooplein • 6 min walk", "Weesperplein • 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/cb/6c/fb/magere-brug.jpg"]}
{"name": "Sexmuseum Amsterdam Venustempel", "description": "Explore how sex has evolved throughout history at this museum with its extensive collection of explicit paintings, pictures, recordings, and artifacts. The exhibits detail over 100 years’ worth of sensual love from all the cultures of the world. Some pieces will make you laugh, while others are more thought-provoking. The museum, which opened in 1985, is the oldest of its kind still in operation. It’s located at the Damrak waterfront, one of the most vibrant areas in downtown Amsterdam. When you’re done touring the exhibits, grab a beer or a snack, or enjoy a canal cruise. – Tripadvisor", "category": "Speciality Museums Art Museums History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Sexmuseum Amsterdam Venustempel"], "hours": "11:00 AM - 7:00 PM", "duration": "Duration: 1-2 hours", "address": "Damrak 18, 1012 LH Amsterdam The Netherlands", "neighborhood": "Neighborhood: Damrak", "rating": 0, "getting_there": ["Centraal Station • 4 min walk", "Amsterdam Centraal Station • 5 min walk"], "top_reviews": [{"title": "Very bizarre experience", "review": "We thought we’d come here while in Amsterdam to kill some time looking around. It was about €10 per person which isn’t extreme It was a very random experience looking at all photos and models through the years, spent probably around an hour or so here. It gets a little busy around midday when we arrived. Not wheelchair friendly as there are a lot of stairs to gain access to other floors If you’re in Amsterdam it’s something to do if you have time on your hands", "rating": 5.0, "visited": "January 2024"}, {"title": "Blonde haired women on entrance is rude af and is the reason why it doesnt get 5/5", "review": "For €10 its well priced. The toilets are something to be seen a quote from my friend \"the most impeccable toilets iv seen in Amsterdam\" lots of interesting photos. Very amusing. Alot of stairs and staff are rude and miserable. But worth a visit", "rating": 5.0, "visited": "January 2024"}, {"title": "Inexpensive Time Killer", "review": "We attended the museum to kill time between a meal and another planned trip. It was overall ok with some interesting exhibits and some really bad (old and unrealistic) mechanical displays. The overall impression was that sex and pornography has interested various world cultures throughout history. There was a separate exhibition for LGBTQ++ rights which was great to see and also interesting Entrance was 10 euros each which I felt fair.", "rating": 5.0, "visited": "January 2024"}, {"title": "Shady sex experience", "review": "Visited this as part of our Amsterdam trip in February. Obviously we all know the story with Amsterdam and its links to the sex industry, drugs and whatever craziness it presents so therefore this was a must visit for us. The museum itself has this sort of “shadiness” feeling about it as you enter, being met by some smartly dressed hosts. When you enter you’re immediately met by various statues, images and a couple of electronic animations of a man being relieved in a toilet and also another man who opens his coat and surprises you. I think the whole point of the museum is to introduce you to the world of sex, the history behind it etc yet i felt this was just full of pornographic images from the 1910s all the way through to current day and also a small exhibition on historic condoms and other contraception. For the entry of ten euros per person it isn’t the worst, but when it’s done i don’t think i would make it a priority to return.", "rating": 5.0, "visited": "February 2024"}, {"title": "A quick hour stop", "review": "We popped in here upon passing it on our way into Amsterdam and thought \"Why not\". It is what it says on the tin, we had a good laugh here and there was a lot to see, but just know it is not very accessible at all, with a lot of very narrow staircases. It killed an hour for 20 euros each so you can't complain too much, but it's definitely a see once-and-done kind of place.", "rating": 5.0, "visited": "February 2024"}, {"title": "Interesting visit.", "review": "I think this is one of those must see things in Amsterdam, it's quirky a bit of fun and not to be taken too seriously. It won't pass anymore than an hour or so and I suppose for that reason the €10 entrance is a little expensive. There's actually quite a bit to see though, and I supposed the amount of time you can spend there depends how much in detail you are reading the items watching videos evt. It is entertaining, I'd say it's worth a visit but I wouldn't go again. It can get busy at times.", "rating": 5.0, "visited": "January 2024"}, {"title": "Bit tacky.", "review": "What do you expect for a sex museum- hard to say! We felt it was a bit tacky to be honest and once you have seen one 1950’s porn picture you’ve seen 100’s! Wouldn’t feel the need to go back. Was a bit underwhelming. The giant phalus’s upstairs make for a fun group photo.", "rating": 5.0, "visited": "April 2024"}, {"title": "Fun!", "review": "8/10 We had a really good experience here. €10 to get in which was great! Can get around the place really quickly to take your time Really funny! Also really interesting if you take a minutes to actually read the art ect!", "rating": 5.0, "visited": "June 2024"}, {"title": "Something to do", "review": "We were at the Sexmuseum Amsterdam in June. This was not a highlight of things to do while in Amsterdam but we were in this area so we said why not. The museums exhibits are dated and could be working better but again, we were in this area and, the Sexmuseum was something to do. It took a little over a hour to go through. The layout of the museum isn’t the greatest if there are many people walking around looking at the same exhibits you are trying to view but again, this was just something to do considering Amsterdam is know for the “Red Light District”.", "rating": 5.0, "visited": "June 2024"}, {"title": "Sexmuseum Amsterdam Venustempel - 27/06/2024", "review": "Sexmuseum Amsterdam Venustempel - 27/06/2024 An interesting experience... It is a fairly central part of the city (At least to me, I walked past it a few times). One of those places I walked into for the fun of it. A good laugh with people.", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/d5/7f/72/iconos-sexuales.jpg"]}
{"name": "Ziggo Dome", "description": "", "category": "Arenas & Stadiums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Ziggo Dome"], "hours": "", "duration": "", "address": "De Passage 100, 1101 AX Amsterdam The Netherlands", "neighborhood": "Neighborhood: Amsterdam South-East", "rating": 0, "getting_there": ["Strandvliet • 8 min walk", "Amsterdam Bijlmer ArenA • 9 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/9b/f8/dd/imag1737-largejpg.jpg"]}
{"name": "Tour de Bonton", "description": "Discover the best-kept secret of Amsterdam and have an exclusive tour behind the scenes of the most famous high-end strip and sex club in Amsterdam. During this approx. one-hour tour, which is hosted by a former sex worker, you’ll discover a beautiful, exclusive brothel in a discreet canal house next to the Heineken Experience. During this unique Amsterdam brothel tour a friendly and experienced former sex worker will be present. You can ask her anything you want to know. Listen to the funny, strange, and interesting stories that only real insiders in the industry can tell. You'll hear what it's like to be a sex worker in Amsterdam, learn about safety measures, local prices and what it is like at night in a club like BonTon. You’ll also get the opportunity to discover all the rooms including the dressing room and VIP rooms by yourself and you can climb the stripper poles at the bar. Enjoy one of Amsterdam's unique tours and you'll certainly have a story to tell when you get back home!", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Tour de Bonton"], "hours": "12:30 PM - 6:30 PM", "duration": "Duration: < 1 hour", "address": "Stadhouderskade 64/1, 1072 AD Amsterdam The Netherlands", "neighborhood": "Neighborhood: De Pijp", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/e2/1c/8b/at-tour-de-bonton-you.jpg"]}
{"name": "EYE Film Institute Netherlands", "description": "EYE Filmmuseum is the Dutch centre for film culture and heritage. On april 5 2012 EYE opened the doors of a futuristic building on the banks of the river IJ right next to Amsterdam's Central station. A free ferry service runs right at the back of the train station and takes you across in less than 3 minutes (24/7).The EYE building was designed by Delugan & Meissl Associated architects from Austria and is freely accessible. It holds 4 screening rooms that showcase a wide variety of films, from historical classics to the latest arthouse premieres. There is a 1200m2 exhibtion space with 4 changing exhibtions every year.There is a large terrace with a spectaculair view over Amsterdam. The bar and restaurant are open 7 days a week from 10.00pm to 01.00am.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "EYE Film Institute Netherlands"], "hours": "10:00 AM - 7:00 PM", "duration": "", "address": "IJpromenade 1, 1031 KT Amsterdam The Netherlands", "neighborhood": "Neighborhood: Noordelijke IJ-oevers", "rating": 0, "getting_there": ["Amsterdam Centraal • 8 min walk", "Amsterdam Centraal Station • 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/11/50/30/80/photo0jpg.jpg"]}
{"name": "Amsterdam Tulip Museum", "description": "The Story of the Tulip. The museum features exhibits and films devoted to the tulip, the unofficial national flower of The Netherlands. From Sultans of the Ottoman Empire, Dutch Merchants of the Golden Age, to gardeners today, the tulip has captivated people around the world for centuries. This fascinating flower has inspired artists and brought great wealth and even economic ruin to people who have fallen under its spell. Explore the tulip's history and discover the remarkable journey the flower bulb has taken from the wilds of the Himalayan highlands to a garden like yours. Conveniently located in the Jordaan district of historic Amsterdam near the Anne Frank House.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Amsterdam Tulip Museum"], "hours": "10:00 AM - 6:00 PM", "duration": "Duration: < 1 hour", "address": "Prinsengracht 116, 1015 EA Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "A little gem", "review": "A friend suggested we visited. As it was included with the I Amsterdam card we thought we’d pop in as we were walking up Prinzgracht canal. Paid entry is I think €5. We spent about 25 min in there as it’s small, but it was lovely and came out feeling we’d learnt something. Nice shop too. Added advantage, unlike so many Amsterdam museums you don’t need to pre-book, you just walk in.", "rating": 5.0, "visited": "October 2023"}, {"title": "Interesting diversion", "review": "This small museum gives a good history of something synonymous with the Netherlands. We didn't know what to expect when we arrived, and were pleasantly surprised. Having no idea about tulips beforehand, it was interesting to learn about how they became so linked with the Netherlands. Over only five rooms, the museum is able to impart a lot of information.", "rating": 5.0, "visited": "March 2024"}, {"title": "Overall interesting", "review": "Nice visit with interesting information, well presented. I wouldn't have paid for entry if not included in iamsterdam city card though. The shop upstairs was very very busy but the staff were friendly and doing their best to serve people quickly.", "rating": 5.0, "visited": "March 2024"}, {"title": "Great with the city card.", "review": "The museum isnt that big but it's still very interesting and worth an hour of your time. Would recommend getting the city card if you're planning to go as the general entry price seems a bit steep for the size. Lovely gift shop with lots of great choices.", "rating": 5.0, "visited": "February 2024"}, {"title": "Small but Delightful and Informative!", "review": "We had not planned to stop here, but we are so glad we did. The Tulip Museum is a small museum located behind a bulb shop near the Anne Frank House. In a surprisingly small space, the museum takes a whimsical journey through the history of tulips from their native lands to Turkey to the Dutch bulb trade to modern industrial bulb harvesting. The videos are brief and informative and the displays are good. Definitely worth the modest entry fee.", "rating": 5.0, "visited": "April 2024"}, {"title": "A great value for 5 euros", "review": "I stopped here to use up some time before my Anne Frank tour, which is just a one minute walk up the street. I’m glad I did. It was very well presented with a mix of photos, film, and artifacts in English that let you understand the lifecycle of tulips, how they came to Holland, and why they are still important. 30 minutes is ample time for a visit, but they have a small but excellent gift shop, too.", "rating": 5.0, "visited": "April 2024"}, {"title": "Tulip Museum", "review": "This is a cute little museum to learn about the history of tulips in Amsterdam and the farming process. It feels a little cheaply done and there isn’t a ton of great artifacts. It’s a short visit and there is a cute shop. We didn’t book in advance and were able to go in but it is extremely small so I imagine there is a small limit of people allowed in.", "rating": 5.0, "visited": "June 2024"}, {"title": "A real highlight", "review": "This museum was a highlight of our trip! Such a surprise and such a good price, especially as some of us are students. There was so much information about tulips and so much more interesting than we could have imagined! We came away with tulipmania!!! The shop is also lovely and the staff were very helpful, looking forward to planting our bulbs.", "rating": 5.0, "visited": "August 2024"}, {"title": "Small museum, but provides a good history of the Netherlands tulip industry.", "review": "You enter through the gift shop and frankly you could go in there and not even notice the museum entrance in the back of the store. It was cheap to enter ($5 or so) and that is about what it is worth. It is a small 3 room affair that you do at your own pace, but you would have a hard time spending more than 40 minutes looking at the exhibits. You can tell a lot of heart went into the museum and it was informative and easy to understand. More for adults, wouldn't be very fun for kids.", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0f/a9/ff/b2/amsterdam-tulip-museum.jpg"]}
{"name": "Amstelpark", "description": "", "category": "Parks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Amstelpark"], "hours": "", "duration": "", "address": "Arent Janszoon Ernststraat 1, 1083 GP Amsterdam The Netherlands", "neighborhood": "Neighborhood: Buitenveldert-Oost", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/25/65/87/view.jpg"]}
{"name": "De Bijenkorf", "description": "De Bijenkorf meaning beehive, is the most renowned chain of premium department stores in the Netherlands. With flagship stores in Amsterdam, The Hague, Rotterdam and Utrecht and smaller stores in Amstelveen, Eindhoven and Maastricht, it’s the favourite shopping destination for Dutch and international visitors. Wander around the store to find the perfect gift for your loved ones, or take a break from shopping to enjoy a fresh cup of coffee at our cafees or restaurants. As a premium shopping destination, de Bijenkorf provides excellent services such as tax free shopping and offers an unrivalled assortment of brands in fashion, cosmetics, shoes, accessories, toys, homeware and much more. Luxury brands include established international designers ranging from Louis Vuitton, Cartier, Hermes and Saint Laurent, to Tommy Hilfiger, Calvin Klein and Hugo Boss.", "category": "Department Stores", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "De Bijenkorf"], "hours": "10:00 AM - 9:00 PM", "duration": "Duration: 1-2 hours", "address": "Dam 1, 1012 JS Amsterdam The Netherlands", "neighborhood": "Neighborhood: Damrak", "rating": 0, "getting_there": ["Nieuwmarkt • 7 min walk", "Centraal Station • 9 min walk"], "top_reviews": [{"title": "De Bijenkorf Christmas Display", "review": "I am not much of a shopper but the Christmas Display of De Bijenkorf department store in Amsterdam somehow catches my attention each and every year. This year, the Christmas Display of De Bijenkorf did not disappoint me. If you happen to be in Amsterdam, it might be worth a couple of minutes of your time to look at them🌷🌷🌷 (Correction: i am mixing up the months again. For my Hotel Penaga review here below, the date of experience should be October 2023 and not September 2023. Again, my sincere apologies for my error😃)", "rating": 5.0, "visited": "November 2023"}, {"title": "Disappointing", "review": "Although a lovely department store, the cafeteria was extremely disappointing. We wanted a healthy salad and asked several employees in the food court to point us to the right food station, but nobody seemed to have any idea of what was on offer and didn't seem to care. We finally found the large salad station but it was completely empty and featured only a tureen of soup. Why? So we ended up with cheese and salad sandwiches, which were extremely dry (possibly a Dutch thing) so needed butter. The charge was 1.5 euros for two small pats.", "rating": 5.0, "visited": "January 2024"}, {"title": "Excellent staff and a wonderful shopping experience", "review": "Sir or Madam, your shop and staff are excellent. I have tried to find out if you still sell the square Royal Delft Rabbit money boxes. When friends have babies I always get one in your store besides other shopping. Do you still stock them. Regards George Armstrong. commodoregeorge@hotmail.com", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/29/6c/ed/de-bijenkorf-amsterdam.jpg"]}
{"name": "Museum Of Prostitution Red Light Secrets", "description": "Step into an intriguing world that remains hidden to many and discover the secrets of the Amsterdam Red Light District in in the world's only Museum of Prostitution. Take a look behind the scenes of the oldest profession in the world and experience what it feels like to take a seat behind one of the famous windows. Visit Red Light Secrets and experience how surprising and exciting a museum can be!", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Museum Of Prostitution Red Light Secrets"], "hours": "11:00 AM - 11:30 PM", "duration": "Duration: < 1 hour", "address": "Oudezijds Achterburgwal 60, 1012 Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Nieuwmarkt • 4 min walk", "Centraal Station • 6 min walk"], "top_reviews": [{"title": "You simply must visit", "review": "Such an interesting eye opening thought provoking experience. A real opportunity to look at life from the other side of the glass. Excellent museum, shocked, amused, entertained, educated and informed all in one visit.", "rating": 5.0, "visited": "October 2023"}, {"title": "Definitely worth the visit if your interested in more than just what's behind the red lighted windows", "review": "Walking around the red light district left us with a lot of questions about the history behind the red light district and those who work there. Here we found some answers. Taking a break from wandering and getting a little behind the scenes info made our stay much more worthwhile then just walking around gawking lime the masses.", "rating": 5.0, "visited": "December 2023"}, {"title": "Complete change of perspective!", "review": "We visited this attraction at night and found it incredibly interesting, educating and thought provoking. It really helped understand the culture of the city and the people behind the faces in the window. The audio guides were very good and staff were extremely helpful. It was very busy but this did not take away from the experience. Some complained at having to queue outside despite having pre-booked tickets, but this didn’t take long and we didn’t mind at all. Definitely add to your must visit list!", "rating": 5.0, "visited": "January 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/05/26/74/en-memoire-des-prostituees.jpg"]}
{"name": "Joods Historisch Museum", "description": "Explore Jewish life in the Netherlands in these four superbly preserved monumental synagogues. From contemporary art to modern history: paintings, ceremonial objects, films and 3D presentations provide a full, up-to-date survey of Jewish religion and culture in the Netherlands over the centuries. The Jewish Museum features the Jewish Museum junior where children of all ages are encouraged to connect with Jewish culture.", "category": "Speciality Museums History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Joods Historisch Museum"], "hours": "10:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Nieuwe Amstelstraat 1, 1011 PL Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 2 min walk", "Nieuwmarkt • 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/9a/25/f7/20160313-120150-largejpg.jpg"]}
{"name": "OBA Library of Amsterdam", "description": "", "category": "Libraries", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "OBA Library of Amsterdam"], "hours": "10:00 AM - 8:00 PM", "duration": "", "address": "Oosterdokskade 143, 1011 DL Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Centraal Station • 7 min walk", "Nieuwmarkt • 8 min walk"], "top_reviews": [{"title": "Beautiful and Huge", "review": "I originally had planned to spend part of the day working remotely from the library on my last day in Amsterdam before taking the Nightjet train to München. As luck would have it, my Airbnb hosts graciously let me stay late into the afternoon on my final day so I did not need to use the library, but I did stop by the library for a bit to have lunch and check out how practical it would be to work from there. They had an overwhelming number of places where you could work, with outlets and good lighting. I did quickly try to get on to the internet, but struggled a bit and did not take the time to get it figured out. I'm sure the staff could have helped if I had asked. The cafe at the top had nice food and a beautiful view from the terrace.", "rating": 5.0, "visited": "June 2024"}, {"title": "Impressive Library a short walk from Centraal Station", "review": "I met some friends here in June. Right away the security guard was welcoming and cordial. He recommended the cafe/restaurant with a view over the city and river on an upper floor. It's a beautiful library. I noticed it offers many events and services for locals and newcomers to the city. Fantastic section for children!", "rating": 5.0, "visited": "June 2024"}, {"title": "Superb place to enjoy a breathtaking view and a toilet break (and it’s free!)", "review": "Here's a secret tip while you're in Amsterdam........ Where’s the best free place to take a toilet break and enjoy the view of Amsterdam? Yes, it's none other than the OBA Oosterdok, the Central Branch of the Openbare Bibliotheek Amsterdam (Amsterdam Public Library). Opened in 2007, the OBA Oosterdok is actually the 2nd largest library in Europe by floor space, behind the Library of Birmingham in the UK. Located in the eastern docklands within a short walking distance from the Amsterdam Central Station, this public library boasts 10 floors, more than 1,000 seats, 1.5 million of catalogues items, a 300-seats theatre, and opening hours of 90 hours per week (which is double the average opening hours of the conventional libraries in Europe). Best of all, on the top floor (7th floor) is a cafe-restaurant with a terrace that offers spectacular panoramic views over the city. There's no better place to spend a couple of hours especially when it rains in Amsterdam. The best things in life are indeed free!", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/3b/e7/38/sezione-musica-classica.jpg"]}
{"name": "The Amstel", "description": "", "category": "Bodies of Water Points of Interest & Landmarks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "The Amstel"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 3 min walk", "Nieuwmarkt • 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/01/1d/b1/canal.jpg"]}
{"name": "The Upside Down Amsterdam", "description": "Everyone, young and old, will find their inspiration when they step out of their current reality, into a new fantasy world that we call The Upside Down Amsterdam. With our mind bending world we want to inspire you to create, to do things you’ve never dreamt about and to have fun. You can interact with our rooms and decors, you can touch everything and you can go all out.", "category": "Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "The Upside Down Amsterdam"], "hours": "9:30 AM - 8:00 PM", "duration": "Duration: 1-2 hours", "address": "Europaboulevard 5, 1079 PC Amsterdam The Netherlands", "neighborhood": "Neighborhood: Scheldebuurt", "rating": 0, "getting_there": ["Amsterdam RAI • 3 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/55/15/7d/caption.jpg"]}
{"name": "Amsterdam Canal Ring", "description": "", "category": "Neighborhoods Bridges Scenic Walking Areas", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Amsterdam Canal Ring"], "hours": "", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/74/43/4e/img-20190504-094210-1.jpg"]}
{"name": "Rijksmuseum", "description": "The Rijksmuseum is the museum of the Netherlands. The completely renovated Rijksmuseum tells the story of the Netherlands from the Middle Ages to the 20th century. Including works by Rembrandt, Vermeer, Frans Hals, and more! Most famous is Rembrandt's masterpiece the Night Watch. A new display of the collection, a renewed building, new public facilities, a revamped garden and a new Asian Pavilion. Open daily from 9 am to 5 pm.", "category": "Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Rijksmuseum"], "hours": "9:00 AM - 5:00 PM", "duration": "Duration: 2-3 hours", "address": "Museumstraat 1, 1071 XX Amsterdam The Netherlands", "neighborhood": "Neighborhood: Museum Quarter (Museumkwartier)", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Take a Guided Tour", "review": "Remarkable art museum with exhibits you will not see anywhere else in the world. We chose a guided tour. Our small group was lead by a very experienced guide who understood the works art we saw, but the artist who was responsible for each of them and the history associated with each piece. There is no way visiting on our own could replicate the experience had. Costs a little more but an excellent value.", "rating": 5.0, "visited": "October 2023"}, {"title": "Overwhelming", "review": "There is so much in this museum it is quite overwhelming - if you have the i Amsterdam card I would suggest going twice (you can get time slots easily online). The Vermeer and Rembrandt paintings were the highlights for us but there are many other amazing paintings, and other objects of interest such as a huge model ship, ancient musical instruments and some incredibly detailed dolls’ houses. The modern section of the museum isn’t very memorable compared to the rest.", "rating": 5.0, "visited": "September 2023"}, {"title": "Go Early!", "review": "Glad we went for a 10am booking as when we came out the entry queue was really long. We made straight for level 2, The Night-watch and Vermeer. This way there were only a handful of other visitors around. Later on when we walked past there was significantly more people and harder to get close, As you’d expect the cafe is extremely expensive and you’re better walking into the Museum Plein for a coffee before or after your visit. Easy to get exhausted by the number of works in there so do pick up their free highlights leaflet and use that.", "rating": 5.0, "visited": "October 2023"}, {"title": "Fabulous collection of Old Dutch Masters", "review": "THE Museum to go to, especially if you have only a limited amount of time. The collection is fabulous and Rembrandt's Night Watch is the star of the show. We spent over 5 hours here, and had a snack in their cafe which is great. Terrific apple pie just enough to keep you going. You will not want to miss this museum.", "rating": 5.0, "visited": "October 2023"}, {"title": "Heaven for art lovers", "review": "We heard it was recently renovated. The museum is great, it's very big and there are alot to see and absorb and you need to spare enough time to be able to enjoy it. you may need guide. We usually go on our own, so it wasn't a problem. Don't miss the night watch gallery!", "rating": 5.0, "visited": "October 2023"}, {"title": "Nice. Could take a day!", "review": "The building is beautiful, and has a great cafe/restaurant attached - highly recommend going! You could easily spend an entire day looking at everything in this museum! Definitely worth visiting, but I'd do it on a day where you don't have anything else booked. Maybe a good idea to visit the cafe for a mid-way break!", "rating": 5.0, "visited": "October 2023"}, {"title": "Well worth a visit, book in advance and take your time", "review": "A lovely museum, a great range of different exhibits with something to interest everyone. We loved the building, found it to be very spacious and this added to our visit. There was no sense of rush here and we had plenty of time to look at the things which caught our eye. Some of the paintings that really caught our eye included Vermeer's \"The Milkmaid\" the quality of light is incredible. There is one of Willem Heda's still life studies which is remarkable considering it was painted in 1635 and of course there is the Night Watch by Rembrandt which is absolutely massive. As a point of note, we visited in October 2023 and the Night Watch is currently being studied to try and identify the best way to preserve the canvas. In brief they are monitoring vibrations and this involves a number of devices including a glass cage/box device to help. This does mean you don't have the full picture to see, but it is well managed by the museum and is perfectly understandable. Another good thing the museum does, is that it has information cards for key exhibits which you can read when standing with those items. These cards are approx A4 in size, double sided and can be found in boxes near the exhibit. You can simply chose the language of your choice, pick them up and spend time reading about the subject before replacing them, great idea. The main tips we would give are: 1. Book in advance, saves time and means you will definitely get in at the time and date of your choice. 2. Don't rush when you're inside, there is a lot to see and plenty of room, so pace yourself. 3. There is a Van Gogh self portrait here, it is lovely but don't base your visit because of this, go to the Van Gogh Museum next door if you want to see his work.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great Museum", "review": "Excellent museum with wonderful works very well displayed ad explained. I would encourage the audio tour as it helped guide you through the sections f the museum. The museum’s information provided a great deal of historical knowledge I was heretofore unaware of.", "rating": 5.0, "visited": "October 2023"}, {"title": "Learned about Dutch art and history", "review": "Gorgeous art, sculpture and collections. We spent most of our time in the main galleries to see the Van Gogh, Rembrandt, Vermeer, and others. However we did venture into the smaller galleries and learned a lot about other artists. You can download the audio guide to your phone and listen to save the 5€ for the audio guide there. They have a QR code that you can use to get the guide. Our kids only lasted two hours but easily could have spent four there. It was the local school break time and they had special kids activities on when we visited.", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing Art Inches Away", "review": "There are so many amazing pieces of art —whether it’s paintings, silver, glass, ceramics etc. Make sure that you visit the gallery showing the most famous pieces of art. We went in October and even then, it was crowded. The headsets are not useful. Don’t spend the extra money. FYI there are a lot of stairs. Elevators are available but for general attendees, you will be climbing the stairs a lot.", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/15/eb/e2/vista-lateral.jpg"]}
{"name": "Vondelpark", "description": "At one of Amsterdam's most famous parks, travelers can enjoy a host of outdoor activities amid beautiful English-style landscaping. Here, you can hike the countless trails or ride a bike around to spot charming bandstands and even a sculpture by Picasso along the way. Have a picnic by the pond as herons and ducks waltz past or pop by one of the many cafes in the park. You might want to visit between April and May to see the park awash with tulips in bloom or between May and September to watch live concerts at the open-air theater. – Tripadvisor", "category": "Parks", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Vondelpark"], "hours": "", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Museum Quarter (Museumkwartier)", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Nice park that is quite massive", "review": "We had rented bicycles from A-Bike Rental that is close by, as there are no bicycle rent shops inside the park. The park is quite massive, though there are lots of people cycling, walking or just relaxing. Little to do inside the park though, so we just cycled several times around.", "rating": 5.0, "visited": "August 2023"}, {"title": "Lovely City Center Green Space!", "review": "Unplanned circumstances allowed us to become well acquainted with Vondelpark in the heart of Amsterdam. We had Sunday reservations at both the Van Gogh & Rijksmuseum. We had no idea that the Amsterdam Marathon was being run that day! Sunday morning, as we tried to access the Van Gogh Museum, we discovered that we would have to use an alternate, longer route. We hurried through Vondelpark and finally found a bridge that took you over the participants. After our time in the museum, we leisurely walked through the park to then discover that getting into the Rijksmuseum would be just as difficult. Vondelpark is a beautiful green space in the center of Amsterdam!", "rating": 5.0, "visited": "October 2023"}, {"title": "European floral paradise!", "review": "Spring is coming! Visiting Vondelpark during the spring season is a wonderful experience. This iconic park is blooming with snow drops and other spring flowers right now. We had a lovely stroll in the sun and enjoyed a take away coffee from one of the carts in the park. My 2 year old played with the ducks near the pond. When you walk here you know: life in Amsterdam is good. So don’t hesitate to visit this park if you want a peaceful getaway right next to the hustle and bustle of the city center.", "rating": 5.0, "visited": "March 2024"}, {"title": "Pretty park", "review": "Vondelpark is ideal for a walk, cycle or run. We hired bikes for an hour (25 euro for 2) from Macs, about half mile away. This meant cycling on cycle lane to the park. There doesn’t seem to be anywhere within the park to hire bikes. We were looking forward to seeing lots of tulips in the park, being April, but there were hardly any, apart from in baskets in the lake, but otherwise, a lovely park.", "rating": 5.0, "visited": "April 2024"}, {"title": "Outdoor Greenery", "review": "Spectacular park with limestone paths throughout. You can relax near one of the water features or stroll through the trees. The weekends can be very busy with so many runners and bikers. It's a great place to enjoy some outdoor greenery.", "rating": 5.0, "visited": "April 2024"}, {"title": "Lovely park", "review": "Beautiful park not far from Rijksmuseum. During warm days a nice place to relax either in the sun or in the shade, during the evenings a lovely pretty quiet place for a walk, run or biking where you can hear the birds sing even in the middle of a city. There are a few place where you can buy something to drink but I didn't try them.", "rating": 5.0, "visited": "May 2024"}, {"title": "Well worth a couple hours to enjoy the sunshine!", "review": "Really beautiful park, easily accessible via the trams. Had been scared to rent bikes and ride them around the streets of Amsterdam, but rented a few for a cycle around the park. It was amazing! If you do cycle around the park, make sure to follow the rules of the road (cycle on the right, indicate with hands before turning). The Picasso statue blends right into the park, such an interesting way to show that art is for the every day. Unfortunately we weren’t able to see any storks, however the island they are supposedly on still looked beautiful! We went mid day and it was busy, but not too crowded. Overall, a delightful park to visit.", "rating": 5.0, "visited": "May 2024"}, {"title": "It's a Beautiful Park - But It is Just a Park", "review": "I went to Vondelpark twice. Once I went on my own and I also took a bike tour of the city where we biked through the park. It is a beautiful park to walk or bike through. There is not much to see except for the beauty of the park. There are lots of runner, walkers, cyclists, etc... in the park and the park is very well maintained. If I was to run while on my trip I would have definitely headed over to the park. If you are a photographer there are lots of beautiful views. If you want to just experience Vondelpark and say you were there, 30-60 minutes is more than enough. I would compare it to Central Park in NYC. There are people that can walk the 6 mile road in Central Park for 2-3 hours and love it or you take several hours to see the whole park and all of the areas, or you can say an hour in the park is enough to experience it and say you were there. It would also be similar to Lumpini Park in Bangkok.", "rating": 5.0, "visited": "April 2024"}, {"title": "'It's slightly out of the centre but can be accessed from many different entrances.'", "review": "I like to call it the Central Park of Amsterdam because there's so many things to see, from sculptures, water features and ponds. It's slightly out of the centre but can be accessed from many different entrances. The park itself is huge and there's many green open spaces so perfect for having picnics and catching up with friends. When we visited the weather was stunning, 25 degrees celsius to be exact, so it was very busy but there was still plenty of room to sit down and soak up the sunshine. Overall, a stunning park which is well kept and litter free. Would highly recommend if the weather is good and you're looking to relax whilst visting Amsterdam.", "rating": 5.0, "visited": "May 2024"}, {"title": "Nice park but watch out for all the bicycles", "review": "Did a walk through and indeed it is a beautiful park. On the other hand it is a regular bicycle thoroughfare and any peace you might feel has to be tempered by the constant vigilance for bicycles. Easy to pick a path but difficult to cross the main bike path.", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0c/bf/7b/51/vondelpark.jpg"]}
{"name": "Stedelijk Museum Amsterdam", "description": "The Stedelijk Museum is an international institution in Amsterdam dedicated to modern and contemporary art and design. The Museum aims to provide a home for art, artists and a broad range of publics, where artistic production is actively fostered, presented, protected, reconsidered and renewed", "category": "Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Stedelijk Museum Amsterdam"], "hours": "10:00 AM - 6:00 PM", "duration": "Duration: 2-3 hours", "address": "Museumplein 10, 1071 DJ Amsterdam The Netherlands", "neighborhood": "Neighborhood: Museum Quarter (Museumkwartier)", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Ok…not great", "review": "We wanted to see some modern art as well as traditional art, but didn’t find much of this memorable. You can’t even take a small canvas bag in, so you can’t sit and sketch if you want to. The cafe was table service only and was incredibly slow just for coffee and cake at a quiet time in the afternoon. This museum is ok but I wouldn’t say it’s a high priority if you have limited time in Amsterdam.", "rating": 5.0, "visited": "September 2023"}, {"title": "Good alternative", "review": "If you can’t get in to the Rijksmuseum or Van Gogh Museum because you didn’t get tickets in advance, this is a very good alternative. Wonderful range of modern art, presented in periods such as 1950s to 1980s and post-1980s. And no need to book!", "rating": 5.0, "visited": "October 2023"}, {"title": "Nice!!!", "review": "Every now and then i drop by this museum. I loved the Chagalls hanging here. It is almost never as crowded as the two nearby world-famous museums so i quite enjoy the space and especially the quietness here. The museum shop is quite lovely too✌✌✌", "rating": 5.0, "visited": "January 2023"}, {"title": "Stellar collection of modern art", "review": "Stedelijk Museum of Modern Art was included in my I Amsterdam card and one of the highlights of my trip. Absolutely wonderful collection! Chagall’s “Maternity” and “Bella in Green” stole my heart, as expected. There are several interesting portraits by Russian avant-Garde painters of the early 20th century: Kokoshka, Matyushin, etc. All of these paintings are in the first room. After that, the collection takes more “modern” turn. For the fans of Yayoi Kusama's installations, there is her famous erotic “Boat” in different shades of blue. I didn’t spend much time on the ultra-contemporary art and on Mondrian as well. Two hours of joy for an art lover like me… and no crowds at all.", "rating": 5.0, "visited": "October 2023"}, {"title": "All the names you expect but a little soulless", "review": "I tried first to visit the Stedelijk on a Friday evening, when it's late night opening, but the queue was so long and not moving much that I gave up. I didn't have an advanced ticket but speaking to people in the queue this didn't make any difference as there were not separate queues for tickets and ticketless. Fortunately I was able to re-arrange to go first thing on a Tuesday morning when it was much quieter. The lovely lady who manages the entrance hall (more of whom shortly) said it is always extremely busy from Friday through the weekend, so if you can visit on a weekday do so. Once inside it was clear this is a big building, and it took me a good 3 hours to see the whole thing, and that was without visiting the Marina Abramovic exhibition that was on (I'm not a fan). I went around in room number order so as not to miss anything, which meant I came to a Matthew Wong exhibition first. I quite like his work but I found the amount of it here a little overwhelming and to be honest was pleased to come to the end of it and move on to the permanent exhibition. Like all modern/contemporary galleries there are likely to be a things that leave you cold and things you love, but they'll be different for different people. Suffice to say the collection is so extensive that there'll be something for everyone. Note that the lockers here are before you pass the ticket gates, so make sure you have everything you need with you. The lockers are the key code type, and if you find you can't open your locker when you return (and you're dashing to catch a train) don't dissolve into a gibbering wreck like me, just ask the cloakroom attendants who will call the lovely lady running the place who will use her master code to sort you out and send you on your way in two minutes. Overall my view of the Stedelijk is that it has all the names you expect, gives a comprehensive view of 20th Century art, but is a little soulless and lacking in an identity.", "rating": 5.0, "visited": "March 2024"}, {"title": "Well worth visiting", "review": "The Stedelijk has a great collection of Modernist Art from the early 20th century up to today. The original building has been extended with what locals refer to as the \"bathtub\" and the collection has grown since our previous visit several years go. Pre booking is not absolutely essential but remains a good idea as it is busy. The staff are very helpful and the displays are wheelchair friendly.", "rating": 5.0, "visited": "July 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/45/e9/11/stedelijk-museum.jpg"]}
{"name": "De Duif", "description": "", "category": "Churches & Cathedrals", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "De Duif"], "hours": "", "duration": "", "address": "Prinsengracht 756, 1017 LD Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 10 min walk", "Weesperplein • 10 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/15/50/44/prinsengracht.jpg"]}
{"name": "Museum Het Rembrandthuis", "description": "Rembrandt lived and worked from 1639 to 1658 in this 17th-century house, which today is a museum that pays tribute to the artist's life and career.", "category": "Historic Sites Art Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Museum Het Rembrandthuis"], "hours": "10:00 AM - 6:00 PM", "duration": "", "address": "Jodenbreestraat 4, 1011 NK Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 3 min walk", "Nieuwmarkt • 4 min walk"], "top_reviews": [{"title": "Interesting and Informative Self-Tour!", "review": "And of course you can't visit Amsterdam without Rembrandt! He was a true Amsterdamer, and although he never left the Netherlands, he felt that he traveled the world through art! The Rembrandthuis Museum is housed in a residence that was his home for about 20 years. He was an affluent & respected artist, but after a time, financial difficulties forced him to find a smaller home. The audio guide allowed you to tour the residence at your own pace. Not only was the property the families personal residence, but it also was his studio, a studio for art apprenticeships, and his art dealership. The house, in true 17th century splendor, is adorned with the prints, sculptures, and paintings of other painters from Rembrandt’s time. A collection of almost all Rembrandt’s etchings, prints, and the graphic techniques he used are also shown. No visit to Amsterdam would be complete without a visit to the Rembrandthuis Museum.", "rating": 5.0, "visited": "October 2023"}, {"title": "Rembrandt’s house", "review": "From extremely hectic Rokin I took a nice walk to the Rembrandt House Museum, which was included in my I Amsterdam card. The museum has the largest collection of etchings created by the artist. His drawings are on different subjects: nature, love, family life (the drawing of his “Prodigal Son “ is there)… The rooms are recreated to produce an image of the house he had owned with his first wife Saskia, and then with Hendrickje Stoffels, whom he never married, and his son, Titus. There is a replica of his work room, his bedroom and his kitchen, the place where he was mixing paints and preparing canvases… I also looked at etching process demo, which was quite entertaining. You can also see the complete collection of Rembrandt’s etchings on the second floor. All of this was very interesting and brought me closer to one of my favorite painters, but to see his immortal art you have to go to the Rijksmuseum.", "rating": 5.0, "visited": "October 2023"}, {"title": "Don’t miss the Rembrandt House Museum in Amsterdam!", "review": "I purchased admission tickets online to see the Rembrandt House Museum in Amsterdam via Booking.com for my husband, teen, and me. Three tickets cost me approx. US$38.00 (€35). We arrived early in the morning of April 10th 2024, took a nap, and found our way there for our 3 pm timed entry. There’s lockers to hold your backpack & other belongings. The free audio tour is a must do. Full of info about Rembrandt’s work, his Influences, his personal life, and the house where he lived from 1639 to 1658. It was surreal to stand in the studio space in the house where he worked, to see his etchings, and to learn about how he prepared his paints. The museum shop also carries very reasonably priced items to bring home as souvenirs. Don’t miss it. Well worth seeing and learning about Rembrandt. The space is beautiful.", "rating": 5.0, "visited": "April 2024"}, {"title": "Amazing place", "review": "We visited the Rembrandt House which represents the place where Rembrandt was living and working. We can see it all of the reasons that he was going bankrupt. Before selling all his worldly goods he wrote a complete setup which ended in a thick book. So we know exactly what has been inside in this house and it could be reseted once again.", "rating": 5.0, "visited": "May 2024"}, {"title": "(:", "review": "Most of the things and works were not actually in the house and were added later on, so that part isn’t actually authentic. Still very nice, especially his and his pupils’ works. The house itself though is fantastic, you feel teleported in time.", "rating": 5.0, "visited": "April 2024"}, {"title": "Highly recommended!", "review": "Very well-organized, clean, and engaging. The staff was very polite, also. Do not lose the opportunity to imagine Rembrandt's life in his working and living space. Highly recommended! (Just a suggestion to the Museum: providing the possibility to choose the playback speed on the guided tour would be the golden touch.)", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/cc/ea/ba/rembrandt-his-studio.jpg"]}
{"name": "Wereldmuseum Amsterdam", "description": "Wereldmuseum Amsterdam is een museum over mensen, gevestigd in het indrukwekkende rijksmonument aan het Oosterpark in Amsterdam. Een omvangrijke vaste tentoonstelling en regelmatig wisselende exposities tonen objecten, die stuk voor stuk een menselijk verhaal vertellen. Verhalen over universele menselijke thema’s zoals rouwen, vieren, versieren, bidden of vechten. Van Afrika tot West- en Zuidoost-Azië, van Nieuw-Guinea tot Latijns-Amerika. In Wereldmuseum Amsterdam ontdek je dat we ondanks de verschillen, allemaal hetzelfde zijn. Wereldmuseum Junior is het kindermuseum, speciaal voor kinderen van 6 t/m 13 jaar. Als je Wereldmuseum Junior binnenkomt, stap je in een andere wereld. Het is een ware beleving waarbij alle zintuigen worden geprikkeld. Je leert door te doen. In de huidige doe-tentoonstelling ZieZo Marokko ga je op reis met Esmaa, Fatima, Nasrdin en Yousef en ontdek je het land van hun ouders. Wereldmuseum Junior biedt kinderen een open blik op de wereld.", "category": "History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Wereldmuseum Amsterdam"], "hours": "10:00 AM - 5:00 PM", "duration": "", "address": "Linnaeusstraat 2, 1092 CK Amsterdam The Netherlands", "neighborhood": "Neighborhood: Amsterdam East", "rating": 0, "getting_there": ["Muiderpoort • 9 min walk"], "top_reviews": [{"title": "Beautiful interior", "review": "I like to come here sometimes. The inside of this quite huge building is really quite beautiful. There are always exhibitions here with different themes. Worth taking a look if you are in Amsterdam and have some time over after your sightseeing ✌✌✌", "rating": 5.0, "visited": "January 2023"}, {"title": "Eclectic museum", "review": "Eclectic museum with exhibits on their colonial.history, plastics, Arabian music artists among others. Very much a learning and understanding museum - makes you think. Bear in mind now called Wereldmuseum as has brought multiple museums together. Cafe is self service.", "rating": 5.0, "visited": "February 2024"}, {"title": "Finally we are talking about it", "review": "I visited the Wereldmuseum on a school trip the other week … obtained terrible museum fatigue in the process but the exhibit we saw was very informative of the masked history of the Netherlands. This has been a certain point of frustration for me during my time in Amsterdam. The complete lack of discussion of colonization and imperialism imbedded within Dutch history is seldom talked about. I appreciated the Wereldmuseum for this.", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2d/cd/45/d8/wereldmuseum-amsterdam.jpg"]}
{"name": "Museum Het Schip", "description": "Museum The Ship is located in the imaginative social housing complex ofthe same name designed by architect Michel de Klerk. This expressionistic housing block was built in 1919 for social housing corporation Eigen Haard. The triangular shape of the building inspired its nickname “The Ship”. It is one of the best examples of the “Amsterdam School”– a movement in architecture and decorative arts that spread across all of the Netherlands.", "category": "Speciality Museums Architectural Buildings History Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Museum Het Schip"], "hours": "11:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Oostzaanstraat 45, 1013 WG Amsterdam The Netherlands", "neighborhood": "Neighborhood: Spaarndammerbuurt", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/f4/31/f5/world-famous-social-housing.jpg"]}
{"name": "Noordermarkt", "description": "", "category": "Flea & Street Markets", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Noordermarkt"], "hours": "9:00 AM - 4:00 PM", "duration": "", "address": "", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Quintessential Dutch market", "review": "We landed early in the AM; by the time we cleared customs and dropped off our bags, the market was open. I was surprised to find that there wasn't any coffee for sale (and the cafes around it were packed), but there were stands selling Poffertjes (small dutch pancakes), fresh produce, and aged cheese that was safe to travel with because they don't need to be constantly refrigerated. The focus on this market was really thrift, and you can find a lot of great things here if that's your interest.", "rating": 5.0, "visited": "September 2023"}, {"title": "Compared to I like to unwind at the end with a nice glass of red wine at Cafe Daalder, for instance!", "review": "I enjoy taking my time exploring and finding new things. I purchase fruit, cheese, outerwear, shoes, blouses, t-shirts, and a lot more. After that, I go to The Church to see my preferred book sellers. I always succeed when I buy books on my career and pastime.", "rating": 5.0, "visited": "August 2024"}, {"title": "We went there since a buddy told us to.", "review": "We adored the sights and scents of the abundant produce, cheeses, meats, and seafood. Together with stalls offering both new and old clothes, there were sellers selling antiques. There were several kiosks filled with gorgeous sweaters and coats because winter is almost approaching.", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/18/e5/50/noodermarkt-on-non-market.jpg"]}
{"name": "NEMO Science Museum", "description": "Expand your world at NEMO Science Museum. In the largest science museum of the Netherlands you will find proof that science and technology can be captivating for all ages. The remarkable building on top of the IJ-tunnel offers lots of exciting hands-on activities. At NEMO you can experience the joy of science and technology, by blowing gigantic soap bubbles, watch an enormous chain reaction and experiment in a real laboratory. In a variety of exhibitions you can 'Take a journey through the mind' or learn that there is more than meets the eye when it comes to sustainable electricity and smart transportation at 'Smart Technology'. The creative mind behind NEMO, built in 1997, is Italian architect Renzo Piano. He had a clear vision for his design of the NEMO building, with its very own piazza 22 metres above water level.", "category": "Science Museums Children's Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "NEMO Science Museum"], "hours": "10:00 AM - 5:30 PM", "duration": "Duration: 2-3 hours", "address": "Oosterdok 2, 1011 VX Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Nieuwmarkt • 10 min walk"], "top_reviews": [{"title": "Very nice", "review": "We really like the visit here, all the workshops labs and installations are very well done and organised. Also the upper floor is very interesting and also the threated themes are very impoortant and inclusive. Absolutely it s is worth a visit!!", "rating": 5.0, "visited": "September 2023"}, {"title": "Fun interactive exhibits for all ages", "review": "Our kids loved this museum and so did we as adults. It’s not particularly Dutch in that you can find good science museums all over but it was a wonderful way to break up other Dutch/Amsterdam museums that we visited with the kids. We spent three hours here with our two kids. There are loads of interactive exhibits. The restaurant is convenient as you have to go back across a large street into the neighbourhood to get to restaurants. It’s not inexpensive but the food was good.", "rating": 5.0, "visited": "October 2023"}, {"title": "AMAZING", "review": "I went on a class trip there was about 30 of us all teenagers and we had the best time. This place isn’t limited to children or teenagers though because the adults there lived it too. If you are going make sure you bring a good camera because there are great photo opportunities. Try everything because It’s all worth it and make sure you take a lot of time out of your day for it as we were there for hours on end. Honestly one of the best places.", "rating": 5.0, "visited": "April 2023"}, {"title": "Great science museum", "review": "Fantastic Science Museum. Loads for the kids but great for us adults too who like to experiment. Highlight was seeing the chain reaction. Didn't do the lab. As half term was very busy so didn't do as much as we hoped but will go back during term time.", "rating": 5.0, "visited": "February 2024"}, {"title": "Incredible experience!", "review": "My second time visiting Amsterdam and so a second visit to the NEMO science museum was a must. Lots of interactive stations and learning areas on all sorts of things science!! We don't have children but still really loved our experience. Staff friendly and helpful. Lockers available for coats.", "rating": 5.0, "visited": "March 2024"}, {"title": "Expensive day out but ok rainy day activity", "review": "Decidedly average especially for €17+ euro per person. We watched the “chain reaction” display twice as that was probably the most engaging thing but most of the explanation was in Dutch so it was hard for non Dutch speaking children to get properly involved. Lots of very disruptive children queue jumping, not taking turns, at times quite stressful. Our 8 year old enjoyed it but the 11 year old (normally very science-oriented) found it boring. The science lab was worth queuing for but by the time we found it we had ran out of time. Lunch (4 portions of vegetarian chilli) was over €50, all drinks extra, no tap water available. Children complained that their school chilli was better (!) and couldn’t bring themselves to finish even though they were hungry. Ok for a rainy day but hard to justify the cost when compared to the free science museum or natural history museum in London.", "rating": 5.0, "visited": "March 2024"}, {"title": "Fun Day in Nemo Science Museum", "review": "Nemo science museum is easily accessible by metro or boat. You will not miss it by its symbolic ship-shaped building and it is also opposite to maritime museum. My 5-year-old daughter loved the whole visit experience. The museum demonstrates science in different interactions, and live sessions which kids can easily engage with. The museum has all facilities such coffee shop, restaurant as well. The rooftop restaurant is definitely a good place to relax and have a bird view of the city.", "rating": 5.0, "visited": "April 2024"}, {"title": "Interesting, Intriguing, Innovative", "review": "Extremely Expansive, wise variety of interesting exhibits. Much better than the same old repetitive amusement parks. It has several floors and each floor has different sections. The Experiment Room on one of the Floors where you actually do a Project is just fantastic. Don't skip it. Then of course, the illusions pics that you take. The place takes a lot of time, engaging your interest, hence keep enough time. At the Top there is a nice Eatery with a beautiful outside area and most amazing views of the city. Dont Miss !", "rating": 5.0, "visited": "June 2023"}, {"title": "We had sun and it was hot but that was great because it was hot on the terrace. On the terrace is water and wind things. Childre", "review": "Very fun museums. I recommend that you skip first few floors and go to humania floor, beacouse it is gonna take you most of the time. Then cocertate to other floors. It depands how old your children are. The 2 floor is fin too. On every full hour there will be chain reaction on 1st floor", "rating": 5.0, "visited": "May 2024"}, {"title": "Very interactive", "review": "The place was hugely interactive. It was fun to get to have a go at the different activities and learn at the same time! I would say that it gets really busy especially near the interactive sections so come early and go to what you want to see first. We did get to see a show which was nice although I would say some people didn’t know how to be polite and were actively encouraging their children to start playing on the activity you are already on until you have to give up and move. The gift shop is alright but it’s expensive for what it is and doesn’t really have anything suitable for those above the age of 12", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/fc/a7/ce/nemo.jpg"]}
{"name": "The Milkmaid Project", "description": "This is the 'BEST ART EXPERIENCE OF AMSTERDAM'! Step back in time and immerse yourself in the vibrant world of the 17th Century. Wander through our meticulously recreated museum, where every scent, texture, and detail captures the essence of life during this era. Discover the secrets of Dutch masters like Vermeer and Rembrandt, and uncover the stories behind their timeless paintings. Why just learn about history when you can become part of it? Pose as iconic figures like the self portraits of Rembrandt, like William of Orange, The Milkmaid of the Girl with the Pearl in beautiful reconstructed settings. The possibilities for you and you beloved ones are endless. This unique experience only takes one hour and you will leave our Milkmaid Project with a beautiful print in your hands. Ready to transform into a Dutch masterpiece? Book now and step into history.", "category": "Art Galleries", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "The Milkmaid Project"], "hours": "12:00 PM - 7:00 PM", "duration": "Duration: 1-2 hours", "address": "Nieuwe Leliestraat 14-H, 1015 SP Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Enjoyable afternoon", "review": "Sander provided us with an enjoyable afternoon and a quality keepsake from Amsterdam. He provided an interesting introduction to the artwork and built up the excitement. The attention to detail when taking the picture was great and they were edited and delivered really quickly.", "rating": 5.0, "visited": "October 2023"}, {"title": "A truly unforgettable cultural experience. Get ready to jump in the past!", "review": "Sandro's remarkable talent and scholarly insight truly elevate the experience at his studio. His meticulous recreation of 1700s paintings transports visitors to a bygone era, revealing his extraordinary craftsmanship and deep understanding of art history. The passion he exudes for Vermeer's work is infectious, infusing each piece with an authentic essence that captivates the soul. Guests are not only treated to an artistic spectacle but also an educational journey into the mind of a true master. Sandro's studio is an oasis for art enthusiasts, offering a profound and enriching immersion in the world of classical art.", "rating": 5.0, "visited": "October 2023"}, {"title": "Very special must-do!", "review": "Sander has a great story to tell about the Milkmaid by Vermeer and has a brilliant studio in 17th century-style. The clothes, the props, everything breathes this amazing period in time. With great patience and joy in his work, he is able to shoot the right picture of anyone or any group. A must-do, when you are visiting Amsterdam.", "rating": 5.0, "visited": "October 2023"}, {"title": "The Milkmaid Project", "review": "The Milkmaid Project is the vision of professional photographer Sander Veeneman. Over the past three years, he has researched the works of Vermeer and Rembrandt, among others, to create a studio in which to capture in photography what was painted by the old masters. I arrived out of the rainy streets a few minutes early for my appointment and was kindly offered a cappochino. There followed an engaging conversation of his analysis of Vermeer’s The Milkmaid to recreate in studio a setting faithful to the times and materials painted by the masters. We reviewed various settings and selected the tableau of Portrait of A Scholar of 1631. While Sander set to work staging the photo, including a 17th century leather bound book he purchased at auction, I followed his instructions in donning the costume. Lights, camera, and an engaging photo session of about 20 captured images. Hard to keep a straight face with some of Sander’s light humor but he knows the works the your image is based on. Following his prompts, we found a very nice rendering and a nice photo of an afternoon well spent. I have no hesitation recommending your participation, whether you seek a serious image or a more light hearted version.", "rating": 5.0, "visited": "November 2023"}, {"title": "A Journey Through Art with Sander's Lens", "review": "Sander is an exceptional artist and historian, and our time with him was truly remarkable. When I surprised my dad with a family portrait session, Sander welcomed us into his world – his studio, an absolute wonder for any art enthusiast. I highly recommend booking a photography session with him. You'll not only leave with a unique souvenir but also with a sense of enrichment that will last a lifetime", "rating": 5.0, "visited": "October 2023"}, {"title": "A full immersion into Vermeer's work", "review": "Not only is it an incredibly fun activity, but it also sheds new light on Vermeer's work and the technique he used. Sander's passion for this project can be felt in every detail, starting with the welcome greating and the back story of how he discovered his passion for Rembrandt and Vermeer. The level of detail put into recreating Vermeer's milkmaid kitchen is incredible. Not only during but also after your visit you'll have a smile on your face thinking back about the shoot. Its almost as if you're going back to the 17th century to experience what life was like. The end result is even better than you expect it to be! If you're in Amsterdam and are looking to do something unique, then this is what you need to do!", "rating": 5.0, "visited": "October 2023"}, {"title": "Great experience, great fun", "review": "My kids took me to The Milkmaid Project for a photoshoot to celebrate my 75th birthday early december. It was a perfect happening. Alexander/Sander is a great guy, very professional photographer, much fun to be with, great storyteller. My photo choice was Rembrandt's 'The Scholar'. The result is a fine, beautiful portrait, now the eyecatcher on the wall in my livingroom...If you're around in Amsterdam and have some spare hours, go visit The Milkmaid Project ! You won't regret it !! Aart", "rating": 5.0, "visited": "December 2023"}, {"title": "Familyportrait.", "review": "Receive a gift voucher. With this voucher we wanted to take a different kind of family portrait than standard. That certainly worked. We received a very friendly welcome, were treated to a bit of art history and then dressed up for the photo shoot. This one was hilarious, but with a beautiful result. Even our 17 year old son had an enjoyable afternoon. Thanks Sander!", "rating": 5.0, "visited": "December 2023"}, {"title": "Unique family portrait", "review": "This was an amazing experience and the family portrait that was the result we will cherish for a long time. I initially thought that this was expensive but given their time, energy and enthusiasm and the uniqueness of what they offer, I don't think it's bad value at all. My advice is to just book it, you won't regret it!", "rating": 5.0, "visited": "December 2023"}, {"title": "History comes alive, with you as the leading character!", "review": "We just had an unforgettable experience thanks to Sander. This passionate photographer, skilled storyteller and humble historian has made our Amsterdam visit so special and memorable. Entering his domain is like stepping back into time, his camera the only 21st century prop. The costumes, the setting and his eye for detail enable anyone to turn into a Rembrandt or Vermeer model. We thoroughly enjoyed the session and adore the result. Thank you so much Sander!", "rating": 5.0, "visited": "January 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/56/fe/65/this-is-just-a-small.jpg"]}
{"name": "Brouwerij 't IJ", "description": "", "category": "Bars & Clubs Breweries", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Brouwerij 't IJ"], "hours": "12:00 PM - 8:00 PM", "duration": "", "address": "Funenkade 7, 1018 AL Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Muiderpoort • 10 min walk"], "top_reviews": [{"title": "Great Beer!", "review": "Unfortunately we came during their Oktoberfest celebration so the places was packed and only three beers were available to try. But the next day we visited their Voldenpark location and the the staff and beers were on point. Love trying craft beer in other countries!", "rating": 5.0, "visited": "October 2023"}, {"title": "Great place for a beer", "review": "Was in Amsterdam for a football match between Netherlands and Scotland, and having visited Amsterdam before, was wanting to get away from the central side of the city, and see what more it can offer. Had just been for a meal near by, and the \"windmill brewery\" had really taken my fancy, as I could see from across the road that for a Thursday night it was packed! Went in for a couple of beers, and was really good and a excellent alternative to the regular beers that the Netherlands has to offer.", "rating": 5.0, "visited": "March 2024"}, {"title": "Good Place.", "review": "I checked this place on a nice sunny afternoon. Some different selection of beers, followed by some other finger food options, nice terrace with a very good vibe made the full package. The only reason I didn't rank it higher was because of the staff. At least the person who took all my different orders was really single word answering and with no sympathy at all. In a place where you usually have to ask several different questions about beer and stuff, didn't really make me want further explore the options.", "rating": 5.0, "visited": "May 2024"}, {"title": "A beer beside the only windmill in the city - what’s not to like!", "review": "The only windmill in the city makes it a destination beer to say the least. Easy access by public transport as well as walking from the centre. The beer paddle was a great way to experience the beer (I had the classic one) and then you have plenty more to choose from if you want to settle in. A great range of beer snacks (we had the bitterballen with mustard). We went on a weekday so didn’t do the brewery tour - but that’s ok. Not much there if you don’t like beer though", "rating": 5.0, "visited": "June 2024"}, {"title": "Refresh and recharge", "review": "After spending time walking the street markets of De Pijp or Dapperstraad or going through the Maritime Museum, take an afternoon break here. Plenty of shade and breeze along with a couple of pints of craft beer restores the soul. Flights are available if you want to explore more flavors as you recharge.", "rating": 5.0, "visited": "July 2024"}, {"title": "Great beer and friendly vibes", "review": "Visited this place on a recent trip to Amsterdam and had a great afternoon. Easy tram ride from the centre of Amsterdam. It was a really hot day and was packed and a great atmosphere. My husband and I shared two of the beer flights plus some tasty bitterballen. Got chatting to friendly Dutch people sat around us. All in all a great afternoon. Bought myself a beer glass in a nice box for just 5 Euros to take home, which was a lovely souvenir. Highly recommended.", "rating": 5.0, "visited": "July 2024"}, {"title": "The best beer and biterballen we had", "review": "We have been there twice and the first time we have opted out for beer samples tasting. The second time when we went there, we didn't know what was the name of the beer we had tasted the first time. When we tried to describe it, the bartender figured out what we would like to drink, and gave us to taste a sample before ordering. I recommend this place to everyone who wants to relax and enjoy the atmosphere while having a good beer and a tasty snack.", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/b6/93/78/windmill-the-gooyer.jpg"]}
{"name": "Emperor's Canal (Keizersgracht)", "description": "", "category": "Bodies of Water", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "Emperor's Canal (Keizersgracht)"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Grachtengordel-West", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/5b/e6/6e/caption.jpg"]}
{"name": "The Cat Cabinet", "description": "A museum for cat lovers that features a collection of objects d'art wholly centered around the theme of our feline friends.", "category": "Speciality Museums", "breadcrumbs": ["Europe", "The Netherlands", "North Holland Province", "Amsterdam", "Things to Do in Amsterdam", "The Cat Cabinet"], "hours": "12:00 PM - 5:00 PM", "duration": "", "address": "Herengracht 497, 1017 BT Amsterdam The Netherlands", "neighborhood": "Neighborhood: Centrum", "rating": 0, "getting_there": ["Waterlooplein • 10 min walk"], "top_reviews": [{"title": "Cute but overpriced", "review": "Definitely one for cat lovers! This museum is full of cat paintings, statues and many other forms of cat memorabilia. There are also a few live feline friends running around who are absolutely adorable. The staff are friendly and polite. Unfortunately the experience is overpriced at €10 per person. We were in and out within about 25 minutes. Compared with some of the other museums, this doesn't represent great value for money. All bags are removed from you at the door and there are no lockers, they are simply looked after by the staff.", "rating": 5.0, "visited": "November 2023"}, {"title": "Cute Cat Museum with 2 kitties", "review": "Cute little museum with a bunch of cat memorabilia and paintings throughout the years. The back garden isn't open in the winter which was the only bad thing for us! This place has two kitties sleeping around, very good ☺️", "rating": 5.0, "visited": "January 2024"}, {"title": "If You Love Cats, This is For You", "review": "Quirky, off-beat, run by cat lovers. If you love cats, you'll love this place. If you don't, you'll feel you have wasted your 10 euros entrance fee. If it's for you, this is a good place to spend an hour. Located in an old mansion house, on several floors and with a back garden (open in early March), Katten Kabinet is a labour of love for all things cat. Lots of pictures, many featured cat themed advertisements going back to the late nineteenth century. Cat themed furniture, cat themed antiques, cat themed ornaments, cat themed items to buy (many being posters or cards of the advertisements), you get the gist. It's also home to a couple of cats; if you're lucky you may see one (totally ignoring all things human, it's nothing personal). Well, we liked it.", "rating": 5.0, "visited": "March 2024"}, {"title": "the place for cat lovers", "review": "Interesting museum and a must see for any cat lovers. However there were only a couple rooms open so there wasn’t much to see and we unfortunately didn’t see the cats :( Other than that we had a lovely visit. Staff were very friendly and helpful", "rating": 5.0, "visited": "July 2024"}, {"title": "Must-see for any cat lover", "review": "I visited on a Thursday morning. It started off quiet but the traffic picked up. There were two cats in residence that were delightful! On view for visitors included artwork, sculptures, and all sorts of knick knacks. There was a garden but it was closed off due to renovations.", "rating": 5.0, "visited": "July 2024"}, {"title": "Disappointing", "review": "I was disappointed, it was quite expensive for what it was…. Only took 20 mins to go through…but as we only went to kill some time it served a purpose. There isn’t much to read to tell you about the art and the artist. It is also very small! I didn’t even see any of the real cats people mentioned! I love cats but this was a bit boring! I wanted to learn something! Some cool cat pieces though!", "rating": 5.0, "visited": "August 2024"}, {"title": "A lovely museum", "review": "Very nice museum with a lovely array of cat things to look at, there are live cats in there although we didn’t see them :( there is also a garden but that was closed during our visit (April) it opens during nicer weather. It is quite small so you can get around it fast but we paid €5 and felt it was certainly well worth the price They don’t allow bags to be taken round but they let you leave it behind reception and give you a little cat card with a number on so you don’t take another persons bag. Loved it in here, the building was also very lovely, will have to visit again in the warmer months for the garden, and hopefully see the resident cats :)", "rating": 5.0, "visited": "April 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/55/be/95/the-cat-cabinet.jpg"]}
