{"name": "Dubai Miracle Garden", "description": "Miracle Garden is one of a kind in the region and in the world for such a unique display and extravagant outdoor recreational destination. Miracle Garden in its first phase is providing state-of-the-art services and facilities including open parking, VIP parking, sitting areas, prayer room, toilet blocks, ablution facility, security room, first aid room, carts for handicapped visitors, retails and commercial kiosk and all other related services available to facilitate visitors.", "category": "Gardens", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Miracle Garden"], "hours": "9:00 AM - 11:00 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Al Barsha", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Great trip", "review": "Visited miracle garden and the work that has gone into this place is amazing. The detail into the flower displays were unique. Loved the different themes. Great place to take memorable pics. Definitely would recommend visitors to get down to miracle garden. A few hours is needed.", "rating": 5.0, "visited": "October 2023"}, {"title": "Don't forget your camera", "review": "Visited with my daughter. Lovely hour walking round. The gardeners must work round the clock as everything looked well maintained. A lovely time, and great photo opportunities.", "rating": 5.0, "visited": "November 2023"}, {"title": "Seasonal Display of Flowers", "review": "The garden opens only on seasonal basis. But once ready it is quite impressive. Donâ\u0080\u0099t expect tulips however. Time to visit is better either early morning or late afternoon with humidity a little lesser. Good for photo ops. Several food stalls and shops on standby. A little further away from the city center.", "rating": 5.0, "visited": "November 2023"}, {"title": "A unique experience", "review": "If you like the look and smell of living flowers then a visit to Miracle Gardens is a must do! Allow a couple of hours or more to see what the gardeners achieve literally overnight, every night. A unique and unforgettable experience reasonably priced within easy taxi distance of the local hotels in Dubai.", "rating": 5.0, "visited": "November 2023"}, {"title": "must visit", "review": "what an amazing place to visit, but i believe they have a staffing problem. we started to line up from 08:45 but we were told they had an electricity problem and we ended up entering the garden at 09:30. only ONE gate had the electricity problem and they could have easily directed us to the other gates which they didn't. on approaching the window to get the ticket, the operator basically shouted at me saying \"rain , no refund\" and it wasn't raining !!!!", "rating": 5.0, "visited": "November 2023"}, {"title": "Very good garden would recommend- be careful of taxis outside", "review": "I didnâ\u0080\u0099t see any ads or photos beforehand but I like gardens and flowers etc, I hate gardening but like pretty things, tickets were reasonable about Â£20 each. I thought it was brilliant. Very vivid, grand, dramatic, interesting, plenty to see. Shops to compliment on the outside, not too pushy sales people either. Loads of food huts and buses seating areas. Really enjoyed it, would recommend. TAXI WARNING: Taxis outside, some are not even taxis just men with cars. They told us the 50 dirham journey we had to get there was now 425 dirham due to rush hourâ\u0080¦. There was no rush hour. I got to 5 cars and was told each time it would be 150 minimum. In the end I decided to walk the 11 miles as I knew I was being fleeced. At that point they took me for 100. So it had gone from 425 to 100. Needless to say we got back quick in no traffic and it was no different to my proper taxi on the way there which cost only 50!", "rating": 5.0, "visited": "November 2023"}, {"title": "More flowers in one place than anywhere else", "review": "This garden was absolutely amazing, it had so many flowers, and it reminded me of Alice in the Wonderland with the castle and palace like structures and all the heart shaped motifs. The huge Emirates plan covered in flowers was also great. It is extremely crowded and very difficult to get a taxi to leave, which is a downside. There are a few food stalls selling junk food, fruit juices and coffee. It is 5 minutes walk from the butterfly garden so itâ\u0080\u0099s good to see both on the same day.", "rating": 5.0, "visited": "November 2023"}, {"title": "A Garden Like No Other", "review": "This was quite the place and aptly named. We have visited many gardens around the world. This one was very different than most. Massive amounts of flowers decorate large-scale displays. In typical Dubai fashion, they even do their flowers up on a grand scale! The location had huge flower arches, a castle, a Smurf village, an Emirates plane, etc. It just went on and on. Pretty incredible to see. The grounds were very clean and they offered food stands around the perimeter and shaded areas with tables to sit down and eat. It was over the top but you get used to that in Dubai. We found it quite interesting and enjoyable. Good for a nice walk with interesting visuals. Just be prepared for the incredible number of people having to take picture after picture of themselves in front of everything.", "rating": 5.0, "visited": "November 2023"}, {"title": "Beautiful", "review": "Dubai don't do things by halves, this is an absolutely phenomenal experience. Lots to see and opportunity to capture pictures. We didn't do a tour, we just grabbed cab that dropped us off at the front and the driver advised that there is a butterfly garden nearby. Similarly, when leaving there are plenty of cabs outside that are ready to pick you up. Inside there are a lot of shaded areas so you don't need to worry about it being too hot to enjoy and it is definitely a comfortable experience. Also there are plentiful areas for refreshments too. There is a small area that the local market traders try to get you to visit their shops but they are respectful when you say \"no thank you\" so it isn't too overwhelming and actually feels pleasant.", "rating": 5.0, "visited": "December 2023"}, {"title": "Beautiful and artistic but crowds can make it less exciting and you can do the whole thing in an hour and a half", "review": "Its very pretty, Dubai is a great place to travel with young kids so they would enjoy it especially. Its gorgeous but our tour organisers had said we would want to spend 2-3hours in miracle garden. I requested a change in the itinerary last minute and Im glad I did. You should spend 1 and a half hour max here. But its subjective to the person, some people can spend an hour trying to get a good instagram shot. I also wasn't interested in the smurf sections so that cut down time for me. In a busy period you just want to see everything, snap some pretty pics and go somewhere else.", "rating": 5.0, "visited": "December 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/04/19/64/4a/miracle-garden.jpg"]}
{"name": "Gurunanak Darbar Sikh Temple", "description": "", "category": "Religious Sites", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Gurunanak Darbar Sikh Temple"], "hours": "4:30 AM - 8:30 PM", "duration": "", "address": "", "neighborhood": "Neighborhood: Jebel Ali", "rating": 0, "getting_there": [], "top_reviews": [{"title": "A blessing .", "review": "A blessing to visit this Gurdwara , more so that the Sikhism faith is honoured and recognised in Dubai allowing Sikhism to grow strength to strength without restrictions. A beautiful building , spaciousness in all areas from langar hall to darbar. Very clean , well maintained and open to all visitorâ\u0080\u0099s.", "rating": 5.0, "visited": "October 2023"}, {"title": "Suddenly, India, and a relaxing atmosphere", "review": "You want to switch to another mood from Dubai? Head straight to this Sikh temple! Though clearly the only non Indians, we were very well welcomed, after washing hands and wearing some sort of bandana... Temple is so relaxing and bringing inner peace. Just sitting for a while was like recharging batteries. When leaving the temple, no taxis in sight, but again the Indians there were so helpful, and indeed a bus from the community drove all of us without a car to the near Ibn Battuta mall - free of charge mind you. Thanks to all the people behind this, bless them all.", "rating": 5.0, "visited": "November 2023"}, {"title": "Waheguru ji waheguru ji waheguru ji waheguru ji waheguru ji waheguru ji waheguru ji waheguru ji waheguru ji waheguru ji", "review": "Waheguru ji waheguru ji It's really really heaven in the earth ð\u009f\u008c\u008e Waheguru ji blessings us. This Guru's house is for everyone, anyone can go and eat food, langar is served three times, tea is served all day. Waheguru Ji, keep your blessings on everyone like this waheguru ji ka Khalsa waheguru ji ki fathe .. Satnam Shri waheguru ji", "rating": 5.0, "visited": "June 2024"}, {"title": "A beautiful, spiritually uplifting centre welcome to all", "review": "What a beautiful, spiritually uplifting experience. Extremely peaceful and a feeling of serenity. Welcoming to all faiths and types. Slow and respectful entry with the ability to carefully enter the prayer hall and offer prayers. Beautiful surroundings, intricately designed and maintained. The ability for all to have langar in the dining area with the only requirement not to waste any food. A lovely ethos and opportunity to mix with those of different faiths. The Gurudwara is easily accessible, adjacent to the Hindu Temple and opposite a church.", "rating": 5.0, "visited": "July 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/21/20/e7/caption.jpg"]}
{"name": "Dubai Crocodile Park", "description": "Explore The Fascinating World Of Crocodiles. Home to 250 Nile Crocodiles, Dubai Crocodile Park offers a family friendly experience. The park includes a Natural History Museum, an African lake themed aquarium, a Savanna inspired landscaped area, a curio shop and multiple dining outlets.", "category": "Zoos Parks Aquariums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Crocodile Park"], "hours": "10:00 AM - 8:00 PM", "duration": "Duration: < 1 hour", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Crocodile experience for 2", "review": "Really good experience, the staff were very welcoming and showed us and explained everything, it almost feels like you are getting a private tour of the complex. Definitely value for your money compared to other comparable experiences in the area such as the aquariums. Nice balance of aircon to outdoors area too and worth recommending to go just before 4:30 as this is feeding time for the crocodiles. You probably only need 1hr 30min. But worth every penny!", "rating": 5.0, "visited": "October 2023"}, {"title": "Great family experience", "review": "Great Crocodile park and aquarium! Took the kids (5 years and 15 years) all loved it so great for all ages. Museum is also a good learning experience for everyone. Our tour guide spent 1hr with us (no extra cost) and gave us loads of insight into the individual crocs. You can see fully grown 26 year old crocs, child crocs (in aquarium) and baby crocs under 1yrs in the medium. Will be going back.", "rating": 5.0, "visited": "October 2023"}, {"title": "A must for families and people who love animals", "review": "The park is very beautiful and considered a fun outing for family with kids. I enjoyed learning new and interesting facts about these fascinating creatures. The park offers two lovely restaurants to be opened during winter season, and a special crocodile encounter where you get to touch a crocodile, and an aquarium full of crocodiles swimming and enjoying their time under water. The place is well managed and well kept and offers an informative tour inside the museum if Iâ\u0080\u0099m not mistaken shedding light on their historical existence and remains.", "rating": 5.0, "visited": "August 2023"}, {"title": "Brilliant and new must do in Dubai", "review": "Very good experience and very well presented if you want to get close to crocs. Mustafa gave us a guided tour and was very engaging, informative and great with the kids. For a relaxed visit with time in the museum plan for just over an hour with more if you fancy a bite to eat or arrive at feeding time. I will definitely be bringing people back to visit.", "rating": 5.0, "visited": "October 2023"}, {"title": "Dubai Crocodile Park review", "review": "Amazing experience from start to finish. Really quirky thing to do whilst in Dubai and much value for money vs other things I have done here. Really helpful staff that enjoy what they do. Baby crocodile encounter was a nice touch and the feeding was really interesting to see the crocs in action. Would highly recommend new experience and well worth every penny. Thanks to all the staff for making it well worth it", "rating": 5.0, "visited": "October 2023"}, {"title": "Definitely worth a visit", "review": "Itâ\u0080\u0099s a lovely new place in Dubai. The guides were extremely friendly and knowledgeable, we learnt so many interesting things about crocodiles. Went with 2 teenagers and a 6-year old who all loved it. I cannot thank the staff enough for this great experience", "rating": 5.0, "visited": "October 2023"}, {"title": "Wonderful Experience", "review": "Amazing place for crocodile lovers. Great customer service from all the staffs from the reception to the curio shop to the museum to the aquarium and to the park. Loved it. Recommended place to visit while in Dubai. From kids to adults, everyone will love the experience.", "rating": 5.0, "visited": "October 2023"}, {"title": "Must visit", "review": "This place is amazing and a complete contrast to Dubaiâ\u0080\u0098s rush. The employees are very friendly. The guides took a lot of time for explaining everything. The crocodiles seem very relaxed which is a good indicator for their treatment.", "rating": 5.0, "visited": "October 2023"}, {"title": "Worth the trip, and awesome staff, facilities, and experience!", "review": "This was much better than expected! There are over 200 crocodiles here of all ages/sizes, and the facilities are high quality. The caretakers and staff were very friendly, and they also fed us so much information about the history and life of crocodiles. One staff member held a Q/A session with us while another member gave us a full tour of the museum (at no extra costs). We went in the evening when it was not too warm and also not too busy. You can tell that a lot of thought and care was used to build this facility. Initially we thought the 80dhs was an expensive ticket, but after the experience, we can say it was well spent. You can spend a lot more in Dubai and get a lot less :-D", "rating": 5.0, "visited": "November 2023"}, {"title": "Great place, wish more people knew about it", "review": "The crocodiles were so many, it looked very serene and the staff was exceptionally helpful and friendly and well educated on their jobs, we had so much fun here! Iâ\u0080\u0099m sure this place will grow so popular very soon, try to catch it before it becomes that way so youd enjoy the peaceful vibes and uninterrupted guidance from the staff. Highly recommended!", "rating": 5.0, "visited": "November 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/ba/69/5c/a-unique-experience-designed.jpg"]}
{"name": "Burj Al Arab", "description": "One of the tallest hotels in the world, the unique white sail shape of this luxury hotel on Jumeirah Beach is iconic to Dubai's skyline.", "category": "Architectural Buildings", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Burj Al Arab"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Umm Suqeim 3", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Too class service in Jumeriah", "review": "We have a wonderful wonderful time in Dubai. Top class service with very kind people, yesterday after inside Burj Al Arab tour, weâ\u0080\u0099re not sure how to get to Shimmers, the guy in the pic take us there and introduce Jumeirah Hotels to us, we have a very pleasant chat, and we have a really good memories here. Definitely will try Jumeriah resorts next time!", "rating": 5.0, "visited": "October 2023"}, {"title": "Beautiful building", "review": "This is a beautiful hotel and as you would expect nothing has been spared on decor. It's iconic and luxurious and if you feel like splashing out go for lunch. Guests get the benefit of seeing this area during the day and for those with children there is the huge Waterpark close by", "rating": 5.0, "visited": "September 2023"}, {"title": "An incredible and exceptional stay", "review": "Although I have visited the Burj Al Arab several times, this is the first time i stayed albeit for two nights. I can say it certainly was an experience being very grand and quite overwhelming at times. Their E Butler service is fantastic, all of the staff are amazing and the breakfast might be one of the best we have ever had...they also catered for my grandson who has allergies. This hotel astounded us with its exceptional touches such as 'happy hour' in our rooms to Hermes toiletries and access to Wild Wadi Water Park. It was an incredible experience, thoroughly enjoyed by all.", "rating": 5.0, "visited": "August 2023"}, {"title": "Luxurious stay", "review": "we stayed September for our wedding anniversary from the moment you step out of the limousine you are treated like royalty. the attention to detail is amazing. we arrived early and had a drink in the lobby bar Amazing! the butler took us to our room and showed us round every thing about the place just shouted luxury. gold plated just about very thing they could. all rooms are duplexes and downstairs is a wash room and toilet, tea coffee facilities by the entrance desk along side the mini bar which wasn't so mini. dining table and sofa's laid out on the spacious living level with floor to ceiling windows looking out to the Arabian sea. Going up the sweeping staircase to the wardrobes and dressing area, even a gold plated Dyson hairdryer! to the left was a spacious bathroom with jacuzzi bath double sink with his and hers Hermes toiletries including aftershave and perfume. extremely large shower cubicle with jets coming from all directions. across the hallway was the bedroom with seating area and again floor to ceiling windows overlooking the Arabian sea everything was remote controlled to the TV coming up from behind the drinks cabinet at the foot of the bed to the curtains being drawn but with a view that we had never shut the curtains. We had cocktails/ drinks served at our room prior to dinner with canapes absolutely delicious! the whole place was just opulent and did not want to leave. definitely stay again.", "rating": 5.0, "visited": "September 2023"}, {"title": "Loved the tour and the drinks", "review": "On day one we took the Big Bus tour to the stop for Burj Al Arab. We were disappointed we couldn't walk into the building, but I totally understand, given the crazy number of people there trying to get pictures. We decided to pay for the tour, then we were told my husband couldn't get in because he was in flip flops. I had read that online and totally forgot. The next day we came back dressed appropriately. The tour was great but our favorite part was relaxing at the beautiful outdoor bar after. We had been on tour after tour for two days and were exhausted. The view, drinks and service were just what we needed.", "rating": 5.0, "visited": "November 2023"}, {"title": "Guided tours inside are a must do", "review": "I think the most iconic building of Dubai (yes more than Burj Khalifa) as it is such a striking and unique structure. I was a little surprised that you can see it from roads nearby poking up from the office buildings and cars as I thought it was on a man-made island a bit off shore - but it is actually very close. I was able to go to the Jumeirah Beach hotel and take photos from their pool and walk on the beach area for close ups - nobody stopped me although not staying there. I think the guided tour inside is also well worth doing as we all know what it looks like from the outside but few see the decor inside. I note that the foundations have been laid nearby for Burj Al Arab 2 which are 3 times that of this original hotel. In my opinion the new one will spoil the views as less can be more. Glad I visited before the building overcrowding happens...", "rating": 5.0, "visited": "November 2023"}, {"title": "Amazing trip", "review": "Amazing place to visit. It is absolutely amazing to think it was built in the shape of a sail it stands out for miles. We took a boat ride around the harbour to start with to see how beautiful it was, and then we decided we would actually visit and we were so glad that we did the Kings room and the Queens room are beautiful. The fabrics that they used and the silk that they put on the walls to represent fire Stunning cashmere carpets gold staircase. The staff were extremely friendly. It was well organised. I was with two other friends and we sat we had some drinks and we just took in the view to me. This is a must itâ\u0080\u0099s a seven star it is a hotel on a few floors are dread to think the cost, but to be honest, it was well worth the fee to get in. You could choose once youâ\u0080\u0099ve got there to upgrade which we did and if you have a drink you can then sit in the lounge for as long as you want. They give you a complimentary fruit which is Dates. The dates in England donâ\u0080\u0099t taste anywhere near the beautiful Dates I have there I asked for seconds, the staff are amazing theyâ\u0080\u0099re willing informed have lots of information will take your photo if you ask him and I would recommend this visit really I would", "rating": 5.0, "visited": "February 2024"}, {"title": "A box ticked.", "review": "This is an excellent property with unparalleled location. The suites have great views and great butler service. Special mention is for our butler Tareq who made our stay very comfortable and did not make us feel the pressure of staying in a 7 star property. Food and beverages in restaurants were not as pricey as I was expecting.", "rating": 5.0, "visited": "February 2024"}, {"title": "Inside the Burj", "review": "How special it is to be able to visit the tour \"Inside the Burj al Arab\". Otherwise, you won't get into this 7 * hotel just like that, of course. After being welcomed in a sort of lobby, we were told what the tour was about. After walking through the.lobby we were taken by lift to the 25th floor. There we were shown how the hotel came into being and were able to walk through the museum and ask questions. After a date and coffee, we were picked up to go to the presidential suite and,..... What luxury. If you want to experience this when you are in Dubai definitely go for it", "rating": 5.0, "visited": "February 2024"}, {"title": "Five Stars because of Omar", "review": "The Burj is absolutely beautiful. The service was good Was good with the exception of our Butler Omar. He was absolutely fantastic!!! He went above and beyond and made our experience so much better. To be honest, my friend was a little upset about the service on our first night given the price of the Burj, but the next day we met Omar, and he totally turned our opinion around. He provided the type of luxury service that one would associate with the Burj. I also must give a shout out to the waiter we had for our tea service cannot remember his name, but he was fantastic as well. All in all it was a very nice experience and Iâ\u0080\u0099m glad we stayed there.", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/49/c0/02/20180310-101831-largejpg.jpg"]}
{"name": "Kite Beach", "description": "Kite Beach features open stretches of soft white sand, vibrant sights and sounds, fitness areas, a beach library, and kids activities, so all you have to do is sit back and relax.", "category": "Beaches", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Kite Beach"], "hours": "10:00 AM - 10:00 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Nice beach â\u009b±ï¸\u008f to", "review": "Sand beach with thin water in egde, got alot of opportunity of foods and drinks but also place for shower. Have also parking options but unsure about payment , could have 2h free for guest but we could not get it . Otherwise 10AED per hour. You are nearby Burj Arab.", "rating": 5.0, "visited": "October 2023"}, {"title": "Nice", "review": "Very nice place and its free. Its an open beach for everyone. And they have also some shops and restaurants to eat there as well. You can enjoy swimming all day long, but they will not allow to swim like around 6pm.", "rating": 5.0, "visited": "September 2023"}, {"title": "Beautiful Beach", "review": "Absolutely beautiful beach. Very well maintained and very clean. Lots of food and drink options available (Starbucks, Cinnabon, etc). Lovely beach huts selling clothing, bags and jewellry. Changing & Shower Rooms available. We opted for the beach day pass at 120aed each. Beach towels, sun lounger and parasol included. Staff brilliant. Extremely impressed. My teenage daughter really loved it. Cycle track and walking track too.", "rating": 5.0, "visited": "December 2023"}, {"title": "Lovely beach", "review": "The beach is a must visit in Dubai. This is a huge wide stretch of beach and Kite Beach is a hub of restaurants and activities, including volleyball, padel tennis and more. You can take your own sun seats or pay to hotel sun beds. There is a bike track, walking track and the sea is generally very lovely and calm.", "rating": 5.0, "visited": "March 2024"}, {"title": "Lots to see and do at Kite Beach", "review": "this is a beautiful area in Dubai with plenty to do on the beach. Lots of food trucks and small restaurant type options to eat. There are many activities on the beach as well as a skate park and trampolines. Walk along the track for miles day and night .Beautiful sea views and views of the Burj Al Arab.", "rating": 5.0, "visited": "July 2023"}, {"title": "Family trip to Kite beach", "review": "Famous Kite beach! It is very popular and does get crowded, but not so much to ruin the experience. Great views of iconic Dubai buildings and a lovely sandy beach. Life guards on duty and loads of facilities, shops, and places to eat. Only negative is that the shower, toilet and changing facilities could improve.", "rating": 5.0, "visited": "April 2024"}, {"title": "Nice clean beach with Burj Al Arab views", "review": "This was Day 5 of my Dubai Trip and we started by visiting beach in the morning. I didnâ\u0080\u0099t have much expectations but I was surprised with the clear and pristine waters, less crowd and Burj Al Arab views. We didnâ\u0080\u0099t have much time to spend here and also it was a bit hot but I liked this beach.", "rating": 5.0, "visited": "February 2024"}, {"title": "Great beach to relax", "review": "Great beach to relax while in Dubai. It is a huge beach and you dont feel the cramped. After winter time till july, sea temparatures are quite nice. During and post summer, water is too warm for my liking.", "rating": 5.0, "visited": "May 2024"}, {"title": "The best days on the Kite Beach", "review": "It was my 4th vacation in Dubai. Iâ\u0080\u0099ve spent amazing time on the Kite beach with friends. This location is easy to reach by bus (you can take it from the bus station near the Mall of Emirates) and taxi. There are various cafes to eat with a sea view. This beach has some changing rooms, toilets and showers. I advise you to rent a bicycle and take a ride. Also, you can find other sports activities.", "rating": 5.0, "visited": "April 2024"}, {"title": "Be under no illusion that Dubai beaches are not a patch on natural European beaches", "review": "If youâ\u0080\u0099re reading this you are either already in Dubai or considering visiting Dubaiâ\u0080¦ Be under no illusion that Dubai beaches are not a patch on natural European beaches, no matter how much faking they do. Taking that into account Kite beach is certainly one of the better beaches in Dubai, with no high rises, clean toilet, shower & changing facilities along with a variety of pop up eateries. Beach is clean and we found the water to be slightly cooler here than it is at JBR beach for example. life guards on duty.", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/36/4a/8f/1180-kite-beach-largejpg.jpg"]}
{"name": "Children's City", "description": "Dubai-based Children's City is the first educational city in the United Arab Emirates devoted to children between two and fifteen years old where they can investigate, explore, play, discover, and learn about the world in which we live. The Children's City is specially designed for children to interact and discover together in family and school groups. It contains several exhibits and programs like a nature center, space exploration, human body, planetarium, the way we live and international culture as well as toddlers area. In addition, Children's City presents daily educational workshops throughout the year at the different galleries or in the purpose-built halls and entertainment programs at the Children's City Theater for school students, children and families.", "category": "Amusement & Theme Parks Parks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Children's City"], "hours": "2:00 PM - 8:00 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Bur Dubai", "rating": 0, "getting_there": [], "top_reviews": [{"title": "School Trip", "review": "We went from school as a educational trip during the space week. The price was worth it, and the trips that they went on were really fun and educational. Students had great time, specially the laser show, puppet show and the the planetarium show. I would definitely recommend to other school. Great educational experience.", "rating": 5.0, "visited": "October 2023"}, {"title": "Ø²Ù\u008aØ§Ø±Ù\u0087 Ù\u0081Ø¹Ø§Ù\u0084Ù\u008aÙ\u0087 Ù\u0085Ø¯Ù\u008aÙ\u0086Ø© Ø§Ù\u0084Ø·Ù\u0081Ù\u0084 Ø¯Ø¨Ù\u008a", "review": "â\u0080\u008fToday, I visit creek Park. I am surprised by the beautiful event for children Future entrepreneur, organized by Childrenâ\u0080\u0099s City. Next year, I will participate with my children to sell their products and handmade creations.", "rating": 5.0, "visited": "February 2024"}, {"title": "Wonderful place for children", "review": "It was lovely to see my little explorers enjoying in the play area and discovering the educational facilities like human body and space exploration. My daughter was happy for selling her handmade accessories by participating in the event of future entrepreneur. Your exceptional talent in organizing such a successful event is greatly appreciated. Thank you for an unforgettable experience.", "rating": 5.0, "visited": "February 2024"}, {"title": "Excellent Staff & Excellent Place", "review": "Great experience. Went last Minute with my 3 daughters and they loved it. The face painting ladies were able to do all 3 girls at the same time since they had 3 face painters on staff. The information lady from Karla was so very friendly. The entrance guards were even friendly. The lady at the play area opened the area up for our 3@4 year old even though the area was closed off (prior to the end time of the museum). My only suggestion would be to keep everything open and turned on until exactly the closing time, and not be turning things off prior to the closing time.", "rating": 5.0, "visited": "March 2024"}, {"title": "Amazing", "review": "I am so happy that I visited this place with my four kids. There was a play area for small kids like 3 or 4 years old or limited height of 110. And for my big kids they did workshops. There was planet shows which they enjoyed and all the galleries are like interactive. Worth for money and will visit again", "rating": 5.0, "visited": "May 2024"}, {"title": "Fun place for kids! Recommend 100%!", "review": "Amazing place for kids and family! The stuff is very friendly and helpful:) Definitely recommend to take your kids to the beautiful Creek park and Children city, and you can spend a whole day here. My son loves this place! Lots of things to do, not just educational but also something fun for kids, especially my sonâ\u0080\u0099s favorite place is the soft play area where is available for kids under 110cm height.", "rating": 5.0, "visited": "June 2024"}, {"title": "Thanks to Stefi we had an amazing experience at the Al Ajyal theatre !", "review": "Yesterday we held our Annual function in the Al ajyal theater in the children's city Everything was so well organized . There team was so supportive a Thank you for the exceptional support and opportunity you and your team have provided to local dance groups like ours. I'm especially grateful for the support we have received from Stefi at the reception, the security guards and the housekeeping team ! They were so well planned and organized! We felt welcomed and valued. Once again, thank you for the opportunity and your support is highly appreciated", "rating": 5.0, "visited": "June 2024"}, {"title": "The Best Summer Camp in Children City", "review": "Children City one of the best places for Summer Camp. My daughter hand a fantastic and enjoyable time during the 2 weeks. They have variety and different activities every day, also daily trips to wonderful places. They have good security to keep kids safe, plus buggy take the parents to gate. I would like to thanks all the supervisors and helper that make this summer camp interesting and unique than others. Amna Ismaeel (mom)", "rating": 5.0, "visited": "July 2024"}, {"title": "Educational and Informative - with scope and capacity to become a fantastic venue but lacking some creativity", "review": "A good entertaining venue, particularly during the summer. The exhibits are educational and informative. The planetarium also incorporates very interesting materials showcasing videos purpose made for young children to educate in a fun way. There was unfortunately not much guidance from staff to engage the children, which other locations in Dubai benefit from - i.e. where staff direct and interact with children and bring exhibits to life. I feel more could be done with the expansive space available too to really make this is a must-go-to venue. At the moment, it is somewhat treated as an add-on if visiting the dolphinarium but they could invest some creativity into making this a standalone visit. Pricing is reasonable but perhaps on the high side considering what is currently offered. My daughter was able to do some facepainting which she thoroughly enjoyed and there is a small softplay for very young children too.", "rating": 5.0, "visited": "July 2024"}, {"title": "An outstanding harbor for kids", "review": "Enrolled my daughter for summer camp, am amazed how is she enjoying and so eager to attend . This shows the amount of dedication, excellence, commitment of the whole staff of Dubai s child city . They are really hardworking, caring and supportive to parents and kids They deserve ð\u009f\u008f\u0086ð\u009f\u008f\u0086ð\u009f\u008f\u0086Ù\u008aØ¹Ø·Ù\u008aÙ\u0083Ù\u0085 Ø§Ù\u0084Ø¹Ø§Ù\u0081Ù\u008aÙ\u0087 Ù\u0088 Ø¨Ø§Ø±Ù\u0083 Ø§Ù\u0084Ù\u0084Ù\u0087 Ù\u0081Ù\u008aÙ\u0083Ù\u0085 Ù\u0088 Ø£Ø³Ø¹Ø¯Ù\u0083Ù\u0085 Ù\u0083Ù\u0085Ø§ Ø£Ø³Ø¹Ø¯ØªÙ\u0085 Ø£Ø¨Ù\u0086Ø§Ø¦Ù\u0086Ø§ ð\u009f¤²ð\u009f\u008f» Ø£Ù\u0085 Ù\u0088Ù\u0081Ø§Ø¡ Ø§Ù\u0084Ø´Ø§Ù\u0085Ø³Ù\u008a", "rating": 5.0, "visited": "July 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/f2/9b/95/children-s-city.jpg"]}
{"name": "Jumeirah Emirates Towers", "description": "", "category": "Architectural Buildings", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Jumeirah Emirates Towers"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Trade Centre", "rating": 0, "getting_there": ["Emirates Towers â\u0080¢ 3 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/e1/b2/65/torri-emirates.jpg"]}
{"name": "Jumeirah Mosque", "description": "The Jumeirah Mosque has been a focal point for our â\u0080\u0098Open Doors. Open Minds.â\u0080\u0099 program for over two decades, an opportunity to interact with your guide, ask plenty of questions and take photographs. Join us for a visit at the iconic Jumeirah Mosque, one of the most popular mosque visit in Dubai which are open to non-Muslims. Register at our Majlis, and enjoy light Emirati refreshments before the presentation starts. Booking is not required for public visits. Modest clothing is preferred. Ladies are required to bring their own head cover/scarf. First guided Mosque visit at 10:00am Second guided Mosque visit at 2:00pm Registration begins 30 minutes before the program starts Price: AED 35 (Includes light refreshments and all majlis activities) Open from Saturday to Thursday. Closed on Friday.", "category": "Religious Sites", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Jumeirah Mosque"], "hours": "10:00 AM - 11:15 AM, 2:00 PM - 3:15 PM", "duration": "Duration: 1-2 hours", "address": "", "neighborhood": "Neighborhood: Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Open Doors, Open Minds. Truly worthwhile!", "review": "A visit to this mosque and participation in the program allows for learning about a different culture/religion. We had the ability to ask questions in a â\u0080\u009csafe spaceâ\u0080\u009d without fear of saying or seeing the wrong thing. I highly recommend participating. A great way we started our visit to Dubai!", "rating": 5.0, "visited": "October 2023"}, {"title": "Fantastic Visit", "review": "Well worth a visit. Beautiful building and incredibly informative. You are made to feel so incredibly welcome, everyone is approachable and keen to share their beliefs with you. The tour guide we have was wonderful and tan the tour in a really light hearted way. Loved seeing the womenâ\u0080\u0099s prayer room filled with toys - itâ\u0080\u0099s a living, breathing place of worship. Not stuffy at all. Thoroughly recommend.", "rating": 5.0, "visited": "October 2023"}, {"title": "Jumeirah mosque visit", "review": "Great, informative and friendly tour. Food from the buffet was lovely way to start the tour. Tour guide was really calm and friendly , used lots of life situations and funny stories that were taken really well by public. Falcon photo and the henna tattoo is a sweet cherry at the top of the cake. Thank you for this great experience , hope to come back soon.", "rating": 5.0, "visited": "October 2023"}, {"title": "Beautiful mosque and kind people", "review": "This was a great experience. We were welcomed with open arms. We got received with local sweets and could walk around a gallery and the museum part. After this we went inside the mosque. This mosque is beautiful decorated and was very calming. Our guide told us a lot about Islam and the mosque with pride. You can see how much he cares for the mosque. We were encouraged to ask as many questions as we could think of, and i did. This was an amazing experience and we were so happy that we saw another part of Dubai as well.", "rating": 5.0, "visited": "October 2023"}, {"title": "A true gift", "review": "The whole experience was mesmerizing. The staff was very kind and provided us with extensive information on Islam's rituals, story and habits. I would strongly recommend the attraction to truly understand and experience an introduction to this faith, providing a respectful approach towards intercultural dialogue and coexistence.", "rating": 5.0, "visited": "November 2023"}, {"title": "Mosque visit in Dubai", "review": "This was a very interesting program introducing us to the Muslim faith. Our guide was very engaging and answered our questions well. Inside the mosque, the echo sometimes made it difficult to understand or hear everything he was saying.", "rating": 5.0, "visited": "November 2023"}, {"title": "Don't miss this beautiful mosque!", "review": "This is a canâ\u0080\u0099t miss attraction in Dubai. For less than $10 US, you can tour a beautiful mosque, experience Arabic coffee and have a beautiful henna tattoo. My tour guide was friendly, welcoming and knowledge. It was one of my Dubai highlights.", "rating": 5.0, "visited": "December 2023"}, {"title": "Highly Recomended!", "review": "This place was awesome you will learn a lot and understand more about Islam and culture of UAE the best. If you are new or expat in UAE this is a must. Levhan is very welcoming, Latifa is superb and all of the staff have a welcoming smile. Thank you for this experience.", "rating": 5.0, "visited": "January 2024"}, {"title": "The most amazing and organized Mosque tour", "review": "The most amazing and well organized mosque tour I have seen. Me and my mum enjoyed the tour conducted by Ahmed. Who is fun and engaging. He speaks good english and im sure everyone understands him. We truly feel the arabic culture and Islam. Thanks to UAE for this wonderful experience.", "rating": 5.0, "visited": "December 2023"}, {"title": "Very interesting visit", "review": "Such an interesting tour led by our guide Ahmed. We learnt a lot about the mosque and Emirati culture within Islam. We were able to ask questions to find out more and were welcomed with local coffee and snacks. A wonderful mid afternoon outing.", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/9f/61/d3/caption.jpg"]}
{"name": "Sea Lion Point", "description": "Imagine a magical encounter with sea lions in a safe and indoor environment. At Sea Lion Point, that dream can become a reality. With a range of interactive experiences, you can get up-close with these amazing marine mammals and show you how we take care of them while helping you to develop a greater appreciation and respect for marine life.", "category": "Nature & Wildlife Areas", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Sea Lion Point"], "hours": "9:15 AM - 6:00 PM", "duration": "Duration: 1-2 hours ", "address": "Crescent Rd Atlantis, The Palm, Dubai 00000 United Arab Emirates", "neighborhood": "Neighborhood: Palm Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Amazing and educational tour!", "review": "We were given a tour of the sea lion and dolphin houses and were amazed at what we learned. Wanda was great in hosting us and Timi taught us so much when showing us round. We were allowed to watch 4 month old baby Kai being trained surrounded by all the generations of his family. Weâ\u0080\u0099re going back on Monday for an encounter with them and we canâ\u0080\u0099t wait!", "rating": 5.0, "visited": "October 2023"}, {"title": "Out of this world . Wow", "review": "Unique experience. Very friendly staff! And unforgettable moments. Iâ\u0080\u0099ve done also the dolphin experience which is also beautiful. Although the price for the photos are over the top. The experience itself is expensive so itâ\u0080\u0099s a bit sad when a family has to pay also a big amount of money money for the photosâ\u0080¦.", "rating": 5.0, "visited": "October 2023"}, {"title": "Magical", "review": "Really lovely staff. The experience was very well organised. A very magical experience and I was made to feel very welcome as I was doing the experience alone. Swan the sea lion very lovely to meet and spend time with.", "rating": 5.0, "visited": "November 2023"}, {"title": "Aqaventure Dubai Sea Lion Point", "review": "The program was extremely well organized. The people were very friendly and supportive. I recommend everyone who goes to Dubai to go and swim with the sea lions! Many thanks to the hosts Shamim, Francis and the Trainers Shazir Lorena.", "rating": 5.0, "visited": "November 2023"}, {"title": "Amazing", "review": "Great activity and experience. We had a tour of the facilities at Aquadventure, and went on to book an experience with the dolphins. The whole thing was great, a once in a lifetime experience that we will never forget. We got to have a close up encounter with a dolphin that was amazing. Special thatâ\u0080\u0099s to Megan, Keira and George for making it such a great day. Highly recommend.", "rating": 5.0, "visited": "November 2023"}, {"title": "Great Experience", "review": "Marcos and the team were very friendly and welcoming. We had a great experience meeting Rufus and learnt a bit about his specie. It was also great to get up and close. Only thing that could have improved the experience was spending more time with Rufus (Sea Lion) as it was only about 15 minutes. However, we had a great time. Thanks Winda, Tamwryn, Marcus and Rufus!", "rating": 5.0, "visited": "November 2023"}, {"title": "Swimming with Juna", "review": "Absolutely mesmerizing! Swimming with the sea lions was a unique and unforgettable experience. Their playful nature and gentle interaction left me in awe. The trainers were professional, ensuring our safety while allowing us to enjoy this intimate encounter. It's a must-do for any animal lover. 5 stars without a doubt!", "rating": 5.0, "visited": "November 2023"}, {"title": "Amazing experience with Swan!", "review": "My family and I visited the lovely sealion point yet again and it was nothing short of amazing! We had a wonderful time meeting the beautiful Swan! She was amazing, and taught us so much! You can tell the trainers truly care for them. Thank you again Nola, Corn and Shazeel! Absolutely brilliant experience would highly recommend!!", "rating": 5.0, "visited": "November 2023"}, {"title": "Out of my expectations! Fantastic and very enjoyable moment!", "review": "The Palm Altantic hotel offered this complementary dolphin tour for our family. This was a bonus trip and great surprise to us. The guide Marouf was very friendly and patient to us. We have a very enjoyable moment with him and the dolphins!", "rating": 5.0, "visited": "February 2024"}, {"title": "Sea lion experience with Connor and Loretta", "review": "We had Connor and loretta talk to us about the sea lions , was an amazing experience to get up close with them. Both Connor and Loretta were very knowledgeable and explained a lot to us about the sea lion. They were both very funny and had a great sense of humour which was very nice. They made our experience worth every penny.", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/dd/e3/8b/sea-lion-photo-fun.jpg"]}
{"name": "Ibn Battuta Mall", "description": "Ibn Battuta Mall blends shopping, dining and entertainment with history, culture and the story of a remarkable explorer. It is the largest themed shopping mall in Dubai and one of the cityâ\u0080\u0099s most exciting shopping and retail destinations.", "category": "Shopping Malls", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Ibn Battuta Mall"], "hours": "10:00 AM - 12:00 AM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Discovery Gardens", "rating": 0, "getting_there": ["Ibn Battuta â\u0080¢ 5 min walk"], "top_reviews": [{"title": "Loved this Themed Mall", "review": "Amazing mall. It's huge, loved the different themed sections. Great food options along with great shopping. We were staying next door in the Avani hotel so visiting the mall was so convenient. Spent 2 days trying to see it all & visit as many shops that were pertinent to us. Bought men's & women's clothes (great to find big sizes) jewellery along with supplies from the Carrefours supermarket. Lovely cafes n 2 big food halls. There is a train station adjacent. Have previously been to The Dubai Mall & the Mall of the Emirates & while perhaps not as big it was still a great mall", "rating": 5.0, "visited": "October 2023"}, {"title": "ibn battuta mall dubai", "review": "ibn battuta mall dubai I was with family and 3-4 hour we don't know how it gone. Beautiful mall with lots of shopping brand, food stalls are Amazing ð\u009f\u0091\u008f Must visit if you are in Dubai highly recommended ð\u009f\u0091\u008c", "rating": 5.0, "visited": "August 2024"}, {"title": "Amazing architectural design", "review": "It is of the oldest malls in Dubai. I once visited this place 15 years ago,since then it has changed a lot. The one thing that has remained is the large ship and water fountain. My favourite part of the mall is the huge dome in the middle, surrounded by coffee shops.", "rating": 5.0, "visited": "August 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/5e/e4/84/ibn-battuta-mall-blends.jpg"]}
{"name": "Dubai Marina", "description": "This luxurious waterfront district adjacent to the Palm Jumeirah is lined with glittering skyscrapers, exclusive residences, and breezy boulevards that are entirely man-made.", "category": "Marinas", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Marina"], "hours": "", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: The Marina", "rating": 0, "getting_there": [], "top_reviews": [{"title": "The best", "review": "People are so nice and very accomadating, their smile were so warmth and welcoming. Also the guy Mr.Vaibhav was so nice and told us to ask him if we needed anything else. Forgot his name but surely I will recommend this resto for my friends ð\u009f\u0091\u008d", "rating": 5.0, "visited": "September 2023"}, {"title": "Lovely area but be on the look out", "review": "A beautiful area to walk around either in the day or night, but the lights make the evening experience a little more enjoyable. Loads of smart restaurants and cafes to eat and drink at and not too expensive for the area. Just two issues that we didnâ\u0080\u0099t enjoy which stops me giving it 5 stars 1/ Some of the touts trying to get you to eat in their restaurant were a bit invasive and stopped a nice leisurely walk. Others are not a problem when you say you have eaten or meeting someone. Just be prepared! 2/ the second issue was a real nuisance and that is the E scooters that plague the area. They travel at some speed and you canâ\u0080\u0099t here them, they also have electric buggies that are a nuisance as well. I get that it would be beneficial for people with mobility problems but this is just for fun. Please be aware of your environment as there a few near misses. Personally Iâ\u0080\u0099d like to see them stopped as it stops you relaxing as you walk about. Some fabulous yachts in the marina to drool over as well. There is also the marina mall which is pleasant to walk around", "rating": 5.0, "visited": "October 2023"}, {"title": "Beautiful marina", "review": "The area is very beautiful. It is surrounded by skyscrapers, with a waterfront promenade, there are many restaurants (but very few also serve alcohol...). There are also a few small grocery stores where you can buy water or juice at reasonable prices. Also, there is a mall, but it is not the most beautiful in Dubai. In the evening, the employees of the restaurants trying to convince you to stop at them are a bit annoying. The area is much more spectacular and livelier in the evening.", "rating": 5.0, "visited": "October 2023"}, {"title": "Cool Area", "review": "We really enjoyed our time walking around in this area. Many of Dubai's other tall buildings are here and we enjoyed the architecture and design in the area. It is worthwhile checking out a restaurant in this area to sit and enjoy the views with some good. The closest metro is DMCC and there are a few tram connections nearby. Plan to spend a couple of hours here in cooler months and more if you plan to dine here.", "rating": 5.0, "visited": "November 2023"}, {"title": "Cleanliness and bright atmosphere", "review": "Tall buildings with different architecture and cleanliness was eye catching. Dubai government do truly amazing job at keeping the city bright and clean. Had a good time walking around with friends", "rating": 5.0, "visited": "November 2023"}, {"title": "Awesome!", "review": "Amazing city! Very clean, very organized! We went on business, but had the opportunity to visit The Frame, Miracle Garden, The Global Village. The best experience was a Safari trip to the Red Dessert, but the magical moment was private night yacht cruise!", "rating": 5.0, "visited": "November 2023"}, {"title": "A Nice Walk With Lovely Views", "review": "This is a walk recommended in all the travel guides, so we too had a wander. It had a nice breeze (as it had been very hot), nice views of the boats, the Mosque lighted up, restaurants dotting the walkway area, and lots of people strolling along. We chose to have dinner at an outdoor restaurant and ended up at a Lebanese Place. Its always hit and miss if you have not read reviews etc, and we struck it lucky. We had a very tasty dinner while watching the world go by.", "rating": 5.0, "visited": "October 2023"}, {"title": "Beautiful walk", "review": "Beautiful walk round, as per the title. Very picturesque and pleasant to walk along the river. You have the mall in the centre with plenty of restaurants and shops to check out. Outside you can grab a boat tour, something we did. Theyâ\u0080\u0099ll be a lot of people outside trying to promote boat trips - one of which we did - and we did a private cruise for two around Palm Jumeirah, despite it being very bumpy once you exit the marina and head out into open water.", "rating": 5.0, "visited": "March 2024"}, {"title": "Peaceful area for a weekend stroll", "review": "A nice area to have a wander round, and it was surprisingly quiet on a sunny morning in January. Thereâ\u0080\u0099s loads of cafes and restaurants along the waterfront so you can spend a long period of time there, and thereâ\u0080\u0099s plenty of spots to sit and watch the world go by. Thereâ\u0080\u0099s the option of taking a boat ride but it didnâ\u0080\u0099t appear to be a regular or frequent service. If youâ\u0080\u0099re looking for somewhere with a slower pace and to relax, head here.", "rating": 5.0, "visited": "January 2024"}, {"title": "Recommend for a visit", "review": "Fantastic place, unbelievably clean, no litter, no graffiti, no groups of kids hanging around. Lots of restaurants and some shops, great vibe during the evening. Felt very safe. I would recommend a walk round the Marina walk amazing skyline and photo opportunities", "rating": 5.0, "visited": "June 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/f7/31/f0/dubai-marina.jpg"]}
{"name": "The View Palm Jumeirah", "description": "Stunning 360-degree views 240 meters above the world-famous Palm Jumeirah. At 240 meters high, The View on level 52 of the iconic Palm Tower offers panoramic, 360-degree views of Palm Jumeirah, the Arabian Gulf, and beyond from an outdoor terrace and a premium lounge. Spot iconic landmarks and hidden gems of this beautiful city.", "category": "Observation Decks & Towers", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "The View Palm Jumeirah"], "hours": "9:00 AM - 7:30 PM", "duration": "", "address": "", "neighborhood": "Neighborhood: Palm Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [{"title": "For a great view of the Palm!", "review": "Definitely worth doing! Gives you such a great view of the Palm! Make sure you go early to avoid the queues! Or even a fast track ticket. They manage the lines well-waited in line maybe 20-30 min. Also donâ\u0080\u0099t forget to go to the upper level-view even better! No pylons in the way. in You do need to be able to climb 2 flights of stairs!", "rating": 5.0, "visited": "October 2023"}, {"title": "Advance book tickets and be mindful of peak rates after 4 pm when tickets are 50 percent higher", "review": "I could not get a ticket to visit the top at the counter. Please book your tickets in advance to get to this place. Also please be mindful of the peak rates after 4 pm The rates are 50 perverse higher. Also it closes at 8 pm", "rating": 5.0, "visited": "October 2023"}, {"title": "A great evening out learning about the creation of Palm Island and top tier views", "review": "We visited The View at the Palm during a 10 day stay in Dubai stopping at the famous Atlantis the Palm. From Atlantis is was easy to reach on the metro to Nakheel Mall then taking the elevator to the top. We went at night time but we have said if we come again we would like to go in the day too. The 360 views are amazing. If you have a nervous disposition to heights this probably isn't for you but try and push through it like my husband did as it will be worth it. Even I felt wobbly standing on some of the glass platforms! You can buy professional photos at the end. Staff are really friendly and our daughter enjoyed running around. Was also interesting learning about the history of Palm island and the creation of it before you go out to the viewing deck. All in all, a good evening out. Also food and drinks outlets there.", "rating": 5.0, "visited": "November 2022"}, {"title": "Loved the whole experience", "review": "Originally the view was not in our plans as we had done the burj khalifa and travelling with children I thought they wouldnâ\u0080\u0099t enjoy it. But one free afternoon we hopped on the metro and decided to take a look. And wow Iâ\u0080\u0099m so glad we did! It was much more than just a view, we enjoyed the whole experience, with the interactive floor telling the story of how it was made, the little cinema etc. and the view was just something else. I could have spent all day up there never getting bored of it. We had some lovely photos taken up there, enjoyed the gift shop and cafe. Iâ\u0080\u0099m so glad we decided to go. One side was in the full sun and therefore very very hot but the other side was shaded so the children enjoyed that side more. Iâ\u0080\u0099d definately recommend and would go again myself.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great way to explore and view The Palm", "review": "Great experience learning about The palm and how it was created. A quick interactive and informative session provided about the area before we were taken to the 42nd floor viewing platform. The view is amazing! Would highly recommend.", "rating": 5.0, "visited": "October 2023"}, {"title": "Best View of Palm Jumeirah", "review": "Amazing view of the iconic Palm Jumeirah. I think this is the best view of the island, which you cannot get anywhere else. We went to the queue quite early so we did not have to wait long. The Nakheel mall is also very accessible and the entrance to the top deck is very easy to navigate, as they have an in-house online map which you can get when you scan the QR code at the mall entrance. However, even though it was September at that time, and according to the locals, the temperature is a bit better, it was still boiling hot at the top deck. The official souvenir photographer took us to the rooftop and asked us to do lying and sitting poses, touching the sweltering hot surface. I liked the photos though, only because of the view (my face looked like I was burning) so I bought them. I was really surprised to find that they were really expensive! I was not going to buy them because of the price but (A) I felt obliged since the photographer took many photos (maybe almost a hundred) and (B) you cannot get the few photos you like unless you pay for the whole package! Upon checking my online banking I felt a deep regret as I spent Â£67 for photos!! It came in a nice frame though but I still felt cheated. I know it's not their fault because they told us the price before they showed us the photos at the shop (not before they took them) but it was not a nice experience for me paying that much for what I expected to be a reasonable price. The photos were more expensive than the entrance fee itself. Anyway I cannot take that money back now but I brought back memories (the good and the bad!) with me and I will forever remember that moment where I was at the top, seeing the view of the Palm.", "rating": 5.0, "visited": "September 2023"}, {"title": "Is was great", "review": "It was unreal beautiful, i saw it and i loved it. One of the best place in Dubai. When you will come to Dubai, i recommend to visit this place. And thanks to Anastasia, she is doing her work very well and always smiling.", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing Experience at The View At The Palm", "review": "Amazing view of the The Palm Jumeirah with world-class service. Excellent customer interaction and very accommodating staff. Special thanks to Mr. Keith who made our visit to The View At The Palm extra special and truly an experience my family will never forget.", "rating": 5.0, "visited": "September 2023"}, {"title": "Best Nakheel experience.", "review": "Amazing experience with my family. Went there way back 2021 and Covid was still a pandemic. However, the professionalism and hospitality of staff are exceptional. Safety is always their first priority and making sure the guest will remember The View experience as one their best. Furthermore, not only you will enjoy The View experience, yet to will have a chance to visit one of dubais best mall, Nakheel mall. Special mention to Mr. Keith for providing us all the information we need, hes product knowledge blown us away. We definetly recommend this awesome experience.", "rating": 5.0, "visited": "December 2022"}, {"title": "The whole experience is the best!!", "review": "The view is amazing ð\u009f\u0091\u008f We had another of photos! The whole experience is excellent start from welcome area to cashiers to the staff inside the journey are all happy to assist us. Imagine even security guards has a lot of knowledge about the view too! Well done.", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/27/7e/20/a3/don-t-miss-out-on-dubai.jpg"]}
{"name": "City Centre Mirdif", "description": "With more than 400 stores, this mall truly caters to all audiences and budgets. Find international brands like Lululemon and Desigual as well as more local labels including Almotahajiba and Hanayen.", "category": "Shopping Malls", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "City Centre Mirdif"], "hours": "10:00 AM - 12:00 AM", "duration": "", "address": "", "neighborhood": "Neighborhood: Mirdif", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/20/7c/5f/amazing.jpg"]}
{"name": "Dubai Ferry", "description": "", "category": "Ferries", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Ferry"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Al Sufouh", "rating": 0, "getting_there": ["Al Ghubaiba â\u0080¢ 3 min walk", "Al Ras â\u0080¢ 6 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/9f/e5/75/marina-creek.jpg"]}
{"name": "Atlantis Aquaventure Waterpark", "description": "As the worldâ\u0080\u0099s largest waterpark, Aquaventure World is great for all ages. Take on the Odyssey of Terror, the worldâ\u0080\u0099s tallest waterslide; experience weightlessness on the Zoomerangoâ\u0080\u0099s vertical wall; and zoom through a tube that goes through a shark-filled underwater lagoon on Shark Attack. Bust your moves at the surf area, cliff-jump at Immortal Falls, and let the little ones loose at the Splashers Kidsâ\u0080\u0099 Play Area.", "category": "Water Parks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Atlantis Aquaventure Waterpark"], "hours": "9:00 AM - 9:00 PM", "duration": "Duration: More than 3 hours Tripadvisor does not provide bookings for this experience because it does not meet our animal welfare guidelines.", "address": "", "neighborhood": "Neighborhood: Palm Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Thank you Madhuri & Happy Patrick", "review": "The first time in my life I work out in a vacation. We were having fun in Atlantis pool and Madhuri & Happy Patrick attracted the whole crowd in the pool with a superb summer vibe and positivity. The in-pool aerobic exercise was fun and stress reliever. Thank you Madhuri & Happy Patrick for the great experience I had with you.", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing experience with Hydro watersports", "review": "I did flyboarding at the Atlantis Hotel in Dubai with Hydro watersports. Experience was amazing and definitely recommend doing this - and be sure to ask for Sam for excellent pictures - what an amazing photographer he is, he captured the whole experience. Can't wait to return and see him again. Sam the man.", "rating": 5.0, "visited": "October 2023"}, {"title": "Hydro water sports", "review": "A big thanks to the photographer sam. My daughter had a great time with the e. jet ski. And sam he make a good photos for her really thanks for photos itâ\u0080\u0099s amazing and I feeling a good service from hydro water sports I will come back again thanks Atlantis thanks hydro water sports thanks sam photographer", "rating": 5.0, "visited": "October 2023"}, {"title": "Friendly staff", "review": "The best water park weâ\u0080\u0099ve ever been to. The staff are so friendly and everywhere is spotless! Itâ\u0080\u0099s so big it doesnâ\u0080\u0099t feel too busy anywhere and lots of sun beds. Food is superb we ate in the barracudas food hall.", "rating": 5.0, "visited": "October 2023"}, {"title": "Happy Happy & Thank You to Patrick & Madhuri - Aqua Aerobics @ Atlantis the Palm - Dubai", "review": "Aqua Aerobic sessions run by Happy Patrick and his colleague Madhuri were outstanding. The planning, effort, exercises/music and guest engagement were the best we have ever seen (anywhere). It was a pleasure to welcome Patrick & Madhuri to the pool everyday and watch the fun begin, the guests loved them and the crowds they drew in through their sheer hard work, personalities and love for what they done shone through. It would be nice for the hotel management to acknowledge both Patrick and Madhuri for their hard work and efforts, we hope that they could be rewarded in some way, by way of thank from us (and no doubt all the guest who enjoyed their sessions). Tracy & Paul", "rating": 5.0, "visited": "September 2023"}, {"title": "Perfect Getaway for the birthdays", "review": "Have a great family adventure for my daughter 4th bday. Madhav and Madan were helping us through our at the premium seating section. Didnâ\u0080\u0099t quite feel the heat as they were at our beck and call for any F&B service we wanted.", "rating": 5.0, "visited": "October 2023"}, {"title": "Simply The Best!", "review": "Our second visit was wonderful. Park very clean, well organised and sign posted. Slides are all epic. Plenty of food and drink places. Was extremely hot when we visited at 39Â°! But we managed to cool off with snow bomb drinks!", "rating": 5.0, "visited": "October 2023"}, {"title": "Impressive place!", "review": "Amazing place full of offers for the entire family. For us, the Dolphin encounter was fun, as well as the two rivers. We recommend booking a cabana at the entrance for a full experience and confort in the park. Ours was great, thanks to Justin L, our welcoming host. Thanks Justin! Other advises: book online tickets, otherwise do expect an extra queue. Be punctual for your dolphin experience, keep in mind the place is opposite the entrance and takes you 15-25 min to get there. Towels and swim socks you will find in the park. As well as food and soft drinks. Swim shirts long sleeves, hat and sun glasses should be on your bring along list. Entrance and exit is done through the hotel wing, they dont allow shirtless visitors, make sure you bring extra t-shirt for leaving. Have fun ð\u009f\u0099\u0082", "rating": 5.0, "visited": "October 2023"}, {"title": "I recommend taking a photo session in Atlantis", "review": "I came on vacation to Atlantis Palm to celebrate my birthday with my family. I am incredibly pleased with the work of the photographer of this hotel - Sam. We used his services twice and were satisfied both times. He is brave and will tell you how best to take the photo so that it turns out perfect.", "rating": 5.0, "visited": "October 2023"}, {"title": "Hydro aqua atp", "review": "Great time had by my son 11 years old. He loved it. He did the electric jet ski. Haroun was very helpful and was great definitely we will back again thanks a lot hydro guys", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/1f/b5/bd/photo5jpg.jpg"]}
{"name": "Dubai Autodrome", "description": "Located just 20 minutes from central Dubai, the Dubai Autodrome Circuit is an FIA Grade 1 race circuit that incorporates various different experiences for kids, adults and families - these include: - our Race & Drive Center, where you can enjoy the thrill of driving various road and race cars on the circuit. -Indoor and Outdoor Kartdrome for kids aged from 7 years and upwards -Lasertag center -Motorsport Events, Dubai Autodrome hosts national and international sporting events including the famous 24H Dubai race Asian Le Mans Series & The Gulf Historic Dubai GP Revival.", "category": "Auto Racing Tracks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Autodrome"], "hours": "9:00 AM - 5:00 PM", "duration": "Duration: 1-2 hours", "address": "Sheikh Mohammed Bin Zayed Rd Motor City, Dubai 57331 United Arab Emirates", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Awesome feeling of \"need for speed\"", "review": "Had the opportunity to do a driving experience taking the BMW M3 Competition out. Wow, what speed and massive thanks to my instructor, Mike, his guidance was awesome to get the most of the frills drivng this beast. Definiately recommend this.", "rating": 5.0, "visited": "October 2023"}, {"title": "Such an incredible experience!", "review": "Everyone were so nice, instructors gave very personal treatment, allowed us to ask all the questions and feel comfortable getting into the car. Answered my every request getting ready, and explaining everything. Car was fasttt and track was excellent, video quality is great, really recommended!!", "rating": 5.0, "visited": "September 2023"}, {"title": "Driving Experience", "review": "All I can say is wow, what a wonderful experience. Fantastic facility, amazing track and friendly staff. Thank you for making me feel so welcome and the instructors were so helpful. Will recommend the Dubai Autodrome driving experience to any adrenaline seeking person.", "rating": 5.0, "visited": "September 2023"}, {"title": "Formula DXB Max Experience", "review": "I did the Formula DXB Max experience and thoroughly loved it! My instructor, Fidel, gave a great briefing prior to driving and answered all questions. I was able to get on track with another instructor, Kuda, who was fantastic as well. He brought me up to speed quickly and I was able to drive as fast as I was capable of, since it was just he & I in our group. After the session, Kuda gave me instruction on how I could improve my driving, which was much appreciated. I will be back soon! One area could be improved on, which is the lighting at night. The area around turn 1 is a bit dark and could use some additional lighting and the lighting around the chicane could be modified so that it doesn't shine in your eyes coming up through the chicane. Looking forward to my next experience! Cheers!", "rating": 5.0, "visited": "October 2023"}, {"title": "Spectacular!", "review": "Very nice ans spectacular ride on the circuit with a very capable driver who is also a nice guy. I took a passenger ride in the BMW M20, fabulous car. You can watch other cars on the circuit as wel and the people are very relaxed. Recommended!", "rating": 5.0, "visited": "January 2024"}, {"title": "Excellent racing experience", "review": "We came for a passenger ride in a Ferrari 458 GT. All service personnel was very friendly and helpful. Organisation was very structured and safety standards were on a very high level, for example triple checking if seat belts were fastened correctly. The race car had brand new front tires so we got an extra round for free to experience full speed - it was excellent! Is this a helpful review? Then please give me a \"Thumbs up Thank FrankGeisler\" by clicking the button below.", "rating": 5.0, "visited": "February 2024"}, {"title": "M2 Experience", "review": "Amazing race track offering plenty of different experiences from open wheel single seaters to sports cars. I did the M2 Experience and aside from it being a little too short it was amazing. Instructors give you all the necessary information and confidence and depending on your skills let you push the cars quite a bit. Everybody from the staff is very friendly.", "rating": 5.0, "visited": "February 2024"}, {"title": "Great experience !! Highly recommended !!", "review": "I've been to Dubai Autodrome approx. 6 times in the last 2 years and couldn't rate it more highly !! Tarek, Rehan and Mario are all fantastic and help everyone from a novice to the more experienced. Now my wife has started to join me in the experiences offered.", "rating": 5.0, "visited": "February 2024"}, {"title": "Must try if you live to drive.", "review": "Been on my bucket list for a long time. Booked months in advance to drive the BMW 240i. Was a fantastic experience. You get around 7 laps with an instructor. Takes time to get used to the left hand drive. But a must try. Many cars to choose. The location is a bit outside of main Dubai, but taxis are pretty much easy to get.", "rating": 5.0, "visited": "March 2024"}, {"title": "F1 Experience 11/10", "review": "I did the F1 track experience and it was worth every penny. My instructor Sean was very thorough and informative. He started by briefing me on what to expect followed by driving me around the track in a BMW M3 for familiarization. I then drove a couple laps in a 2-seater racecar as Sean rode along, in order to get me comfortable on the track. This gave me a chance to get familiar with braking zones and corner exits before hopping into the beast. Then there was the F1 drive itself. I definitely stalled out a couple times leaving the pit lane, but the engineers were very helpful in getting me moving. By far the best driving experience I've had. If you ever get the opportunity, this is something you don't want to miss. This was my first time on a race track. I hadn't driven a manual car any time recently, but I do a lot of sim racing. You definitely want to be comfortable with when to shift, but the clutch is only used for getting into 1st gear. Once you get going, it's all paddle shifters from there. This was a blast, and I highly recommend Sean as an instructor.", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/d5/18/4e/night-time-driving-experience.jpg"]}
{"name": "AURA SKYPOOL", "description": "Suspended 200 metres in the air, AURA SKYPOOL is the worldâ\u0080\u0099s highest 360-degree infinity pool offering incredible views of the iconic Dubai skyline, Palm Jumeirah and the glistening horizon of the Arabian Gulf. AURA is a one-of-a-kind experience triggering all the senses, and a truly unmissable spot to capture the essence Dubai at new heights.", "category": "Observation Decks & Towers Observatories & Planetariums Beach & Pool Clubs", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "AURA SKYPOOL"], "hours": "8:00 AM - 11:00 PM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Amazing experience", "review": "Wow! What can I say, this place is just amazing! The views are just wow. You must visit this place if coming to dubai! Make sure you book early. The staff Kavindu and Raj are amazing can't fault them!", "rating": 5.0, "visited": "October 2023"}, {"title": "10/10 experience", "review": "Nico and Yin Minâ\u0080\u0099s service were outstanding. We came for my friends 30th birthday and from start to finish they made the experience so special and I canâ\u0080\u0099t fault their service at all. Would 100% recommend.", "rating": 5.0, "visited": "October 2023"}, {"title": "Must do experience in Dubai", "review": "Amazing view of Dubai. Must do experience- we had a lounge chair facing the palm. Gorgeous view and the pool goes all the way around. Helpful staff and great welcome gift. Highly recommend", "rating": 5.0, "visited": "October 2023"}, {"title": "Great yoga dance class in the sky!", "review": "Imagine the view of the palm and a breezy yoga class in the sky at 8am - thank you Nuni for a great time! We really enjoyed our experience. The yoga class was followed by breakfast which was a limited, but tasty selection of breakfast items with allergens listed + accommodated. Thank you Marvin for your service!", "rating": 5.0, "visited": "October 2023"}, {"title": "Fantastic! A must to visit when in Dubai.", "review": "Absolutely amazing place! I knew it was going to be good but it blew my expectations! The views from the pool are out of this world and to see the sunset from there over the palm was fantastic! The service and food was 5*! A must to visit when Iâ\u0080\u0099m Dubai!", "rating": 5.0, "visited": "October 2023"}, {"title": "Absolutely Superb!", "review": "Absolutely superb! Not many experiences now we havenâ\u0080\u0099t done, but this was one of them and wow, just wow! Itâ\u0080\u0099s not cheap but it is so worth the money. See less arrival and entrance after a short wait in the lobby. But from the minute you step out of the lift, the views are just amazing. We paid the little extra for a front row Sunbed, Ain side facing the wheel and Blue waters, the sun was just coming round as we arrived at 10, and it was constant until we left at 2. The food and drink was very expensive, but wonderful and in those surroundings it was worth every single penny. Get it booked!", "rating": 5.0, "visited": "October 2023"}, {"title": "Impeccable!", "review": "We had such a wonderful time in aura sky pool. Special thanks goes to Fabio ans Bibec for looking after us. Everything was impeccable. The view, the food, the service and even little sweet things like free sun glasses cleaning service!", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing!!", "review": "Absolutely amazing experience! The views are stunning. The staff couldnâ\u0080\u0099t do enough for you. Food and drinks were delicious. Shout out to Fabio for coming round and cleaning our sunglasses for us, nice little touch. We will definitely come back when in Dubai again. Thank you for making the morning so special.", "rating": 5.0, "visited": "October 2023"}, {"title": "Aura sky pool October 3p", "review": "Shiva was our server very kind and helpful. Enjoyed our experience, we had to wait 20 mins to enter at 3pm. Food was excellent and drinks. We tried to exchange cash to tip waiter but this wasnâ\u0080\u0099t allowed which seemed unfair. Would return. Thank you", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing place and amazing staff!", "review": "Incredible place! Nikolas and Hamzah really look after us, made our last night of our honeymoon really special treated us like kings and queens. Big thank you to the manger for moving our seats too! If you are coming to Dubai this place is a must visit! Thank you so much 10/10!", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/22/e3/6a/f3/aura-skypool-ain-marina.jpg"]}
{"name": "Pier 7", "description": "", "category": "Points of Interest & Landmarks Architectural Buildings", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Pier 7"], "hours": "12:00 PM - 2:00 AM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Jumeirah", "rating": 0, "getting_there": ["Jumeirah Lake Towers â\u0080¢ 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/92/73/b0/vista-dal-7-piano-del.jpg"]}
{"name": "White Beach", "description": "WHITE Beach welcomes you to the hottest beachfront destination. Featuring two Instagram-worthy pools, a chic outdoor restaurant perfect for sunset cocktail-sipping. This is the place to be and to be seen.", "category": "Beach & Pool Clubs", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "White Beach"], "hours": "10:00 AM - 8:00 PM", "duration": "", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Family Lunch at WHITE beach - AMAZING profiteroles!", "review": "We couldn't not visit WHITE beach during a family holiday at Atlantis. Although my husband and I would have loved to make use of the beach club, obviously toddlers were not allowed here, but we could have lunch in the restaurant and we were not disappointed. The food was delicious, green juices, bread and oil, kale salad, pasta and the most amazing profiterole stack for dessert! Great music, great atmosphere, attentive staff, spotlessly clean and it was no problem getting a lunchtime reservation. The beach club itself looked fabulous, everything you would hope it would be - glamourous, boujee, a vibe. They even had a bird of prey next to the DJ set.", "rating": 5.0, "visited": ""}, {"title": "5 star", "review": "I love White Beachâ\u0080¦ but what really stood out today was the guy taking care of me for the day, Kieran. Extremely personable, very attentive, nothing was too much trouble. This guy knows how to make people feel looked after and thatâ\u0080\u0099s what we want, right! Make sure you give him every opportunity to excel at white beach, heâ\u0080\u0099s a keeper!", "rating": 5.0, "visited": ""}, {"title": "Wonderful White Beach", "review": "Amazing day at White Beach Club! Wow, absolutely beautiful decor and scenery. Great vibes all day thanks to the exceptional beats by Tim Davis! Service was excellent too, thanks Marks for making sure our drinks were full! See you all again!", "rating": 5.0, "visited": ""}, {"title": "Lovely start to the evening", "review": "Lovely nights, great setting, beautiful restaurant and can't rate Shaun highly enough. Absolute gentleman, great fun, very attentive. To be honest all the hosts were exceptional. Michael", "rating": 5.0, "visited": ""}, {"title": "Dubaiâ\u0080\u0099s White Beach Club Nails It!", "review": "Service is top-notch, I was greeted warmly by not just the service representative. But by Security, as well. I already knew what I wanted in terms of a reservation, and there was availability, granted, I did arrive just at opening. The representative walked me over to the pool where I was going to be spending the day with my wife and she explained the amenities and restaurant availability. I was waited on by a very friendly chap, Mr. Aiban, who was very attentive throughout my entire stay, constantly refilling the ice bucket, and taking care of my orders promptly and with diligence. The restaurant was terrific: we had the dragon roll and beef tartare along with a meringue dessert; we very much enjoyed the meal. The changing room and bathroom is roomy, but just enough. There are two showers in the menâ\u0080\u0099s side and you can lock the door while you are in the shower and there is a small changing area adjacent to the shower stall. Everything is nice, clean, and tidy. The facility is extremely well-maintained, the view of the water leading to the Persian Gulf is lovely and tranquil. Note: you are looking at two story residences across the way, but you have a metropolitan skyline beyond that which I enjoyed viewing. As you face the water, the sun will set to your right. If it is very windy, umbrellas may not always be opened. Make sure you bring everything you normally would to a beach club as prices are quite high, although the quality is top-notch. White Beach is a terrific beach club, destination, and one more thing, the DJ plays an awesome mix nonstopâ\u0080\u0094 you just canâ\u0080\u0099t help but get into that beach club vibe! Well done, White Beach organization!", "rating": 5.0, "visited": ""}, {"title": "Amazing beach day", "review": "This is the perfect beach day! Cocktails are delicious. Nice chilled vibes earlier in the day. Service was incredible. Thank you Marks for looking after us and catering for all our needs. We canâ\u0080\u0099t wait to come back", "rating": 5.0, "visited": ""}, {"title": "Best beach club on the Palm!", "review": "Wow. Amazing beach club and restaurant! Perfect location, amazing music and show dancers, delicious food. Top location in Dubai right on the palm its one of the best Iâ\u0080\u0099ve been to .", "rating": 5.0, "visited": ""}, {"title": "Love the vibe, food and the Music", "review": "I was on a Saturday lunch at white beach , amazing atmosphere with live dj the front view and restaurant decorations boho style just amazing. You have a privat chattle to the restaurant from parking and a lot of food options on the menu. Everything was amazing. Loved the place .", "rating": 5.0, "visited": ""}, {"title": "Best beach club in Dubai", "review": "The best and our favorite beach club in Dubai. Top hospitality experience. The waiters who assisted us are very attentive, professional and friendly. Shame we forgot to ask their names. It was a Greek guy at the beach. And a lady wearing reading eye glasses. Delicious and amazing food. Facilities is amazing. We love the setting and atmosphere of the outdoor restaurant. Toilet and shower area is clean and maintained well. There are 2 pools and private dipping pool with private cabana. Vibrant atmosphere, amazing music, the distance between the sunbeds is decent unlike other beach clubs. My 3rd time in White Beach. This beach club is definitely a must visit if you are in Dubai!", "rating": 5.0, "visited": ""}, {"title": "Amazing place", "review": "Beautiful Restaurant I went with my friend for lunch to the restaurant and the atmosphere was great, the DJ was awesome kept us enjoying the whole time! The staff was very professional, Melissa was great looking after us recommending dishes that combined the place. We had a great time and I would really recommend it", "rating": 5.0, "visited": ""}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/ac/0e/c7/beachfront-restaurant.jpg"]}
{"name": "Al Shindagha Museum", "description": "The iconic Dubai Creek area is the home to our museum, where visitors can experience the vibrant history of Dubai. It was developed as part of an initiative to transform the creek into a regional culture and traditional centre. Shindagha Museum tells the universal tale of human innovation, resilience, and the desire for progress which shaped the Dubai of nowadays.", "category": "Historic Walking Areas History Museums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Al Shindagha Museum"], "hours": "10:00 AM - 8:00 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Al Fahidi", "rating": 0, "getting_there": ["Al Ghubaiba â\u0080¢ 2 min walk", "Al Ras â\u0080¢ 7 min walk"], "top_reviews": [{"title": "One of best museum experience I ever have", "review": "The other day I have been to the Al Shindagha museum, and I really love the experience. Al Shindagha museum is actually a group of house, each represents a different subject, including Arabic Perfume, Poetry, Tradition Life on Lands/Coastal and so much more. Each house is well designed and full of interactivity, so it is a good choice for family and those who want to learn different aspect of Emirate culture. The staff at the museum are very helpful, some of the house staff will introduce you in detail about the subject of the house, and they are really friendly. It will probably take 3 to 4 hours if you want to go through most of the houses, it will be a excellent experience and remember to take some water with you.", "rating": 5.0, "visited": "October 2023"}, {"title": "Children Pavillion, great expirience for kids provided with staff delightful guided tours, exercising great patience towards ki", "review": "Children Pavillion, great expirience for kids provided with staff delightful guided tours, exercising great patience towards kids in offering training class on drawing, paper crafts etc. Both of my grandkids enjoyed a lot. Thanks to their mentor Ayesha especially for her Co.munication skills on understanding every child talent with short talk and offering them a suitable short training accordingly.", "rating": 5.0, "visited": "October 2023"}, {"title": "Al Shindagha Museum - Great experience", "review": "This is a hidden gem within Dubai. We were not sure what to expect, but 3+ hours and 20+ buildings later we came out with a much better understanding of the city and the immense history of it and interactions as a hub to other countries. It is an unconventional layout going from building to building and some of the displays were a little repetitive, but overall it was very informative and had some great photos and insight to Old Dubai. Great thought and lots of tech went into this museum. There were many staff on site and all were very friendly and knowledgeable. A great way to pass and afternoon or evening out.", "rating": 5.0, "visited": "November 2023"}, {"title": "Absolutely must visit!!!", "review": "We were very sorry that we found out about this museum only on our last day in Dubai, and we could not devote more than 2-3 hours. This museum is a hidden gem, as described previously, very UNDER PROMOTED as noted previously, and it is a great pity that it was empty....the tech is amazing, the content is amazing, the staff is very helpful, and you get to learn a lot about UAE and the Emirati culture and history. We would recommend to first time visitors, to put this museum at the top of their list. They will not be disappointed!!", "rating": 5.0, "visited": "December 2023"}, {"title": "What an excellent museum displaying the history of Old Dubai", "review": "I had visited the Al Shindagha Museum with a private tour when I was visiting Dubai for a graduate class. The staff could not have been nicer to us with the 45 minute tour we had of the museum. We got to see part of the introduction film and then we had a quick half hour tour of the museum with some of my classmates. The displays of ancient artifacts were very interesting. It is impressive how the museum preserved the City's past. Our tour guide explained the museum, what they were trying to accomplish and then took us room by room to see some of the displays. Even though it was a quick tour, I highly recommend a private tour of the museum so that you can see all the highlights of the museum. You need at least an hour in the museum.", "rating": 5.0, "visited": "January 2024"}, {"title": "Good Visit", "review": "The museum is stunning. Itâ\u0080\u0099s very nicely laid out and there are people to direct you every step of the way even though itâ\u0080\u0099s mostly self-guided. Clearly a lot of thought and planning went into it and it was really eye-opening and educational. I would plan for at least 3 hours to view all the pavilions. The restored historic houses were one of my favourite aspects of it although there were a lot of interactive and participatory elements as well. Itâ\u0080\u0099s definitely definitely worth the trip. The staff were very friendly, welcoming, and knowledgeable as well, particularly in the jewellery section.", "rating": 5.0, "visited": "December 2023"}, {"title": "A visit that takes you back in time to an authentic and historic Dubai", "review": "A wonderful museum for anyone interested in learning about the history of Dubai and its rich culture, which extends from a long pearling tradition to the literary arts (poetry, calligraphy), perfumery and jewellery and so much more. The staff, and the guides in particular, are most welcoming. A special mention to Rahmah Alsadi and the team at the jewellers' house.", "rating": 5.0, "visited": "April 2024"}, {"title": "Good old story", "review": "Al Shindagha Museums among the newest, family-friendly Heritage Museums in Dubai which is spread over several buildings. All this gives you an insight into the culture, traditions and history of Dubai. If you like history about the places you visit, this is definitely a museum to see. A good opportunity for good photos and historical experiences.", "rating": 5.0, "visited": "May 2024"}, {"title": "Surprise, fun", "review": "This museum is the first place I visited in Dubai. It's incredible. It gives me a full understanding of Dubai's culture and history, Ms. Xinyan Liu gave us a tour in the Perfume house. She is very professional, explained in details. We really enjoyed with her. Highly recommend this museum.", "rating": 5.0, "visited": "April 2024"}, {"title": "Excellent museum in Dubai! Not to be missed", "review": "Used to very shiny new things in Dubai, visiting this amazing traditional museum was a delight!! The museum occupies like a whole neighborhood of traditional houses that have been preserved in their architecture and renovated inside to give place to really modern displays, each dedicated to a different theme, all in the service of introducing you to the history, culture and heritage of Dubai and UAE. From the beginning of the tour, our guide, Aisha Al Ameir, was wonderful, very warm, charming and knowledgeable about the museum, the traditions and history. Since there are so many houses with displays and we couldn't cover them all in the hours we were there, she pointed us to the ones she loved the most and we could see why. Also Mohamed Askari was really good in one of the first houses we visited. I would definitely recommend the visit for all tourist, but also to the expatriates living in UAE: the museum tells a compelling tale of the people of this wonderful land. And if you ask for Aisha you'll be sure to have an even better time. The location by the creek makes for some amazing pictures. Don't miss sitting by the water to see the seagulls.", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/49/4a/83/al-shindagha-museum.jpg"]}
{"name": "Etihad Museum", "description": "", "category": "History Museums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Etihad Museum"], "hours": "10:00 AM - 8:00 PM", "duration": "Duration: 1-2 hours", "address": "", "neighborhood": "Neighborhood: Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/48/b1/05/etihad-museum.jpg"]}
{"name": "The Camel Farm", "description": "We Are Now Temporary Closed For The Summer. Our Guided Visits Will Start Again By Mid October 2022.", "category": "Farms", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "The Camel Farm"], "hours": "9:00 AM - 12:00 PM, 3:00 PM - 7:00 PM", "duration": "Duration: 1-2 hours ", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Amazing experience!", "review": "Today we visited the camel farm. It was an amazing experience! The people running the place are very kind and the tour guide knows a lot about the animals. The camel ride was also fun! Worth the visit and not very expensive. Thanks to the entire team on behalf of my husband and I for an amazing experience!!", "rating": 5.0, "visited": "October 2023"}, {"title": "Brilliant experience and service!", "review": "Had a wonderful experience at the Camel Farm. Whilst I was expecting something slightly bigger, the interaction with the animals as well the information from our guide, Oluchi, made it an unforgettable experience. We took the tour with feeding, which was supposed to last an hour and the time flew by. Oluchi was great at answering all our questions, telling us about the animals' stories, and it was brilliant to be able to hold baby goats and tortoises as well. He took some great pictures for us as well. Whilst it isn't the cheapest thing to do, I felt it was money well spent and would highly recommend a visit.", "rating": 5.0, "visited": "December 2023"}, {"title": "Definitely well worth the visit", "review": "Loved the Camel farm. Not advertised on tourist map I found it on Arabic tourist map instead. Our lovely guide gave us plants to feed them, aswell as the other farm animals including deer,donkeys,bunnies,large tortoise and birds. I went on the three minute ride which was great. They also do an hour camel ride in the dessert which I would have loved to do but my daughter wasnâ\u0080\u0099t keen. Would love to go back again for the hour ride. Closes at 5pm", "rating": 5.0, "visited": "January 2024"}, {"title": "Just brilliant!", "review": "One of our absolute favourite experiences in the UAE. A genuine delight to visit and help feed all their amazing animals. The kids had a blast and we got to see a one week old camel and cuddle a three week old baby! Did the feeding tour, camel cuddle therapy and a quick ride. Could not recommend more highly!", "rating": 5.0, "visited": "March 2024"}, {"title": "My favourite attraction in Dubai", "review": "One of the best tourist attractions I have ever visited. Quite easy to drive yourself to - on a brand new highway followed by a mildly thrilling 300m or so across the desert. If you do go the guided tour with animal feeding is well worth paying for. Unencumbered by ideals of conservationism that have reduced many western zoos to quasi museums, here one can really get up close and personal with the animals. Our toddler was able to pick up a baby goat and carry it around. You don't get that at Berlin Zoo. The camels are charming, the staff are charming, and sitting in their tent drinking a cup of tea after the walk was wonderfully peaceful. An absolute must for any family in Dubai.", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/e2/d1/a9/getlstd-property-photo.jpg"]}
{"name": "Dubai Creek", "description": "Separating Deira and Bur Dubai, the creek is the city's historic commercial hub. Explore and cross the canal on a traditional abra boat ride.", "category": "Bodies of Water Piers & Boardwalks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Creek"], "hours": "", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Al Fahidi", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Abra road", "review": "A fairly wide channel, crossed by a lot of boats of all kinds, zigzagging between the banks like aquatic insects. In the Bur-Dubai area, the shore is full of restaurants with terraces right on the water's edge. Also, here is the bazaar area, very lively and crowded. I think it is an experience that must be tried.", "rating": 5.0, "visited": "October 2023"}, {"title": "Enjoyed my visit here!", "review": "After checking it at my hotel in Deira, this was the first attraction I visited i the area. I noted shops and stores as I walked towards the Abra Station where I rode the local boat for 1 AED. The boat ride was short, about 5-7 minutes. There is a Souq or a small market area where one can shop for clothings, spices, nuts, bags & luggages, jewelries, etc. Of course there are small restaurants along the creek and near the Souq. I enjoyed my visit here. Highly recommended to visit here, when you get bored visiting high rise buildings.", "rating": 5.0, "visited": "November 2023"}, {"title": "Where Dubai got started in the 1830s", "review": "This saltwater creek that leads from the Persian Gulf towards the south landinward is where first human settlement took place in this part of the Arabia. Originally the creek was not very deep and it ended in a swamp (Ras al Khor). Gradually it was deepened and quays were developed along its shores enabling dhows (cargo ships) to dock. Nowadays it is much more \"developed\". A canal was built in 2016 connecting the once dead-end creek to the sea south of Dubai. Along its shores particularly southwest is the modern city with sky scrapers, but towards the north where it is dividing Bur Dubai and Deira still more traditional harbour activities can be observed. This is definitely the most interesting part of the creek, though few Emiratis still tend to live there. Deira and Bur Dubai feel more like cities on the Indian subcontinent.", "rating": 5.0, "visited": "December 2023"}, {"title": "Dubai Creek is the city's vibrant artery", "review": "Dubai Creek is a natural seawater inlet divides the city of Dubai into two sections: Deira and Bur Dubai. Today, it boasts modern developments including iconic landmarks like Dubai Creek Tower. The area harmouniously belnds tradition and innovation, offering visitors a unique experince with traditional markets known as souks, and picturesque waterfront showcasing the city commitment to preserving its heritage while embarcing contemporary elements.", "rating": 5.0, "visited": "December 2023"}, {"title": "Awesome", "review": "It was beautiful. Wish we couldve stayed longer. So much to do so little time. The list of activities is endless. Many accomodation and dining options. Perfect place to have a wide range of experiences in one place.", "rating": 5.0, "visited": "January 2024"}, {"title": "Great to see but pestered non stop !", "review": "So pleased we visited here to experience a bit of old town Dubai in the Gold & Spice Souks. We were ready to be pestered by the vendors but our experience took things to a whole new level. We were always polite with â\u0080\u0098no Thank youâ\u0080\u0099 but for some thatâ\u0080\u0099s not enough, they physically grab you or even block you leaving their store if you enter so my advice is to visit if you are confident & know what you want but if you are timid do not go, you will be taken advantage of. Do not shake hands (they donâ\u0080\u0099t let go & pull you in), do not try on head scarves â\u0080\u009cfor a photoâ\u0080\u009d as it is taken as a gesture to but, etc etcâ\u0080¦ Always haggle on price as first price is never best & even â\u0080\u009cbest priceâ\u0080\u009d is not lowest ! Again, we wanted to come here & really pleased we did, also make sure you experience the boats across the creek, you pay the driver 1 EAD pp/per trip - !!! We found a nice coffee shop for a break @ also a nice place for ice tea by the creek, quite reasonable prices too", "rating": 5.0, "visited": "April 2024"}, {"title": "Lovely trip to the creek and souks", "review": "Love the creek and the souks. Great experience for the kids . Itâ\u0080\u0099s one dirhams each to cross the creek on the wooden boats which the kids loved. We went to a lovely restaurant called the real creek ! Food was amazing", "rating": 5.0, "visited": "April 2024"}, {"title": "Picturesque", "review": "The one dirham boat ride across was an experience, ensure you donâ\u0080\u0099t end up on a private crossing as they are much more expensive and unnecessary in my opinion. The guys running the boats are very keen to lead you to a private option. We were not comfortable walking round the vendors on the other side as they were so persistent and determined. So a very short half hour and we went back. The stalls on the main side had a couple selling fresh squeezed juice. Absolutely delicious and very cheap, orange or pomegranate.", "rating": 5.0, "visited": "April 2024"}, {"title": "A must do in Dubai!", "review": "Love Love Love Dubai! The creek is a must! Like being in the Aladdin film! See the original part though, do a tour with a guide you learn so much! Definitely take an Abra over to the souk. What an experience. Would 100 % return.", "rating": 5.0, "visited": "February 2024"}, {"title": "66th Birthday in Dubai â\u0080¦ a 20-day grand vacation.", "review": "I have lots of fun with my youngest daughter. Spending my 66th birthday here on board Dhow cruise.at the Creek. It was my unforgettable birthday and for being my first time to visit Dubai. I have a 20 days grand vacation in this luxurious travel destination that is Dubai. Very grateful for the moment in my waning days. Thanks to my daughters for giving me this gift of my lifetime.", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/c6/f2/9c/20200115-140413-largejpg.jpg"]}
{"name": "Meydan Racecourse", "description": "", "category": "Horse Tracks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Meydan Racecourse"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Nad Al Sheba", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Great experience", "review": "First time back for a few years and booked the Invasor Room package. Beautiful restaurant with option to sit outdoors to watch the races. Good selection of both food and drinks. Excellent and friendly service by all of the staff and a special thank you to Shasti for looking after us. Also really enjoyed the live saxophonist.", "rating": 5.0, "visited": "January 2024"}, {"title": "Beware Rogue 'Taxi'", "review": "We had a wonderful evening at Meydan racecourse. We opted for the Parade Ring Package which was fantastic value, staff were wonderful and the food and choice of drinks excellent. Now to the downside. We took an Uber there from our hotel with no issues, price 110AED, when leaving the racecourse we joined the taxi queue. Looked very official. We got in the taxi and I noticed that it did not have a meter. The driver said it would be 460AED how would I like to pay, I said I wouldn't and got out. No signal so couldn't call an Uber and not a single official taxi anywhere. A long line of people waiting for cabs, I eventually negotiated 140AED. It felt very uncomfortable and I was very glad to arrive back safely. It is a shame that the official taxi situation isn't addressed.", "rating": 5.0, "visited": "January 2024"}, {"title": "Fun visit", "review": "It was a very fascinating experience, as it was a first time for us. We had no clue what to expect- but the 5AED price of ticket booked online was worth every penny. They had 6-7 races on the day we went. At the entrance you are given a booklet with the horse details for each race, and a card on which you make your guess and mark the winning horses for each race. Since we were confused we asked around, and were given all the help we needed. It's a unique experience for sure. Pro tip: if you don't like crowds- beware, or buy more expensive tickets. But we found the crowds friendly and helpful.", "rating": 5.0, "visited": "February 2024"}, {"title": "Meydan Racecourse First Class, definitely worth the visit", "review": "Meydan Racecourse was on our bucket list, it was well worth the wait. Itâ\u0080\u0099s an amazing venue . We splashed out in a Paddock View with buffet dinner. Everything was first class. The food was delicious, the service was excellent, ambiance was lovely. We chose Paddock View, which has its own outside seating areas and holds around 25/30 people, food service was open and completely stocked up until the end of racing which was after 10pm, excellent selection, very tasty and well presented. Lovely guy beautifully playing a very fancy violin type instrument, Made to feel very welcome, Thank you everyone for such. Brilliant evening", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/04/cf/d6/10/meydan-racecourse.jpg"]}
{"name": "Quranic Park", "description": "Quranic Park is a pioneering modern, cultural project that emerges from the cultural and scientific achievements of Islam, a wonderful opportunity to explain many wonderful meanings and miracles that the Holy Quran contains in the scientific and medical fields. The Park is open daily, kindly check the operational hours before taking the trip as it changes frequently on National and Public Holidays. Jogging area is open 24 hours. Park entrance is free of charge, however there is fee for two attractions: ticket price is AED 10 for entrance to the Cave of the Miracles (AED 5) and Glass House (AED 5) located inside the Quranic Park. Kids below three years of age, people of determination enter for free. Customers can use RTA NOL card, also recharge it inside the Park. Public transportation to Quranic Park E66, X23, X123 as well as public taxis are available right the entrance gate of Quranic Park.", "category": "Parks Educational sites History Museums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Quranic Park"], "hours": "10:00 AM - 10:00 PM", "duration": "Duration: 1-2 hours", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Most Amazing experience", "review": "It was one of the best places we have visited as a Muslim family in Dubai. The miracle cave videos were very educational and the guide asked us multiple questions throughout that made the experience even more exciting for our four children. We then proceeded to the glass house and what an experience that was. Our guide Abdul Kareem was excellent. He gave us a guided tour of all the plants, asked us multiple questions, told us the characteristics of each plant or fruit and made us reflect on those characteristics and how it relates to us in our day to day lives. Abdul Kareem also made us reflect on our own Quranic knowledge and ayahs in the Quran that we related to most. Itâ\u0080\u0099s definitely worth a visit for Muslims and non Muslims alike and us as a family of 6 with4 children aged between 7-12 years thoroughly enjoyed it. We ended up spending over 3 hours here when originally thinking we would be done in one. Absolutely loved it and if you get to have a tour of the glass house with Abdul Kareem go for it!!", "rating": 5.0, "visited": "October 2023"}, {"title": "Tour guide at glass house Quranic Park", "review": "I had a chance to visit the Quranic Park. It was an extreme experience. If you ever plan to visit. Go to the Glass House and ask for Brother Hakeem (or other staff members) for tours. He will talk about fruits and vegetables (plants) the meaning behind why it was created that way and the benefits etc.", "rating": 5.0, "visited": "October 2023"}, {"title": "Peaceful Park", "review": "Really beautiful park. I had the pleasure of meeting Abdul, who kindly showed me around the park and spoke in depth about the significance of the plants within the park. I was even kindly gifted a Quran which was really nice. The park itself is huge; amazing for families. I would definitely go back there again.", "rating": 5.0, "visited": "September 2023"}, {"title": "Phenomenal, informative & enlightening", "review": "Delightful and most informative visit to the Glass House Quranic park. Mr Abdul Hakim had us spell bound as he spoke about 19 of the 51 plants and trees, their benefits and significance as mentioned in Al Quran and Al Sunnah. 3 hours well spent.", "rating": 5.0, "visited": "October 2023"}, {"title": "Thought provoking", "review": "The Quran was brought to life in the Glass House by Abdul Hakeem. His â\u0080\u0098question was which plant are you?â\u0080\u0099 He then went on to capture our audience by describing the qualities of a the plants and likening them to characteristics of a human and society The date palm tree was likened to a friend who stands tall and gives. The olive tree is humble, resilient and giving. The watermelon which is strong but also tender and sweet. The Basil gives easily and without effort. The pomegranate was likened to a family - the crown the father , the peel the mum and the jewels within children - but the reason this unit works is because of the boundaries( thin but there to ensure you are close but still have space. He referred back to verses of the Quran and narrated stories of our beloved prophet.", "rating": 5.0, "visited": "November 2023"}, {"title": "Peaceful Park", "review": "Beautiful glass house..where you can learn about plants in Quran and hadits...with clear explanation from our guide Ahmad Shaleh from Sudan. Unfortunately when we came the lake was under reconstruction. But still we could enjoy the serenity of the park.", "rating": 5.0, "visited": "November 2023"}, {"title": "Amazing experience with family in Quranic Park Dubai", "review": "We visited this amazing place on our trip to Dubai.We brought our little daughter with us, and had a full tour of the place. It gives an exceptional experience and deeper understanding of our Holy Quran. I was pleasantly surprised of knowledge of guides, they are young but all the questions we asked during the tour in Cave, our guide (his name tag said Shahbaz Khan), was able to answer in depth and made our experience richer. The Glass house with the plants interested our baby a lot, she was just looking aroud in amusement. And we enjoyed the natural beaty of the place overall. Definitely will visit once again and will tell our friends who will be visiting Dubai not to miss this beautiful place.", "rating": 5.0, "visited": "October 2023"}, {"title": "Quran Park Greenhouse Tour", "review": "Had a really lovely day out with the family! We joint the tour given by Abdul Haqeem. He gave an excellent tour with Islamic stories that he related to the fruits and vegetables in the exhibition. Will definitely be recommending to our family/friends!", "rating": 5.0, "visited": "November 2023"}, {"title": "Knowledgeable and counseling", "review": "Had a wonderful time and managed to discover my personality better and learned on how to relate it with a plant. I learned that I can introduce myself as a date palm-tree cause it's a sign of generosity and hospitality. Thanks to the guide in a white dress for he explained it well and related it to the Quran and social life. It's worthy visiting", "rating": 5.0, "visited": "December 2023"}, {"title": "Beautiful â\u009d¤ï¸\u008f", "review": "Such a beautiful place with Mr Abdul Hakim explaining each and every plants about their pros and cons. All the plants and fruits that were mentioned in the Quran. Itâ\u0080\u0099s a must to visit here. For my personality is Onion and Cucumber. Ahmad was also guiding the path and was friendly to us. Highly recommend ð\u009f\u0091\u008dð\u009f\u008f½ð\u009f\u0091\u008dð\u009f\u008f½ð\u009f\u0091\u008dð\u009f\u008f½", "rating": 5.0, "visited": "December 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/02/7d/5f/quranic-park-in-al-khwaneej.jpg"]}
{"name": "OliOli", "description": "OliOliÂ® - The must-visit world-class childrenâ\u0080\u0099s museum OliOliÂ® is the Hawaiian word for 'joy' and entails 8 galleries with over 45 interactive exhibits. Lovingly designed and inspired by ideas of educators, artists, development psychologists and museum experts from 12 countries, OliOliÂ® offers children the ability to engage in open-ended and non-judgmental play, learn to take risks in low-stakes environments, use their hands to make things and problem-solve, gain fascination with STEAM in a joyful manner â\u0080\u0093 and most importantly, play and bond with their families. Come, explore, be curious, discovery, find joy!", "category": "Children's Museums Game & Entertainment Centers", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "OliOli"], "hours": "9:00 AM - 8:00 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Al Quoz", "rating": 0, "getting_there": [], "top_reviews": [{"title": "OliOli visit!", "review": "We had such a fab experience at Oli Oli, My kids had an amazing time and they were completely entertained! It was fun and educational! The Magical Winterland was beautiful and it got us into the festive spirit! This Childrenâ\u0080\u0099s play museum is a must visit!", "rating": 5.0, "visited": "November 2023"}, {"title": "Highly recommended!", "review": "Such an amazing experience, everything is planned and thought out beforehand, and I did not have to worry about anything. Roxy, Alden, Abigail and Alex did a very good job especially the girl who was in charge of the Birthday, she was born to do the job she did. Highly recommended!", "rating": 5.0, "visited": "October 2023"}, {"title": "A wonderful holiday indeed", "review": "God bless their wonderful team. To be honest working in this kind of field is not easy but they handled it well with their smile and dedication. They are so welcoming and helpful . Our whole experience in Oli Oli is really amazing.", "rating": 5.0, "visited": "December 2023"}, {"title": "Great for young children!", "review": "My child & I visited on 21 May from 10.30am to 1pm. In every gallery/station, we were greeted by a friendly crew who was so patient in explaining the how-to to my child. In particular, the crew member at the colouring station interacted so well with my child. The activities are engaging, perfect for young children!", "rating": 5.0, "visited": "May 2024"}, {"title": "Oli Oli - A school's dream excursion destination!", "review": "Oli Oli offers an incredible opportunity for students to continue their learning journey outside the classroom. This STEM-integrated facility focuses on the holistic development of the child, fostering learning through play. The staff's warmth and friendliness make it a student-focused and well-maintained environment. We are grateful for the space it provides to make learning fun and interesting, and we highly recommend it to any parent or school. Our students are enthusiastic about Oli Oli, and we look forward to our next visit.", "rating": 5.0, "visited": "June 2024"}, {"title": "Amazing experience ð\u009f\u0092¯", "review": "We had an outstanding time at the OliOli Children's Museum! The various galleries that offer activities that kept our kids engaged and excited throughout our visit. The interactive exhibits are not only fun but also educational, making it a perfect outing for families. A special shoutout to Don, a staff member who went above and beyond to ensure we had a memorable experience. His patience and enthusiasm as he played with the kids and showed us around made our visit even more enjoyable. The entire staff was friendly and accommodating, contributing to a fantastic atmosphere. Highly recommended for anyone with young children looking for a fun and enriching experience!", "rating": 5.0, "visited": "June 2024"}, {"title": "Always exceptional!", "review": "We had a pleasant visit at OliOli! We usually visit on weekends but I would say weekdays are the best! They have the free food for kids for 3hrs play ticket! Cafe is a vibe, Mark is very friendly with the kids while we are on cafe and Don is the best! He helps us and guide on cars and ramps and that made our visit more special!", "rating": 5.0, "visited": "July 2024"}, {"title": "Fantastic engaging and immersive experience for young children", "review": "6 Year Old absolutely loved her time at Oli Oli. Wonderful interactive and immersive experiences available. The staff are delightful, very engaging and keen to participate alongside the children - they are welcoming and friendly and put the children to ease. Spent over 3 hours there and could quite easily have spent many more. The range of activities is so simple yet so thought provoking. Well priced and a terrific indoor adventure to get children thinking and exploring in a safe environment. Thoroughly enjoyable - great value and entertainment.", "rating": 5.0, "visited": "July 2024"}, {"title": "Best place for Family!", "review": "If you are visiting Dubai or lives here in UAE, You should visit OliOli! I love how they had a different concept per room and they also have a small cafe with variety of healthy option for kids and adults too! Iâ\u0080\u0099d recommend to bring socks as you will need it. This place is for families and for sure you will need lots of energy as you play with your kids! Iâ\u0080\u0099d like to highlight their staff! Very helpful and friendly. We met the loveliest people in light room - Eliza and Don who play and guide us. That made our visit memorable and enjoyable!", "rating": 5.0, "visited": "July 2024"}, {"title": "Take a full 3 hours for sure!", "review": "My son couldn't get enough of this place after 3 hours of non stop, explorative play. Fantastic set up, huge place and well maintained yet quiet in September. Great value and he rated it 9/10 ahead of all the theme parks and waterparks. Wow.", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/83/82/af/toshi-s-nets-gallery.jpg"]}
{"name": "Dubai Opera", "description": "In the heart of the United Arab Emirates, where cultures unite, Dubai Opera stands tall, as the main lighthouse for the performing arts in the Middle East. A global stage, where artistic languages, creative expressions, from all over the world converge and blend every day. Dubai Opera serves, unifies and inspires the community of Dubai and beyond. Through excellence in the arts, Dubai Opera aims to build a more vibrant and inclusive society, placing Dubai at the forefront of the global cultural scene.", "category": "Theaters", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Opera"], "hours": "", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Downtown Dubai", "rating": 0, "getting_there": ["Burj Khalifa/Dubai Mall â\u0080¢ 9 min walk"], "top_reviews": [{"title": "Beautiful theatre", "review": "We have gone to see both the Nutcracker ballet and the Matteo Bocelli show at the Dubai opera. The Dubai Opera is a beautiful well organised theatre. Delightful staff and beautiful setting. We enjoyed both shows thoroughly.", "rating": 5.0, "visited": "December 2023"}, {"title": "Beautiful Venue", "review": "Felt like film stars arriving at the Opera House on 21st December to see Matteo Bocelli. Red carpet arrival and the venue is beautiful with views over the dancing fountains from the bar areas. Fabulous auditorium and would argue everyone would have an excellent view. We booked one of the boxes close to the stage and it was amazing! The bathroom facilities are lovely with a beautiful light fitting which looks like morano glass in the centre of the room with glass basins beneath, spotlessly clean. Would recommend and if in Dubai again will definitely be seeing what is on for another excellent experience.", "rating": 5.0, "visited": "December 2023"}, {"title": "A modern and sophisticated cultural hub", "review": "I came here for the second time and never got disappointed from the moment I stepped inside to those popular and international performances that I did not want to miss. I love the staff's friendliness, making you feel comfortable. The interior design of the place is worth staring at. It was indeed a wonderful experience.", "rating": 5.0, "visited": "February 2024"}, {"title": "Giselle did not disappoint!", "review": "Giselle a Ballet performed by the Polish National Ballet was showing for only two nights at the Dubai Opera so I took the opportunity to book this and a pre-show \"Classic\" package which was very well priced and started off an amazing experience to the Dubai Opera. Shown to the a private lounge on arrival and welcomed with glass of champagne on arrival, a private sofa and table in the VIP lounge as well as a tray of canapes to enjoy before the show. If booking at the Dubai Opera again, I would definitely book the Classic package again, 75 DHs extra was great value to start the evening off and feel special!", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/d4/3b/38/oopperatalo-on-suunniteltu.jpg"]}
{"name": "Cloud 22", "description": "", "category": "Beach & Pool Clubs", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Cloud 22"], "hours": "10:00 AM - 11:00 PM", "duration": "", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Over the clouds in CLOUD 22", "review": "The Cloud 22 infinity pool at Atlantis The Royal is a must-visit, situated high above the sky. The view is truly surreal, and the atmosphere strikes a perfect balance between relaxation and fun. During our visit, we enjoyed a delectable lunch consisting of lamb chops and baby chicken, as well as pizza and fries for our late afternoon snacks. The taste and quality of the food were top-notch, truly world-class! I want to give special recognition to Niken, whose exceptional service made our experience even more memorable. She took great care of us and ensured our comfort throughout. Niken's attentiveness and genuine care made us feel like VIPs. It was an added bonus to notice her serving everyone with a warm and welcoming smile!", "rating": 5.0, "visited": ""}, {"title": "SURPRISE ENGAGMENTâ\u0080¦ amazing staff, incredible view", "review": "I expected to be only on a floating bedâ\u0080¦little did I know my partner and management were in on a secret engagement for me!!! Management and staff went above and beyond for us and our special moment, couldnâ\u0080\u0099t have done better, really made it special, gave us a special fruit playter set up with my ring in the middle, we really loved this special touch. View was incredible, cleanliness was of high standard, staff were very friendly and approachable, I would say staff should be given chairs or regular water breaks as its so hot and they were standing for so long.", "rating": 5.0, "visited": ""}, {"title": "The Perfect Engagement Surprise with outstanding Staff & View at Cloud22", "review": "As a couple looking for a special experience to celebrate our engagement, we couldn't have chosen a better place than Cloud22. It was an unforgettable experience, with breathtaking views that truly captured the essence of Dubai's skyline. However, what made our time at Cloud22 even more exceptional was the outstanding staff, particularly Steffi, who went above and beyond to make our engagement surprise perfect. From the moment we arrived, Steffi and the staff greeted us with a warm and genuine smile, instantly making us feel welcomed and valued as guests. She went the extra mile to ensure that every detail of our surprise was executed flawlessly. Steffi's attentiveness and impeccable professionalism truly made us feel like VIPs throughout our entire visit. The service provided by the staff at Cloud22 was simply outstanding.", "rating": 5.0, "visited": ""}, {"title": "Amazing experience- Thankyou Daniela", "review": "Such a lovely experience, amazing food, good drinks and great atmosphere. All the staff at cloud 22 were so friendly and welcoming no complaints. Iâ\u0080\u0099d like to say a big thankyou to Daniela for making me and my partner very welcome and ensuring we are happy sheâ\u0080\u0099s very welcoming and positive and make our experience 10/10 would definitely recommend cloud 22", "rating": 5.0, "visited": ""}, {"title": "Incredible Views", "review": "Cloud 22 is absolutely worth visiting. The views are incredible. The staff go above and beyond. Everything is luxurious... you can easily spend all day in the infinity pool enjoying the Palm views, sipping on some drinks & enjoying the delicious food. Cabanas and sun lounge chairs are available for a fee. Cloud 22 is not complimentary even when you are staying at the hotel... but it's totally worth it Reservation is required.", "rating": 5.0, "visited": ""}, {"title": "An experience must tryâ\u0080¦", "review": "Top place with stunning view! Amazing pool and very nice and attentive staff. Very nice food and reasonable pricing for a venue like that. Wanna give credit to Damien , Vasilis and one lady for being so professional and made our day!", "rating": 5.0, "visited": ""}, {"title": "Heaven on earth!!!", "review": "The best rooftop pool in Dubai! Absolutely heavenly. I never I saw a place like that! Beyond words and luxuryâ\u0080¦ Views, food, staff and service were top as you expect in a place like that. Best option for infinity pool. I am still processing the experience we had in Cloud22. We will be back for sure, the best place I was in my entire life without doubt! Just WOW!!ð\u009f¤\u008d", "rating": 5.0, "visited": ""}, {"title": "Great staff and venue!", "review": "Exceptional hospitality from all staff but especially to Bayern and Zia. Both were attentive and caring throughout the day. So professional. They made the day more enjoyable, nothing was too much trouble. I have to commend their patience with the most ignorant of clientele. However I have to say great venue and all day vibes. Great first impressions and come away having enjoying the day. Thanks to all the team! Definitely will go back in the not distant future.", "rating": 5.0, "visited": ""}, {"title": "A truly special experience", "review": "A truly special experience right from the start. The staff are so welcoming and attentive. Would definitely recommend going for a floating bed in the infinity pool if you can - the views of the palm are incredible (most lose the sun around 4:30pm and our waiter did offer to move us but we were happy where we were). We didnâ\u0080\u0099t venture round the other side but I suspect itâ\u0080\u0099s shaded all day and less of a vibe. The food was top class. Whilst not stared on the menu you can chicken or prawns to the Caesar salad. DJ ramps up around 1:30-2pm complemented by a violinist. We were struggling to decide between here & Aura but so glad we chose here - couldnâ\u0080\u0099t fault it one bit.", "rating": 5.0, "visited": ""}, {"title": "Amazing day", "review": "Amazing experience, beautiful location and surroundings. We had an infinity pool bed and so glad I picked this one as it had the sun all day long! Our server Tristan from South Africa was THE best! Took excellent care of us and a lovely young man to have a chat with. Would definitely come back again.", "rating": 5.0, "visited": ""}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2c/21/f4/d6/fashion-and-poolside.jpg"]}
{"name": "Museum Of Illusions", "description": "Welcome to our fascinating world of illusions. Thrilled yet bewildered you will enter a world that will blow your mind but also give you an opportunity to learn all sorts of things... come and visit us! It is sure to be an amazing and unimaginable experience because whatever you see, especially here in the Museum of Illusions, is not what it appears to be. Are you ready for an adventure?", "category": "Speciality Museums Science Museums Children's Museums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Museum Of Illusions"], "hours": "10:00 AM - 10:00 PM", "duration": "Duration: 1-2 hours", "address": "", "neighborhood": "Neighborhood: Al Hamriya", "rating": 0, "getting_there": ["Baniyas Square â\u0080¢ 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/13/f9/f9/head-on-the-plate.jpg"]}
{"name": "Jumeirah Lake Towers", "description": "", "category": "Points of Interest & Landmarks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Jumeirah Lake Towers"], "hours": "", "duration": "", "address": "", "neighborhood": "Neighborhood: Jumeirah Lakes Towers (JLT)", "rating": 0, "getting_there": ["DAMAC Properties â\u0080¢ 8 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/57/f6/ac/photo0jpg.jpg"]}
{"name": "Al Seef", "description": "Along Dubai Creekâ\u0080\u0099s shoreline is Al Seef, a bustling waterfront promenade where old meets new. It has two zones: an old-world heritage area and a modern section lined with malls, hotels, and restaurants. Here, you can learn about the Gulfâ\u0080\u0099s beginnings as a famous pearl diving port, explore the open-air floating market and 1950s-style souk, get a henna tattoo, and purchase handicrafts along the sikkas (alleyways). You can even hop aboard a romantic dhow boat and take in the fantastic views on a dinner cruise. Al Seef is great to visit together with the nearby Al Fahidi neighborhood on a walking tour. â\u0080\u0093 Tripadvisor", "category": "Points of Interest & Landmarks Scenic Walking Areas", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Al Seef"], "hours": "10:00 AM - 11:00 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Umm Hurair", "rating": 0, "getting_there": ["BurJuman â\u0080¢ 10 min walk"], "top_reviews": [{"title": "Al Seef, well worth a visit", "review": "Nice visit to Al Seef, recommended for seeing the old style buildings and shopping for bargains. Many places for food and drink, really good value. Great to stroll down the Promenade too and see a different side to Dubai", "rating": 5.0, "visited": "December 2023"}, {"title": "Lovely development", "review": "This is an impressive development on the creek. The development comprises an â\u0080\u0098oldâ\u0080\u0099 dude and â\u0080\u0098newâ\u0080\u0099 side. The old side captures well the traditional building and streets of a classical Middle Eastern city. There are a large number of restaurants and shops, a museum of illusions and a couple of hotels. The whole area runs alongside the creek which makes further a beautiful backdrop.", "rating": 5.0, "visited": "February 2024"}, {"title": "Casablanca", "review": "Hotel is in a great location. I feel like I'm in Morocco n in a Indiana Jones movie. Plenty of shop n cafes right below our room. Room are small n have no electrical plus to charge phone from US ..so bring adapters..or ask hotel to bring you one..", "rating": 5.0, "visited": "February 2024"}, {"title": "Mirzam at Al Seef", "review": "MIRZAM Chocolate is must visit at Al Seef! Nestled in the vibrant streets of Al Seef, we stumbled upon this hidden gem of a chocolate store. During our visit, we had the pleasure of meeting the person behind the counter: Waseem, who exuded kindness and warmth. He patiently guided us through the array of chocolates, generously offering testers and sharing his expertise. We left with bags full of treats and hearts full of gratitude only because of him. Whether youâ\u0080\u0099re a chocolate aficionado or simply seeking a sweet escape, this charming spot promises to satisfy your cravings and leave you with a smile. Thank you Waseem!", "rating": 5.0, "visited": "February 2024"}, {"title": "A Mixture of old & new Dubai", "review": "We are regular visitors to Al Seef when the weather cools down in the UAE. The redevelopment of the old Bur Dubai Creekside by Meraas is quite fantastic in my opinion. Inspired by the old Dubai architecture with sand stone and wind towers, they have changed the whole look & feel of this area. Ample parking in the lower levels, loads of eating joints of all types and the views across the creek are just fantastic! Definitely visit during the early evenings to around sunset time to get the best experience and experience Al Seef at night.", "rating": 5.0, "visited": "November 2023"}, {"title": "Reproduction of how things used to be", "review": "I do enjoy historical city centers, but this felt inauthentic to me. This entire area was built \"in the style of\" historical Dubai, and I did enjoy the scenery and the change of pace from the rest of Dubai. But I couldn't help but feeling that this was simply a veneer over an outdoor shopping mall. I stayed at the Al Seef hotel, which sprawls over a wide area, and I couldn't help but think that the idea was to locate the rooms so that you'd have to walk past lots of shops and spend lots of money.", "rating": 5.0, "visited": "May 2024"}, {"title": "Loved it", "review": "Al Seef and Al Fahidi are absolutely beautiful. Loved the alley ways in Al Fahidi. A must see on your visit to Dubai. Took an abra from Al Fahidi to the Gold Souk and it was a lovely experiece", "rating": 5.0, "visited": "May 2024"}, {"title": "Must Visit Place", "review": "An evening in the fifteenth century. Dubai, a symbol of innovation and human progress, is filled with modern marvels. Yet, amidst this contemporary landscape, Al Seef Street in the Al Fahidi neighbourhood offers a journey back to old Arabia. Stretching along the banks of Dubai Creek for one and a half kilometres, the street is divided into two parts. One side reflects modern life, with stylish restaurants and contemporary buildings, while the other side beautifully captures traditional Arabic culture and architecture. As you walk between these sections, it feels like stepping back four hundred years in time. Here, you'll find buildings made of sand, lime, and stone, narrow mud-brick streets, and weathered wooden doors. Palm bark canopies shade the entrances to homes, ancient fishing nets hang nearby, and the soft glow of lanterns enhances the historic atmosphere. Among these settings, youâ\u0080\u0099ll also discover various restaurants, including a Starbucks Cafe, designed in the traditional style. I spend my evening here whenever I get time, it is one of my favorite places in Dubai.", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/23/71/29/ca/caption.jpg"]}
{"name": "Dubai Aquarium & Underwater Zoo", "description": "Dubai Aquarium & Underwater Zoo is one of the most captivating attractions in Dubai. Located at The Dubai Mall, the largest mall in the world, offering a memorable journey into ocean life. With capacity to hold 10 million litres of water, Dubai Aquarium is one of the largest indoor aquariums in the world and it illuminates the marvels of the ocean floor, showcasing one of the most diverse collections of aquatic life. Located just above the aquarium, Underwater Zoo brings visitors up close with penguins, piranhas, crabs, water rats, sea horses, jellyfish and plenty more. A fascinating new addition at Underwater Zoo is King Croc, regarded as nature's rare phenomenon and one of the world's largest reptiles - at over 5 meters long and weighing an imposing 750 kg plus. Underwater Zoo regularly hosts innovative exhibits. One such exhibit, 'UAE's Night Creatures' presents the experience of nightfall in the desert as creatures of the dark.", "category": "Aquariums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Aquarium & Underwater Zoo"], "hours": "10:00 AM - 11:59 PM", "duration": "Duration: More than 3 hours ", "address": "", "neighborhood": "Neighborhood: Downtown Dubai", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Varied experience", "review": "Purchase the outdoor penguins and inside penguin experience as well as the admission to the aquarium and under water zoo. The inside penguin experience was great they don't let you take your phone in and you have to purchase photos if you want them but loved it. The outdoor penguin experience was very poor in my opinion X2 glass small enclosures with perhaps 6 penguins in them, felt sorry for the penguins but they all look well cared for. Then the guide does a talk and shows you some other things. The underwater zoo and night zoo had lots of different fishes and species and was great. The downstairs aquarium tunnel was ok not that great,it got quite crowded but ok if you've never seen one of these tunnels before.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great visit", "review": "Expensive, nice experience but I did think it was priced too high even for Dubai. The aquarium attractions are fantastic, you pay extra to feed the fish or visit the penguins. Itâ\u0080\u0099s a great one off experience but due to the price would not visit again", "rating": 5.0, "visited": "October 2023"}, {"title": "Overpriced", "review": "I paid 410 AED (over 100 euros!) for an \"ALL ACCESS PASS\" bought online, a few days before the date of the visit. It's not worth it! The aquarium is quite big, beautiful, but I have seen other aquariums at least as beautiful for less than half of this price. The tunnel is short and trivial, Submersible Simulator is just a cartoon, Penguin Cove is a small section, with a few penguins that didn't look too happy. It took me two hours to visit it. All in all, it's worth visiting, it's beautiful, but it doesn't excel in any way and it's not worth the money!", "rating": 5.0, "visited": "October 2023"}, {"title": "Great marine experience", "review": "Ground floor has this giant fish tank where you could see all marine lives. I found the shark moving left to right and vice versa. Not sure if it was real or fake as didn't see his eyes blinking not even once. May be on some marijuana or something which kept them calm and move from here to there. Other fishes were live and playful. Underwater zoo tunnel was great experience. Then on first floor you have rainforest which is part of this ticket only. You get to see so many stuff there. Like all kinds of marines lives living in the water. Main highlight was big giant crocodile live infront of us in the tank. Rain forest was great experience. Even if you miss The green planet is fine as this was better than that. We had not booked for Shark experience & Penguine cave. Overall great place for kids to enjoy.", "rating": 5.0, "visited": "October 2023"}, {"title": "Okay", "review": "Some very interesting fish to watch and also some excellent animals and insects on the upper floor. What really let the place down for me and my wife was how you had to keep exiting the place to then go to another part of it then have to re-show your entry ticket. It was also extremely difficult to go around the place in a co-ordinated fashion - more signs would have been helpful. Personally been to better Sealife centres, but interesting nevertheless.", "rating": 5.0, "visited": "November 2023"}, {"title": "Just amazing!", "review": "Amazing staff. Very good value for money. The animals are very well cared for. I purchased the add-on for the otter, experience. I also purchased a diving experience in a cage to watch the sharks being fed. Everything was superlative. The briefing for the otters and the shark cage was very detailed and I could tell that the safety of the animals and myself was important to the staff. I was provided with a dive suit and diving helmet for the diving. I was allowed to buy a photo experience where the safety diver took tons of photos and videos and the staff then imported them directly on to my phone. The cafe was lovely and there were lots of nice options to eat. I was asked by several members of staff if I needed advice or if I had questions. I am absolutely in love with the otters. Shaking hands with an otter was the most amazing experience. I am going back later in the week to meet the otters again and to meet the penguins and the king croc.", "rating": 5.0, "visited": "November 2023"}, {"title": "Decent aquarium although expensive", "review": "This was a really nice and massive aquarium, they had so many types of fish including massive sharks, crocodiles, penguins and even reptiles and Manta Rays. It takes about 2-2.5 hours to do everything other than the diving. We did the whole package except diving, which costed 299 AED so itâ\u0080\u0099s quite expensive. There is not really food inside, just a coffee counter with ready made sandwiches so best eat before or after. It is very crowded. Overall a good aquarium, not the best Ive seen in terms of aquariums in general, but worth a visit if you like fish.", "rating": 5.0, "visited": "November 2023"}, {"title": "Penguin cove is the best part", "review": "Walked past it loads of times and thought you could see it all from outside so why pay money to go it. Buy inside is much better going under the tunnel is great. Best part is the penguin cove. In the rest of the world you would pay 4-5 x the price of it to get a penguin experience, loved getting in the cold and seeing them up close. Very glad they provided the jackets to keep us warm.", "rating": 5.0, "visited": "December 2023"}, {"title": "Family Fun day", "review": "We recently visited the aquarium, the visit was organized by Fabio, and it was an extraordinary experience!.The staff was knowledgeable, and the ambiance was delightful. The diverse range of aquatic life showcased, along with informative displays, made it both entertaining and educational. Both kids & adults enjoyed the experience and clicked memorable photos. Canâ\u0080\u0099t wait to visit again ð\u009f\u0098\u008d", "rating": 5.0, "visited": "November 2023"}, {"title": "Penguin Cove. Azing experience!", "review": "Had an amazing experience at Penguin Cove. Our guide Jessica was very helpful. She explained and showed skark, jellyfish and sea horses Lifecycle. Gave us some nice facts about penguins. Worth it.", "rating": 5.0, "visited": "December 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/78/84/94/dubai-aquarium-underwater.jpg"]}
{"name": "Illusion City Dubai", "description": "illusion City is a museum of wonderment. None of the elements in our collection can be described as ordinary, and many will defy your intuition and seem impossible. We have curated the finest examples from across the world, including carefully selected optical, auditory and tactile illusions, high quality magic tricks, the latest technological marvels, and even unbelievable phenomena found on the Internet. At illusion City, experience the impossible becoming possible, first hand!", "category": "Speciality Museums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Illusion City Dubai"], "hours": "10:00 AM - 11:00 PM", "duration": "Duration: < 1 hour", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Illusion city", "review": "Amazing little exhibition of illusions presented by a guide. Kids loved it too. Definitely worth a trip. Takes about 40min to go through depending on how much time you spend at each illusion.", "rating": 5.0, "visited": "October 2023"}, {"title": "Humorous family amusement with some learning moments", "review": "A quiet day wandering around Blue Water and came across Illusion City. Went in to see the displays. Was an interesting half an hour. We were escorted by a guide around a set of optical illusions. This was very helpful as she showed how to see some of the more complicated ones which you may not see on your own. There are lots of opportunities to take photos and amuse family. Was good value for money and a good way to spend half an hour.", "rating": 5.0, "visited": "October 2023"}, {"title": "Dont miss it! Wonderful place!", "review": "Amazing visit! Very original and so fun! We had a magical family moment, learning and taking photos ! The team was very kind and welcoming ! John was wonderful and Benj gave us Best tour ever! A must in dubai !", "rating": 5.0, "visited": "October 2023"}, {"title": "Mind-bending experience!", "review": "Sensationall! Wonderful experience and totally mind-blowing. I especially loved the ideas behind it, the physics, the angles, in shortâ\u0080¦..everything. Even my three-year-old son enjoyed it. As a school teacher I would certainly propose bringing students here. Bravo! Will definitely recommend to all my friends.", "rating": 5.0, "visited": "October 2023"}, {"title": "A must visit museum with kids !", "review": "Very interesting museum with illusionary games, rooms and sculptures to marvel at and make kids work their brain on. Beautiful pictures taken giving the illusion that my boy is climbing the wall like Spider-Man or making me so little compare to my kids â\u0080¦ lots of fun and good times ! I strongly recommend ð\u009f\u0091\u008dð\u009f\u008f»", "rating": 5.0, "visited": "November 2023"}, {"title": "Amazing experience", "review": "Not usually a museum type of person but this was 10/10. Very interesting mind blowing things. Very happy I actually went. Big shout out to John and the rest of the team for being so helpful. Definitely recommend.", "rating": 5.0, "visited": "November 2023"}, {"title": "Worth it!!!", "review": "It was a really fun experince. We were skeptical about it in the beginning but it turned out to be really interesting. Lukman, our guide was extremely amazing and very willing to take multiple pictures and ensure we have a good time. Highly recommend!!", "rating": 5.0, "visited": "November 2023"}, {"title": "Family time at illusion city", "review": "Has a chance to visit illusion city this Friday with my family we had a very good experience with its mesmerizing blend of cutting-edge technology and architectural wonders. The cityscape, adorned with vibrant lights and futuristic designs, creates a truly immersive illusion. From high-tech entertainment to stunning skyline views, Illusion City Dubai is a testament to innovation and luxury, making it a must-visit for those seeking a surreal urban adventure.", "rating": 5.0, "visited": "October 2023"}, {"title": "An amazing, interactive and creative experience! It makes you smile and have fun, so I definitely want to come back!", "review": "This museum is amazing! I visited it by myself and I really recommend you ask Justin for some guidance during the visit. He is very professional, friendly and has a great knowledge about all the illusions! Here you have an interactive and funny experience because you can try the illusions, see them and challenge your brain. You also take incredible photos and get surprised by each thing you see!", "rating": 5.0, "visited": "December 2023"}, {"title": "Have a fun hour â\u0080¦", "review": "Good fun to kill an hour. Awesome tour by John - taking crazy pictures. Some of the best money I have spent in Dubai. They really join you, show you the best camera angles etc. really good", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2d/d4/f0/c5/caption.jpg"]}
{"name": "Dubai Water Canal", "description": "Columbus Yachts and Boats Rentals was founded in dubai 2013 Cruise from Marina to Dubai Water Canal & enjoy amazing sightseeing along the Canal Route, Sheikh Zayed Bridge and more! 4 hours yacht cruise for 1 until100 people by Luxury Yachts", "category": "Bodies of Water Points of Interest & Landmarks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Water Canal"], "hours": "12:00 AM - 11:59 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/16/21/45/fe/let-this-dusk-invite.jpg"]}
{"name": "Dubai Marina Yacht Club", "description": "Set in one of Dubai's most vibrant residential areas Dubai Marina is spread over a 3.5Km canal. Comprising of 500 sheltered berthing spaces Dubai Marina is the largest Marina in the Middle East. A prestigious 5 Gold Anchor Award winning marina recognised for the quality of services and facilities. Also winner of Boat Owner Middle East Awards Leading Marina, 2013. Dubai Marina Yacht Club has become both a Waterfront Destination for residents and tourists alike and a Boaters Haven.", "category": "Marinas", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Marina Yacht Club"], "hours": "7:00 AM - 7:00 PM", "duration": "", "address": "Al Hubob St Vida Dubai Marina, Dubai 32923 United Arab Emirates", "neighborhood": "Neighborhood: The Marina", "rating": 0, "getting_there": ["Jumeirah Lake Towers â\u0080¢ 4 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/06/d6/62/e4/dubai-marina-yacht-club.jpg"]}
{"name": "The Green Planet", "description": "The Green Planet is the regionâ\u0080\u0099s first bio-dome that recreates the enchanting world of a tropical forest with its rich biodiversity of over 3,000 plants and animals. The enclosed ecosystem, located at CITY WALK, offers visitors an immersive expedition into the tropics. The unique venue has 4 levels of interaction for visitor with fascinating animal and plant species to see from Sloths, Tucan's and Tree porcupines to South American plants, vines, reptiles, fish and insects. A great destination for families and guests of all ages.", "category": "Nature & Wildlife Areas Zoos", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "The Green Planet"], "hours": "10:00 AM - 6:00 PM", "duration": "Duration: 2-3 hours ", "address": "", "neighborhood": "Neighborhood: Al Satwa", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Best birthday venue", "review": "We hosted my sons 7th birthday at Green Planet and it was AMAZING. The kids had a so much fun! If your kid loves animals this is an amazing place to visit. The best was Joy and Hershey who were so good with kids, so knowledgeable about the animals kept everything moving so smoothly. (Thank you ladies!) Highly recommend.", "rating": 5.0, "visited": "October 2023"}, {"title": "Worth doing but doesnâ\u0080\u0099t last long.", "review": "Great interactions with the animals and a fab concept. Would have given 5 stars but I was a bit disappointed that it wasnâ\u0080\u0099t a longer activity: we didnâ\u0080\u0099t rush through at all but weâ\u0080\u0099re still only in the biome about an hour. There is a new play area outside but despite being covered it was still too hot for the kids to play for long.", "rating": 5.0, "visited": "October 2023"}, {"title": "Interesting place", "review": "A building in which a tropical forest is recreated, populated with many exotic animals and birds. The animals are basically domestic, they are not afraid of visitors at all and many of them walk freely among them. However, you are not allowed to touch them in any way, not even to pet them. During the visit, you can even witness the feeding of some of the animals. You can spend 1-2 very pleasant hours here.", "rating": 5.0, "visited": "October 2023"}, {"title": "Birthday party at Green Planet", "review": "Ms Hershie and Ms Franchelle did a fantastic job to host our daughterâ\u0080\u0099s birthday party. It included a tour through Green Planet. The kids loved it. Thank you again for a great day", "rating": 5.0, "visited": "November 2023"}, {"title": "Beautiful planter", "review": "We visited green planet during our holidays in Dubai. It was really beautiful, surreal and interactive being here with all birds and animals roaming freely inside without being caged. We loved it here. One of the highlights of our Dubai holidays. Must visit if you have young kids with you.", "rating": 5.0, "visited": "November 2023"}, {"title": "Not for Disabled Persons", "review": "We had to leave the wheelchair behind as the place is not designed to hold disable people. Which you can figure out how our tour had to finish fast. The scenery is beautiful and very refreshing even to grownups. But tiny area to pass between crowds! Despite the above circumstances it is a great place for families.", "rating": 5.0, "visited": "June 2023"}, {"title": "Great Attractions for all ages !", "review": "My daughter aged 23 wanted to visit so we went as 4 adults ! This is a unique experience which I would say is a great place to visit for people of all ages. We did the complete experience in around an hour which was more than enough time for adults. If you have children below the age of 11 then it will take much longer as there are several play areas that will draw them in - activities in the attraction. You arrive and go up in the lift to the top of the building and then gently walk around the building descending visiting various habitant for different animal species. It unusual to be able to get so up and close to the birds which was a major advantage of this experience. There are two cafe / snack bars on on which is situated in the childrenâ\u0080\u0099s play area.", "rating": 5.0, "visited": "January 2024"}, {"title": "Nature in its diversity", "review": "Truly a learning curve for children by observing and interacting with some of nature's wonders. The foliage, natural habitat, birds, animals and creatures were an eye opener for everyone including the grandparents!! Really a fantastic achievement in this part of the globe but not really surprising anymore seeing other theme related places in the same country. Nice short outing within the city limits.", "rating": 5.0, "visited": "January 2024"}, {"title": "Great Experience for whole Family", "review": "We enjoyed visiting the place very much. We could have spent the whole day here if we could. So much to see for a small place. We were just before the tropical rain and seeing the animal enjoying the rain was great. They have no care in the world, we felt like we were in the wild. Saw lemur â\u0080\u009cstealingâ\u0080\u009d the tortoise food. He went around stole every other animals food. Too funny.", "rating": 5.0, "visited": "February 2024"}, {"title": "Great up close experience", "review": "Great for kids and adults alike. The biosphere itself was an experience like no other. Better than any zoo. Getting close up with animals like you wouldnâ\u0080\u0099t get anywhere near else, particularly the UK. Itâ\u0080\u0099s quite small and will only take around 45 mins if that, but well worth it for the experience. Only in Dubai would you get something like this.", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1d/1f/e9/b2/visit-us-and-experience.jpg"]}
{"name": "Dubai Metro", "description": "", "category": "Taxis & Shuttles", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Metro"], "hours": "", "duration": "", "address": "", "neighborhood": "", "rating": 0, "getting_there": ["Nakheel â\u0080¢ 1 min walk"], "top_reviews": [{"title": "Excellent", "review": "Really great and affordable way to get around the city. Surprisingly long ride from Dubai Marina to the Burj Khalifa and even further to the Gold Souk, but great value at c.Â£5 each per day (standard ticket) and c.Â£10 a day Gold Class. Definitely worth upgrading if you need a seat during busier times. Puts the London Underground and the Paris Metro to shame. Excellent!", "rating": 5.0, "visited": "November 2023"}, {"title": "Connects to the Major Attractions", "review": "We stayed near the red line and found it very convenient to get to where we needed to go and had planned for. There are a variety of ticket options and they cost 6 AED to 8 AED depending on the zone you are traveling too for a single journey. You can get a day pass for 22 AED that covers all zones and the tram line and we used this which we felt saved us a lot of money that would have been spent on Uber. There is a gold card available that costs twice as much and the seats are larger and the car is separate. There is also a separate car for women but my wife had no issues with the regular car until the evening when it was overcrowded but the women car also got pretty packed too. We rarely got a seat but found that the metro was smooth enough to stand on. The metro has plans to expand and hopefully soon as it seems near its limit most of the time for passengers. We were able to get on the first train most of the time but we didn't make it on once due to crowding and recall a few stations where people couldn't get on our train in the evening. The stations were easy to navigate but they could use more ticket machines during peak times. It is important to note that the metro only goes to DXB airport terminal 1 and 3 but there is a free shuttle that can take you to terminal 2. The metro is separate from the Palm Island monorail and that monorail has a pricey ticket. The metro is open until midnight most nights and 1:00 am Friday night.", "rating": 5.0, "visited": "November 2023"}, {"title": "Cheap way to get around - but not if you're claustrophobic", "review": "Fast and modern Metro system to see all the major Dubai points of interest. Buying a Nol Card is easy and can be reloaded as needed for fares. Mostly laid out on an East to West route (Red Line) and a SE route (Green Line). Stations are clean and signage is easy to follow. ***Note - the Metro is usually very crowded. Not recommended for people who are claustrophobic because the trains are congested with riders, especially on the Red Line during Rush Hours.", "rating": 5.0, "visited": "November 2023"}, {"title": "Excellent method of transport - if you are a woman!", "review": "Fast, cheap, well placed stations and everything you want from a metro (although overground, not a subway). However, like all big cities it gets uncomfortably crowded at and around the peak times. I was fortunate that, being female, I could enter the quieter Woman & Children cabins and most often get a seat even when a busy time. Would have been a nightmare otherwise. I do also like how Dubai metro stations with there large black/gold tunnels outside are very easy to spot even from a distance. Better than looking out for a small 'M' sign for sure!", "rating": 5.0, "visited": "November 2023"}, {"title": "Really convenient", "review": "Really easy to use and clean. If a female and travelling alone or with friends / children you can use the women and children cabins (no men allowed). Gets really crowded around rush hr but trains almost every minute", "rating": 5.0, "visited": "January 2024"}, {"title": "Loved it so much.", "review": "The first thing we did was getting the RTA cards and it's so convenient to use the metro. Can get very busy at times and that's something I love about the hustle. The stations and the trains are very clean and the stations have convenient stores too. Saves you a lot of time and money to get around Dubai. Very very convenient.", "rating": 5.0, "visited": "February 2024"}, {"title": "Good enough to travel along the shore line, but you'll need other modes to access inner city", "review": "It's the only metro available in the city. It's good to travel with, it's connected along the shore of Dubai. It has major stops around the entire metro line. It's a good initiative by the UAE Government to improve public transport", "rating": 5.0, "visited": "June 2023"}, {"title": "Great way to get around Dubai", "review": "This is a cheap, clean and efficient way to travel around parts of Dubai, including to and from the airport. The metro does get extremely busy around peak times so an upgrade to a gold ticket is worth it if you can afford it. It also offers great views of the skyline, in particular DIFC.", "rating": 5.0, "visited": "March 2024"}, {"title": "Way to travel as a tourist.", "review": "For tourists this is the best and cheapest way to get around in Dubai. Make no mistake the carriages can be packed at peak hours. Trains is on time and clean. Free wifi is also available on all trains.", "rating": 5.0, "visited": "March 2024"}, {"title": "Excellent metro service", "review": "With the metro I did visit the GITEX 2023 event in World Trade Center in the week of October 16-23. Very convenient metro line, which has a stop at World Trade Center right in front of the event. Leave your car at home and use the public transport to attend big events in Dubai.", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/2a/f6/25/metro-dubai.jpg"]}
{"name": "Bur Dubai Abra Station", "description": "", "category": "Piers & Boardwalks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Bur Dubai Abra Station"], "hours": "12:00 AM - 11:59 PM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Deira", "rating": 0, "getting_there": ["Al Ghubaiba â\u0080¢ 5 min walk", "Al Ras â\u0080¢ 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/14/8b/8f/29/dubai-creek-largejpg.jpg"]}
{"name": "Dubai Frame", "description": "The UAEâ\u0080\u0099s latest cultural landmark, Dubai Frame is an iconic structure that â\u0080\u0098framesâ\u0080\u0099 impressive views of Old and New Dubai, while serving as a metaphorical bridge connecting the emirateâ\u0080\u0099s rich past with its magnificent present. Dubai Frame celebrates the story of Dubai from its early establishment to its ambitious plans for future development. Launched in January 2018, the project comprises a 150-metre-high, 95-meter-wide structure being built to resemble a huge picture frame, through which landmarks representing modern Dubai such as Emirates Towers and Burj Khalifa can be seen on one side, while from the other side, visitors can view older parts of the city such as Deira and Karama. Exterior design of Dubai Frame was inspired from the logo of EXPO2020 and it is world's largest picture frame by Guinness World Records. According to Dubai Frame general policy, guests are requested to wear respectful clothing: shoulders and knees to be covered.", "category": "Points of Interest & Landmarks Architectural Buildings Observation Decks & Towers", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Frame"], "hours": "8:00 AM - 9:00 PM", "duration": "Duration: 1-2 hours", "address": "", "neighborhood": "Neighborhood: Bur Dubai", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Great views", "review": "Neat, slim, high, perfect and simple architectural design. Not far from other attractions (Burj Khalifa, Museum of the Future) and reasonably priced fee at dhs 49 (USD 13.5). Less waiting time, and beautiful views from the top, specially to watch sunset. A one-time visit site", "rating": 5.0, "visited": "October 2023"}, {"title": "The Frame", "review": "Glad we did it. short and sweet, tick off the list of things to do in Dubai. Probably a â\u0080\u0098once youâ\u0080\u0099ve done it, you wouldnâ\u0080\u0099t do it againâ\u0080\u0099 type of place. Great views of The Burj and the forever growing city. Friendly staff and well managed queuing up lifts etc.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great", "review": "I purchased skip the line tickets from a tour operator but did not receive them. The staff at The Frame were amazing! After explaining that they donâ\u0080\u0099t have fast track, they contacted the seller, sorted our entry and even let us go straight through. I canâ\u0080\u0099t praise them enough. The Frame is well worth a visit, we really enjoyed it.", "rating": 5.0, "visited": "November 2023"}, {"title": "You must visit Dubai Frame ð\u009f\u0091\u008c", "review": "Patience is a virtue when you are visiting Dubai Frame during peak hours, it was indeed worth the wait. We are queueing for more than 40 minutes just to reach the top floor. When reaching the top view, you will see the landscape of new Dubai and Old Dubai and you will walk on the glass bridge. On the top floor, we don't have family photos taken on our mobile at the glass bridge due to the big crowd, luckily there's a photographer who approached us to take a family photo... the photo was a bit expensive but worth buying for the family souvenirs. And the staff are all friendly especially the staff at photo souvenir they give us a good price to take home our memorable photos . I asked one of the staff regarding the best time to visit without that much queuing, he said from 9 to 10 AM and evening from 7 to 9 . ( Dubai Frame timings from 9:00 AM to 9:00 PM) Overall it was an amazing experience. Highly recommended to visit.", "rating": 5.0, "visited": "November 2023"}, {"title": "Great experience my family really enjoyed â\u009d¤ï¸\u008fð\u009f\u0098\u008dð\u009f\u0098\u008dð\u009f\u0098\u008d", "review": "This 150 m building in the shape of a frame is a nice attraction to do in Dubai. For 50 AED, you get access to the top floor to enjoy a stunning view over the city skylines. There is also an entertaining opaque glass floor that becomes transparent when touched and give you a scare. Highly recommended!", "rating": 5.0, "visited": "November 2023"}, {"title": "Iconic Landmark", "review": "This has become an iconic landmark, besides the Burj Al Arab and the tall Burj Khalifa. Very popular attraction as well. It is either you come early or late to avoid long tourist lines. At the topmost you can have views of old and the new of Dubai. Visit can last an hour as staying longer might be a bore. Outside , look for photo ops ideal to your setting. It is my 2nd visit , and it is still fine with me.", "rating": 5.0, "visited": "November 2023"}, {"title": "Worth to visit", "review": "A very beautiful view of the city from the top of the frame. Never thought from the outside that people can go to the top of this frame and also walk looking directly below via a transparent floor. The area surrounding this frame is very well maintained and it's a good place to click beautiful picturespictures.", "rating": 5.0, "visited": "September 2023"}, {"title": "Definitely worth visit", "review": "Ticket was quick to get but there was a long queue to get inside. Staff were extremely friendly and helpful. Definitely worth visiting. If you are scared of heights definitely not one for you. Enjoyed walking on the glass and looking down amazing views all round.", "rating": 5.0, "visited": "November 2023"}, {"title": "Far better than the Burj", "review": "Whilst the Frame is not as high as the Burj Khalifa nor affords as good views, it is a fraction of the price and you will not have to wait so long to get in and it is not as overcrowded. We did have to wait in the queue for about 40 minutes before we walked through the UAE in the past mini history tour, but when you don't have a time slot booked I guess you Kind of have to expect this. Views were great from the top, transparent walkway was cool and it wasn't overcrowded. Unlike the Burj you can see outside from the lift as you ascend. The UAE future 360 show at the end was very cleverly done. Whole thing including queueing probably took about 2 hours. Very nice gardens etc outside. Easy to access off stop 15 on the Big Bus Tour.", "rating": 5.0, "visited": "November 2023"}, {"title": "The view from the top of the frame is very, very beautiful.", "review": "Very nice.. and organized.. and they deal respectfully with visitors. The view from the top of the frame is very, very beautiful. Entrance price for adults is 50 dirhams and 20 dirhams for children Its height is about 150 metres Entry is through Zabeel Park Gate No. 4", "rating": 5.0, "visited": "December 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/12/07/8e/6d/dubai-frame-main.jpg"]}
{"name": "Burj Khalifa", "description": "Standing over 2,700 feet and 163 floors high, this record-breaking skyscraper in downtown Dubai is the tallest structure in the world. Burj Khalifa has several open-air viewing decks and swanky lounges which offer splendid views of the UAE and the Persian Gulf. The highest lounge is located at level 154, and there is even a hotel at levels 38 and 39. Designed by Skidmore, Owings & Merrill architects, this mixed-used development atop Dubai Mall is inspired by the Great Mosque of Samarra in Iraq. You might want to buy skip-the-line tickets or join a tour to avoid snaking queues at this popular attraction in Dubai. â\u0080\u0093 Tripadvisor", "category": "Architectural Buildings Observation Decks & Towers", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Burj Khalifa"], "hours": "12:00 AM - 11:59 PM", "duration": "Duration: More than 3 hours", "address": "1 Mohammed Bin Rashid Boulevard Downtown Dubai, Dubai 9440 United Arab Emirates", "neighborhood": "Neighborhood: Downtown Dubai", "rating": 0, "getting_there": ["Burj Khalifa/Dubai Mall â\u0080¢ 9 min walk"], "top_reviews": [{"title": "Family viewing", "review": "We bought our ticket on-line in the UK and went for a viewing for the 124/125 floors for a time before 3:00 pm (?) because after that time the price went up. If you use public transfer to get to it and get off at Burj Khalifa/Dubai Mall metro stop, you should be aware that the station is about 10-15 walk away from the actual mall but the walkway is under cover with a/c. Buying our ticket in advance and arriving at the set time allowed us just to walk in with no real queues for the very fast, quite cool lifts. There lots of official picture opportunities there with artificial backgrounds put on them but at the cost of Â£50 for a photo I thought it was extortionate. At the top there are obviously lots of people doing selfies and taking pictures and I thought the viewing decks would be a bit bigger but you do get a great view of Dubai. There is a usual gift shop at the top with a very small , expensive drinks/cake place.", "rating": 5.0, "visited": "August 2023"}, {"title": "A sight to see", "review": "A great way to see the city although it would be more spectacular if it was a clear day (not that common in Dubai due to the haze). Well run and only took about 10 minutes in the line to get into the elevators and up to the 124th/125th floor. The 360 views of Dubai are a sight to see. Lots to see and buy at the top. A well oiled machine to get you up there. We used the Dubai Go City pass and that got us straight in without having to book a time. Well worth a visit.", "rating": 5.0, "visited": "September 2023"}, {"title": "Incredible views of Dubai", "review": "Absolutely amazing experience to see Dubai from above. Youâ\u0080\u0099ll get views of the incredible buildings, fountains below, the coast and vast dessert where construction is ongoing. It is something you have to try once in your life. It was even more special to do this on our honeymoon and my birthday. We did a sunset ticket which is more expensive but worth it when you get to see the view by dusk and night with all the lights. If you are scared of heights (I am), trust me when I say that it actually feels okay.", "rating": 5.0, "visited": "September 2023"}, {"title": "A must-see experience", "review": "One of the top things to do in Dubai. A wonderful attraction. Very slick with staff organising visitors so all runs efficiently. Be prepared for a wait at peak times (2 hour wait even in Autumn). Book in advance. We booked online and received seamless service. Photos can be pricey but itâ\u0080\u0099s par for the course with similar experiences. Gift shop is well stocked. If you get the opportunity try the virtual reality experience it is hilarious", "rating": 5.0, "visited": "October 2023"}, {"title": "Fantastic VIP Experience!", "review": "We decided to book the VIP lounge at the Burj Khalifa - everything was swift. VIP lounge very welcoming staff, food very lovely. Photographers friendly and got some lovely photos. The viewsâ\u0080¦. Just wow! We chose sunset and this was a perfect choice. Thank you for our great experience visiting the worldâ\u0080\u0099s tallest building!", "rating": 5.0, "visited": "October 2023"}, {"title": "Dubai from the top", "review": "Ticket to access floors 124 & 125 is dhs 149 (USD 41) if booked in advance, which is highly recommended. Nice views from the top (if you fancy concrete jungle), overpriced photo-services, and I would is say the entrance fee is exaggerated as well. The tower is in Dubai Mall with a fountain show that runs for 5 minutes with an interval of 30 minutes. Donâ\u0080\u0099t miss it since you are there.", "rating": 5.0, "visited": "October 2023"}, {"title": "The views are amazing but be aware of timings.", "review": "There is no denying that the views from the top are breathtaking. We decided to pay extra to go to 154, we booked for 5pm so that we could see the views in daylight then watch the sunset and see the Dubai at night. We thought we had booked, expensive but once in a lifetime, tickets. On arrival we joined the queues with everyone else - it transpires the online booking is merely a booking confirmation, you have to queue to get physical tickets. Once these were obtained we were given a VIP sticker denoting that we were going all the way up and shown into a side waiting room, where we waited, and waited. There was no information forthcoming and time was passing. Eventually our guide appeared and as we were lead through security and a myriad of corridors we were given the history of the building - all very interesting had we not wanted to see the views in daylight. Yes the lifts are very quick but it was nearly 6 before we actually made it to the top by which time the sun was already going down. For such an expensive and supposedly luxury experience the organisation and communication were very sadly lacking.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great view", "review": "Took about 15 minutes to walk from the taxi stand outside the mall to the entrance and then about 30 minutes to get to the elevator. The view was good although a little hazy that day. We could see the funnel of the QE2 in the port, the sail shaped hotel by the water and the desert. Small shop at top was busy but when you go back down there's a much bigger shop at the bottom. We only went to 124125.", "rating": 5.0, "visited": "September 2023"}, {"title": "beautiful experience", "review": "Beautiful, stunning experience and very welcoming staff. we paid VIP and had the pleasure to skip the queue. the lift was amazing as well! once you get to the top floor, it was breathtaking, stunning view and amazing staff", "rating": 5.0, "visited": "October 2023"}, {"title": "Top of the world.", "review": "I was a little nervous about going up in a lift so high but my nerves were unnecessary as you really didnâ\u0080\u0099t feel the lift moving. Once at the top, well floor 124, the views were amazing especially as it was particularly clear. I would definitely recommend a trip up the Burj Khalifa just remember to buy your tickets in advance!", "rating": 5.0, "visited": "October 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/f3/49/93/photo5jpg.jpg"]}
{"name": "Dubai Tram", "description": "", "category": "Trams", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Tram"], "hours": "", "duration": "Duration: < 1 hour", "address": "", "neighborhood": "Neighborhood: Al Garhoud", "rating": 0, "getting_there": ["Sharaf DG â\u0080¢ 7 min walk"], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/e7/18/c8/caption.jpg"]}
{"name": "Mall of the Emirates", "description": "This massive mall has a mix of luxury labels like Christian Louboutin and midscale brands like DKNY. Itâ\u0080\u0099s also home to hotels, restaurants, theaters, and the indoor ski resort Ski Dubai.", "category": "Shopping Malls", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Mall of the Emirates"], "hours": "10:00 AM - 12:00 AM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Al Barsha", "rating": 0, "getting_there": ["Mall of the Emirates â\u0080¢ 3 min walk"], "top_reviews": [{"title": "Amazing Mall to visit", "review": "This Mall is huge and has so many shops you should find what you are looking for. Even an indoor ski field with chair lift. You could spend an entire day walking around this Mall. Lots of eateries on every level is a bonus.", "rating": 5.0, "visited": "September 2023"}, {"title": "Mall that Caters to Everyone", "review": "This is just like itâ\u0080\u0099s counterpart the Dubai Mall , the difference is that it opened first , making it a little on the dated side. But the enormous choices that it offers , caters to every type . From fast food to casual restaurants, from low to high end luxury brands ( Dubai Mall has the edge on this one with its Fashion boulevard) . It has a snow skating amusement park , and even a huge Carrefour supermarket. It even has cinemas as well .", "rating": 5.0, "visited": "November 2023"}, {"title": "Very Nice Mall", "review": "This mall is quite grand with plenty of shops and things to do. My wife and I spent 4 hours here window shopping and looking around. The Ski Dubai is interesting enough and worth a quick look. The mall is well appointed and many major brands are here including quite a few good restaurant chains. The prices were pretty decent compared to other malls we've been to in the middle east. We also got a little sidetracked looking at Christmas decorations that were scattered throughout the shops. The mall is located on the red line at the Mall of the Emirates Metro stop. It takes a while to get around the mall but thankfully the signage is decent.", "rating": 5.0, "visited": "November 2023"}, {"title": "HUGE mall with over 600 shops", "review": "My 2nd time to this huge mall but the biggest highlight in my opinion is the penguin experience within ski dubai, yes expensive but if you love penguins this is the place to go. Besides that I don't think there's nothing this mall doesn't have under its roof. Direct stop off the metro. Make sure you give yourself hours.", "rating": 5.0, "visited": "November 2023"}, {"title": "Nice mall", "review": "A fairly large mall. The central part is impressive, with the dome on the metal skeleton. What makes it really special is the fact that it houses Ski Dubai, a place where you can ski in the heart of the desert. Otherwise, an ordinary mall, with dozens of shops of all kinds, the fast food area, restaurants.", "rating": 5.0, "visited": "November 2023"}, {"title": "Collectibles Paradise", "review": "NE is a collectorâ\u0080\u0099s dream come true! The selection of rare items, such as the sheer selection of Bearbrick figures, is simply extraordinary. NEâ\u0080\u0099s curation of these collectibles showcases a passion for unique and exclusive pieces. The store is a must-visit for collectors seeking treasures that stand out from the ordinary", "rating": 5.0, "visited": "December 2023"}, {"title": "Smaller than Dubai Mall", "review": "Mall of the emirates is smaller than Dubai mall, but you will enjoy yourself more in my opinion. Ski Dubai is located inside the mall as well as many restaurants and shops to keep you busy for ahalf a day. Definitely worth the trip.", "rating": 5.0, "visited": "December 2023"}, {"title": "Mall of the Emirates stands as an ultimate haven for shoppers!", "review": "Mall of the Emirates stands as an ultimate haven for shoppers! The incredible variety of stores, encompassing high-end luxury fashion to affordable options, electronics, and more, is truly astonishing. The mall's expansive, pristine, and well-maintained environment, coupled with friendly and helpful staff, enhances the overall experience. With a diverse food court offering various cuisines and numerous entertainment options, including the must-visit Ski Dubai featuring the possibility of encountering penguins, the mall becomes a fantastic destination for a comprehensive shopping, dining, and entertainment experience.", "rating": 5.0, "visited": "January 2024"}, {"title": "it's a must-visit spot in Dubai", "review": "Yesterday, I had the pleasure of visiting the Mall of the Emirates, and it proved to be a delightful experience. The mall boasts numerous brand outlets and a diverse food court offering a variety of cuisines, making it an ideal destination for quality time with family and friends. Undoubtedly, it's a must-visit spot in Dubai, especially following a visit to the Dubai Mall.", "rating": 5.0, "visited": "January 2024"}, {"title": "My 2nd favorite mall in dubai", "review": "Mall of Emirates is my absolute favorite mall. Mostly because it has Carrefour supermarket! Love everything about it. For fun family activities, almost everything is located within. Ski sites dubai, the Ice rink, food court, designer/luxury and ofcourse various discounts at all times. My 2nd favorite malls of now", "rating": 5.0, "visited": "January 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/09/f5/9b/9c/mall-of-the-emirates.jpg"]}
{"name": "LEGOLAND Dubai", "description": "LEGOLANDÂ® Dubai is the ultimate world of year-round LEGOÂ® theme park adventures for families with children aged 2-12. It will feature over 40 interactive rides, shows and attractions and 15,000 LEGOÂ® model structures made from over 60 million LEGOÂ® bricks. LEGOLANDÂ® Dubai will feature six themed lands - LEGOÂ® CITY, ADVENTURE, KINDGOMS, IMAGINATION, FACTORY and MINILAND - each unique in their design, entertainment and playful learning experience.", "category": "Amusement & Theme Parks", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "LEGOLAND Dubai"], "hours": "11:00 AM - 6:00 PM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Jebel Ali", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Must do if you are in Dubai and love Lego", "review": "Every place I travel I look for a Legoland near so when I went to Dubai I decided to visit place. And I love it, the mini city is breath taking, the attraction are fun, the installations are nice, I bought a lot of Lego's for me in the big store, the staff is really kind and welcoming. Totally worth it, sure I'll be back again!", "rating": 5.0, "visited": "October 2023"}, {"title": "Lovely", "review": "A five year relationship with Legoland dubai will never be a worth mentioning one. Special mention is ms tatu at the Legoland restaurant . A friendly person and smiling face. A feel good for every guest... Always would love to be here", "rating": 5.0, "visited": "October 2023"}, {"title": "Birthday Celebration at Legoland!", "review": "Because we stayed at Legoland Hotel and just after reviewing it, Ofcourse I'll review this one too! When we went here on October it was less crowded and everything was toddler friendly. We celebrated our son's birthday here and he had a blast! He wont stop talking about it and that only means that he had the best time of his life! It was our first time here and the tall dark gentleman at the entrance who's name started with letter K (I forgot to write it down lol) made sure that we're well informed about the timings and location of the rides. I love that he was very patient and took his time explaining the whole ordeal. We were lucky to say the least. All the rides were fun and spent our whole day there. We unexpectedly bought alot of lego pieces and that was expected because it was Legoland. 10/10 recommend and definitely coming back because our toddler keeps mentioning this place atleast 5x a day. Haha", "rating": 5.0, "visited": "October 2023"}, {"title": "Fantastic", "review": "We were really fortunate that we visited on a seemingly quiet day other then school trips so we walked onto pretty much every ride within a few minutes. It did feel if Iâ\u0080\u0099m honest the shop/restaurant to ride ratio was really high. That said we enjoyed the rides/attractions My personal highlight was the miniature area where the Buildings are truly outstanding. We completed in 2-3 hours at no great rush but it was empty.", "rating": 5.0, "visited": "October 2023"}, {"title": "Legoland Park: A Colorful Paradise for Lego Lovers!", "review": "Legoland Park is a must-visit for Lego lovers! While it's primarily for children, I had a great time snapping pictures and exploring the Mini Land. The attention to detail is spot on, and the park offers something for everyone. The staff was friendly and helpful, making the experience even more enjoyable. If you're a fan of Lego, don't miss out on this fun and vibrant park!", "rating": 5.0, "visited": "November 2023"}, {"title": "Excellent kids attraction", "review": "Excellent place for young kids. Itâ\u0080\u0099s fun for families as well. The location is slightly away from Central Dubai hence you need to plan your day accordingly. Take only one ticket per day to enjoy the rides. Combined tickets for two attractions in one day will be a waste.", "rating": 5.0, "visited": "November 2023"}, {"title": "Best Ticket Advice from Fatima Mohammed", "review": "It was funny how we ended up in Legoland.. we were heading to Motiongate. The taxi dropped us to Legoland gate turns out they both are in the same area, not a knowledge I knew of. So I was lost what to do and decide between both .. the ticket officer Fatima Mohammed made my decision easier and was so grateful. She told me about the hopper ticket and plus a GCC discount, that I may gain from downloading an app etc.. ticket price became more affordable and less than a 100 drhams Addition to the 1 day leagoland ticket pass. So grateful to her and a very successful experiment for me and my kid. Plus had time to do both parks since our time was not a peak season.", "rating": 5.0, "visited": "October 2023"}, {"title": "Legoland Christmas and Snow", "review": "Once again, Totally Awesome. Christmas is here and the tree is up together with snow in the desert. Ate as usual at Caesars Pasta where the staff are so lovely with children. In particular Shaz and Lily who despite the thousands that visit, have made a point to remember childrenâ\u0080\u0099s names. Our son Zach loves the restaurant not just because of the delicious pizza but the two ladies that remember his name. Hats off to Bolaji who as one of the management team, has provided our son with high fives whenever seen Fantastic park!! Quite simply you have to visit.", "rating": 5.0, "visited": "December 2023"}, {"title": "Great day out", "review": "I had read the reviews before coming so didnâ\u0080\u0099t have high expectations but we had a wonderful time. We had 4 kids between 5 and 11 and they all had something to keep them busy. We spent a few hours the first night then a good 5 hours the next day (we had unlimited entries to the parks over three days). Queues were non-existent so we were able to go on the good rides many times and the kids had an awesome time. Fun day out!", "rating": 5.0, "visited": "December 2023"}, {"title": "Amazingly Great as long as you are not on the short end !", "review": "LegoLand was so fun! We had an amazing time, the rides are all kid friendly. My only issue with the entire thing is that the height limit for rides tends to be 90cm. I would advise you measure your kid in advance before going specifically for the kid in question to Motiongate and LegoLand. I would say the kids should be approximately 3 years or so to enjoy the theme park. Nontheless there are other options for the smaller ones(not as many) and fun for the kids and adults. The attention to detail is astounding! There is a mini world section. I love the theme, there is play areas for smaller ones and rides which the smaller ones can go on with parents. There are great restaurants and food stalls available. I did not stay at the hotel we stayed at Lapita which is nearby as well. We did not have many queues because we went around the 18th December but I am sure closer to Christmas would be much busier.", "rating": 5.0, "visited": "December 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/ad/1f/60/caption.jpg"]}
{"name": "The Lost Chambers Aquarium", "description": "The largest Aquarium in the Middle-East and Africa! Lost for thousands of years deep beneath the sea, the ancient ruins of the lost city of Atlantis have finally been uncovered. Come live out your own Atlantean adventure at The Lost Chambers Aquarium home to 65,000 incredible marine animals. Explore the underwater mazes and tunnels of this lost civilization while encountering sharks, eels, seahorses and piranhas. There are over 20 impressive marine life exhibits including a touch tank and our interactive Aquatheatre show.", "category": "Aquariums", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "The Lost Chambers Aquarium"], "hours": "10:00 AM - 9:00 PM", "duration": "Duration: More than 3 hours ", "address": "", "neighborhood": "Neighborhood: Palm Jumeirah", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Coffee, breakfast, and sharks!", "review": "The \"Ambassador Dive\" is a laid-back underwater adventure for all types of divers. It's like a chill 50-minute hangout with loads of tropical fish, rays and sharks! A perfect way to kickstart your day.", "rating": 5.0, "visited": "October 2023"}, {"title": "Once in a lifetime, do it", "review": "It was amazing to do both the Aquatrek Xtreme followed by Dive Discovery. You are accompanied by two pro divers. I was a bit scared for the first few minutes but diver Joel was seasoned enough to sense that proceed with the full dive of ~31ft for around 27 mins before my o2 started to near low. The dive chamber is induce the Atlantis aquarium with the Atlantis theme. People can see you from the large glass walls of the aquarium! simply put once in a lifetime experience for this who want to have a taste of diving. Thanks to the Joel and the dive crew.", "rating": 5.0, "visited": "October 2023"}, {"title": "Exceptional", "review": "As far as aquariums go this is exceptionally clean and all the fish look happy with plenty of space. The main tank is magical. We took our time and went through some sections twice but we was done within an hour which was disappointing", "rating": 5.0, "visited": "October 2023"}, {"title": "Atlantis Aquarium!! must to take the fish tales tour ð\u009f\u0091\u0086", "review": "Wowww so amazing!! You need to book the fish tales tour with Dan. You get so many insides about the aquarium.. Number of animals in the tanks, food per day, team size and you can see baby sharks and heaps of jelly fishes. It is a fun tour with a huge learning effect for both kids and adults ð\u009f\u0091\u008c Again, thx to Dan!!!!", "rating": 5.0, "visited": "October 2023"}, {"title": "Amazing!!", "review": "We did the fish tales tour. It whorthed every minute! Charles guided us throughout the chambers and curious data about the sea life, reproduction, among other things that makes total difference during the tour. We visited the sharks, jelly fish nursery, itâ\u0080\u0099s so interesting!", "rating": 5.0, "visited": "November 2023"}, {"title": "Interesting design", "review": "The layout is original and interesting. It makes you feel like you're in a sci-fi movie, as if you're expecting an alien to appear around the corner at any moment. Personally, I liked it more than Dubai Aquarium & Underwater Zoo. Quite crowded. It is strange that in the description it is said that it is \"the largest Aquarium in the Middle-East and Africa\". It didn't seem very big to me and not bigger than Dubai Aquarium & Underwater Zoo. You need about an hour to visit it.", "rating": 5.0, "visited": "October 2023"}, {"title": "A day at the lost chamber!", "review": "Den took the time to explain to us all the details about the way the aquarium operates the number of species and the process! So knowledgeable and enthusiastic about the work the team does! We were impressed with the amount of species and the cleanliness of the place!", "rating": 5.0, "visited": "November 2023"}, {"title": "Fish Tour", "review": "We had a very good time during our Fish Tour with Den at the Lost Chamber Aquarium. Den was full of energy and knowledge about the marine life and the fishes that resides in the aquarium. Would definitely come back again when Iâ\u0080\u0099m back in Dubai.", "rating": 5.0, "visited": "November 2023"}, {"title": "Diving in The Lost Chambers aquarium", "review": "Signed up for diving in The Lost Chambers aquarium and it was a very pleasant and amazing experience. Full diving equipment is available and it is well taken care of. Instructor Fabian is very clear on dive plan and help us out, in case we found difficulty in the water. Overall, very very good experience except that the sharks are mostly shy with the divers", "rating": 5.0, "visited": "November 2023"}, {"title": "AquaTrek at Atlantis", "review": "AquaTrek was an amazing experience! Highly recommend to anyone visiting Dubai. Airen was our instructor and she was absolutely brilliant! All the staff took great care of us and are very professional. And a special thank you to Lorraine who went above and beyond! Thank you for an unforgettable experience!", "rating": 5.0, "visited": "November 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/60/d6/81/ambassador-lagoon-at.jpg"]}
{"name": "Bla Bla Dubai", "description": "21 Bars, 3 Cuisines, 1 Beach Club in one unique venue. Offering a day-to-night experience with a breathtaking view of Bluewaters and The Dubai Eye. Located at The Beach, JBR. Under 21 allowed in the restaurant only from 8am to 5pm.", "category": "Bars & Clubs Beach & Pool Clubs", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Bla Bla Dubai"], "hours": "12:00 AM - 3:00 AM, 10:00 AM - 11:45 PM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Jumeirah Beach Residence (JBR)", "rating": 0, "getting_there": [], "top_reviews": [{"title": "A must stop if youâ\u0080\u0099re visiting the Marina!", "review": "Wow! What a wonderful way to spend a day there! Pool, food and music outstanding, the service is next level like all places we went in Dubai! If your staying at the marina a mist stop!", "rating": 5.0, "visited": "September 2023"}, {"title": "5â­\u0090ï¸\u008f", "review": "I was there last Friday the atmosphere was electric and the overall view was very chill , The IT place to be in Dubai .Highly recommend . The Service was amazing all thanks to Vuchko, who was very polite, hostel , and on his top tier to make sure everything was intact. 5 â­\u0090ï¸\u008f for his service!! Very hard working", "rating": 5.0, "visited": "October 2023"}, {"title": "Live Music, Good Food, Choice of Beers", "review": "We were in Dubai for a weekâ\u0080\u0099s break. We like taking a stroll along the Walk at JBR. We have been in Bla Bla a few times now during previous visits. This visit was good too. We didnâ\u0080\u0099t book. Shown to a choice of tables. Service quick for drink but had to attract attention to order food. Music no so good this time, but live music is an attraction. Food was good. Well worth a visit.", "rating": 5.0, "visited": "October 2023"}, {"title": "5 star !!", "review": "I was in Bla Bla on Sat , and the music was amazing!! The food and drinks was out of this world. And the service was one of the best all thanks to Vushko , who was very kind , helpful and positive with a smile . Will definitely visit again.", "rating": 5.0, "visited": "October 2023"}, {"title": "Good live entertainment at Bla Bla", "review": "The service was very friendly, the entertainment by Aston Wylie was very enjoyable. He sang songs from the guests wishlist , really funny and nice . And such a good singer. And the food is good :) We discovered that there even is a club . Next visit we explore the nightclub :)", "rating": 5.0, "visited": "October 2023"}, {"title": "Nice beach club", "review": "Day time review - Good atmosphere, food and drinks was amazing and good service. Would recommend the sushi! Note that make sure you arrive within the 15 minute grace period or they will give away your booking.", "rating": 5.0, "visited": "September 2023"}, {"title": "Favorite place in Dubai", "review": "We booked the VIP table as usual and from the reception to the table was an amazing experience. They cool guy from Russia name Dima was an absolute stunner, he is the reason we booked the VVIP for Vengaboyz event. Kudos to Bla Bla Team ð\u009f\u0091\u008d", "rating": 5.0, "visited": "November 2023"}, {"title": "Favourite lunch spot", "review": "Bla Bla is my favourite lunch spot to go to with my mother. It was the first place to return to after our visit earlier this year. The staff here are all equally friendly and polite - shout out to Tun he is great! Of the many times weâ\u0080\u0099ve eaten here, each time we have left with no complaints. If you are looking for light enjoyable, good quality food with variation this is the place.", "rating": 5.0, "visited": "November 2023"}, {"title": "The party was fantastic, and the music was exceptional.", "review": "\"Windy truly made our night party at Bla Bla Night Club unforgettable! Her exceptional handling that demonstrated professionalism and a keen eye for detail. From start to finish, Windy's energy and expertise added an extra spark to the night. Thank you for making our event a success!\"", "rating": 5.0, "visited": "November 2023"}, {"title": "Best Night Club in Dubai", "review": "Bla Bla is one of the most elegant , casual and incredible nightclub in Dubai. The location is amazing, the staff is wonderful and regardless of the day of the week one will have a great time. The DJ, the music, the bartenders and the entire staff of Bla Bla is amazing. I would like to recognize Mr. Ivan one of the managers for his amazing job with crowd control and following up with all of the guests to make sure they have a wonderful experience. Heâ\u0080\u0099s an example of what a phenomenal leader is. During my last trip in Dubai, I had the incredible experience of visiting Bla Bla on multiple days while I was in Dubai, and have been treated so amazing by the staff, and Mr. Ivan personally making sure my experience was amazing. I Highly recommend this club, to anyone that wants to party in style, casual, classy and an amazing environment in the best location in Dubai the JBR beach!!", "rating": 5.0, "visited": "November 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1c/8d/64/81/bla-bla-beach-club.jpg"]}
{"name": "Al Qudra Cycle Path", "description": "", "category": "Biking Trails", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Al Qudra Cycle Path"], "hours": "", "duration": "", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/10/95/59/b0/al-qudra-cycle-path.jpg"]}
{"name": "At The Top, Burj Khalifa", "description": "Your chance to enter the record books The high point of any Khalifa experience is the view from At The Top observation deck Located on level 124 of the world's tallest tower, this observatory is destined to be the highlight of any visit to the Middle East.the journey to the top, visitors are entertained by a multi-media presentation of the exotic history of Dubai and the marvel of Burj Khalifa.", "category": "Architectural Buildings Observation Decks & Towers", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "At The Top, Burj Khalifa"], "hours": "8:00 AM - 12:00 AM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Downtown Dubai", "rating": 0, "getting_there": ["Burj Khalifa/Dubai Mall â\u0080¢ 10 min walk"], "top_reviews": [{"title": "Topmost Experience", "review": "Noteworthy experience. Ultra fast elevator climb to the 125th floor. At the tallest standing free structure in the world . Lots of tourists. Getting help from our excellent tour guide was definitely a big help. Nice to see some history before the ascent, and showing appreciation to the brains and brawn behind the project , by presenting several galleries. Photo Ops galore.", "rating": 5.0, "visited": "November 2023"}, {"title": "Sunrise Experience for the Wallet", "review": "Going up the Burj Khalifa can be pricey depending on the date and time so the Sunrise + Morning Treat Package was something we chose to save some money. To get to the At the Top area we went to the Fashion Avenue entrance by Cartier at Dubai Mall. The security will open doors for Dubai Mall before 5:30 am and our entrance opened around 5:15 am but we saw people who had gotten up there earlier. Getting here early meant we got an elevator all to ourselves but if we had to wait there were enough things to look at and read in an exhibition hall before the elevator. The Sunrise experience only gets you access to the 124rth floor but there's a nice terrace and we got a pretty good sunrise. You can stay here as long as you want and many people were camping out in the window frames for the viewing spots. Outside of the terrace there's not much - there is a gift shop, a cafe, bathrooms and some TVs displaying facts and statistics about the Burj Khalifa. The gift shop is underwhelming and the cafe was closed while we were up there. There are other ticket packages but they can get expensive so do your research and choose what you'd like. The queue to get down wasn't managed well and people were crowding the elevators that go up and down. We felt they could have used a couple of staff to let people know where to wait to go down so that people could disembark the elevators more easily and the area didn't get too crowded. We felt people were pushy to get in the elevators so we had to wait a bit even though we were one of the first to get line up to go down. The treat at the cafe was nice and you had a choice between several hot and cold beverages including coffee, tea, hot chocolate and juice with many options for each. The treat also included a pastry and we had cheese puffs, chicken puffs and some sort of cheese/chicken pie to choose from. A big perk for us getting here so early was that we got unobstructed pictures near the Dubai Fountains of the Burj Khalifa after we came down and they were perfect. It does not matter which ticket package you buy but it is recommended to purchase in advance. At the Top is located in Dubai Mall near a food court and the signage is very helpful to lead the way. To get here you could use the Burj Khalifa/Dubai Mall metro station which is about a 15-20 minute walk but it is covered and air conditioned.", "rating": 5.0, "visited": "November 2023"}, {"title": "We are AT THE TOP", "review": "The view from the top of Burj Khalifa is breathtaking, offering beautiful panorama of the city. Understanding construction journey (year wise) adds depth to the experience & providing a closer look at its incredible engineering. Consider opening additional floors to the public, especially with the 124th floor ticket prices, to reduce queues & improve the overall experience. â\u0096ªï¸\u008fPurchase your entry tickets online beforehand. â\u0096ªï¸\u008fArrive at the site an hour before your selected time (expect long queues) â\u0096ªï¸\u008fSingle time see spot only [as a chance to witness the worldâ\u0080\u0099s tallest building]", "rating": 5.0, "visited": "December 2023"}, {"title": "Breathtaking view", "review": "I went to Burj Khalifa on 11th of March 2024. This is a must visit attraction if you come to Dubai. The view is simply amazing. One of the best experiences. Please visit the attraction as early as possible, then it wonâ\u0080\u0099t be much crowded and you can take beautiful pictures.", "rating": 5.0, "visited": "March 2024"}, {"title": "Sylwester", "review": "Great experience! First and foremost, big thanks for the kind and professional service provided by Ms. Reem B. The experience itself was fantastic! I highly recommend everyone to visit this place!", "rating": 5.0, "visited": "March 2024"}, {"title": "top of the building", "review": "the building itâ\u0080\u0099s self was incredible, the view is amazing at the top and all around, the way the building lights up is incredible. watching the water show from the top was a great experience. 10/10 recommend coming here for the experience", "rating": 5.0, "visited": "March 2024"}, {"title": "Thank You Heidy Gonzales", "review": "My visit to Burj Khalifa was made extraordinary thanks to the impeccable service provided by Gonzalez Agency. Their professionalism, attention to detail, and personalized approach ensured a memorable experience. The team's knowledge and passion enhanced my visit, making it seamless and truly enjoyable. I highly recommend Gonzalez Agency for anyone looking to experience Burj Khalifa at its best.", "rating": 5.0, "visited": "March 2024"}, {"title": "Thank You Heidy Gonzalezs !â\u009d¤ï¸\u008fâ\u009d¤ï¸\u008fâ\u009d¤ï¸\u008f", "review": "My journey to Burj Khalifa turned into an exceptional adventure, all thanks to the top-notch service delivered by the Gonzalez Agency. Their professionalism, meticulous attention to every detail, and tailored service guaranteed an unforgettable visit. The expertise and enthusiasm of the team elevated my experience, ensuring a smooth and delightful visit. For an unparalleled experience of Burj Khalifa, choosing Gonzalez Agency is a must. Highly recommended!", "rating": 5.0, "visited": "March 2024"}, {"title": "Beatiful", "review": "Thank you for being here. The building is amazing. Nice plaza, beautiful szopd everywhere. We want to come back again. Everything perfect. Amazing customer service with good people.", "rating": 5.0, "visited": "March 2024"}, {"title": "Exceptional experience and great host Tatiana Veiga", "review": "The experience at At The Top was exceptional. The view from the lounge on the 148th floor of the Burj Khalifa is priceless. The entire lounge staff was extremely friendly and helpful. They are offering refreshing drinks and food all the time. Special praise of course goes to the host ambassador Tatiana Veiga who was extremely friendly and very professional in her work. We will not forget her hospitality. Highly recommend!", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/13/6f/ef/fc/view-from-burj-khalifa.jpg"]}
{"name": "Dubai Festival City Mall", "description": "Dubai Festival City Mall is a shopping mall in Dubai Festival City, on Dubai Creek in Dubai, United Arab Emirates (UAE). Originally opened in 2007, but expanded in 2017.â\u0080\u008b Overlooking the serene waters of the creek and iconic Dubai Skyline, Festival City Mall holds a special place in the heart of North Dubai.â\u0080\u008b Accessible to shoppers via multiple roadways, public transport and special water taxi stops on the iconic Dubai Creek.â\u0080\u008b The mall Festival Bay a great outdoor and used for daily nighttime \"IMAGINE Show\" Laser, Lights and Fountain show. There is an Abra boat service across Dubai Creek between the Dubai Festival City Mall and the Al Jaddaf Marine Station, close to the Dubai Creek metro station on the green Line of the Dubai Metro. This is operated by the Dubai Roads and Transport Authority (RTA). With over 400 stores and more than 100 Restaurants and Cafes, Food Court with 1000 Seat the largest in Dubai.", "category": "Shopping Malls", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Festival City Mall"], "hours": "10:00 AM - 1:00 AM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Dubai Festival City", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Dubai festival city", "review": "I really love this place! I try to come every time I come. An exceptionally pleasant holiday atmosphere fills this shopping center, there are no crowds of tourists here, as in the Dubai Mall. You can combine business with pleasure â\u0080\u0093 most brands are represented in shopping galleries. But the most enticing for me is the embankment with fountains, laser and fire Show! I recommend you to visit. Be sure to go to the Rasasi and Desigual store!", "rating": 5.0, "visited": "November 2023"}, {"title": "Very nice place", "review": "A large and quite beautiful mall. Dozens of shops (or hundreds...), a food court area with a rich offer, playgrounds for children, a Lulu supermarket. It is interesting that here you can take a cruise on Dubai creek, with a traditional boat. Also, one thing worth coming here for is Imagine, an impressive show of water, fire, lights and lasers.", "rating": 5.0, "visited": "October 2023"}, {"title": "Festive enough to be called festival mall", "review": "the fountain display at the festival mall was awesome. Colourful with a laser display, fire n sounds from the fountain made it for a thrilling displays . The Christmas displays n entertainment on the outside of the festival mall where the fountains are the made me feel like a child again. To me, the festive mall outweighed the Dubai n Emirates Malls. The mall was more normal n family orientated. I suppose since it's not rated as touristy, no hype about it.", "rating": 5.0, "visited": "December 2023"}, {"title": "A nice mix of shops and restaurants", "review": "Weâ\u0080\u0099ve been to most Dubai malls over the years and the bigger ones tend to have only high end stores. If you get the chance try Dubai Festival City Mall. Itâ\u0080\u0099s a good size, less touristy with a variety of shops and great food court too. To add to the adventure get the Metro to Creek station, outside go straight across down a little path for a few minutes to get the water taxi across the Creek to the Festival City mall ð\u009f\u0091\u008d", "rating": 5.0, "visited": "July 2024"}, {"title": "Impressive mall", "review": "This is a large and well stocked mall with a great location. The outside area offers a great view to downtown Dubai and daily fountain show. Inside is a wide range of shops and excellent food and beverage outlets. There is also a large Carrefour and IKEA, together with lots of entertainment options. The mall is easily accessible by car and there is plenty of parking.", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1a/83/e1/ab/dubai-festival-city-mall.jpg"]}
{"name": "The Dubai Fountain", "description": "Choreographed to music, the Dubai Fountain shoots water as high as 500 feet â\u0080\u0093thatâ\u0080\u0099s as high as a 50-story building. Designed by creators of the Fountains of Bellagio in Vegas, Dubai Fountain Performances occur daily on the 30-acre Burj Khalifa Lake.", "category": "Fountains", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "The Dubai Fountain"], "hours": "", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Downtown Dubai", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Great day and night time viewing", "review": "This is a must see and especially at night wit the water display and the Burj Khalifa light show. Its a good walk around and plenty of restaurants and eateries on most sides. We saw it during the daytime and from a restaurant at night. The light and water display is every half hour and each one is done to a different style and music.", "rating": 5.0, "visited": "September 2023"}, {"title": "Dubai Downtown", "review": "I had a dinner with my fellow delegates at ABD EL WAHAB RESTAURANT a lebanese cuisine and it was a great experience. just right outside you can see the dancing fountains at night come to life, right behind it is the burj khalifa shining and full of lights. It was a dream came into reality", "rating": 5.0, "visited": "October 2023"}, {"title": "Fabulous show", "review": "This is something not to be missed. It happens every half hour on the hour and at half past but you need to take up your position a lot earlier as it gets very crowded. Itâ\u0080\u0099s a spectacular show where the sprinklers and jets dance to the music sending the water in choreographed directions along with loud firecracker sounds. The Burj Khalifa stands in the background and lights up in numerous colours and effects that add to the memorable experience", "rating": 5.0, "visited": "October 2023"}, {"title": "Absolutely brilliant", "review": "Saw the show from beside the lake the first time but it was so crowded you could only see the tall fountains and the colours on the Burj but then we went for dinner at Joe's with a terrace table and saw it twice more and it was brilliant. Each time was different and to different music, both classic and modern. Lot like Vegas but the Burj being lit up adds to it.", "rating": 5.0, "visited": "September 2023"}, {"title": "Must see", "review": "This was so beautiful to watch! Caught the daytime show while at the mall. It was so hot outside but that didn't matter to me. I had to watch the whole show. I imagine that the boat ride on the fountains at night would have been even more beautiful. This was my most favorite experience in Dubai.", "rating": 5.0, "visited": "October 2023"}, {"title": "Very nice , hopefully this review is different", "review": "10/10 donâ\u0080\u0099t really need me to tell you how great this place is however what I can tell you that is. Free view , anywhere around the fountain stood up. Cheap fantastic view , somewhere like 5 guys or Pizza Hut or vapianos Medium price but best view huqqa 2nd floor mall . You canâ\u0080\u0099t see the burj but can see a better view of the fountain . Drinks start from about Â£4/5 to Â£10/15", "rating": 5.0, "visited": "October 2023"}, {"title": "DUBAI FOUNTAIN AT DAY AND NIGHT", "review": "Dubai Fountain is one of the best tourist attraction that Iâ\u0080\u0099ve always see in my social media platform. I was amazed to its majestic and perfect place to take a picture with Burj Khalifa. Even at night, the water fountain show is highly recommended to watch and visit. Iâ\u0080\u0099ll comeback here soon!", "rating": 5.0, "visited": "October 2023"}, {"title": "Very nice", "review": "very nice to see a the variety of cultures sharing together this unforgettable experience. My wife and I love to visit this place at least once a month to feel the vibe irradiated by this espectacular place. We always enjoy seeing the fountain performances which are very diversified.", "rating": 5.0, "visited": "May 2023"}, {"title": "Amazing", "review": "Very, very beautiful show of fountains, in perfect harmony with music. Every 30min another show (starting with 6pm, I think...). Probably in future will be colored light of jets (as in Bucharest). Is an infinite pleasure to stay on terasse at Souk Al Bahir and see fountains and Burj Kalifa...", "rating": 5.0, "visited": "October 2023"}, {"title": "Great Display of Sights and Sounds", "review": "Be there by 5:30 pm for good vantage points. By 6 pm the show starts. Not that lengthy display but it is nice enough not to drag. Goes on 30 minute interval. Reminds one of those in Las Vegas and Macau.", "rating": 5.0, "visited": "November 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/05/19/1c/the-dubai-fountain.jpg"]}
{"name": "City Walk", "description": "City Walk is a design-inspired open-air lifestyle destination in Dubai that spans an area of more than 10 million square feet. Nestled in a prestigious neighbourhood on Al Safa Street in close proximity to the arterial Sheikh Zayed Road and the sophisticated Jumeirah Street, the family-friendly hub seamlessly combines living, retail, F&B, entertainment, hospitality and wellness options within one integrated space to offer visitors a unique sense of community and comfort. Designed to evolve as a city within a city, City Walk has emerged as the preferred choice for residents and tourists looking for a sophisticated place to shop, dine, socialize and spend quality time in a serene ambience in the heart of Dubai. City Walk is home to Canadian University Dubai and will soon have Talabatâ\u0080\u0099s 150,000 sq ft HQ that will be split across two separate buildings, with the first set of employees expected to be moved in by Q3 2022.", "category": "Shopping Malls", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "City Walk"], "hours": "10:00 AM - 11:00 PM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Al Satwa", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/9a/3a/4a/photo2jpg.jpg"]}
{"name": "The Dubai Mall", "description": "This downtown mall is known for luxury stores like Cartier and Harry Winston. It also has an aquarium, ice rink, and 360-degree views of the city from the worldâ\u0080\u0099s tallest building, The Burj Khalifa.", "category": "Shopping Malls", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "The Dubai Mall"], "hours": "10:00 AM - 1:00 AM", "duration": "Duration: 2-3 hours", "address": "", "neighborhood": "Neighborhood: Downtown Dubai", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Didn't have time to do it justice", "review": "If you use public transfer to get to it and get off at Burj Khalifa/Dubai Mall metro stop you should be aware that the station is about 10-15 walk away from the actual Mall itself but the walk way is under cover and air conditioned. We spent several hours there but my wife and daughters didn't think we had time to do it justice. There is a whole floor of eateries and the shops go from the expected \"very high end very expensive\" to H&M. It contains a massive aquarium which has a huge transparent wall you can look into and there is the free Fountain Show from about 6:30 in the evening so you might want to go in the afternoon. I suppose there is slight surreal/excess feel to the place but you should go and see it.", "rating": 5.0, "visited": "August 2023"}, {"title": "Great Mall to visit.", "review": "This mall has more open space than the Mall of Emirates and some different shops. Lots of eateries to choose from and also this mall is the access to the Burl Khalifa. On the far side is access to the Dubai fountain. Also this mall has an indoor Aquarium and ice skating rink. Very impressive to see.", "rating": 5.0, "visited": "September 2023"}, {"title": "Fantastic mall", "review": "You don't have to like shopping to enjoy this mall. So much lovely detail inside and incredible shops amd eateries to wonder around. Great access out to see the Burj and Fountains therefore it's a fantastic area to spend some time. You'll find the mall's air conditioning lovely on the hottest of days!", "rating": 5.0, "visited": "September 2023"}, {"title": "Epically big", "review": "To an average person you must be blow away by the size of the space, just when you think you have clear the floor you glance and see another section. Everything is supersized, posh shops, restaurants and cafeterias everywhere. You choose well time when you come here and accept fact that unless you spend days here, you will be unable to see all. Taking taxi is a nightmare, you may end up waiting hour or two.", "rating": 5.0, "visited": "October 2023"}, {"title": "A gem!", "review": "Breathtaking mall! Everything was easy , from parking to finding our way around! Having been to various global malls..this mall gets full marks! From its architectural design to its array of shops ...the experience of just being there is overwhelming! Every shop is kitted out elegantly from local to western brands. The magnitude of size will take one, more than a day to explore all shops. There's a food court ; a kids' play area. Unlike other malls here it's the space that spreads out the crowds ...hence one doesn't get the elbow jostling space invasion experience. Dubai Mall is itself a unique experience; for any visitor..it has earned its name & grandeur reputation.", "rating": 5.0, "visited": "October 2023"}, {"title": "A Shopping Mall with an ice rink! Only in Dubai", "review": "This is the biggest shopping mall you will ever experience. It is so amazing, with every designer shop you can think off. We event went to the underwater zoo, which is also an amazing experience, and seeing live crocodiles! Dubai is just out there and offers quality and friendly people. We even came across an ice rink! The Mall is massive and you need to spend a whole day there to take it all in. Food Halls are superb, so much choice, and not that expensive. The Fountains outside of a night time is a must and get on a boat taxi for only Â£16 and see the fountains up close. A truly memorable experience and will be back.", "rating": 5.0, "visited": "October 2023"}, {"title": "Dubai Mall !!", "review": "A fun evening out. We started at The Frame then took a short taxi ride to Dubai Mall. Where else could you see the words tallest building, a fountain light show, a waterfall inside the mall, an aquarium inside the mall and endless shops of all kinds all within a short(ish) distance.", "rating": 5.0, "visited": "October 2023"}, {"title": "Probably one of the best in the world", "review": "With its huge spacious dimensions, the intimidating number of brands from basic to the ultra luxurious. Being connected to the worlds tallest free standing structure. Having the extreme of cuisines from fast food to must try fine dining. Having a high end aquarium . Looking out to a lovely fountain display at evening. It caters for every choice. Be wary however of the volume of people going in and out of the mall , particularly during peak hours.", "rating": 5.0, "visited": "November 2023"}, {"title": "A must", "review": "It is NOT just another mall! While you will recognize almost all of the shops, the attractions, design and architecture will enthrall you. We found that going from attraction to attraction (aquarium, divers waterfall, ice rink, the souk, Burj Khalifa, Dubai Fountain) brought us close enough by so many retail shops we were happy with what we'd seen / shopped. The mall is HUGE and the directional signage not always helpful. We arrived at 1pm, walked around, made out appointment at the BK, had dinner, saw the fountain show and then gelato before finally leaving about 930pm. Crazy amount of people around the time of the fountain shows, but crowds rapidly disperse around the mall. More luxurious than the other mall (with the ski slope) not too far away.", "rating": 5.0, "visited": "November 2023"}, {"title": "Easily Spent too much time here", "review": "We didn't want to spend too much time here but found ourselves here almost everyday during our trip to Dubai. There is a lot to see and some very nice shops and restaurants. The Dubai Mall is part of the great Downtown Dubai area and is connected to the Burj Khalifa and offers a variety of terraces to view the Dubai Fountains and Burj area. We did quite a bit of window shopping and buying here as there are a lot of brands from all over the world and we felt we got some good deals on some new clothes, shoes and other items too. When we went in November there was lots of Christmas items and displays that we appreciated. The best part about this mall is how clean and well maintained it is. There are a lot of different themed areas and the mall itself is nicely organized to have similar shops in the same area. For example there is an area called Fashion Avenue which has more of the upscale fashion brands, a Souq area with Arabic style shops, there is Chinatown which has restaurants and stores catered to Chinese, a sports area, children's clothes area, etc. There are many attractions in the mall too like an ice skating rink, a giant aquarium and indoor art installations. There are also quite a few domed areas and nicely decorated walls that look great in pictures. The At the Top experience for Burj Khalifa can also be accessed from inside the Dubai Mall. The mall is connected to the Dubai Metro at Burj Khalifa/Dubai Mall station via a long pedway system which takes about 15 minutes to get to. The mall is truly overwhelming and worth spending a few hours at to just look around if you enjoy malls. There is also a Dubai Mall application that can help navigate the mall to find specific stores or attractions. The application stopped working a few times for us but we found closing and opening it up again helped us. We found ourselves coming back again and again to either try a different experience or restaurant.", "rating": 5.0, "visited": "November 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/8c/0c/1a/taken-5-years-ago-it.jpg"]}
{"name": "Dubai Creek Golf & Yacht Club", "description": "Golf course in Dubai with distinctive sail-like clubhouse architecture.", "category": "Golf Courses", "breadcrumbs": ["Middle East", "United Arab Emirates", "Emirate of Dubai", "Dubai", "Things to Do in Dubai", "Dubai Creek Golf & Yacht Club"], "hours": "6:45 AM - 10:00 PM", "duration": "Duration: More than 3 hours", "address": "", "neighborhood": "Neighborhood: Deira", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/83/5f/4e/dubai-creek-golf-yacht.jpg"]}
