{"name": "Sahara Tours 4x4", "description": "Sahara Tours 4x4 offers private tours from such ancient cities as Marrakech and Fez, through the High Atlas Mountains and out into the Sahara Desert. Anywhere you would like to see, it is our pleasure to show you. We have new, comfortable, air-conditioned 4x4s for smaller groups and minivans for larger groups. It is well known that there is a lot of distance to be covered in Morocco so we recommend that you book a longer trip so that we can take our time, drive slowly, stopping any time that you would like to have a break and to take pictures. We can organize trips for any sized group - family, friends or on your own and can accommodate a wide variety of budgets. We are friendly and professional. We speak Spanish, French, English and Italian. Our wish is for you to enjoy a spectacular trip of a lifetime.", "category": "Safaris", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Sahara Tours 4x4"], "hours": "", "duration": "Duration: More than 3 hours ", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "The best possible guide is Mohamed El Baz", "review": "Sahara 4x4was our tourist agency in Marocco. We visited: Marrakech, the desert and Fez, we traveling 1600 kilometers and visiting towns along the way. We were led by the best tour guide, Mohamed El Baz, from Sahara 4x4. We were 5 Colombian tourists. We asked the director, Said, to assign us that guide, based on the good recommendations given by a friend who knew them and in fact, they assign him. It is an extraordinary tourism agency for its infrastructure, its 24 hour attention, its order, its presentation, its respect, its care, its good hotels, roads, chosen by them, its knowledge, its compliance, its always kindness and its desire so that we would always be happy.", "rating": 5.0, "visited": "September 2023"}, {"title": "the best possible guide is Mohamed El Baz.", "review": "Sahara 4x4 was our tourist agency in Marocco. We visited Marrakech, the desert and fez, traveling 1.600 kilometres and visiting towns along the way. We were led by the best tour guide, Mohamed El Baz, from Sahara 4x4. We were 5 Colombian tourists. We asked the director, Said, to assign us that guide, based on the good recommendations given by a friend who knew them and in fact, they assign him. It is an extreordinary tourism agency for its infrastructure, its 24 hours attention, its order, its presentation, its respect, its care, its good hotels, riad, chosen by them, its knoledge, its compliance, its always kidness and its desire so that we would always be happy.", "rating": 5.0, "visited": "September 2023"}, {"title": "Private tour focused on the travelers needs. An amazing and unforgettable experience", "review": "What an amazing trip! Prior to even starting the trip I was in contact with Said who was always so responsive to my questions. Well organized, private tour with an amazing guide, Hassan who was incredibly attentive to all our needs and easily went with the flow of our group dynamic. Hassan gets a 10+. He is truly a star! Camel ride, Sahara desert, monkey fingers and so much more we got to experience. Best of all was to learn from Hassan about Morocco and it’s people. This is the BEST tour I have been on. Loved the private nature and attention to every detail so we could have the best experience possible. This is a MUST DO!", "rating": 5.0, "visited": "October 2023"}, {"title": "Breathtaking landscapes and charming people!", "review": "we loved the trip! we saw so many beautiful sites and landscapes and learned a lot about Morocco’s culture and history! Our guide Youssef was very pleasant and shared interesting insights into the region’s uniqueness.", "rating": 5.0, "visited": "October 2023"}, {"title": "Sahara from Marrakech - Fes / Youssef best guide !!!!", "review": "Youssef was our guide for our 4 day (3 night) Sahara tour from Marrakech to Fes. The trip was faultless and an honest highlight of my four month travel. He was insightful, easy to talk to and full of local knowledge. I feel he went above and beyond his duties at many points during the four days and I couldn't recommend this tour and Youssef in particular to anyone. All the accomodation provided was incredible and the food was outstanding. We got the most spectacular views and experiences that wouldn't be topped by any of the other companies around. Would definitely go again!!!", "rating": 5.0, "visited": "October 2023"}, {"title": "5-star guide/driver!", "review": "We booked a private tour for 2 pax from 1st to 12th Dec. Youssef was our guide/driver. All thanks to Youssef, we thoroughly enjoyed the trip. Youssef made us (2 girls) feel safe wherever we went. He looked out for us and briefed us on what to expect on the trip everyday. He respected our choices (e.g spending more or less time on certain activities/places). He was thoughtful (e.g stopping for coffee when he observed that we enjoyed local coffee). We had pleasant conversations where we learnt alot from his knowledge and sharing. In our email correspondences, we liaised with Said, who was very prompt and responsive. We will definitely recommend this tour to our friends and family!", "rating": 5.0, "visited": "December 2023"}, {"title": "Incredible, must do desert experience in Morocco!", "review": "Our 4 day, 3 night desert experience starting in Marrakech and ending in Fes was outstanding! Our driver, Mohamed el Baz was incredible and the best driver, guide, photographer, and travel companion. He always went the extra mile to make sure we were well taken care of, explained a lot about what we were seeing and what to expect, and was very friendly. He is also originally from the desert so was very familiar with the area and people. The riads and camp we stayed in were high quality and matched our expectations. Said who owns the company is also an excellent communicator and ensured we had a good experience and were cared for with detail and accommodation to our vegetarian diet. Highly recommend this company and overall experience - the sunset on the camel ride and sand dunes are unforgettable, along with everything we learned about Berber culture!", "rating": 5.0, "visited": "December 2023"}, {"title": "Unforgettable experience in the desert!", "review": "Fantastic tour into the desert, which was made particularly enjoyable by our driver Mohamed El Baz - he went the extra mile to ensure that we were safe on the road, comfortable, having fun, and constantly learning new things along the journey. He even organized a little surprise for my wife’s birthday, which made our experience all the more memorable. Said (owner) was extremely easy to communicate with and was highly responsive to anything we needed. The riads and desert camp were all high quality with fantastic staff. Hard to imagine a better way to spend a few days getting to / staying in the desert - highly recommend this company and this experience!", "rating": 5.0, "visited": "December 2023"}, {"title": "Awesome trip!", "review": "This trip was amazing! We took a three day, two night trip from Marrakech through the Atlas Mountains and Dades Valley to the desert near Merzouga, then back to Marrakech. Our guide Mohamed was fantastic! He had a lot of great information and stories to share about the places we visited, and made the trip a lot of fun. We also felt very safe and comfortable with him as our driver. The riad and luxury tent we stayed in both exceeded expectations, and all of the meals we had along the trip were delicious. Overall, this was an unforgettable experience and we would highly recommend it to others!", "rating": 5.0, "visited": "January 2024"}, {"title": "Thank you MOHAMED!! BEST GUIDE!!!", "review": "We took a three day, two night tour through the Atlas Mountains to the desert near Merzouga. Mohamed was an absolutely amazing tour guide!! Shared a ton of fun facts and very hospitable. All the accommodations on the trip were much more than we expected and everyone we met made the trip even more memorable for us! Mohamed was also a very safe driver and made any stops we wanted. He even gave us recommendations when we got back to Marrakech. Wish we had more time but we will be back Inshallah!", "rating": 5.0, "visited": "January 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/daodao/photo-o/10/ca/92/49/photo0jpg.jpg"]}
{"name": "Herbalism Marrakech", "description": "Welcome to Herbalism, your destination for natural, organic, and ethically sourced skincare and beauty products. Our mission is to promote healthy living and holistic beauty by harnessing the power of nature. At Herbalism, we believe that beauty is more than skin-deep. That's why we carefully select each of our products to ensure they are made with only the highest quality, naturally derived ingredients. We work with local farmers and artisans to source the best ingredients from the bountiful natural resources of Morocco.", "category": "Department Stores", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Herbalism Marrakech"], "hours": "9:00 AM - 8:30 PM", "duration": "Duration: < 1 hour", "address": "Sabt moulay elhaj el maslouhi n•67 laksour, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Spices and products and scents, oh my!", "review": "Fantastic and informative time at Herbalism! I went with a group on a wellness retreat, and Ibramhim was wonderful. He answered all questions honestly and completely. I never felt like there was a \"hard sell.\" There's a huge supply of products of every scent, and each of them is lovely. If ever in Marrakech, make sure to visit!", "rating": 5.0, "visited": "October 2023"}, {"title": "Way beyond amazing!", "review": "Ibrahim was a pleasure to work with - he’s knowledgeable, good natured and extremely helpful. He went way beyond when he came to my hotel so I could buy more products as gifts the day before I was leaving. He even helped me get my packages to the post office. Then when I found out the post doesn’t take credit card and I didn’t have enough dirhams he let me charge the amount and paid them cash for me. A total life saver! Thanks for all your help!", "rating": 5.0, "visited": "September 2023"}, {"title": "Youssef is a gem!", "review": "Youseff was really passionate and knowledgeable about the products in the store. He was very kind in allowing us to test them. We recommend this fabulous store, if you are looking for genuine, trusted herbal products. The service 5* - thank you! Can’t wait to try our products out when we get home.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great products, friendly people Well worth a visit.", "review": "Whilst on our visit to Marrakesh we visited herbalism Marrakesh. Hamza was so friendly and knowledgable without being pushy. We bought a variety of products. They were so good later on our holiday we sort out the place again, this time to get some spices too. I highly recommend a visit to this place.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great store, fantastic products!", "review": "My friend and I visited Herbalism last week. Ibrahim was helpful and informative. He showed us a variety of products and demonstrated to us how to use them. We purchased argan oil products, prickly pear facial oil, and mint crystals (decongestant).", "rating": 5.0, "visited": "October 2023"}, {"title": "Great experience", "review": "We had a great time with Badr showcasing some of the products. He was knowledgeable and funny and we enjoyed stopping and listening to him. We came home with some teas and oils and we love that we were able to bring some of Marrakech home with us. Definitely would recommend!", "rating": 5.0, "visited": "October 2023"}, {"title": "The best Argan oil experience ever!", "review": "Thank you so much Yosief for being a great host and provided the best Argan oil experience ever! We went to this shop at least 3 to 4 times in our one week stat with various friends and family. I bought so much here and I'm so happy I did! I bought spices, Argan oil with Sandalwood, Argan oil with Rose and plain Argan oil as well as pure Amber perfume, black cumin and menthol and mand other treats. I can't wait to come back and visit. I highly rate visiting here and would not skip it. Shukran.", "rating": 5.0, "visited": "October 2023"}, {"title": "Friendly owner", "review": "This was part of the food tour with Yahya. Fun presentation of oils with sampling. After leaving for a couple hours, realized one of us left a backpack at the store. Store owner went back late at night to get it and delivered it to us in person. 10/10.", "rating": 5.0, "visited": "November 2023"}, {"title": "Aragan oil and herbs", "review": "Simply incredible. Youssef made us feel at home and very comfortable. He's a great host. He explained everything to us about the products and their benefits, and his passion for the family business with ancestral tradition. We can also try the excellent quality products. Needless to say, we brought several home. It's really worth visiting.", "rating": 5.0, "visited": "November 2023"}, {"title": "Badr is amazing.", "review": "Badr is so knowledgeable about every single product, the oil for me is my favourite. Whenever I come from London to Marrakech its a must that I buy some Argan Oil. Herbalism for me is the best, Badr is one of a kind and his service is fantastic. he is great with how he talks about all the products and know his stuff! the people here are so friendly. i will definitely, be returning to buy more products especially the Argan oil", "rating": 5.0, "visited": "July 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/29/27/c3/32/welcome-to-herbalism.jpg"]}
{"name": "Heritage Spa", "description": "The virtue of HERITAGE SPA is to transform your beauty care into the exeptional tailor-made event created just for you and you alone. At Heritage Spa the art of wellness is highly linked to the return to the nature and authenticity, a trip to the heart of ancient traditions of beauty. At the same time it is a place of Haute Beaute based on the rich experience of luxury cosmetics brands.Here at HERITAGE SPA , mental clarity is as vital to your wellness as your physical condition. Developed in coordination with international beauty experts, our tailored Beauty and Body programs will provide the ultimate experience.Each of your treatments are highlighted by natural plants’ extracts and aromatic restorative oils. They will leave you feeling relaxed, content and deliciously pampered.Our exigency made us choose the best cosmetique brands such as CARITA, NECTAROME, CHARMES DU MAROC et GERMAINE DE CAPPUCCINI.", "category": "Arab Baths Hammams & Turkish Baths Spas", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Heritage Spa"], "hours": "10:00 AM - 8:00 PM", "duration": "", "address": "40 rue Arset Aouzal, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Excellent spa, staff and treatments", "review": "A truly special time when you visit this spa. Professional and courteous staff, really welcoming owner and nothing is too much trouble for them. We visited twice as a group and totally recommend all the treatments. Reasonable prices too and quality service", "rating": 5.0, "visited": "October 2023"}, {"title": "little oasis! great treatments!", "review": "I was recommended this spa, by someone i met on a food tour and i’m glad i took up the recommendation. it’s down an alleyway and you don’t know what to expect, but its lovely, a real oasis! i went with a relative and we both had a hamman(my first) and it was great! followed by a anti ageing facial with prickly pear oil. this was amazing and my therapist was fab, so much so i booked a hot stone massage with her the next day! this was just as good! she was very attentive and made me feel great!! i can’t remember her name!!😥, but if i went back i’d definitely have her again!! my friend didn’t have the same experience with her facial and on tellîng the receptionist, they were quick to not charge her and apologised. my friend had been there the day before for a massage and loved it!!", "rating": 5.0, "visited": "October 2023"}, {"title": "Exceeded expectations", "review": "A wonderful Hammam experience. Be prepared to be pampered and exfoliated in a way you have not experienced before. Everything is provided including disposable underwear for women - although it hardly seemed worth it! It’s a leisurely experience so don’t rush or expect to be finished quite on time. I would not have wanted a massage on top of the Royal Hammam.", "rating": 5.0, "visited": "October 2023"}, {"title": "Blissful Royal Hammam for two", "review": "Visited with my teenage daughter and we both had the royal hammam - pure bliss. We were in the same ‘wet room’ where there were two heated marble beds and two hand showers. The ladies first showered us and oiled our hair. Then we were washed with black soap, left to relax, thoroughly scrubbed down and rinsed… all a blissful blur after that but next involved a hair wash and conditioning mask and clay body mask, relaxation and a final rinse and wash down. In cosy gowns we were escorted to a lounge to relax with mint tea and biscuits. The two hammam ladies were lovely - very friendly and attentive. Would be definitively be going back for another treatment except this was out last day… next time", "rating": 5.0, "visited": "November 2023"}, {"title": "Treat yourself generously, you deserve this experience!", "review": "Absolutely wonderful experience. Services and professionalism, amazing beyond our anticipation. From booking, to check in, to spa services, to value, to final payment including soap parting gifts, everything was exceptional. Highly skilled techniques in all aspects of spa therapies and hammam. Personalized attention to individualized focus areas. We booked the 3 1/2 hour couples package and all treatments were top-notch, rivaling our spa experiences throughout the world. Couples package is the best value in the city. I would rarely extend such a review, but I give Heritage spa an unequivocal recommendation.", "rating": 5.0, "visited": "November 2023"}, {"title": "Absolutely recommend", "review": "Booked for my mum and aunt for body massage and royal hammam. They had an amazing time and would absolutely recommend. The ladies are lovely and extremely professional. Everything is clean. Though I did not receive any treatment, I was treated very well by the team. Will definitely be booking this again. 5 star experience.", "rating": 5.0, "visited": "December 2023"}, {"title": "Fantastic spa experience, so relaxing and worth the money!", "review": "I visited the spa with my partner and we had a fantastic time. We booked the Refreshing Detox package. We arrived, and were given mint tea whilst we decided what oils we wanted in our massage. Next we went for the Hammam where we had the black soap and the scrub, on a hot stone bed. Next we relaxed with more mint tea and pastries. After this we were taken for our massages, and even though we didn’t book a couples package, our massages were both in the same room which was nice. Altogether we spent 3 hours at the spa because it was so relaxing!", "rating": 5.0, "visited": "January 2024"}, {"title": "Amazing first hammam experience", "review": "Booked the romance package with my husband for our last day in Marrakech and it was incredible. We were in the same room for everything. It was our first time experiencing the hammam and wow, we've never been exfoliated like that before! The staff was very kind and professional. Left feeling relaxed and rejuvenated - we joked that if we had done this earlier in our trip we definitely would have come back for a second experience.", "rating": 5.0, "visited": "January 2024"}, {"title": "Wonderful Experience", "review": "We had read several reviews of different spa’s in the Medina. We decided to visit the spa and complete the signature couple package. It was a wonderful and authentic experience. The staff was very attentive, polite and nice. The installations very clean and organized. Although the spa was fully booked, you did not get the sense that there were more people at the spa. You go between the different rooms, changing room, hamman, lounge and massage rooms without running into other people. We were able to relax from the caos of the Medina for 3 hours. We will definitely return and recommend to other people.", "rating": 5.0, "visited": "March 2024"}, {"title": "Heritage Spa Experience", "review": "I was pleased with everything about my visit, starting with the prompt and informative responses I received to my email inquiries. When it came to my appointment (I did a combo of a traditional bath, followed by a massage, and facial), I was warmly welcomed, and immediately ushered to a pleasant area where I very shortly began my experience. Each of the handful of attendants who worked hard to give me a full and relaxing experience were friendly, and comfortable to be around. I loved every minute of this experience. The mint tea and cookies were a lovely touch as well. This spa is quiet, clean, and relaxing. The staff is professional and warm. I felt so comfortable here and hope I have the opportunity to return one day. If you have a chance, book yourself a treatment there. You will not regret it. Merci!", "rating": 5.0, "visited": "April 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/7b/be/a1/massage-room.jpg"]}
{"name": "Isis Spa", "description": "Vous souhaitez faire plaisir à vos proches en offrant l'un de nos prestations bien-être ou vous offrir un vrai moment de détente ou encore de partager un bon instant de relaxation ? Découvrez nos soins en solo, en couple , en famille , entre amis (es) :Équipe de Spa isis Marrakech hâte de vous recevoir", "category": "Spas", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Isis Spa"], "hours": "10:00 AM - 9:00 PM", "duration": "", "address": "Derb dabachi, Derb jdid N°12 A 10 MN de la place jemaa el fna, Marrakech 40400 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Very family friendly", "review": "It was such a pleasure to visit Isis Spa with my wife and our nine year old son. The friendly staff were all really competent, attentive, friendly and helpful. We appreciated their attention to children and our very active child found a relaxing place after a long travel day. I would like to mention Hasna, who gave a wonderful and strong massage.", "rating": 5.0, "visited": "October 2023"}, {"title": "Wonderful family experience. So relaxing!!", "review": "Our kids are 11 and 9 so this was perfect for us to experience as a family. Sena and Tama were very gentle and kind when they washed and scrubbed us. They were great with the kids as they had the chocolate on them. Really wonderful relaxing experience! The massages were excellent. We weren’t rushed at all and we got time to relax afterwards as a family and when we were ready to leave. Highly recommend!", "rating": 5.0, "visited": "October 2023"}, {"title": "Great value for money", "review": "Great place very peaceful. After checking reviews gave the a try and wasn’t disappointed. Booked a Hammam and massage package at a very reasonable price. Thanks to Hasna and Sana for the hamam and Maria and Saida for the massage. Highly recommended", "rating": 5.0, "visited": "November 2023"}, {"title": "Fantastic hamman - authentic but comfortable!", "review": "We wanted to try a traditional Moroccan hammam as a couple and the Isis spa was highly recommended so we decided to give it a go. It was very easy to book via WhatsApp and we were lucky enough to get a booking the next day. We found it easily after an enjoyable walk through the souk (as another reviewer said, ignore anyone who tells you the place you are heading to is closed!). We were welcomed and shown to the changing room where we changed into bathrobes and slippers, then taken up to the Hamman room on the top floor. What a fantastic experience! We were washed with the black soap, scrubbed, exfoliated and steamed all over and even had our hair washed. My nervous husband relaxed and enjoyed it. It was a very unhurried experience, we were left to relax in the steam room as long as we wanted with regular checks to make sure we were happy and the temperature was ok. After a final application of moisturiser we were wrapped back in our robes and taken to a relaxation room where we were served mint tea. We stayed there until we felt ready to head out for lunch. My husband ( first timer) wore swim shorts, I just wore my knickers (underwear essential and take dry ones for afterwards). Hassina and Tama were lovely, so professional and friendly. It was a great authentic experience without being as intimidating as a public hamman. Plus I loved that we could share it as a couple. Great value and highly recommended.", "rating": 5.0, "visited": "November 2023"}, {"title": "Amazing experience !", "review": "I'm delighted to share a glowing review of the spa staff, especially Hayat and Mariam. Their exceptional treatment and service made my experience truly enjoyable. The entire team's dedication to creating a relaxing atmosphere is commendable. Highly recommended for a rejuvenating escape!", "rating": 5.0, "visited": "November 2023"}, {"title": "Family friendly hammam Marrakech", "review": "Loved this hammam that was so family friendly! They were very caring with our kids (3 and 1) and I have never seen our 3-year-old so relaxed. The whole experience was fantastic and actually a great value especially when you consider it’s a hamman and massage for 4 people.", "rating": 5.0, "visited": "November 2023"}, {"title": "Relaxation pure", "review": "If you want a treat this is the place to go. I have been to the Isis on numerous trips to Marrakech for Hamam visits and massages. Great atmosphere and very friendly staff. Today I had another great experience with the therapist Nishan.", "rating": 5.0, "visited": "December 2023"}, {"title": "Good coupes spa experience", "review": "My wife and I really loved it. Calm, clean site with lite music in the background. It was lovely. We did the couples experience which was 2.5 hours or so. Started with the steam bath, ended with a nice massage and resting with tea in a side room. It’s a bit to find but worth it.", "rating": 5.0, "visited": "November 2023"}, {"title": "Just bliss. A beautiful quiet hammam you will love.", "review": "Absolute bliss. This is the perfect Hammam spa. Quiet, not touristy, lovely gentle staff who scrub, soak and then if you’d like give you a heavenly deep tissue massage. It is out of the way of the hustle of the Medina, we were luckily is was in our Ryad’s laneway. Book this in when in Marrakech.", "rating": 5.0, "visited": "December 2023"}, {"title": "Excellent experience at ISIS spa", "review": "Excellent spa in the heart of Marrakech. Very clean and professional .Hamam with Hasna was invigorating. Also excellent massage with Sonaa. Abd. at the front desk was very friendly and helpful. Definitely recommend highly.", "rating": 5.0, "visited": "December 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/15/dc/2f/ca/isis-spa-marrakech-salle.jpg"]}
{"name": "Jardin Majorelle", "description": "Nicely designed and maintained gardens, similar to those of Generalife in Granada, Spain. It’s a good place to recoup from the intensity of the market atmosphere.", "category": "Gardens", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Jardin Majorelle"], "hours": "8:00 AM - 6:30 PM", "duration": "Duration: 1-2 hours", "address": "Rue Yves Saint Laurent, Marrakech 40090 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Relaxing escape amidst chaotic Marrakech", "review": "The gardens were quite beautiful and offer a relaxing contrast to the chaos often associated with Marrakech. The vibrant colors and vegetation make you feel like you're in a movie. The downsides were that It was quite busy when we went, so I recommend going as early as possible. If you're planning on buying something at the café expect prices made for tourists. Finally, since this is far from the city center I recommend going by taxi, and always be wary of the taxi prices.", "rating": 5.0, "visited": "August 2023"}, {"title": "Marjorelle and Menara towers", "review": "Our Guide Mohamed, is friendly and speaks well, chatting with us about the gardens that we visited. Driver, Khalid, brought us safely to our destinations amidst the busy morning traffic. I'm a solo traveller but shared a car with another lovely couple. The Marjorelle is beautiful but too many people to enjoy it in peace. Regardless, It was nice to be able to see it. Menara towers didn't have much to see compared to Marjorelle. But I was also glad the guides brought us to a shop with beautiful home stuff, that we didn't need to haggle for price.", "rating": 5.0, "visited": "October 2023"}, {"title": "Great value for high standard.", "review": "The combined ticket to Jardin Marjorelle, YSL exhibition and the Berber exhibition are worth the visit. I did not expect the exhibitions to deliver such a high standard of curation. The gardens are a peaceful oasis one inside the walls. The cafe inside the garden is a pleasant break while visiting the gardens.", "rating": 5.0, "visited": "September 2023"}, {"title": "A fabulous garden", "review": "Visited as part of a tour group . Wanted to visit for years & finally managed to ……so glad as it is breathtaking. As part of a group we had a limited time but arrived just after the gardens opened . Leaving just over an hour later it was starting to get busy. They have a “ one way “ walk in operation, which is quite a good idea . If you want to see something agin then you go round agin . The colours are amazing , cobalt blue is a favourite of mine . This teams up so well with the orange & yellow . The plants look beautiful too. There is a Berber Museum to visit , sadly we didn’t have time for this but I’m sure it would have great presentation & items to see . There is also a memorial to Yves St Laurent . Would recommend this 100%", "rating": 5.0, "visited": "September 2023"}, {"title": "Superb", "review": "A place located in a very nice area of Marrakech created by a painter and refined later by a fashion icon - YS. The attention to the detail and the chromatic is scintillating. The gardens are so nice and so colorful. The Berber Museum is so chic and informative and pleasant to visit. The café and that boys serving there are so cool and fun. I would say afternoon is better due to the light. Buy the package because everything worth visiting. Including the YSL House which shows an amazing collection of photos... A bit an obsession in the indoor spaces to forbid photographing is a bit annoying.", "rating": 5.0, "visited": "October 2023"}, {"title": "A tranquil oasis.", "review": "This was our second visit to this lovely tranquil desert garden. A shady oasis away from the heat. Well kept. However, I agree with a previous comment about too many posing influencers but that is not the gardens fault and is definitely worth a visit.", "rating": 5.0, "visited": "October 2023"}, {"title": "Go early", "review": "Having read plenty of reviews here, I followed the advice to book either early or late. We chose early, arrived about 10 minutes before our 9am slot, and walked straight in with no queuing or faff. It was still quiet enough that we could wander at will in any direction we chose, with plenty of space and peace to take photographs if we felt like it, and just chill if we didn’t. Absolutely gorgeous. Cool and beautiful - a fresh garden-y delight around every corner. Having dashed out our riad without eating (see earlier comment re ticket time lol) we had the Moroccan breakfast for 115dh each in the lovely cafe - one of the best breakfasts of our entire trip. Fantastically fresh and tasty and very huge! Top quality mint tea too.", "rating": 5.0, "visited": "October 2023"}, {"title": "Tranquility", "review": "Stunning Tranquil gardens perfect for some time out from the bustle of Marrakech! Shady and green with lots to see! Gorgeous bold blue, yellow and orange colours - obviously favourites of Yves Saint Laurent!", "rating": 5.0, "visited": "November 2023"}, {"title": "Peaceful Haven", "review": "First get there early. We entered just after 9am and it was peaceful with few other people - when we left (about 10.30am) there were long queues outside. This is a small tranquil garden in the modern part of Marrakech. Take your time as you saunter around. There are some amazing plants especially cacti. The gardeners are terrific in keeping the surrounding gravel spotless. The Museum of the Berber is worth a short visit (inc with your ticket). There is a cafe if you need a break - alternatively there is a large one opposite the entrance.", "rating": 5.0, "visited": "November 2023"}, {"title": "Magnificent", "review": "Jardin Majorelle is a tranquil haven amidst the vibrancy of Marrakesh, with stunning cacti and a lush landscape. The garden's compact size makes for a perfect short visit, and pre-purchasing tickets online streamlines entry. The ambiance alone is a delight, making it an essential stop for those who appreciate serene beauty and the art of gardening.", "rating": 5.0, "visited": "May 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/4f/7f/06/20190418-125956-largejpg.jpg"]}
{"name": "Top Sahara Trips", "description": "Top Sahara Trips (https://www.topsaharatrips.com) is a travel company in Morocco we arrange desert trips to Sahara . also day trips from Marrakech to discover Morocco", "category": "Safaris", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Top Sahara Trips"], "hours": "", "duration": "", "address": "Mhamid 9, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Girls Trip of a Lifetime!!!", "review": "We chose Morocco for a girls trip adventure of a lifetime, and it far and away exceeded all of our expectations!! The Erg Chebbi in the Sahara and Marrakech are absolute must-dos! We are so happy that we decided to see Morocco via car (it is a breathtakingly gorgeous country) and that we booked through Top Sahara Trips. During the planning, Ahmed was so responsive, answered all my questions, and there were a lot! He even helped us confirm our lodging in Marrakech after the earthquake when we could not reach our hotel. In addition to booking the Fes to Marrakech Desert Tour, we had our guide, Moustapha, pick us up from the ferry in Tangier, bring us to Chefchaouen, and then a day in Fes before heading into the desert. We highly recommend having a guide drive your private party so you can sit back, relax and enjoy the wonders of Morocco!! We also think you should request Moustapha as your guide because he is beyond amazing!! He is an excellent driver and definitely kept us safe on the road. More importantly he kept us feeling safe and comfortable off the road by giving us the inside scoop on what we should expect and what we should do and not do in each location. He also made all sorts of stops between each major destination so we really got to see Morocco! He did all of this in the most welcoming, warmest, and fun way possible! Morocco is unlike any other place in the world that I have visited and I absolutely recommend visiting and booking through Top Sahara Tours and requesting Moustapha as your guide!", "rating": 5.0, "visited": "October 2023"}, {"title": "Marrakech to Fes 4d/3n", "review": "We had an amazing time on our 4d/3n trip from Marrakech to Fes. Mustapha was our driver and he was very welcoming and gave us a lot of good insights. This isn't just a desert tour where the highlight is riding a camel, we stopped off at loads of awesome stops which were all unique. Highly recommended this trip/company.", "rating": 5.0, "visited": "October 2023"}, {"title": "11 day Morocco tour", "review": "My wife and I did an 11 day tour in Morocco. From the first time we emailed the company, Mohammed was very responsive and sent a preplanned itinerary right away. He was willing to make any modifications needed as well. Everything went smoothly during our trip, from the time we got picked up it was extremely easy to find our driver. I had requested specific lodges and all the correct and agreed upon places were booked. The itinerary was also following as specified, but we had the choice to add / remove stuff as we wished. The itinerary was great though and covered all of the key sights to see in Morocco. Said was our driver and he was fantastic. He was patient, informative and very timely. He always ensured we were dropped off in the hotel and were comfortable before he left, and whenever he picked us up, he was very punctual which we appreciated - this ensured our tour wasn’t running late. We had day guides in Fes and Marrakech and both were also great. The day tours were a perfect length, the guides were very informative and took us to all the key spots in the cities. We also did a dessert camp which we rode camels into - this was one of the most memorable experiences for us. We went during August so it was pretty hot, all the hotels / riads had air conditioning which was key. Overall, I would recommend Top Sahara Trips for a Morocco trip!", "rating": 5.0, "visited": "August 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/4c/08/cf/caption.jpg"]}
{"name": "Book Desert Tours", "description": "www.Bookdeserttours.com Best company around Morocco. Our Tours can start from any city in Morocco like Marrakech, Fes, Casablanca and Tangier", "category": "Safaris", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Book Desert Tours"], "hours": "", "duration": "", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/b7/2d/28/caption.jpg"]}
{"name": "Arib Voyages Day Tours", "description": "Arib Voyages is a small customer-focused Moroccan tour company specialising in Trekking, Desert Tours, Camel treks, 4 x 4 adventures, cycling and bespoke trips in all areas of Morrocco such as Marrakech, Sahara, Atlas Mountains, the Atlantic Coast and beyond. Operated by two Bedouin brothers Bachir and Mokhtar el Ammari, Arib Voyages are dedicated to promoting and continuing Bedouin culture by promising outstanding journeys through their qualified guides, mule drivers, chefs, equipment and vehicles. Marhaba!", "category": "Safaris", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Arib Voyages Day Tours"], "hours": "12:00 AM - 11:59 PM", "duration": "Duration: More than 3 hours ", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2b/bb/23/36/agafay-desert.jpg"]}
{"name": "Medina of Marrakesh", "description": "", "category": "Historic Sites Points of Interest & Landmarks", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Medina of Marrakesh"], "hours": "6:00 AM - 12:00 AM", "duration": "Duration: More than 3 hours", "address": "Derb Fhal Zefriti nº6 Derb Fhal Zefriti, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Too many motorbikes", "review": "Very busy square. It was somewhere we wanted to go, but I think I would've enjoyed it more if it weren't for all the harrassers. I also don't think the motorbikes should be allowed in here - we had to constantly be on the lookout for them and try and avoid them in the narrow streets.", "rating": 5.0, "visited": "October 2023"}, {"title": "Ok but too busy for us", "review": "Visited the Medina & Djemaa El Fna Square as part of a tour group . We went early morning before it was too busy . We had a local guide and our Tour Manager with us . Personally we preferred the Medina in Fez . The Medina here allows motorcyclists, donkeys, carts , bicyclists, so it became difficult to walk around. One of our group had a very bad cut on his leg from a rusty cart . So just be very careful. The local people weren’t pushy, rude or over zealous in trying to sell you items . We just found Fez seemed calmer , although it was a much larger area. Several of our group visited the Square in the evening . We had seen the snake charmers & medicine men during the day so gave it a miss .", "rating": 5.0, "visited": "September 2023"}, {"title": "Chaos", "review": "You can find anything here and wander for hours. Smells like a mix of sewage and two-stroke engine fumes. Pure chaos. 10/10, loved it. PS: Please don't support those with the monkeys, poor things are chained up in costumes. Taking photos will get you harassed for money.", "rating": 5.0, "visited": "November 2023"}, {"title": "Pandemonium, chaos and a den of those willing to relieve you of your money", "review": "Unbelievable chaos. It begins the minute you walk in. Horse pee smells from the horse carts. The continual flutes and drums. Poor snakes and monkeys. What ever you do, don't stop to look or you will be hounded for money. There is someone in every nook and cranny ready to take your money. The maize of stalls are indescribable. If you aren't dodging scooters, bike and donkey carts you are all but pulled into a stall. All the stalls sell basically the same stuff. You can ( and will) get lost in the maize of stalls. Google maps for this is very accurate. Offline maps won't work for walking. You just pause to look at something, your harassed cruelly to negotiate. So I'd low ball what you don't want. Only pay what you feel it's worth. At night, the square has multiple street restaurants, which again is a pain to walk through as you become victim of stiff competition with owners in your face ( literally) to win your business. Again, they want to rip you off. Start of reasonable, then without your permission, add things and charge ridiculous amounts for it ( especially stall 55) I absolutely hated this experience, but oddly found it stimulating. Go figure. Oh, and if you catch a cab, ensure you are clear on the price first, and when you end up in a cab, just close your eyes. It's a heart stopping experience .", "rating": 5.0, "visited": "November 2023"}, {"title": "Once in a lifetime", "review": "Life is too short, so if you're healthy and have the time, you should visit Marrakesh.. The city is amazing, totally mad in the nicest way, and straight out of a movie set. Seeing is believing.. but not for everyone. The above statements aside, I recommend Marrakesh to everyone. The people who live here are amazing, happy, and kind. Sure you'll get someone who will happily rip you off, but that's the same in every city around the world. Give Marrakesh and the people who live here the time and respect they deserve, and you'll have an amazing experience. Totally recommend Phil smith 2023", "rating": 5.0, "visited": "December 2023"}, {"title": "You'll Enjoy It, Go!", "review": "You have to do this experience it’s incredible. Even if you don’t buy anything, you should look during the day versus the night. It’s a different marketplace. I recommend that you go deep into the souk to purchase your items. Don’t buy as you see things entering because you see things repeatedly; however, the wholesalers are at the very back where the best prices are. You should always bargain. They give you a price, but you cut that price in half and meet them in the middle, never giving them what they ask for, except maybe where the wholesalers are. They work hard making the items, so do what you must do based on your wallet. If you don’t want to buy anything, ignore them, be kind, say thank you, no thank you, and move on. You can find lots of authentic stuff and a whole bunch of knockoffs, so buyers beware. That’s why I recommend you shop where the artisans are, meaning the people making the items. Purchase heaviest items on your way out. Be careful of the motorcycles cause they’ll ring you over. You don't need a guy either since they'll bring you to friends that have fixed prices for you. Explore on your own and have a great time.", "rating": 5.0, "visited": "December 2023"}, {"title": "Loved it", "review": "The place was very crowded and very lively. We were there around 4pm and sunset was around 5pm. You could definitely finish the entire plaza in 1-2 hours. Its recommended to exchange your dollars around this plaza since the exchange rate was a better deal than other places. Also, keep in mind do NOT take pictures of the people playing with monkeys, if they saw you taking a picture they would ask for payment. We also got confronted by shop keepers when we tried to take their pictures. Apparently, people here believe in dark magic and there was one type of dark magic that trap people's face inside a photo and curse people so that's why the locals hate it when you try to take their photos. Watch out for your pockets near the plaza, this is where most of pickpockets happen but other than that, you are quite safe. We also went to a tea place near the center of the plaza, you go to the roof top and you could view the entire plaza.", "rating": 5.0, "visited": "November 2023"}, {"title": "A lifetime Experience", "review": "The Medina in Marrakech is one for the bucket list, it covers a huge area, at its heart is the Djemaa El Fna. Full of hustle & bustle and selling genuine antiques to tourist crap and many things in-between. The sights and smells are a wonder to behold. The Riyad where we stayed was in the middle of the Medina.", "rating": 5.0, "visited": "December 2023"}, {"title": "Enjoyed it a lot", "review": "Enjoyed wandering through here. Try to take a half day or even a whole day to get lost and wander, eat, shop, talk to people. I found this place to be the best for shopping and souvenirs as prices were competitive in comparison to Fez and Casablanca. Yes, you can go to specific places/towns/merchants directly in Morocco and buy from them as well. People are so friendly. If you get lost, ask people for the \"big square\" every few minutes till you get there and then you can probably find your way back home. Yes, there is bargaining. Enjoy it. It is not meant to be aggressive or rude. Have fun with it like everyone said", "rating": 5.0, "visited": "February 2024"}, {"title": "Fantastic Experience", "review": "Marrakesh was amazing and I would definitely go again. Perhaps brush up on French before I do. The vegetarian food was delicious. I was there with a small group on an art experience. I felt safe on my own. Tips: Go to the airport very early as there are multiple checkpoints. We were lined up out the front doors. Considering how busy it was, it was surprising how quickly we were processed. If packing oils into checked luggage, seal them in plastic bags - not straight in amongst your clothes.", "rating": 5.0, "visited": "March 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/63/94/51/kveldsstemningeksotisktusen.jpg"]}
{"name": "Sahara Riders", "description": "Sahara Desert Exursions from Marrakech", "category": "Safaris", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Sahara Riders"], "hours": "12:00 AM - 11:59 PM", "duration": "Duration: More than 3 hours ", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/98/2a/e3/sandboarding-in-the-sahara.jpg"]}
{"name": "Bahia Palace", "description": "After your hammam at Mythic Oriental, come for a stroll in this extravagant 19th century palace. You’ll be able to prolong your relaxation with the beauty and quiet offered here.", "category": "Historic Sites Architectural Buildings", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Bahia Palace"], "hours": "9:00 AM - 5:00 PM", "duration": "Duration: More than 3 hours", "address": "5 Rue Riad Zitoun el Jdid, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Beautiful but busy", "review": "It was beautiful and interesting history but extremely busy. I knew it would be busy but I should’ve gone early in the morning or right before close so it wouldn’t be as busy. It was also really hard to get photos without people in the background but overall worth going to.", "rating": 5.0, "visited": "October 2023"}, {"title": "Beautiful and Interesting", "review": "As most already know visiting these old palaces and houses in this part of the world is much different than visiting a palace in Europe. There’s no remaining furniture and no artwork to admire. The one thing that one appreciates when visiting these types of houses and museums is the tile work and beautiful gardens. This particular palace has both gorgeous tiles and a beautiful garden but other than that not much more to see. If you have time go and see this place as there are not very many other places to visit here in Marakech.", "rating": 5.0, "visited": "September 2023"}, {"title": "Well worth a visit, but expect to leave with neck ache!", "review": "Lovely building, gardens glorious and ceilings simply stunning. Incredible craftsmanship on these and the plasterwork. A few parts clearly damaged by September earthquake, and under repair, but this doesn't detract from a visit. Sadly the number of visitors does - pity about the ones who created log jams when trying to get the best posed selfie! We were lucky to be able to visit later in the day, when numbers were clearly tapering off.", "rating": 5.0, "visited": "November 2023"}, {"title": "Great place but get there early", "review": "A great place to visit with some wonderful tiled rooms and gardens. There is currently some refurbishment going on but this does not detract from the experience too much. Get there when it opens and have the place to yourself. The tour groups really fill it up later. Well worth a visit", "rating": 5.0, "visited": "November 2023"}, {"title": "An iconic place !!!", "review": "An iconic place !!! It's worth visiting and if you can get a guide to tell you about it's history it's better. There is an entrance fee but you dont need to buy online your tickets. You can buy them right outside the palace but you cant pay with card, cash only.", "rating": 5.0, "visited": "November 2023"}, {"title": "Not to be missed while in Marrakesh", "review": "A very well designed historic place , which cannot be missed while one is in Marrakesh. It has some intricate designs with an excellent combination of wood , plaster , ceramics and marble. The palace provides numerous settings for taking pictures.", "rating": 5.0, "visited": "November 2023"}, {"title": "A Palace Worth A Visit", "review": "Beautiful Royal Palace with ornate ceilings, walls, decorative windows and stained glass windows. Hidden pathways leading to the courtyards and small garden in each turn. It’s sad that some parts of the building were closed to 6.8M earthquake damage and closed for repairs.", "rating": 5.0, "visited": "October 2023"}, {"title": "Captivating elegance", "review": "Bahia palace weaves together moroccan history and architectural splendor. Ils détail ex craftsmanship,vibrant garde ne and tranquil C ourtyards from an enchanting tapestry. A must visit to immerse yourself in cultural riches and timeless elegance.", "rating": 5.0, "visited": "November 2023"}, {"title": "Timeless elegance", "review": "Bahia palace is a precious gem in Marrakech reflecting the blend history of not only Marrakech but the whole morocco. stepping into its ornate courtyard and intricated chambers felt like a travel through time. A must visit for architecture and history.", "rating": 5.0, "visited": "November 2023"}, {"title": "Loved this beautiful, authentic palace", "review": "We visited in November and absolutely loved the stunning, authentic building. By far my favourite tourist attraction in Marrakesh. Reasonably priced, crowds but didn't feel too busy and so many photo opportunities. A great way to spend a few hours.", "rating": 5.0, "visited": "November 2023"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/26/e2/c5/8f/palais-bahia.jpg"]}
{"name": "Mythic Oriental Spa", "description": "A spa with quality facilities and good massages with reasonable prices for what you get. Come ready to relax! Welcome A stone’s throw away in a lit “Derb” you’ll discover the door of the “Riad”. The latch on the door to knock gives access to the oriental ancestral culture of well-being. A smile welcomes you and offers you the chance to cross the threshold of the carefully restored dwelling… “Salam Alekoum”… you are welcome. Settle in and as our age-old tradition of hospitality dictates, make yourself at home in the “bou’h” (little lounge) to appreciate a scented tea. Let your first sense, taste, awaken.", "category": "Arab Baths Hammams & Turkish Baths Spas", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Mythic Oriental Spa"], "hours": "10:30 AM - 8:00 PM", "duration": "Duration: 2-3 hours", "address": "7 Derb Esaleh, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Relaxing experience", "review": "Not always sure how long we were in each space. Beautiful building interior, polite staff, water and choice of scent for massage. Scrub in the Hammam was an experience, the massage that followed was great almost fell asleep. Final relax on the rooftop as darkness fell and a call to prayer rang out. Magical", "rating": 5.0, "visited": "October 2023"}, {"title": "Incredible", "review": "What an amazing experience. We were greeted by the staff and they couldn’t have made us feel more welcome. Myself and my husband had a duo mystic package with private beldi hammam including black soap scrub followed by a massage. I can honestly say this was the best massage we have both had. We do day spas at home in the UK but the masseuses here really know their stuff. The way they take you from treatment to treatment is effortless and not stressful at all and they explain it all so well. There was perfect time in between treatments to sit and drink water and rehydrate and we never felt rushed. The mint tea and pastries on the terrace was a lovely touch at the end. We loved it so much we have book a different treatment before we leave Marrakesh.", "rating": 5.0, "visited": "November 2023"}, {"title": "Enjoyable time", "review": "It was a very cool experience. What I especially liked was that they tried to really keep the place quiet so that you can relax and enjoy fully. I did not hear any sounds behind the door during the massage (no talks in the hallways or other sounds - it can be the case in some hammams). The massage was really good and the attitude to a guest - very welcoming and respectful.", "rating": 5.0, "visited": "February 2024"}, {"title": "Best massage in our lives.", "review": "We booked a couples package (Mythic Oriental Lovers) and had the experience of our lifetime. Hard to put in words how good this was, but my wife told me I fell asleep twice during the massage to the point that I was snoring. I was so relaxed that I didn’t even noticed it. My wife and I agreed that this has been the best massage of our lives, and we have traveled to a few places and spas across South America, Europe, and Southeast Asia.", "rating": 5.0, "visited": "March 2024"}, {"title": "Amazing day", "review": "An amazing spa, I would highly recommend this place. The staff are accommodating and lovely they speak good English also. The place itself is beautiful and very clean, it's homely. Me and my mum went for a hammam and massage and we both had the best time. I could have stayed here longer but we were in a rush. Definitely try this place out if you are in Marrakech", "rating": 5.0, "visited": "March 2024"}, {"title": "Pure luxury", "review": "We went for the Mythic Royal.package and it was nearly 6 hours of pure pampering and relaxation. Cannot recommend this highly enough. Beautiful surroundings and lovely staff who made the experience one to remember.", "rating": 5.0, "visited": "March 2024"}, {"title": "Worth a trip if you’re in the area and worth every penny!", "review": "Relaxation and chilled out. Great price and definitely worth a visit. No pool option though. It would be nice to be given water after the massage, but we were given tea which was still lovely. We went as a group of friends, but that means you’re stripping off together for the massage and there’s no hiding, I’m just conscious of those who may book with people who they aren’t comfortable doing that with. There’s only one shower and toilet which can hinder the time it takes to leave after, but was a lovely day!", "rating": 5.0, "visited": "March 2024"}, {"title": "Great experience very relaxing!", "review": "This was our first time at a hammam and we enjoyed it so much we booked in again! Both times we had the hammam rituals which was great value for money. We particularly enjoyed the steam room experience and must mention how good the tall thin lady was. Luckily we had her both times. The first visit was on a quieter hot day and we weren’t rushed enjoying tea on the terrace. The second time was unfortunately awful weather and was much busier with walk ins being fitted in. We still enjoyed it but the moisturiser was smeared on and we had to sit awhile in the communal area waiting for it to soak in. On our first visit it was well rubbed into our skin and it felt like the same care wasn’t taken. This wouldn’t however put us going off again next time we’re in Marrakesh though.", "rating": 5.0, "visited": "March 2024"}, {"title": "Traditional hammam and massage", "review": "We went here as a couple and it was amazing. Relaxing experience. First we had hammam and afterwards we had a really nice full body massage. In between we got provided with moroccan tea and water. We had a really nice traditional experience. Thanks.", "rating": 5.0, "visited": "April 2024"}, {"title": "Best Hammam in the World.", "review": "The best Hammam I've ever been to. Simply fantastic from start to finish. Zahara, Hadija, Fataima the ladies who massaged and scrubbed us down were amazing. The place is spotless clean and chic without being pretentious. The products are gorgeous and the prices are fair. I would go back 100 times. Even the tea and biscuits at the end are home made and fresh. Amazing.", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/19/c6/6c/45/patio-the-night-of-mythic.jpg"]}
{"name": "Alphais Spa", "description": "Alphaïs Spa Marrakech is located a few minutes walk from the famous Jemaa El Fna square, in one of the most famous areas of Marrakech traditionally reserved for the beautiful residences of the Medina, a welcoming, elegant, calm and peaceful place that will enchant your senses. Push the doors of your Spa in Marrakech and try the complete experience. Soft lighting, subtle aromas, relaxing music. Find the alliance of modern well-being in a place of rest and traditional tranquility in the heart of the medina of Marrakech. Under the expert hands of our beauticians, treat yourself to a unique journey. Body and facial treatments, massages, hammam, jacuzzi...", "category": "Hammams & Turkish Baths Spas", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Alphais Spa"], "hours": "9:00 AM - 8:00 PM", "duration": "Duration: 2-3 hours", "address": "Derb Lalla Zouina 4, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Amazing", "review": "The spa is located in one of the side alleys and looks fairly average from the outside, however once you step in, you enter a different world. The spa is decorated beautifully and is so calm and relaxing. You are provided with disposable thongs/boxers, comfy slippers to wear around the spa and given a robe. You get given a locker to put your belongings in and create a code to lock it. We booked the Hamam and massage experience and walked out at the end feeling squeaky clean and so relaxed and smelling gorgeous. Huda and Hasna were incredible with looking after us. We know where to come for every time we come to to Marrakech.", "rating": 5.0, "visited": "October 2023"}, {"title": "A must Haman visit!", "review": "WOW! This is a little piece of heaven off the busy intense Kasbah. On first impressions you'd be forgiven if you had 2nd thoughts but as the door opens, you're welcomed into an oasis of calm tranquillity. From the subdued lighting to the waterfall wall you enter a Tardis of serenity. My husband & I had a couples 45 min Haman and relax 1 hour massage. We were asked to get changed and provided with 'paper' men boxers and a lady thong, slippers & a robe, I opted to wear my bikini and they were very accommodating. However, once in the Haman room which was a large heated tiled corner bed, I felt comfortable enough to remove my top. The ladies were extremely professional, kind and relaxing, they leave you in between scrubs, lotion application and watering off so the various creams and lotions can be absorbed. Don't let this put you off, it's very normal. Afterwards we had a cool drink of water before starting a very soothing massage. Again, my husband and I were together on adjacent massage beds. After this, we were taken to the 'relax' zone and offered ginger biscuits and hydrating tea...both were delicious. All this for just £60 each! Amazing value & we will definitely visit again.", "rating": 5.0, "visited": "December 2023"}, {"title": "Wow oh wow!!!", "review": "Oh my, I am sad I can only rate this a five! We visited here to get a taste of traditional Moroccan culture. I booked via email before we arrived in Marrakesh & all emails were replied to within minutes. We took a taxi from our hotel and then walked a short way to find the spa (perhaps give yourself some time to find as the streets can all look similar). As other reviews have said, it doesn’t look much from the outside but the moment you step inside you are transported to another world. We were shown to a changing room & given paper underwear, slippers & robe with an additional cover which velcroed around me for my chest. There was also a locker for our belongings that we entered our own code to lock. We first had a couples hammam which was nothing short of amazing, the ladies were very skilled & made us feel at ease right away. I’m not comfortable with my body so opted to keep my bikini on. However, I soon relaxed and removed my bikini top. After the 30 minute hammam, our skin was so soft & we were very relaxed. We were then given a chilled bottle of water each before being taken upstairs to the couples massage room. We were given our choice of different fragrances for the massage, I chose Jasmine & my husband Lemon. I have had a lot of massages over the years but can honestly say it was the best one ever. I wish I could have one that good every week!! After the massage, we were shown to the chill out area & brought mint tea & a biscuit. We were then left to simply chill, indeed I fell asleep. The only slight negative, we weren’t sure how long we should stay there - perhaps the staff could say in future to relax as long as you wish & make your way back to the changing room when you are ready. Once we went back down, we were shown back to the changing room & paid the bill, along with a generous tip. All staff were attentive, friendly & asked more than once of everything was ok…. To which we replied, more than ok! A wonderful gem right in the heart of the Medina but a million miles from anywhere once you step inside. Thank you ladies.", "rating": 5.0, "visited": "January 2024"}, {"title": "Best Hammam and highlight of our visit to Marrakesh!", "review": "My partner and I came from Ireland for much needed 2 day visit to Marrakesh. I have lived in the Middle East and gone for hammam Moroccan baths regularly. I knew this was going to be the highlight of our visit and took a great deal of time to choose the perfect hammam. I’m delighted to say the Alphais Spa is perfect in every way, from the decor, to the relaxing atmosphere, the complimentary mint tea, music and the treatments were exquisite! We both opted for the package which included hammam and scrub for 30mins and tonic massage and we both unanimously felt it was outstanding! All the staff were exceptional, welcoming and warm. In particular Hasina and Asma (hope we got the names right!) took just great care and their tonic massage was incredible! Thank you so very much for your attention to detail and professionalism and look forward to our next visit!", "rating": 5.0, "visited": "March 2024"}, {"title": "Fab Hammam Experience", "review": "This was an authentic experience in a stylish spa. The decor is very classy and the staff are friendly. The wash/scrub is like no other spa experience in the UK - the woman even washed our hair. No body part is left untouched and also be aware that apart from tiny paper pants you'll be naked in front of whoever you're with. After the massage we had plenty of time to relax on loungers and were served mint tea and biscuits. You leave feeling ultra clean, supple and refreshed. Highly recommended.", "rating": 5.0, "visited": "March 2024"}, {"title": "Lovely staff and great hammam", "review": "The spa was relaxing, beautifully decorated and quiet, situated quite close to the main square. My partner and I did the 45 min hammam incl. ghassoul & 20 mins massage – it was heaven! The staff were professional and very friendly, making us feel comfortable throughout our treatment. Finished off with a complimentary water, mint tea & cookies. What’s not to love?", "rating": 5.0, "visited": "March 2024"}, {"title": "Beautiful hammam with fabulous treatment", "review": "Really beautiful, stylish hammam. We had never been for a hammam before but were put at ease. We soon got over wearing the paper pants (after a lot of laughs) and the scrub and wash down was a great experience. The relaxing massage was probably the best I've ever had, the lady seemed to know exactly how each movement felt, and she found and gently worked out all the knots in my shoulders. Would love to return!", "rating": 5.0, "visited": "April 2024"}, {"title": "Bliss", "review": "My friend and I spent about 2 hours at Alphais Spa this afternoon. Everything was calm, clean and relaxing. The service was relaxed and skilful. Possibly the best massage I’ve ever had. The masseurs took not of our needs and gave us perfect service. So relaxing. Highly recommend", "rating": 5.0, "visited": "April 2024"}, {"title": "Great experience", "review": "Very difficult to find!! But worth it when you get there. I had a hamman and back massage, it would have been more relaxing in the steam room had I not been so hot already (37° outside) but was great overall. Staff do not speak English but French which I could understand. Great relaxation room with mint tea afterwards, definitely worth a visit for a truly Moroccan experience", "rating": 5.0, "visited": "April 2024"}, {"title": "Absolutely beautiful spa", "review": "Absolutely beautiful, peaceful and authentic spa in Marrakesh! A must-visit place in my opinion, had a 35 min hammam and 20 minute massage which was fairly priced (tourist prices) and we had a wonderful experience. All staff are professional and communication is spot on. The area which you relax at the end with tea is stunning. I just wish I had the money to go back again! Thank you.", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0e/48/fd/5c/le-patio.jpg"]}
{"name": "ANIMA André Heller Garden", "description": "André Heller's ANIMA is a magical place of surprising beauty that you wouldn't expect in the loud and crowded area of greater Marrakech. It's not only a garden: it's an impressive botanical staging. 250+ types of plants, from bamboo over palms and cacti, interact with pieces of art by Pablo Picasso, Keith Haring, undiscovered local talents and many more. Furthermore, two museum rooms present artists from around the world. Our own Café Paul Bowles offers meals made with spices and ingredients from the garden like saffron, mint, olives, etc. Enjoy fresh organic fruit juice, fine teas and delicious pastries...", "category": "Gardens", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "ANIMA André Heller Garden"], "hours": "9:00 AM - 6:00 PM", "duration": "Duration: 1-2 hours", "address": "Route d'Ourika Douar Sbiti, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Worth the drive for great sights", "review": "Had a fantastic trip out to these gardens. It was lovely and peaceful and you could wander around at your own pace admiring the plants and artwork. There were different sections and plenty of seats to take a rest and take in the surroundings. We stopped for lunch at the cafe which was reasonably priced. We had a private taxi to/from Marrakesh centre, takes about 50 minutes to drive there", "rating": 5.0, "visited": "October 2023"}, {"title": "Stunning", "review": "I really enjoyed this garden. It's about 30km outside of the city and the distance helps in giving it a quiet air. The plants and flowers are beautiful, and the various art and sculptures make for wonderful and at time eerie photo opportunities. There's a lovely cafe and gift shop too. This is the garden to visit in Marrakech!", "rating": 5.0, "visited": "February 2023"}, {"title": "Definitely worth a visit from Marrakech", "review": "Absolutely stunning and enchanting escape from Marrakech. Delightful to see various sculptures and creations round every corner as you wander round all set with the back drop of the Atlas Mountains. The free shuttle to and from Marrakech made it so easy to get to", "rating": 5.0, "visited": "October 2023"}, {"title": "Stunning garden adorned with sculptures", "review": "Lovely tropical garden with many sculptures set within. Sinuous paths lead to garden rooms, each very different and set off by sculptures, some disquieting, others whimsical, others thought provoking. A chic cafe and store provide more reason to linger.", "rating": 5.0, "visited": "November 2023"}, {"title": "Lovely few hours - totally chilled", "review": "We loved this quirky garden - even the teen was impressed by the hidden sculptures and hammocks where you could hang out and chill. Cafe was nice and they have vegan coffee plus snacks. We preferred this to the secret garden even though it’s a 45m drive out of Marrakesh and we chose to go here rather than Jardin Majorelle because it was way more tranquil - no waiting to take pictures/crowds of people. Top tip - book the free transfer before you book the tickets if you want to get the free bus option.", "rating": 5.0, "visited": "November 2023"}, {"title": "Fusion of Art and Nature", "review": "Anima garden combines art and nature in a visually striking way. The entrance fee is relatively higher than others in marrakech or the surrounding .each corner reveals a new blend of nature and creativity providing a serene escape from the bustling city of Marrakech . The harmony creates a tranquil atmosphère. Don not hesitate to visit this amazing place for art and nature.", "rating": 5.0, "visited": "November 2023"}, {"title": "Wonderful and unusual garden - great for kids", "review": "A wonderful trip to a beautiful garden filled with weird and wonderful sculptures and pieces of art. Our kids had a particularly enjoyable time exploring the gardens and delighting in the strange art. Most of the garden is nicely shaded from the heat of the sun. There's a nice cafe too. Worth noting this is quite far out of the city, about a 30-40 minute drive away from the centre of Marrakesh.", "rating": 5.0, "visited": "March 2024"}, {"title": "An absolute delight", "review": "Although there is a shuttle bus available from Marrakesh to view these gardens, we were travelling towards the Atlas mountains in a car so took the opportunity to call and see these highly rated gardens as we were in the area. We were not disappointed. The garden was started from a bare plot of land in 2008. The garden that has been created is magical, filled with beautiful plants, complemented with outstanding art works and with plenty of aromatic shrubs lining the paths it satisfies all the senses. It is immaculately maintained and needs a couple of hours to wander around. Plenty of seating are available to take in the views. There is a small museum dedicated to the works of German artist Hans Werner Geerdts on site and also an excellent reasonably priced cafe to complement the garden We are great fans of gardens and this was one of the most original and eclectic places we have seen around the world. A must visit in our opinion.", "rating": 5.0, "visited": "April 2024"}, {"title": "greentour", "review": "As a visitor to Anima Garden, I was captivated by its enchanting blend of art and nature. The garden's serene ambiance and intricate sculptures provided a truly magical experience. However, I couldn't help but notice the steep price of admission, which may deter some potential visitors.", "rating": 5.0, "visited": "April 2024"}, {"title": "Stunning, spiritual and inspiring", "review": "Just an hour out of Marrakech you’ll find these amazing gardens. Go early and not part of a tour so you can appreciate the tranquility of these beautifully set our gardens. Give yourself at least 2 hours to explore every nook and cranny as every corner you turn presents another jaw dropping view. Fascinating sculptures and art work bring this garden to life. A magical place for contemplation and inspiration. Simply put, don’t leave Marrakech without a visit!", "rating": 5.0, "visited": "May 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/11/3c/21/fc/photo6jpg.jpg"]}
{"name": "Hammam Rosa Bonheur", "description": "Hammam Rosa Bonheur, Spa Care of the mind and body A trip to Morocco without a visit to the hammam is an unfinished dream. Benefit from a hammam is to enter the depths of the country. This is a unique and authentic journey to heal both the mind and the body. It is impossible for the mind to leave a hammam without measuring the history of its places and ancestral traditions of oriental beauty. For the body, because it's well-being is a vital player in one's health. Come and discover Hammam Rosa Bonheur for a personalised relaxation experience. Close to the Place Jemaa El Fna, our new spa combines the beauty of an old redecorated place with techniques for men and women of today. This hammam spa, with its timeless atmosphere, the atmosphere of which draws its wealth in oriental spa is a place of rest and relaxation in which the care, welfare and beauty come together in the same delight. We have developed for your wellbeing a range of treatments using natural products enabling you to discover the beauty of the Moroccan ritual.", "category": "Hammams & Turkish Baths Spas", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Hammam Rosa Bonheur"], "hours": "9:00 AM - 12:00 AM", "duration": "Duration: More than 3 hours", "address": "35 Derb El aarssa Quartier Riad Zitoun Jdid, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Blissful Hammam", "review": "Very easy to schedule via WhatsApp. I was met at the Bahia Palace and walked over to the Hammam which was helpful since it's tucked away. Greeted with mint tea and confirmed my service before changing into the robe. Lockers were provided. The hammam scrub was wonderful and the massage was blissful. I felt well taken care of the entire time. I had two hammam experiences during my trip and this one was the BEST!", "rating": 5.0, "visited": "October 2023"}, {"title": "Beautiful Spa in Marrakech Medina", "review": "Beautiful, professional spa services! We got the royal package as a couple and glad we did. I loved the facial treatment in particular! We made the mistake of not setting an alarm and overslept our meeting time (don't book after a red eye), and they were still able to accommodate us with no guilt! Thank you! Always remember to tip your staff for amazing service!", "rating": 5.0, "visited": "October 2023"}, {"title": "Out of this world", "review": "Me and my friend decided to come to marrakech for a spa holiday. After reading reviews decided to try this hammam, what can I say, it has to be one of the best massages we have had. Me and my freind booked 4 days on the trot and all 4 therapist’s were amazing. A huge thanks to Fatima, Najaf, Toria and Nabila. The manager was very polite and professional. 10/10 would highly recommend.", "rating": 5.0, "visited": "November 2023"}, {"title": "i am reborn", "review": "incredible, 10/10 i feel reborn. we did the rituel royal, called them on whatsapp in the morning and they were able to fit us in 2 hrs later. hammam was incredible, massage and facial were extraordinary. such professional and lovely staff. very clean. great rates compared to other hammam packages, incredible value, good wifi too! overall highly recommended", "rating": 5.0, "visited": "November 2023"}, {"title": "Fantastic! I will definitely go back😊", "review": "This was by far one of the most relaxing experiences I’ve had in my life. I definitely was afraid to try since this was my first time in Marrakesh but thankfully the staff was able to get me in at the last-minute booking and help me figure out where exactly the spa was from my Riad. Forewarning though: make sure you bring cash, but it all worked out as stated later in this post. The facility was beautiful. The staff was so wonderful and made me feel so welcome. The services were excellent. My skin was so soft and I was so relaxed after a very stressful trip to Marrakesh. They even gave me a gift at the end of my session, which was so sweet 😊.when I got back to my room, I passed out like a baby. I know I mentioned bringing cash because I made the mistake of not bringing enough but thankfully Abderrahim was able to walk with me to a working machine and was able to coordinate my taxi back to my Riad. He is a godsend. I will definitely be back as the entire staff was fantastic. I cannot wait to get back actually.😉", "rating": 5.0, "visited": "November 2023"}, {"title": "A must!!", "review": "Everything clean and beautiful. Just arriving we were immediately attended and offered some Moroccan tea for free. And the stuff treated us perfectly, they created a safe atmosphere. Plus they let us stay longer in the jacuzzi. The hammam is an extremely relaxing experience. And we visited twice during our stay, because we really liked it.", "rating": 5.0, "visited": "December 2023"}, {"title": "Lovely time experience", "review": "We ve been recommended this place by a friend who came here before. We booked in whatsap on which the conmunication and the specifications we ordered were very easy. We were welcome by tea and been exolained the procedures then we started the hammam srcub which was amazing and after moved to massage for back and neck which was deep and very nice", "rating": 5.0, "visited": "December 2023"}, {"title": "Fabulous", "review": "Fabulous!! We thoroughly enjoyed our experience at this Hammam. It is a very clean, appealing and relaxing environment. The service was excellent! Also, the Manager was very kind and welcoming! We had massages, scrubs, and facials and they were all amazing. When we finished, we were so relaxed from the whole experience. Highly recommend this Hammam!", "rating": 5.0, "visited": "February 2024"}, {"title": "What a wonderful anniversary present!", "review": "My husband and I have made it to 30 years of marriage and happened to be in Marrakesh. We treated ourselves to some serious pampering at this establishment today 20/02/24 and we very pleased with the experience. Thank you to all the ladies who made us soft and relaxed.", "rating": 5.0, "visited": "February 2024"}, {"title": "Magic experience", "review": "Do not leave Marrakesh without booking a treatment at this spa. It is simply great experience The entire process from beginning to end was smooth and very relaxing. We went as a group of 4 ladies. Once you’re comfortable receivi g your hammam treatment in the same room as your friend you will feel completely pampered (2 per room). The spa was both efficient and luxurious. The prices were also excellent when you compare the conversion rate advantage. The aestheticians are very skilled at their jobs. I did the Hammam, massage and facial for 2h30 in total Highlight recommended", "rating": 5.0, "visited": "February 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/05/23/cc/d9/hammam-rosa-bonheur.jpg"]}
{"name": "EXCURSION FROM MARRAKECH", "description": "Good morning ! My name is soulaimane, and I am an adventurer and nature lover. I am very happy to be your host for this unforgettable experience. And I will be happy to share my culture with you and all my local knowledge about Morocco", "category": "Safaris", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "EXCURSION FROM MARRAKECH"], "hours": "12:00 AM - 11:30 PM", "duration": "", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/0e/ba/d8/caption.jpg"]}
{"name": "Marajah Spa", "description": "Immersed in an experience at the heart of Moroccan tradition, the Marajah Spa will make you travel in a tale of a thousand and one nights. The Marajah Spa makes you discover the ancestral Moroccan rituals in a luxurious universe dedicated to relaxation: 400 m2 of space spread over 2 levels with 4 luxurious hammams, 7 treatment cabins, and a large relaxation room. Women and couples only.", "category": "Hammams & Turkish Baths Spas", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Marajah Spa"], "hours": "9:00 AM - 12:00 AM", "duration": "Duration: 2-3 hours", "address": "Boulevard de Safi Las Torres de Majorelle Building, Marrakech 40000 Morocco", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Definitely recommend", "review": "After spending three days in the Sahara desert, riding camels, long walks & driving, this is exactly what i needed in my life. This was my first hammam bath, so i wasn't sure what to expect. I also got a body, scrub, wrap, foot, and full body massage. The bath by Fatiha 2 was completed with limited communication. She spoke french, which i didn't speak nor understood, but we were able to communicate by hand, lol. While i like to believe I am a clean person, however, the body scrub said differently. I literally felt squeak y clean. The massage by Khadija 3 was awesome; I didn't know I had muscles/joints that popped like that. It was the most amazing experience. I 100% recommend this place.", "rating": 5.0, "visited": "October 2023"}, {"title": "Beautiful Spa, great experience, highly recommended!", "review": "While we had an option to book massages at our Riad, we wanted to have the Hammam experience as well & so I booked the Marajah Spa for myself & my 3 daughters aged 14-21. It was a fantastic experience & I’m so delighted that we chose that option. We went for the Royal treatment which includes the whole Hammam scrubs, etc with a 1 hour massage. The Spa itself is beautifully decorated & feels luxurious. The staff were really friendly & laughed along with us as we tried to figure out the different stages of the Hammam process. We hadn’t a clue, don’t speak Arabic & have limited French but we all managed through odd words here & there, hand gestures & lots of laughs. I would highly recommend this Spa, I know that we will remember the day for a long time! Thank you to all the staff for a fantastic experience!", "rating": 5.0, "visited": "January 2024"}, {"title": "Amazing experience", "review": "Great experience! My first time in a hammam and I didn't know what to expect. But it was relaxing and the ladies are experts. Also, the tea and cookies served were delicious! Please remove your make-up before so you can enjoy the whole treatment for face and hair too. You receive there a bathrobe, slippers and disposable underwear ( you can of course bring your own bikini bottoms), but I also recommend bringing a towel to have after you shower. We didn't have anything planned after this, so we're glad we could just return to the riad and enjoyed the best sleep!", "rating": 5.0, "visited": "April 2024"}, {"title": "Wonderful experience & great pricing", "review": "What a wonderful experience! My mom and I went for a 45 minute facial and didn’t know it started with a message which was absolutely fantastic. The space is clean and gives a sense of peace. There was no rushing, just relaxation. Lina was magical, her hands were so soothing and I felt like a new woman at the end!", "rating": 5.0, "visited": "April 2024"}, {"title": "Super relaxing multi room spa experience", "review": "We went to this spa as a couple and had a very relaxing time. We did the ROYAL 2H course where we were given a black soap scrub, sauna experience (you get given a bottle of water too) , mud face/body mask, argan oil foot massage (with tea and cookies), and finally a 1 hr massage. The building was very beautiful and each of the spa rooms had a good atmosphere and were well designed. The team of people working there were very organised, you will have different women doing each of the spa stages. There are changing rooms with lockers for your belongings and you will get a bathrobe (you can use this to dry yourself after you take a shower at the end), slippers and modesty underwear. Overall I highly recommend this experience.", "rating": 5.0, "visited": "May 2024"}, {"title": "A fantastic, good value experience in relaxing surroundings.", "review": "A fantastic experience which was worth every penny. I’ve been exfoliated from head to toe so my skin feels smooth and soft. I had a separate foot massage followed by a full body massage which was wonderful. Staff (especially Leena) are lovely and there’s no embarrassment whatsoever despite being in modesty knickers (and a robe for moving about). The refreshments of bottled water, mint tea and beautiful biscuits were a welcome bonus.", "rating": 5.0, "visited": "May 2024"}, {"title": "It was amazing", "review": "I had a very good experience with the spa. Was with hammam and with a very good massage. The both girls helped me very good en there where very kind. Especially the girl (Lina) who gave me the massage was very sweet and kind. I recommend everyone to go to her for a very good massage!", "rating": 5.0, "visited": "June 2024"}, {"title": "Fantastic spa in Marrakech!", "review": "Fantastic spa close to the Jardin Majorelle. We had a berber treatment and everything is included. mint tea and cookies just before your massage, sublime! great value for money and the staff are very friendly! Don't hesitate to book!", "rating": 5.0, "visited": "July 2024"}, {"title": "Great Experience", "review": "This was a great experience. It was my first time getting a hammam and it was wonderful. I got the Royal package but was disappointed that I missed out on the mask part. I think that may have been due to a communication difficulty. I speak English and it is not widely spoken at the spa. I was trying to communicate not on my face but I think it was misinterpreted as not at all. I asked for it but nothing happened. I enjoyed the cookies and mint tea between services. It was a lovely touch. Overall, great scrub and relaxing massage. I echo some of the other comments that mentioned noise as a concern. Several times, some of the staff attempted to quiet others as they were making noise talking to one another. I would go back for sure!", "rating": 5.0, "visited": "August 2024"}, {"title": "Wonderful Spa", "review": "My daughter and I went to Marajah Spa on 9th Sept 2024 ( this was my daughter's 2nd visit and my first. It was amazing, it's the best Spa I have ever been too. The staff were so friendly and the who experience was lovely. Thank you Fatima, Naima, Lina and Khadija you 4 lovely ladies made our whole experience absolutely wonderful. I'm a travel agent and will definitely recommended this Spa.", "rating": 5.0, "visited": "September 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/1b/4d/80/64/getlstd-property-photo.jpg"]}
{"name": "Morocco Excursions", "description": "Are you looking for a local Moroccan tour company? At Morocco Excursions Company you are on the right page. Join us on our tours and discover what Morocco has to offer, from the imperial cities to the Atlantic and Mediterranean coasts, the Atlas Mountains, and the Sahara Desert. Our ultimate objective is to link you with the authenticity of Morocco's monarchy and allow you to feel the genuine beauty of our country. We offer private and small group tours in Morocco ranging from 1 to 30 days, departing from Marrakech, Fes, Casablanca, Tangier, Rabat, and other places. The High Atlas Mountains, old Berber villages, oases, valleys, and canyons are all part of our Morocco desert trips. Riding a camel in the dunes for a night in a desert camp under the stars in the middle of the Sahara is one of the highlights of our Sahara adventures. Aside from excursions, we offer car rentals in Morocco, including SUVs, family cars, buses, and more.", "category": "Safaris", "breadcrumbs": ["Africa", "Morocco", "Marrakech-Safi", "Marrakech", "Things to Do in Marrakech", "Morocco Excursions"], "hours": "12:00 AM - 11:59 PM", "duration": "Duration: More than 3 hours ", "address": "", "neighborhood": "", "rating": 0, "getting_there": [], "top_reviews": [{"title": "Amazing 4 day tour from Marrakech to Fes", "review": "We have just finished an awesome four day tour travelling from Marrakech to Fes with our guide Ahmed. We had a great time being shown all the sites of Morocco and Ahmed was amazing always going over and above for us. Our highlight was spending the couple of days in the desert, enjoying the sunrise and sunset and seeing how the nomads and berbers live their life in Morocco. Highly recommend this tour to anyone wanting an adventure getting out of the big cities and experiencing true morocco- the scenes you pass are amazing. A big thanks to Ahmed for making our trip so memorable!!", "rating": 5.0, "visited": "October 2023"}, {"title": "Once in a life time experience", "review": "We did a private five days tour from Agadir to Marrakech with stop overs in Ouarzazate, the Sahara and Boumalne. Our driver and guide Hassan did a fantastic job during these days. He knows his country by heart and is full of inspiration, skills and life. It was a real pleasure and unique experience to travel with Hassan. The tour preparation with Morocco Excursions was smooth and uncomplicated. P.S. thanks for all the coffee stops! :D", "rating": 5.0, "visited": "October 2023"}, {"title": "Great experience thanks to Mohamed", "review": "Did the 5 day desert tour to Merzouga from Marrakesh. Our driver Mohamed was great. His friendly personality and helpful suggestions about the places and viewpoints during the trip were invaluable. Highly recommend him as a driver and guide.", "rating": 5.0, "visited": "December 2023"}, {"title": "9 days in Morocco with Omar is amazing", "review": "we did 9 days tour with Omar from Morocco Excursions and it has been one of the most memorable trips. Omar is very polite, always on time and always tries his best to accomodate our trip. Before he dropped us off at any places, he would give some tips what we should be aware of and a brief story of each place we would visit. Before i decided to choose Morocco Excursions, i had contacted another agency, however the agency owner made me feel unsafe if we would go with him. that was when i decided to do another research and found this agency. The price is very competitive for a private trip (trust me, i did tons of research) and every minute while we were in morocco made me feel it is worth paying. My recommendation is if we find a slow response via email or whatsapp, add their IG account and send IG message, you will get a reply in less than a day", "rating": 5.0, "visited": "December 2023"}, {"title": "Great 4-day Marrakesh-Atlas-Desert tour!", "review": "Great tour! We had a 4-day tour from Marrakesh to Merzouga and then back to Marrakesh and could not recommend it more! Our driver Mohammed was very professional and flexible throughout the trip. He brought to the best (hidden) spots throughout the tour (Kazbah/Co-operatives/View points/Hollywood spots and many many more). Great experience overall we felt safe and taken care of all the time. Moroccan hospitality is really a thing.", "rating": 5.0, "visited": "May 2024"}, {"title": "Great trip", "review": "I sincerely believe that the people are what makes a place amazing, and in this case I can say with confidence that one of the main reasons we loved Morocco was our experience with Morocco Excursions. We were with Mohammed for 6 days and by the end we felt like we were close friends, if not family. He was very polite, always on time, and very patient and loving towards our two kids. We enjoyed our time and felt comfortable during the long drives all across Morocco. The 9 seater van was spacious and more than enough room for our family of 4 and Mohammed. The meals at the hotels were tasty and filling, if a bit repetitive (soup and chicken tagine for dinner most nights). The local tour guides were knowledgeable. We needed to make a few changes to our bookings (upgraded to the superior tents in Merzouga, and decided to spend an extra night in Merzouga rather than Marrakech) and Hassan accommodated both of our requests. Overall, I highly recommend Morocco Excursions, especially our driver Mohammed.", "rating": 5.0, "visited": "May 2024"}, {"title": "An authentic and well organised trip with diverse experiences and friendly people", "review": "Our 12-day tour was perfectly organised. We visited many different areas by car, but it didn't feel tiring as we had regular stops, which also gave us the chance to enjoy beautiful views. Our drivers and guides were knowledgeable and friendly and made us feel comfortable. Our main driver, Omar, had great recommendations, was really friendly and discreet, and we really enjoyed spending time with him on the road. The tour had a great selection of places and things to do, from busy and colourful markets and workshops to mosques, palaces and other attractions, coastal resorts, green areas, mountainous landscapes, and of course, the desert. We always had someone to guide us around and give us tips and never felt unsafe. Also, any questions we had were responded to instantly. We loved all the places we visited but particularly enjoyed the southern part of our trip, including the desert, where we visited a berber nomad tent, rode camels, stayed at the desert overnight, played music with the berbers, and experienced the music of another local tribe. All the people we met were helpful, authentic and friendly. Highly recommended 👌👍👏💯🙌😊", "rating": 5.0, "visited": "May 2024"}, {"title": "Morocco Tour - 2 weeks", "review": "Omar was the perfect driver for the Morocco tour of 2 weeks that I did with a friend. The car was very comfortable and Omar driving skills were perfect. Omar was extremely nice in showing us all the best spots for taking pictures and all the local shops, restaurants and sight seeing. He provided us with all the relevant touristic information and additional local tips. He was very welcoming and kind and he really made the difference during our vacation. Thanks to him our experince in Morocco was great and I will definetely recommend it. Thanks again to Omar for taking care of us during our trip, All the best :) Cecilia", "rating": 5.0, "visited": "June 2024"}, {"title": "Great driver!", "review": "I hired a driver for 6 days tour from Marrakech to Merzouga and back with my two daughters (6 and 8). Having Omar as a driver was a very good experience, he was very helpful, attentive and discreet all the time. He provided suggestions when I needed them without being intrusive. Very caring and also patience with the kids. Would recommend and hire again!", "rating": 5.0, "visited": "August 2024"}], "reviews": [], "images": ["https://dynamic-media-cdn.tripadvisor.com/media/photo-o/2a/bf/59/18/morocco-excursions.jpg"]}
