{"name": "Dallas", "description": ["All eyes were on Dallas on Nov. 22, 1963, when President John F. Kennedy was assassinated as his motorcade drove through Dealey Plaza. While a visit to this famous site, which also serves as the birthplace of Dallas, should be at the top of every traveler's must-see list, that's not all the Big D has to offer visitors. Those in search of family-friendly to-dos should add the Dallas World Aquarium, the Dallas Zoo and the Perot Museum of Nature and Science to their itineraries, while culture hounds explore the Dallas Art Museum, Deep Ellum and the Crow Museum of Asian Art.", "If you're looking for a quintessentially Texan experience, Dallas offers that too. Whether you're in town for a Dallas Cowboys home game at AT&T Stadium, the annual State Fair of Texas, or simply hoping to enjoy some tasty barbecue or Tex-Mex, you'll find it all in Dallas.", "The best time to visit Dallas is between September and November, when the temperatures aren't overwhelmingly hot, the tourist traffic has died down and the State Fair of Texas is in full swing. Keep in mind: The Cowboys football season can drive hotel prices up, especially in the Metroplex areas (neighborhoods around Dallas and Fort Worth). Avoid inflated prices by taking a look at the team's home game schedule. The months between March and May are equally comfortable temperature-wise, and blooming flowers further sweeten the season. Despite temperatures in the 90s and high humidity levels, summer marks the high season in Dallas, so expect hotel costs to climb. You will find deals between December and February, but don't expect exceptionally warm weather. The DFW area experiences all four seasons, with wintertime highs resting in the 50s.", "Texas on display The State Fair of Texas draws millions of attendees each year with the promise of the best barbecues, best rodeos and best displays of Texan pride. Plan your trip for late September or October to join in.", "Beat the heat along the Margarita Mile Did you know the frozen margarita machine was invented in Dallas? Sample some of the city's best along the Margarita Mile, a seasonal, self-guided tour featuring a variety of margaritas at restaurants all over Dallas. Start your journey with this guide from Visit Dallas.", "Shop till you drop Dallas is considered a shopper's paradise. Head to Highland Park Village, NorthPark Center or the Galleria Dallas if you're on the hunt for luxury goods. If you'd rather peruse small local shops, head to neighborhoods like the Design District or Deep Ellum.", "Purchase a CityPASS Save some money on admission fees by investing in a Dallas CityPASS. For one price, you'll gain entrance to some of the city's top attractions, including the Perot Museum of Nature and Science and the George W. Bush Presidential Library & Museum, among others.", "Make the most of the city's free activities Several of the top things to do in Dallas do not charge an entrance fee, including the Dallas Arts Museum, the Crow Museum of Asian Art, Pioneer Plaza and Klyde Warren Park, among others.", "Take advantage of deals and discounts Visit Dallas compiles a list of deals and discounts on its website for everything from happy hour specials to admission tickets.", "The DFW Metroplex is known for red meat and Tex-Mex. For a prime cut, head to Al Biernat's on the northeast edge of Dallas' Oak Lawn district. You'll spend a pretty penny to eat here, but avid foodies swear the steak is worth the price. Town Hearth, another popular steakhouse, also receives rave reviews. For authentic Mexican flavors, heed the advice of locals and head to Beto & Son, El Fenix or El Come Taco. For even more Tex-Mex, sign up for one of the best food tours in Dallas.", "If you want to expand your palette beyond steak and tacos, Dallas has you covered there, too. Thanks to the metro area's large immigrant population (the city estimates that about 25% of its residents are immigrants), Dallas offers a varied roster of dining styles reflective of its multicultural residents. You can find most everything your stomach desires, from Mediterranean cuisine (try Baboush) to Jamaican favorites (locals recommend The Island Spot). Armoury D.E., which is known for its Hungarian menu and live music, and Boulevardier, a French spot in the Bishop Arts District that's serves a popular brunch, are also recommended by locals.", "Although Dallas is a safe places for tourists, you should exercise caution as you would in any other large metro area. Don't walk alone at night and avoid dimly lit areas. Although gun control laws are less strict in Texas than they are in other parts of the country, tourists are generally not the targets of gun-related violence.", "Those who are not used to Texas' climate should take precautions against heat stroke, the symptoms of which generally include headache, dizziness, fatigue and sometimes nausea. Drink plenty of water and apply sunscreen regularly. A hat is another good idea.", "The best way to get around Dallas is by car. Though many of the city's top things to do, such as The Sixth Floor Museum at Dealey Plaza, the Dallas Museum of Art and Reunion Tower, are located within the downtown area and easily accessible via public transit, a few attractions, such as the Dallas Arboretum, are best reached by car. Just be prepared for heavy traffic during rush hour and limited parking no matter the hour.", "There are two airports in Dallas: Dallas Love Field (DAL), which is located about 6 miles northwest of downtown Dallas, and Dallas/Fort Worth International Airport (DFW), which is about 20 miles northwest of downtown. Dallas Love Field only services three airlines: Alaska, Delta and Southwest, so you may find more flight options by flying into Dallas/Fort Worth International Airport, which welcomes flights from United, American, JetBlue and others. Taxi fares from Dallas Love Field cost between $18 and $21, while fares from DFW cost between $37 and $45. Both airports are also serviced by Dallas Area Rapid Transit (DART)."]}