{"name": "Saint John, New Brunswick", "description": ["Saint John, New Brunswick may not give the best first impression: The city's skyline is dominated by shipping terminals and oil tanks, while decades of industrialization have left behind a somewhat gritty appearance. But don't be too quick to dismiss New Brunswick's second-largest city. Beyond the factories lies a vibrant downtown area where remnants of the past enhance the scenery. History lives on in the heart of Saint John at sites like the Saint John City Market, which was built in the late 19th century to accommodate all of the city's markets in one central location. You'll also find an array of Irish pubs that pay tribute to the many Irish immigrants who made their home here in the mid-1800s.", "But perhaps the primary reason to visit Saint John is its access to the Bay of Fundy. This large inlet separating New Brunswick from Nova Scotia is an ideal backdrop for outdoor excursions. You can get a feel for Fundy's powerful tides in the heart of Saint John during a visit to Reversing Falls Rapids. But to truly experience the bay's beauty, head out of town to hike, kayak and more at Fundy National Park. Just keep your eyes peeled: You're bound to catch a glimpse of a whale or two.", "The best times to visit Saint John are April to May and September to October. These shoulder seasons offer mild weather, a colorful landscape (with blooming flowers or changing leaves) and low room rates. Summer is by far the most popular time to visit Saint John thanks to its warmer temperatures and abundant festivals, but heavy crowds can turn the exploration of the rather small downtown area into a test of patience. You'll have the city all to yourself if you visit during the winter, but icy sea breezes will keep you confined to the underground passageways and overhead walkways of the Inside Connection.", "Located on the coast of Canada's only official bilingual province, Saint John offers a mix of cultural influences. Before the city was settled in 1631 by the French and later in the 1760s by the British, the larger New Brunswick area was solely inhabited by several First Nations people, including the Wolastoqiyik and the Peskotomuhkati. Today, the Mi'kmaq and Maliseet people continue to call New Brunswick home and celebrate their culture through festivals, events and powwows in and around Saint John.", "In recent years, Saint John has seen an uptick in immigrants coming from Lebanon, China, Syria, South Korea and the Philippines, though most of the population has Canadian, British or Irish roots. It's hardly surprising, then, that pubs and restaurants specializing in cuisines from many of these cultures are prevalent throughout the city. Saint John also celebrates its cultural heritage during annual events for regional and national holidays like Loyalist Day, Canada Day and National Acadian Day.", "Another prominent aspect of Saint John's culture is its arts scene. In addition to being the home base for New Brunswick's orchestra (Symphony New Brunswick), the city hosts a variety of music and performing arts events, including Buskers on the Bay Festival, Area 506 and the Fundy Fringe Festival.", "Though many aspects of Canadian culture may seem familiar to Americans, two key differences are the country's use of the Canadian dollar and the international metric system. One U.S. dollar equals about CA$1.30, but the exchange rate often fluctuates, so be sure to check it before your trip. For temperatures and weights, remember that metric units (Celsius and grams) are used. You'll also want to familiarize yourself with kilometers and liters if you plan on renting a car, since distance is measured in kilometers (1 kilometer equals 0.6 miles) and gas is sold by the liter (1 liter equals 0.3 gallons).", "Saint John's former colonization by the French and British and its large Irish immigrant community mean Acadian, British and Irish cuisine are featured on many local restaurant and pub menus. British and Irish staples you can enjoy at highly regarded pubs like Cask & Kettle Irish Gastropub, Britt's Pub & Eatery and Gahan House Port City range from shepherd's pie (a hearty meat pie topped with mashed potatoes) to bangers and mash (sausages and mashed potatoes) to fish and chips. Meanwhile, Acadian dishes to try include poutine râpée (boiled potato dumplings stuffed with seasoned pork), coques frites (fried clams) and fiddlehead soup. For a healthy snack, head to the Saint John City Market to buy a bag of dulse (dried seaweed).", "Because of Saint John's sizeable Asian and Middle Eastern populations, several of its restaurants specialize in cuisines commonly found in those areasregions. Asian and Middle Eastern eateries that receive rave reviews from diners include Thai-influenced Splash Thai Cuisine, Indian-focused Thandi and Egyptian-inspired Taste of Egypt.", "If you're hoping to quench your thirst here, you're in luck: In addition to Saint John's plethora of pubs, you'll find multiple breweries creating their own brewssuds. Popular local breweries include Bigtide Brewing Company and Moosehead Breweries. Should you crave more options, time your visit during the Saint John Annual Beerfest in mid-April. Keep in mind, the legal drinking age in Saint John and greater New Brunswick is 19.", "The best ways to get around Saint John are on foot and by car. Many of the city's most popular attractions can be found within its concentrated uptown and are within walking distance of one another. But if you are planning to visit sites outside of Saint John proper – like Fundy National Park – you will need your own set of wheels. You can find major rental car agencies in the city and at Saint John Airport (YSJ), which is located about 10 miles northeast of uptown Saint John. If you don't want to spend money on a rental car, you can rely on the city's bus system to get around.", "Whether you're traveling by land, air or sea, a passport is required for Americans to travel to Canada and to re-enter the country. You must show a passport, passport card or NEXUS card (which allows expedited border crossings for both private and commercial travelers through Canadian and U.S. border controls). A tourist visa is not required for stays lasting less than 180 days. For more information about entry and exit requirements, visit the U.S. State Department's website."]}