{"name": "Santa Cruz", "description": ["This county in northern California is filled with an eclectic bunch of University of California, Santa Cruz students, Silicon Valley tycoons, surfing enthusiasts and left-leaning residents. Its landscape is just as varied, with Pacific Ocean waves crashing against rugged cliffs, redwood trees rising sky-high in nearby forests and the Santa Cruz Mountains looming above it all. ", "The area retains some of its offbeat charms like Mystery Spot and its old-timey attractions like the Santa Cruz Beach Boardwalk, but the county's steady development of new local shops and restaurants speaks to its relevance today. Nowadays, Santa Cruz has enough things to do and places to eat to fill an entire vacation, but its location – just 75 miles south of San Francisco and 35 miles southwest of San Jose – makes it a great spot for a daytrip, too. ", "The best time to visit Santa Cruz is from September through November when the summer tourists have returned home, leaving a bit more room on the beaches, walking paths and other attractions. December, January and February see a slight dip in temperatures, which nonetheless are warm enough for the monarch butterflies who overwinter at Natural Bridges State Beach. The months between April and May are characterized by mounting temperatures and special events that meet their nexus in June, July and August. ", "Surf's up Santa Cruz is steeped in surf history. Much of the cult film favorite \"The Lost Boys\" was filmed here, and surfers still ride the waves in places like Steamer Lane.", "Wetsuits required O'Neill Wetsuits, which is headquartered in Santa Cruz, invented the wetsuit, and you'll likely need one if you're spending time in the cold Pacific waters.", "Be prepared for traffic Whether it's people traveling to the beach from San Jose on Highway 17 or others making the scenic drive on Highway 1, gridlock is inevitable.", "Catch a nature show You can certainly pay to see marine animals up close at the Seymour Marine Discovery Center, but if you keep your eyes peeled, you'll spot plenty of animals around Santa Cruz without having to fork over a dime. Sea lions are known to frequent the Santa Cruz Municipal Wharf and more than 220 species of birds call the Wetlands of Watsonville home.", "Soak up the rays Santa Cruz boasts 29 miles of coastline. Capitola, Rio del Mar, Twin Lakes, Seabright and Main beaches are among the shorelines that are free to access.", "The cuisine in Santa Cruz is as varied as the county's geography. Just as there are oceans, forests and mountains, Santa Cruz boasts wineries, breweries and whisky bars, and restaurants serving cuisine that ranges from Mexican to Mediterranean. To get your caffeine fix, head to Verve Coffee Roasters, a highly acclaimed coffee bar and roaster with other locations in Los Angeles, San Francisco and Tokyo. Linda's Seabreeze Cafe is good spot for breakfast – try the cinnamon rolls – but remember to bring cash, as it does not accept cards. ", "La Posta is a neighborhood Italian eatery with delicious pizza, and Laili serves up Mediterranean-Afghan cuisine. For beer, try the New Bohemia or \"NuBo,\" a brewery opened by University of California, Santa Cruz alums. Or, for a more comprehensive overview of the Santa Cruz brewery scene, hop on board a Brew Cruz bus for a guided tour of the county's best breweries and bars. When you're ready to satisfy your sweet tooth, try the local ice cream. The Penny Ice Creamery, which makes its ice cream in small batches from scratch, is a favorite among visitors and residents. If you want a side of stunning coastal views with your dark chocolate sorbet cone, head to the creamery's Pleasure Point location.  ", "The best way to get around Santa Cruz is by a combination of driving and walking. Santa Cruz is far too large to get around on foot alone, but a mix of walking and driving gives you the flexibility to see the county on your own terms. The county's public bus system is an option too, especially if you don't want to deal with highway traffic or parking fees. ", "The closest airport, Mineta San Jose International Airport (SJC), is located 30 miles northeast of Santa Cruz. If you're not planning to rent a car from the airport, you can get to Santa Cruz via a variety of public and private transportation options. The Santa Cruz Airport Flyer offers service between the San Jose airport, Santa Cruz, Scotts Valley and Aptos, as well as the San Francisco International Airport. Rates range from $40 to $55 per person, depending on your final destination. You can also take a taxi to Santa Cruz, but it'll cost you twice as much: a flat rate from the San Jose airport to Santa Cruz costs $110. If you'd rather rely on public transportation, the Santa Cruz METRO offers a rider's guide with tips on getting to and from the airport via a combination of buses and light rail. "]}