{"name": "Kruger National Park", "description": ["Situated roughly 260 miles northeast of Johannesburg, the nearly 5 million-acre Kruger National Park offers some of the best access to wild animals in Africa. The Big Five – buffalo, elephants, leopards, lions and rhinos – all reside here, as well as Nile crocodiles, hippos and rare birds like southern ground-hornbills and lappet-faced vultures. But this sprawling wildlife sanctuary is home to more than just animals. Giant baobab, fever and marula trees tower above the park's savanna, thornveld and woodland landscape. What's more, Kruger's Marula and Nxanatseni regions house the Albasini and Masorini ruins, where Portuguese colonists and members of the indigenous Ba-Phalaborwa ethnic group once traded metal products, beads, clothes and more.", "A trip to Kruger will undoubtedly bring you as close to nature as possible. To make the most of your time, consider going on a game drive or a bush walk. Many stop near prime animal-viewing areas like Hippo Pool, the Kruger Tablets and the Red Rocks, where lions, hippos and birds regularly linger. Or, take a few days to camp and explore popular trails like Wolhuter and Olifants.", "The best time to visit Kruger National Park is at the beginning or end of the region's dry season, which falls between April and September. During Kruger's dry season, temperatures are mostly pleasant (with nighttime temps dipping into the high 40s and daytime temps occasionally reaching into the mid-80s). What's more, vegetation is sparse and water levels are low due to the lack of rain, meaning visitors will have a better chance of spotting animals. However, extreme dry seasons can also result in increased animal deaths, so it's best to avoid visiting in July, August and September, the season's driest months. And in the rainy season (from October to March), abundant rainstorms and foliage can make it difficult to see animals.", "Like Cape Town and Johannesburg, the official currency in Kruger National Park is the South African Rand (ZAR). You'll want to check the latest exchange rate before visiting, but expect one rand to equal approximately seven American pennies. Unlike Serengeti National Park, U.S. dollars are not accepted anywhere inside Kruger. A bank and ATM are available at Skukuza rest camp, and an ATM is also offered at Letaba rest camp, however, there are no other areas inside the park to withdraw and exchange money, so plan on bringing the bulk of your currency with you. Note: ATM fraud is a common problem in large South African cities; to protect yourself and your bank account, withdraw money before landing in the country.", "Each visitor who enters Kruger will be charged a daily conservation fee of 152 or 304 South African rand (or about $11 or $23 per person), and additional tariffs will apply for game drives, trail access and bush walks (unless otherwise noted by your safari tour operator). Travelers who opt to drive their own car and camp at any of the park's main rest camps, bushveld camps or bush lodges are also required to pay a nightly fee for their accommodations. And like in the U.S., tipping in Kruger is the norm. Expect to leave a few rand per night for camp staff like housekeepers and parking attendants; giving roughly 10 percent of your total bill is common when tipping waiters at a lodge restaurant. And for game drives, plan on offering your ranger and spotter (if present) approximately 50 South African rand (nearly $4) per drive.", "As is the case throughout South Africa, many languages are spoken in Kruger National Park. Most rangers and park employees will know English, as well as Afrikaans and Tsonga, a dialect used by the region's first inhabitants – the Tsonga people. Some Afrikaans and Tsonga phrases you may want to use include, \"hallo\" and \"avuxeni\" (hello), \"dankie\" and \"ndza nkhensa\" (thank you), \"Hoe gaan dit met u?\" and \"Ku njhani?\" (How are you?), and \"ek verstaan nie\" and \"a ni swi twisisi\" (I don't understand).", "While in the park, it is imperative that you follow your guide's instructions at all times. Feeding animals is strictly prohibited, and garbage must be properly disposed of in trash bins. If any food is left in an unattended vehicle, animals will likely find it. Visitors are also asked to stay in their vehicles at all times (unless given permission to exit by a ranger). Lastly, travelers with cars must drive on the left side of the road, are required to adhere to speed limits (which are in kilometers per hour on posted signs throughout the park), need to have a valid international driver's permit and cannot drive off designated paths or down roads with \"no entry\" signs.", "Several luxury lodges in Kruger offer indoor and outdoor dining areas. Two lodges – Rhino Post Safari Lodge and the Relais & Chateaux-affiliated Singita Sweni – even house wine cellars with various South African wines. Others, such as Lukimbi Safari Lodge, provide all meals, including those served in the bush and on the property's decks. And at Punda Maria, Mopani, Satara and other main rest camps, travelers can grab a bite to eat at South African- or American-inspired restaurants. Most lodge and main rest camp meals feature staples like braaivleis (grilled meats), mieliepap (maize porridge), morogo (wild spinach) and potjiekos (hearty meat, veggie and starch dishes prepared in cast iron pots over a fire).", "Travelers can also prepare their own meals on grills found at most campsites. In permanent accommodations, cooking utensils and refrigerators are typically provided, and the bulk of main rest camps have retail shops that sell drinks, raw meat and snacks like beef jerky, chips and ice cream. What's more, safari tour operators – such as Nhongo Safaris, Outlook Safaris and Funky Monkeys Backpackers & Safaris – usually include some or all meals in their rates. But keep in mind that a few tour operators do charge extra for alcoholic beverages.", "Most of Africa's safari parks (especially those with periods of heavy rains) are prone to malaria, a mosquito-borne disease that's endemic throughout the continent. To protect yourself from mosquitoes, wear long-sleeved clothing at night (when mosquitoes are most prevalent), as well as insect repellent with DEET (a chemical that makes it harder for mosquitoes to smell you). Also, speak with your doctor to obtain a prescription for an anti-malarial medication, which will need to be started before your trip and continued after returning home. Note: Some anti-malarial medications cause side effects like vivid dreams, anxiety and nausea, so discuss all options and their potential effects before choosing a medication. And remember, like other animal sanctuaries, keeping a safe distance from wildlife at all times is a must. Always follow park instructions. Should a dangerous situation arise, Kruger guides and rangers – who carry loaded rifles as a precaution – are trained to shoot any threatening animals.", "One of the easiest and most cost-effective ways to get around Kruger National Park is to book a safari tour. Safari guides know the park's roads and game-viewing areas well, so you won't have to worry about getting lost while trying to spot animals. Many safari packages also cover food, lodging, game drives and transportation to and from a regional airstrip or Johannesburg. If you'd rather avoid a group tour, you can rent a car at most of Kruger's airports and Skukuza rest camp. Car hires are also available from Johannesburg's O.R. Tambo International Airport (JNB), but you'll have to drive 244 miles (or about four hours) to reach the park. A faster (albeit pricier) option is to fly into Kruger Mpumalanga International Airport (MQP), Hoedspruit Airport (HDS), Hendrik Van Eck Airport (PHW) or Skukuza Airport (SZK) from O.R. Tambo.", "Americans interested in visiting South Africa will need a passport that is valid for at least 30 days after the date of departure and has two blank visa pages. A tourist visa is not necessary for stays less than 90 days, but if you have a connecting flight or stopover in a country where yellow fever is present, a valid World Health Organization approved International Certificate of Vaccination (also known as a \"yellow card\") is required. To learn more about entry and exit details, visit the U.S. State Department's website."]}