{"name": "Portland, ME", "description": ["The thought of Maine may conjure up images of sleepy coastal towns with craggy coastlines, boats blowing in the wind and loads of lobster, but Portland is so much more than that. With a population of about 69,000, Maine's largest city may not be considered big to some, but it has all the offerings of a vibrant metropolis. Yes, it features typical Maine topography and a thriving harbor that offers plenty of delectable seafood, but Portland has made a name for itself in more ways than one. The city's outstanding dedication to the arts, revered dining scene and incredible preservation and reinvention of its historic Old Port continually impress and surpass traveler expectations. Museums abound, kitchens with James Beard Award-winning chefs dot the downtown area and local boutiques and bed-and-breakfasts share streets with national chains.", "The city's distinctly Maine attributes are also a cut above the rest. Secluded beaches situated on island shorelines, centuries-old lighthouses perfectly positioned on coastal bluffs and mouthwatering lobster rolls are all within reach. Above all, the city is a port hub at heart, once serving as the largest in 17th-century New England. Plus, it's the perfect jumping-off point for some of the best whale watching in Maine. No matter which way you decide to perceive Portland, its charm and ease will surely soothe the soul.", "The best time to visit Portland is from June to August. Although summer is peak tourist season, the season's cool temperatures – with highs seldom climbing above 80 degrees – are hard to beat. What's more, Maine experiences quite a bit of rainfall, and summer is the only time of the year that the amount of precipitation dips to its lowest numbers. Plus, Portland's social calendar hits an all-time high during the summer, offering more festivals and events than any other season in the year. If you're not one for crowds, spring and fall are also great times to visit, especially if you want to peep seasonal flowers and autumn foliage. Considering Portland's placement on the tip of the northeastern coast, lows during those seasons – between 25 and 50 degrees – resemble that of an average winter elsewhere.", "Consider a weekend visit Many shops and restaurants are closed on Mondays and Tuesdays. Plan a weekend trip to ensure closures won't interfere with your eating or shopping plans.", "Walk Many of the city's top attractions, including Old Port, Eastern Promenade and the Portland Museum of Art, are within walking distance of one another. If you don't plan to explore beyond downtown, a car isn't necessary.", "Skip the fine dining Some of Portland's most beloved casual dining spots, including Duckfat and Central Provisions, are headed by James Beard Award-winning chefs and finalists.", "For such a small city, Portland's dining scene packs quite a punch. And that's not just because of the lobster (though it does help). The city offers a variety of cuisines from around the world in addition to traditional Maine fare (often combining the two). But what stands out most about Portland's dining scene isn't necessarily diversity. Rather, Portland's mantra is all about keeping things as close to home as possible. When it comes to ingredients, Portland's commitment to utilizing locally sourced, sustainable fare is strong.", "Critically acclaimed Fore Street, headed by James Beard Award-winning chef Sam Hayward, is seen as a leader in the city and state's farm-to-table movement. Although the menu is adjusted to fit the season, you'll want to sample the wood-roasted mussels, locally sourced oysters and the sustainable red fish.", "This philosophy isn't restricted just to the city's restaurants. Portland's best microbreweries get in on the action, too. Peak Brewing Company brews with blueberries from a farm in Lincolnville, Maine, for its Sweet Tart Blueberry. Meanwhile, Allagash Brewery's Sixteen Counties beer, which honors the counties of Maine, brews with barley, unmalted red wheat and organic oats all from the state.", "Duckfat, headed by James Beard Award winner Rob Evans (formerly of French Laundry), is lauded for its Belgian-style french fries. There's also Blue Rooster Food Co., another popular casual eatery serving sandwiches, as well as an extensive hot dog and tater tot menu. And if you like Japanese food, Pai Men Miyake and Izakaya Minato are not to be missed.", "Along with Fore Street, Leeward is another must-try upscale dining establishment that's known for its pasta-focused menu. If seafood is all you're after, hit up Eventide Oyster Co., which boasts an extensive oyster bar in addition to a la carte seafood dishes, including its signature brown butter lobster roll and the revered New England clam bake. The Shop at Island Creek Oysters serves up outstanding bivalves, raw seafood and local brews in a fun, casual setting.  ", "The best way to get around Portland, Maine, is by car. Having your own set of wheels will make it easier to explore the city's brewery scene and attractions outside of the immediate downtown area, such as Portland Head Light. Plus, you can hop in your car and drive up and down the coast to places like Acadia National Park if you're up for a daytrip. What's more, Portland is within a day's drive of major East Coast destinations. The Maine city is about a two-hour drive from Boston, five hours from New York City and two hours from Hartford, Connecticut. There are plenty of public garages, as well as metered parking. If you know you won't be venturing beyond the downtown area, you can easily get around by foot or by bike.", "Those trying to get to and from Portland International Jetport (PWM) will be happy to know it's located about 5 miles west of downtown Portland. Taxis and rental cars are available at the airport."]}