{"name": "Ibiza", "description": ["If sun-drenched days spent lazing on beaches and sailboats, and long nights grooving to techno beats sounds like your idea of vacation, then Ibiza (or Eivissa in Catalan) is the place for you. Known for its collection of buzzy nightclubs clustered around Ibiza Town and Sant Antoni, the third-largest Balearic Island – located off the east coast of Spain – is packed with revelers throughout most of its summertime peak season. Still, partying isn't Ibiza's only pastime. Pine-clad hills conceal quaint villages, secluded coves hide family-friendly beaches, eateries tempt with traditional Balearic foods and vendors hawk everything from leather goods to olive oils in the local markets. Ibiza is everything you think it is – and so much more.", "The best time to visit Ibiza is from May to October when high temperatures hover in the mid-70s and mid-80s and the party crowd descends. The months between November and April are considered low season, when flight and hotel rates drop along with the temperatures to more moderate 50s and 60s.", "Locals in Ibiza speak Catalan and Spanish, but it's such a tourist town that visitors will be able to get around without knowing either. Still, having a few key phrases in your back pocket can be helpful. For instance, \"hello\" is hola or bon dia; \"thank you\" is gracias; and \"excuse me\" is dispensi or perdoni. ", "The official currency of Spain is the euro, and U.S. travelers can exchange their dollars for euros at the airport or at kiosks throughout the city. Since the exchange rate fluctuates, you'll want to check it before you depart for your trip to get an idea of your travel budget. ", "Ibiza is generally a safe place to visit. Keeping your valuables locked away in hotel safes, making copies of your passport and other forms of identification, and making sure that you don't leave personal belongings unattended, such as on a beach towel, will go a long way to ensuring your safety. If you're enjoying the island's nightlife, you'll want to keep an eye on your drinks, and never drink and drive.", "Like other coastal or island destinations in Spain, Ibiza's cuisine contains a lot of seafood. Paella and tapas are mainstays, but there are few Balearic and Ibizan specialties you might want to try. One is sofrit pages, a Balearic stew of chicken, lamb, sausage, potatoes and artichokes. The Balearic islands have their own sausages – sobrassada and botifarra – which are worth a taste. Arroz de Manteca is Ibiza's own traditional dish of rice, local meats, saffron and mushrooms. For an affordable bite, you can try Bar Dona Ana in Santa Eulalia or Los Pasajeros in Ibiza Town. For a fine dining experience, recent visitors give Amante Ibiza on Cala Llonga rave reviews. ", "A stop at the El Mercat Vell, \"Old Market,\" which is located on the Placa de sa Constitucio, is a must-do, especially if you want to get a taste of the island's produce, olive oils and breads. It's open daily from 9 a.m. to 9:30 p.m., from May to October; and until 6 p.m. from November to April. ", "Nightlife is one of the main draws of Ibiza, and Pacha – opened in 1973 – is Ibiza's quintessential nightclub. Open daily year-round from 11 p.m. to 6 a.m., this favorite among locals and travelers alike contains a large dance floor, an outdoor terrace and a restaurant, all of which surrounds an old farmhouse. Still, admission is steep and drinks are expensive too. For live music and a great ambience without the cover charge, travelers should try Teatro Pereyra.", "The best way to get around Ibiza is by car since it allows you to traverse the island on your own time. Although bus service is available, the network doesn't connect all places of interest and doesn't operate at all hours of the day. Taxis can bridge the gap for those that want to take the bus, but the fares may add up. To reach other Balearic Islands, such as Mallorca and Formentera, or even the Spanish mainland at Valencia, travelers can take ferries. ", "To reach Ibiza, travelers can fly into Aeroport d'Eivissa (IBZ), also known as Ibiza Airport. The airport is situated less than 5 miles southwest of Ibiza Town, making a quick taxi ride into the city the best option for those who do not rent a car. Alternatively, visitors can take a ferry from Valencia or Barcelona.", "For U.S. citizens entering Spain, a passport that is valid for at least six months beyond the travel departure date is required. U.S. citizens do not need a visa unless they plan on remaining in Spain for longer than 90 days. Visit the U.S. State Department's website for more information on exit and entry requirements."]}