{"name": "Corpus Christi", "description": ["Corpus Christi has a long history. For hundreds of years, the Karankawa Indians built thriving communities in this coastal area before Spanish colonists arrived in the 1500s. Today, you can learn more about this beachy city's history at its museums. Beyond its historical attractions, the city offers additional museums that focus on everything from art and science to naval aviation and music stars. When you're itching to get outside, you'll find a myriad of beaches in the city and on the local barrier islands that are ripe for swimming and water sports.", "Corpus Christi is ideal for those who want a quiet seaside getaway; those looking for a raucous spring break should travel 185 miles south to South Padre Island. It's also a great weekend trip to tack on to your San Antonio vacation, as it's about 145 miles (a two-hour drive) south of the Alamo's hometown. So pack your towel and grab the sunscreen; it's time for some fun in the sun.", "The best time to visit Corpus Christi is from September to October, when the summer tourists are back at home and the temperatures get a bit cooler than the steamy summer season. Visiting in the winter months will bring you even nicer temperatures, ranging from the mid-60s to the low 70s, though the city does become a small haven for snowbirds. Spring, particularly March, generates a small uptick in tourists during spring break. Summer brings hot Texas temperatures and an increased chance of rain and storms.", "Access to attractions may vary Due to COVID-19, Corpus has limited access to its beaches and parks temporarily. And in late July 2020, Hurricane Hanna swept through the region, which means the city is undergoing recovery efforts. Plan to check the tourism bureau's website or an attraction's website for operating hours and other information.", "Peak season is hurricane season The Gulf Coast hurricane season runs from June through November. Plan your trip carefully if you want to visit Corpus during these months.", "You'll want a car You can use the city's public transportation system to get to many of the popular attractions around the city, but to travel to the barrier islands, you'll need your own vehicle.", "Eat at Whataburger This burger chain is a Texas staple and got its start in Corpus Christi. It's reasonably priced. Visit the Whataburger by the Bay location (on North Shoreline) for water views while you chow down on one of the joint's beloved burgers.", "Plan a few daytrips Both Mustang Island State Park and Padre Island National Seashore charge entrance fees. Plan to visit each on separate days to make the most of your time at each park and get your money's worth."]}