{"name": "Gettysburg", "description": ["Whether you want to enjoy a romantic weekend away with your significant other or an educational vacation with your kids, Gettysburg has you covered. This charming small town in southern Pennsylvania is packed with mom and pop shops, cozy inns and restaurants that serve farm-to-table American cuisine and locally crafted drinks. But chances are you're visiting this East Coast locale to see its abundance of historic attractions. Known for its ties to the Civil War, Gettysburg is home to all kinds of historically significant sites, including Gettysburg National Military Park, where the war's bloodiest battle took place. To fully immerse yourself in the park's history, consider a guided tour of Gettysburg.", "Though you could easily spend the bulk of your trip exploring the park, be sure to save time for the Jennie Wade House and the Shriver House Museum, among other Civil War sites. And when you want to take a break from Gettysburg's dark past, wander around the Eisenhower National Historic Site or enjoy a photo-op at Sachs Covered Bridge. No matter how you choose to spend your vacation, you're bound to leave town feeling relaxed and more informed than you did prior to your arrival.", "The best time to visit Gettysburg is from September to November or between March and May. The town's daytime temperatures in fall and spring, which generally hover between the low 50s and high 70s, are cooler than what you'll encounter in June, July and August (Gettysburg's peak tourist season). As a result, hotel prices will drop and attraction crowds will thin – especially in November and March. September and October attract leaf peepers and those with an interest in the paranormal, while April and May see an influx of students in town for school field trips. Those who don't mind rubbing elbows with hordes of tourists and paying extra for accommodations should consider visiting between June and August, when outdoor concerts at local wineries and Civil War re-enactments take place.", "It's reportedly haunted Like other historic American cities (think: St. Augustine, Florida, and Savannah, Georgia), Gettysburg boasts several attractions that are considered hot spots for paranormal activity. To learn more about the town's spooky past, sign up for a ghost tour with an outfitter like Ghostly Images of Gettysburg or Gettysburg Ghost Tours.", "It's surrounded by farmland You'll find several orchards, farmers markets, vineyards and farm-to-table restaurants in and just outside of town. Some of the area's most popular eateries with locally sourced products include Dobbin House Tavern, 1863 Restaurant and Mason Dixon Distillery & Restaurant.", "It has presidential ties In addition to living in Gettysburg in 1918 while serving in the army, former President Dwight D. Eisenhower retired here in 1950. You can tour his home at the Eisenhower National Historic Site.", "Check out the tourism board's website Destination Gettysburg's Coupons & Discounts page offers a variety of reduced rates and freebies for everything from sightseeing tours to museums to restaurants and gift shops.", "Stick to free attractions Several must-see Gettysburg sights, including Sachs Covered Bridge, Gettysburg National Military Park and the Gettysburg Museum of History, do not have entrance fees. But remember, charges apply for guided tours of Gettysburg's Civil War sites.", "Visit between November and March From late fall to early spring, average temperatures sit in the low 20s to mid-50s. As a result, travelers tend to stay away, meaning you'll enjoy more elbow room at top attractions and lower room rates at hotels. Just be sure to bundle up while out and about.", "The majority of Gettysburg's restaurants feature American-inspired menus. Some offer period-focused items like pies made with game meat, while others specialize in farm-to-table fare that features local, seasonal products. Traveler-approved eateries serving dishes that highlight organic ingredients include Dobbin House Tavern, Mason Dixon Distillery & Restaurant and 1863 Restaurant. Dobbin House Tavern also appeals to visitors who want to dine in a historical home. In addition to the town's multitude of American restaurants, a few Italian- and Mexican-influenced dining establishments – such as Tommy's Pizza and Montezuma Mexican Restaurant – are available. Both earn rave reviews from diners.", "Gettysburg's location in Adams County (a region known for its apple orchards and vineyards) makes it a popular spot in Pennsylvania for sipping local wines, ciders, spirits and beers. Oenophiles recommend checking out nearby wineries like Adams County Winery, Hauser Estate Winery and Reid's Orchard & Winery, which has a tasting room in central Gettysburg. The downtown area is also home to a few highly regarded pubs, including Garryowen Irish Pub and the Reliance Mine Saloon.", "Although Gettysburg's crime rate is relatively low, theft does occasionally occur, so lock your car when it's not in use and keep an eye on your belongings at all times. When visiting Gettysburg National Military Park, rangers recommend dressing accordingly for the season (including wearing sunscreen on sunny days), keeping a safe distance from wild animals and packing plenty of water for hikes and bike rides.", "Those who venture off of walking trails should also be mindful of ticks, which are often spotted in areas with tall grass and brush during the warmer months. These tiny critters can transmit Lyme disease if they're attached to you for at least 24 hours. To protect yourself from ticks, apply insect repellent with DEET regularly and wear pants and a long-sleeved shirt. Don't forget to check your clothes and skin frequently and to shower shortly after being outside. If you are bitten by a tick, immediately remove it with tweezers. To learn more about how to avoid ticks at Gettysburg National Military Park, check out the park's Tick Safety page.", "The best way to get around Gettysburg is to walk or drive. Though you'll need to use other modes of transportation to get to town, Gettysburg's small size makes it easy to walk to and from any point downtown. Parking is also readily available should you choose to drive. To visit nearby wineries, ski slopes, the Eisenhower National Historic Site or Sachs Covered Bridge, plan on bringing or renting a car. Other options include riding bikes or Freedom Transit trolleys, but their fees make them more expensive than walking or relying on your own set of wheels.", "Several airports – including those servicing Baltimore and Washington, D.C. – sit within 100 miles of Gettysburg, but the closest is Harrisburg International Airport (MDT), which is located about 45 miles northeast in Harrisburg, Pennsylvania. Visitors can also get to town by taking an Amtrak train from New York City, Baltimore, Philadelphia or Washington, D.C., to Harrisburg. Once in Harrisburg, travelers will need to rent a car or hop on a rabbittransit bus to reach Gettysburg. Keep in mind, the latter only operates at select times on weekdays."]}