{"name": "Chattanooga", "description": ["Situated along the Tennessee River and nestled among the mountains of Southeast Tennessee, Chattanooga has truly earned its nickname as the \"Scenic City.\" Once named the most polluted city in America by the Department of Health, Chattanooga has experienced an urban revitalization over the past few decades, making sustainability a priority and giving the city a much-needed boost of diversity without losing touch of its small-town charm. Chattanooga is known as a historical hub, having served as a Civil War battlefield and the grand central station for southern railway travel in the 19th and 20th centuries. Today, the city is a pioneer of different sorts, as one of the first cities in the U.S. to offer its citizens 2 gigabits per second (read: extremely speedy) internet service, and the first American city to have its own typeface, appropriately named \"Chatype.\" Silicon Valley better watch its back.", "Technological advancements aside, travelers of all types could spend days enjoying Chattanooga's diverse array of attractions. Adventurers can explore the nooks and crannies that lie within Lookout Mountain, history buffs can traverse terrain once inhabited by Civil War troops at Chickamauga, engineers can marvel at restored trains (several of which are over 100 years old) at the Tennessee Valley Railroad Museum and foodies can eat their way through the delectable North Shore district. Or, you can simply take a stroll along the city's riverwalk and catch a sunset atop the Walnut Street Bridge, one of the world's longest pedestrian bridges. ", "The best time to visit Chattanooga is during the fall, from September to November. The end of summer peak season ushers in thinner crowds and cooler temperatures ranging from 40 to 80 degrees. The best reason to visit Chattanooga during the fall, however, is the season's colorful foliage. Experts say this is the most beautiful time to visit Chattanooga's plethora of natural attractions. Plus, RiverRocks, the multiweek outdoor adventure festival, is held in October. Travelers tend to steer clear of Chattanooga come wintertime, thanks to chilly temperatures and rain. However, various annual holiday events, such as the Tennessee Valley Railroad Museum's North Pole Limited, do draw some visitors. Spring is another attractive season, with temperatures becoming more moderate. Summer is the busiest season for tourism in Tennessee, which means you'll find the highest hotel prices, not to mention temperatures, this time of year. ", "You should bring the family Many of the city's top attractions cater to children or offer kid-friendly events and programs. Along with the Tennessee Aquarium, take your little ones to the Chattanooga Zoo, the amusement park and SOAKya Water Park at Lake Winnepesaukah and the Creative Discovery Museum, which was made exclusively for children.", "Sustainability is key Solar panels, zero-emission buses and locally sourced ingredients are all the norm in Chattanooga. You don't want to be caught throwing your recyclables in the trash bin. ", "Ditch the car Not only does Chattanooga have an affordable bike-share system, but the city offers a free shuttle that transports passengers throughout downtown where some of Chattanooga's biggest attractions are located.", "Spring for a package Many Chattanooga hotels offer package deals that include tickets to top attractions and other amenities not covered in standard room rates, such as free breakfast or parking.", "Check the tourism website Chattanooga's tourism site offers free coupons to attractions, restaurants, tours and entertainment venues throughout the city. ", "Well-known for its natural wonders and ties to the Civil War, Chattanooga may not stand out to foodies as a must-visit destination at first glance. But at closer inspection, visitors looking for a great bite will see that there is much more to this town than fried chicken. Chattanooga's dining scene is filled with comfort dishes, yes, but it's also involved in the farm-to-table culinary movement. Many of Chattanooga's beloved local eateries source produce, meat and dairy products from farms within a 100-mile radius of town. Among the most notable is the upscale Public House, which severs Southern dishes and has long-standing relationships with local farmers and purveyors. Along with sourcing regional ingredients, Chattanooga prides itself on its large community of local eateries. You won't find a Starbucks on every block here.", "Taco Mamacita reigns supreme as the area's top Mexican joint, while GOOD DOG is the only restaurant of its kind in the city, offering nothing but hot dogs and sausages with loads of toppings. If hot dogs aren't enough to satisfy your carnivorous appetite, head to Urban Stack Burger Lounge for a variety of flavorful patties, including the Philly Cheesesteak Burger. For a great cup of joe, wander to Rembrandt's and indulge in anyone of its breads, French pastries or chocolates. The Italian eatery Alleia is run by Daniel Lindley, a Chattanooga native and five-time semifinalist for Best Chef in the Southeast by the James Beard Foundation.", "There's also the beer. Chattanoogans love beer. Held in March, Chattabrewga is Chattanooga’s premier craft beer festival, where 75 different types of brews are showcased from some of the country's most popular craft breweries. If you aren't in town for the festival, squeeze in Brewhaus, Chattanooga's only German-American-style gastro pub or stop by the Chattanooga Brewing Company.", "And last but not least, MoonPies. MoonPies were invented in Chattanooga. For those unfamiliar, MoonPies are graham cracker marshmallow sandwiches covered entirely in melted chocolate. The name originated when a local coal miner asked a traveling salesman for a snack \"as big as the moon\" at the beginning of the 20th century. The traveling salesman brought the request back to the Chattanooga Bakery and thus MoonPies were born. Because of their low cost (5 cents!) and small size, they were bought up quickly and eventually sent to the front lines of World War II to give soldiers a taste of home. Today, you can find some at the MoonPie General Store in downtown Chattanooga. ", "The best way to get around Chattanooga is via public transportation or by bike. Chattanooga's public transportation system offers a free electric shuttle service that drops visitors off at various points of interest in the city, including the Chattanooga Choo Choo and the Tennessee Aquarium. The city also offers the Chattanooga Bicycle Transit System, which has more than 40 stations spread throughout the downtown area and some in the North Shore district. If traveling by wheels isn't necessarily your cup of tea, then you won't miss much from simply walking. Chattanooga's downtown riverwalk snakes 13 miles along the Tennessee River and boasts numerous shops and restaurants, as well as popular attractions including the Bluff View Art District, the Passage and the Walnut Street Bridge, which is one of the longest pedestrian bridges in the world. If you're looking to explore some of the famous natural attractions that Chattanooga has to offer, such as the Chickamauga & Chattanooga National Military Park, you'll need a car.", "To get from the Chattanooga Metropolitan Airport (CHA) to your hotel, you can take a taxi, use a ride sharing service or take a shuttle bus, since getting around downtown Chattanooga doesn't require a car. Taxi rates are approximately $30 one-way from the airport to downtown Chattanooga. Additionally, ride-hailing services and cabs are available to take visitors throughout Chattanooga, but be forewarned: rates do add up."]}