{"name": "Rio de Janeiro", "description": ["Known as the Cidade Maravilhosa (Marvelous City), this glimmering Brazilian metropolis has certainly earned its title. Resting at the mouth of a bay harbor, the city is lined with white-sand beaches and surrounded by staggered green mountains covered in a lush tropical forest, Rio de Janeiro boasts dramatic views from nearly every angle. From the slopes of Corcovado Mountain, you'll admire the striking 124-foot-tall Christ the Redeemer, who overlooks Rio's pristine beaches. And from the shores of Copacabana and Ipanema, you'll marvel over the picture-perfect backdrop that has charmed Cariocas (native Brazilians born in Rio de Janeiro) and visitors alike for more than 500 years.", "But there's much more to Rio than scenic vistas, tropical forests and cerulean seas. Here, diversity, exuberance and a laid-back attitude dominate the city's character. Stroll along Avenida Atlântica in Copa, and you'll find a city brimming with bikini-clad beachgoers. The city is also known for its love of sport. From Maracanã Stadium (home of the 2014 World Cup finals and the 2016 Olympic Games) to beach volley at Flamengo Park (known as Aterro do Flamengo), the city is alive with activity. At night, you'll hear the energizing beats of samba pulsating through the city streets in Lapa. And if you visit in February — just in time for Carnival — you'll witness Brazil's vibrant parades and heaving blocos (street parties) that draw revelers from across the globe. ", "Note: Rio de Janeiro isn't without its share of problems, although most violent crime occurs on the outskirts of the tourist areas. In general, low-income urban areas, known as favelas, should be avoided due to gang-related violence. However, Vidigal, a favela near to Rio's affluent neighborhood Leblon, is a popular tourist spot and is widely considered safe (you will have to go through Vidigal to reach the entrance to the very popular Dois Irmãos (Two Brothers) hike, which dozens of tourists do daily, often without a guide). Visitors should consult the U.S. Department of State's website for the most up-to-date travel advisories.", "The best time to visit Rio is between December and March, when the weather is warm and sunny enough to hit the beaches, although there may be quick but heavy downpours in the evenings. The city's seductive samba beat and incredible panoramic views last year-round, but arrive in February to experience Carnival. This five-day festival leading up to Fat Tuesday brings tens of thousands of visitors and locals to the streets for parades and parties. Finding an affordable place to stay during Carnival can be difficult; you should consider booking your hotel and flight up to a year in advance. Between January and March, daytime temperatures can sometimes surpass 90 or 100 degrees Fahrenheit. If you prefer more moderate conditions, visit during autumn (April and May) or spring (October and November), when temps fall back to the 70s and low 80s during the day and the 60s at night.", "Using ATMs Most ATMs accept international credit and debit cards. Most ATMs in banks, supermarkets and shopping malls are open from 6 a.m. to 11 p.m., and on holidays and Sundays, ATMs close at 8 p.m. Airports and some gas stations and hotels have 24/7 ATMs. If you use cash, make sure you have small bills (ideally less than 50 reais) to make getting change easier.", "Cards are accepted Contactless payments are available throughout Rio. When paying by card you need to specify if it's debit or credit; sometimes, a debit card will only work when processed in the card machine as a credit card. American Express may not always be accepted.", "Uber is popular Although public transport will get you to all corners of Rio, Uber is a quick and relatively inexpensive way of getting around. It usually works out much cheaper than a taxi and you can get Uber from Rio's airport via the app.", "Grub by the pound Rio de Janeiro is full of buffet-style restaurants that charge by the kilo. Look for signs that say \"por kilo\" and then pile your plate – it's a great way to try a selection of typically Brazilian foods, too.", "Visit Samba do Trabalhador Although Lapa is known as the vibrant neighborhood for nights out, enjoy an inexpensive evening out at Samba do Trabalhador, a popular event venue among locals for live music every Monday.", "Bed down at a pousada Hotel prices are notoriously expensive in the city, especially in beachside neighborhoods. To stay within budget, search for pousadas — the bed-and-breakfasts of Brazil that often include a morning meal in their rates.", "Get outside Rio is famous for its dazzling hikes and the tropical Atlantic Forest that carpets the city's mountainous skyline. Best of all, entry into the forest is free. Hikes in Tijuca Forest are well sign-posted and tend to be well-trekked, making most of them safe to go without a guide for a cheap day out.", "Cariocas (native Brazilians born in Rio de Janeiro) are known for their easy-going demeanor. Friendly, hospitable and always up for a celebration, Cariocas relish eating late, dancing late and dressing up in glittery costumes for Carnival — Rio's most riotous and colorful party.", "Portuguese is Brazil's official language. While there are some English speakers near tourist attractions, it's helpful to bring a Portuguese phrasebook. We also recommend writing down the addresses of attractions you want to visit for taxi drivers.", "You'll fit in by wearing shorts, T-shirts or a vest top and cover-ups or dresses while walking along the beaches. The classic string bikini is the typical attire on the beaches, but there's no need to feel shy – Rio celebrates all body types and there's zero judgment. Being topless is strictly prohibited on the beach, except for one designated nudist beach called Praia de Abricó. Dress code is usually casual in restaurants and along the main streets in the Zona Sul district. However, it's not unusual to spot lavishly dressed locals rummaging through clothing racks in São Conrado Fashion Mall's high-end stores or in top-end restaurants and bars in neighborhoods Leblon and Jardim Botânico.", " As far as tipping goes, it is considered polite to add gratuity; however, most restaurants already include a 10% service charge on the bill. Most restaurants accept credit cards.", "The real (BRL) is Brazil's official currency. The favorable exchange rate makes this South American city affordable for U.S. travelers. Check what the current exchange rate is before you go.", "Rio de Janeiro is a culinary paradise. Its food scene reflects the city's diverse culture and demographics, blending Indigenous, Portuguese, African and immigrant influences with a mix of traditional and new to create a unique gastronomic experience.", "To start your day and finish off your meals like a local, drink an espresso sweetened with heaps of sugar. A must-have dish is feijoada, the iconic black bean stew infused with pork, sausage, and herbs. Modern versions cater to vegetarians, replacing the meat with hearty root vegetables. Seafood lovers will love moqueca, a fragrant fish stew cooked in coconut milk and dendê oil, a staple of Bahian cuisine with a distinct African flair. ", "A popular dining experience is the all-you-can-eat meat option, called rodízio, where you can indulge in an endless stream of skewered meats. Must-tries include picanha, a prime cut of beef, and chicken hearts, which feature at every Brazilian barbecue.", "Truly Brazilian street food includes pastels (deep-fried pastries that can be savory or sweet) served with ice-cold sugarcane juice; coxinhas, deep-fried dough filled with shredded chicken; and pão de queijo, cheese bread made with cassava. On the beach, sip iced tea (mate) and lemonade paired with the airy crunch of Globo cassava-based biscuits. ", "Brigadeiro, chocolate truffles rolled in sprinkles, or a bowl of açaí mixed with your choice of toppings will satisfy a sweet tooth. Don't forget to wash your food down with a classic Brazilian beer served extra cold or a caipirinha, a potent yet refreshing cocktail made with sugarcane liquor (cachaça), lime and sugar and poured over heaps of ice.", "The tourist area – known as Zona Sul (the South Zone) – is generally safe, although exercise caution when walking around at night, especially downtown (Centro), Santa Teresa and Lapa. In all areas of Rio, remain vigilant with valuables due to pickpocketing, and keep in mind that some tourists have been involved in armed robberies (in these cases, always hand over your belongings). Carnival street parties can be a hotspot for petty theft, so keep your possessions zipped away in a secure belt bag and leave at least one backup bank card at your accommodation. Although rare, robberies have been reported on the city's hiking trails, so consider going with a reputable guide (such as Hike in Rio) or in a group, especially during the week when the hikes are quieter.", "Favelas are misunderstood places, and some are perfectly safe to visit (such as Vidigal), or with a guide, such as Rocinha. That being said, most favelas are not tourist-friendly and are best avoided. If you do visit one, be respectful at all times, especially when taking photos (after all, these are people's homes), and avoid straying off the main road. Visit the U.S. Department of State's website for more details.", "The best way to get around Rio is by foot, subway or taxi or Uber. Major attractions – such as Lapa, Santa Teresa and other popular sites – can easily be reached by Uber or a taxi, which are not difficult to hail on the city's main streets. The beaches are easy to reach on foot and a cycle path follows the coastline from the neighborhood Glória to Leblon. For a hassle-free means of transportation from Rio de Janeiro International Airport (GIG), you'll want to get an Uber or taxi. The subway is another affordable and safe way to get around the most popular neighborhoods in the South Zone. City buses are also convenient, but unfamiliar riders can be thrown off by the non-English-speaking bus drivers. Renting a car isn't the best mode of transportation around the city, as traffic is heavy and the roads are packed with disorienting street signs and pedestrians.  ", "United States citizens must bring a valid passport and will be granted a visa upon entry, although these rules will change on Jan. 10, 2024, when U.S. citizens will be required to obtain a visa from the Brazilian Embassy or closest Consulate before entering Brazil. A standard visa enables visitors to stay in Brazil for 90 days, which can be extended to 180 days. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}