{"name": "Cinque Terre", "description": ["Cinque Terre (pronounced CHINK-weh TAY-reh) – translated as five lands and also known as 5 Terre – is a collection of five towns along Northwest Italy's Ligurian Coast. Formerly remote fishing villages, Monterosso, Manarola, Vernazza, Corniglia and Riomaggiore are now connected by train, and the rest of the world has taken notice of their laid-back vibe, their delicious olives and wine, and their transcendent trails that weave through the towns and hug the coastline. In fact, the entire region has become so popular that it's a designated national park and a UNESCO World Heritage Site. Although you'll only need a few days to explore Cinque Terre, it's definitely a destination worth adding to your Italian vacation itinerary. In fact, many visitors take a few days in Cinque Terre to stretch their legs and clear their heads after intense days touring buzzy Rome or art-filled Florence. Many of the best Italy tours offer organized daytrips to the towns – a great alternative if you don't want to find your own transportation to the area.", "The best time to visit Cinque Terre is in September and October when summertime's tourists have returned home – and cooler temps and emptied-out trails await. The wintertime, from November to February, is characterized by cold weather and some amenity closures. Still, the December holidays bring some glow during the winter days; plus, lower rates on accommodations are always nice. Spring is another pleasant shoulder season, which – like fall – can be accompanied by a chance of rain.", "Get your bearings Many people base their Cinque Terre vacations in amenity-filled Monterosso. Find your way among the narrow passageways by orienting yourself with its central Piazza Garibaldi.", "Find a friggitoria If you're looking for a protein-packed Cinque Terre snack to fuel up for a hike, head to a friggitoria for a paper cone packed with bite-sized seafood.", "BYO water bottle Make sure to bring plenty of water while hiking, especially in the hot peak summer season. You can fill up at fountains in each of the villages.", "Buy a Cinque Terre Card If you plan on hiking your way through Cinque Terre, this card will save you money and frustration since it gives you access to all of the trekking paths, park buses and even Wi-Fi.", "Eat cheap Buy affordable but nonetheless delicious street foods, such as pastries, pizza and paninis, for lunch and breakfast, rather than spending more euros at sit-down restaurants.", "Avoid peak season Although summertime has its allures, it's also the most expensive time to visit Cinque Terre. Visit in the low or shoulder seasons, such as the fall, to conserve your cash.", "The official language in Italy is Italian, and though many of the tourist-facing professionals will speak proficient English, it's prudent to brush up on some of the key Italian phrases, including \"hello,\" ciao; \"goodbye,\" addio; \"please,\" per favore; \"thank you,\" grazie; \"yes,\" si; \"no,\" no; and \"excuse me;\" mi scusi.", "The official currency of Italy is the euro, and travelers can exchange their dollars for euros at exchange booths at the airport and at train stations throughout Cinque Terre. However, many travelers choose to take out local money from ATMs with their bank cards. Since the exchange rate fluctuates, you'll want to check it before you go.", "Cinque Terre has an array of local specialties, including anchovies, pesto and stuffed mussels. You should also try pansotti, a ravioli stuffed with ricotta and spinach and topped with a rich hazelnut or walnut sauce. And in Vernazza, order tegame alla Vernazza, which is a main course of anchovies, potatoes and tomatoes, served with white wine, oil and herbs.", "When it comes to wine, sciacchetra is the regional specialty – but keep in mind that a bottle can be pretty expensive. And it's no wonder: Pounds and pounds of grapes go into just one bottle of sciacchetra, and each bottle takes about six years to age. Coffee too is practically an art form in Italy and in Cinque Terre it's no different. Coffee also comes with its own etiquette: For instance, Italians usually save their big frothy lattes for breakfast (which they'll sip with a biscotti or a pastry) and enjoy black espresso during other parts of the day.", "For a fine dining experience in Monterosso, you'll want to try the traveler-approved Ristorante Miky for its delicious seafood dishes. For cheaper eats, pick up a paper cone of seafood from Il Bocconcino on Via Fegina. In Riomaggiore, Il Pescato Cucinato gets high marks for its cheap but delicious seafood. Try Caffee Matteo on Via Felschi in Corniglia for coffee and pastries. For an excellent view and superb wine, stop by Vernazza's Wine Experience or Manarola's Nessun Dorma.", "The best way to get around Cinque Terre is by foot. Not only is trekking the chief attraction of this Italian coastal region, but it's also the best way to experience the charms of the small towns and the beauty of the sea. Still, there are trains and ferries that can get you from point A to point B if your legs grow weary. Driving tends to be more frustrating than helpful.", "Travelers often come to Cinque Terre after several days in another Italian destination, such as Florence, Milan or Genoa among others, and a train is usually the best option to traverse the distance between destinations. There are train stations in each of the villages that comprise Cinque Terre. The nearest airports are: Florence Airport (FLR), about 110 miles southeast; Milan-Malpensa Airport (MXP), around 180 miles north; and Genoa Airport (GOA), approximately 60 miles northwest. If you're based in Florence or Milan and just want to visit Cinque Terre for a day, consider signing up for one of the best Italy tours. Many of these tours will take care of organizing transportation for you, in addition to providing an adept local guide.", "For U.S. citizens entering Italy, a passport that is valid for at least six months beyond the travel departure date is required. U.S. citizens do not need a visa unless they plan on remaining in Italy for longer than 90 days. Visit the U.S. State Department's website for more information on exit and entry requirements."]}