{"name": "Pigeon Forge", "description": ["Pigeon Forge is famously known for being home to the Dollywood theme park and Splash Country water park. However, you may be surprised by how much else there is to discover in this charming small town in eastern Tennessee. Actors, comedians and musicians put on larger-than-life performances at The Comedy Barn and Country Tonite Theatre. There are numerous educational, engaging and family-friendly museums located here, including WonderWorks, the Titanic Museum Attraction and Beyond the Lens!. What's more, the scenic outdoors beckon to travelers: Visitors to Pigeon Forge can enjoy parks, admire the landscape via zip line or alpine coaster, and go camping and hiking nearby.", "You should of course spend some time at Dollywood (it's home to an impressive number of roller coasters, attractions and shows) and Splash Country (the 35-acre water park is packed with slides and rides). But don't forget to slow down and take a stroll through town, check out the shops and eateries at The Island in Pigeon Forge, and maybe stop in to visit a winery or brewery. One thing's for certain: There's no doubt you'll appreciate everything to see, do and experience in Dolly Parton's \"Tennessee mountain home.\"", "The best time to visit Pigeon Forge is in the spring or fall, when the area experiences pleasant temperatures and the local attractions aren't too crowded. Some of the area's best things to do are outside, and average temperatures in the 60s and 70s and lower humidity from March to May and September to October make for an enjoyable atmosphere for all sorts of outdoor fun.", "Summer sees plenty of families flocking to Pigeon Forge during the school break to take advantage of the various amusement and water parks, but accommodations are typically pricier this time of year, the temperatures can be sweltering and the humidity can be suffocating. Winter can be a good time to visit if you don't mind the cold (temperatures range from lows in the mid-20s to highs in the mid-50s) and want to participate in events like Dollywood's Smoky Mountain Christmas or see the snow-covered mountains and holiday light displays.", "Pancakes are popular You'll see plenty of breakfast (specifically pancake) eateries in Pigeon Forge. Make sure to sample some tasty flapjacks while you're in town. Smoky's Pancake Cabin, Red Rooster Pancake House and Flapjack's Pancake Cabin are a few tried-and-true favorites.", "See a show Pigeon Forge boasts several theaters with programming that ranges from comedy and musicals to dinner shows and family-friendly entertainment. Make sure you get tickets to at least one show when you visit.", "Consult the calendar of events This town hosts dozens of events, parades and festivals every year, so chances are there will be something going on during your trip. To see what's planned during your stay (or to help you narrow down when to visit), check out the tourism board's calendar of events.", "Check for coupons The Chamber of Commerce and Pigeon Forge tourism board websites both feature coupons for everything from lodging to local attractions. Consult both before planning your trip to see where you can save.", "Rent a cabin Traveling with a group of people? Renting a cabin will help you save some money on your lodging and there are plenty of rental options for groups big and small in Pigeon Forge."]}