{"name": "Mallorca", "description": ["Mallorca, the largest of the collection of islands located off the east coast of Spain, is also the most diverse of the Balearics. Although it's true that the same aquamarine waters that lap Ibiza – its southwestern neighbor – also roll onto Mallorca's pristine shores, Mallorca's landscape holds many more treasures. For examples, look no further than the island's Serra de Tramuntana mountain range, which lines the northern coast and drops into the rocky Cap de Formentor, or the inland's swaths of green that are draped in olive, almond and carob groves. And its medieval town – Palma – with its soaring cathedrals and palaces and its quaint streets and squares, are in their own way just as delightful to behold. Couple that with a local culture that appreciates good food, good wine and fun – summer is a nonstop party! – and you'll start to wonder, why not Mallorca?", "The best time to visit Mallorca is from March to May, when average temperatures are in the 60s and 70s and the crowds of summer tourists haven't yet descended on the island. Summer has a long stretch in Mallorca – from June to September – and it's characterized by sweltering temperatures, hordes of tourists and high room rates. Fall is another nice shoulder season with mild temperatures and cooling rains, but January and February are the best times to score decent deals on room rates.", "Avoid the tap water Full of minerals and prone to contamination, the tap water in Mallorca isn't drinkable. Stick to bottled water to avoid a sore stomach.", "Find souvenirs at Placa Major This pedestrian square in Palma brims with souvenir shops, selling Balearic vases and jugs, as well as knickknacks like magnets and keychains.", "Book bargain accommodations Look for all-inclusive resort deals in areas like Port d'Alcúdia to save yourself a bundle during the offseason in January and February.", "Throughout its centuries-long history, Mallorca has experienced many different rulers and reigns, from Phoenicians to Romans. The strongest influence on its culture is perhaps James I the Conqueror – who assumed multiple titles during his life as the King of Aragon, Count of Barcelona, Lord of Montpelier, and finally King of Mallorca in 1231 – and his successors, who commissioned art and architecture that are still beloved to this day, including Palma Cathedral and Bellver Castle. ", "Although there is no official religion, a good portion of the population is Roman Catholic, which is reflected in the many festivals that fill the calendar. But Mallorca is an open and friendly place to people of all backgrounds and religions. ", "Mallorca is a safe place for tourists. Still, it's a good idea to use your common sense by keeping your money and credit cards out of sight at the beach or in your rental car. The blinding summertime sun will likely be your biggest threat during a Mallorcan vacation. Pack sunscreen, and make sure to bring plenty of bottled water for your beach days.", "Mallorcans speak Spanish – or a variant of Spanish, called Castilian – and Catalán. But you'll find that many Mallorcans working in the tourism industry speak proficient English. Still, it's not a bad idea to brush up on a few helpful phrases, including \"por favor\" (please); \"gracias\" (thank you); \"hola\" (hello); and \"adios\"(goodbye). The official currency in Mallorca is the euro. Since the U.S. dollar to euro exchange rate fluctuates, be sure to check the current exchange rate before you visit.", "You might think that Mallorca only has three main food groups – pork, seafood and vegetables – since they feature so heavily in traditional dishes, such as arroz brut (Mallorca's take on paella) and llom amb Col (pork loin and cabbage). For local specialties like these, head to Finca es Serral, located on the island's northeast side outside of Artà.", "Mallorca does sweets well, too: You absolutely shouldn't miss ensaïmadas Mallorquina, Mallorca's signature pastry that is sometimes described as a cross between a croissant and brioche. You can find them at Ca'n Joan de S'aigo sprinkled with sugar, topped with apricot and apple, or even stuffed with pumpkin, among other ways.", "Despite its small size, Mallorca is a culinary heavyweight, with nine of the island's restaurants boasting a total of 10 Michelin stars. Zaranda, located in the Castell Son Claret hotel, is the establishment that earned two of those for its inventive tasting menus and interesting wine list. But you don't have to have a thick wallet to dine well in Mallorca. Like the rest of Spain, Mallorca has its fair share of delectable tapas bars – some with sleek, modern vibes and others adorned more traditionally. Try The Tapas Club for the former or La Boveda for the latter; both are located in Palma. Mallorca also offers a wide array of thrumming nightlife. You'll find the greatest frequency of lively bars and clubs in places like Magaluf, Palma and El Arenal.", "Palma's gourmet food market, Mercado Gastronómico San Juan, is another can't-miss spot. About 20 vendors sell everything from tapas to paella to fresh fish.", "Mallorca is a safe destination to visit, but you should use common sense. As with any tourist hot spot, petty theft and pickpocketing is common. Be sure to keep an eye on your valuables and be aware of your surroundings.", "The best way to get around Mallorca is by car. Having your own set of wheels gives you the most freedom to explore the island on your time. Buses are an option, too, but service is limited, especially on weekends. In towns like Palma, there are plenty of taxis, but these are more of an option for inter-city trips rather than for island treks. The same goes for walking and biking. Although there are some lovely pedestrian areas in Palma, Alcúdia and other towns, not to mention beaches, the island is too large to explore on foot or bicycle alone.", "To get to Mallorca from the United States, you have several options. You can fly to a mainland Spanish city, such as Madrid or Valencia, and then catch a connecting flight from a carrier like Iberia, Vueling or Air Europa to Palma de Mallorca Airport (PMI) – also known as Son Sant Joan Mallorca Airport – located just southeast of Palma. Alternatively, you can take a ferry (which can accommodate cars) to Palma from a variety of neighboring destinations, including Barcelona, Ibiza or Valencia.", "To travel to Spain, you'll need a passport that's valid for at least three months beyond your departure date (though six months is recommended). To stay longer than three months, you'll need to obtain a tourist visa before you arrive in Spain. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}