{"name": "Colorado Springs", "description": ["It's easy to see why Katharine Lee Bates was inspired to write the lyrics to the famous patriotic ballad \"America the Beautiful\" from Colorado Springs. Look in one direction and you'll see the majestic \"purple mountains:\" the Colorado Rockies. Shift your eyes in the other direction to find yourself gazing out at \"amber waves of grain:\" the Great Plains. The beautiful scenery isn't the only reason to head to this charming town. Colorado Springs is also home institutions such as the Air Force Academy and the Olympic & Paralympic Training Center. And over the years, it's become a cross section of personalities. Take to the streets and share the sidewalks with budding politicos, young families, art lovers and more: All stake their claim on this portion of America the Beautiful.", "Colorado's second-largest city has cultivated a stellar reputation, continually earning a spot on the U.S. News Best Places to Live ranking. It's also well-known for being a central political and religious hub, but over the past couple of years Colorado Springs has eased up on the religious rhetoric, even adopting a hint of the laid-back vibe that Colorado visitors normally associate with Boulder or Telluride (to experience this side of the Colorado Springs area, head to nearby Manitou Springs). But most visitors don't come here to sample the political and social discourse – they come for the all-encompassing views found at the top of Pikes Peak, the towering cliffs that make up the Garden of the Gods and the blushing cliffs at Red Rock Canyon.", "The best times to visit Colorado Springs are from March to May and from September to October. That's when you'll find slightly cooler (yet still comfortable) temperatures as well as fewer crowds and bargain rates. Another perk for fall visitors: the foliage. Expect to see the surrounding mountains speckled with bright reds, oranges and yellows. Warm summer weather draws visitors in droves, leading to price hikes at hotels and congested attractions.", "You will need a car The city does operate a public bus system, but getting to some of the area's most popular attractions will be easier with your own set of wheels.", "Note the altitude You may experience dizziness or nausea as you adjust to Colorado Springs' high altitude (approximately 6,035 feet). Drink lots of water and avoid strenuous activity (like hiking or zip lines) for the first few days.", "Pack layers Thanks to its mild climate, Colorado Springs doesn't endure the same harsh winter temps of its neighbors. If you're visiting in winter, pack a warm coat, but also bring a T-shirt and shorts in case you're in town for one of the city's unusually warm days.", "Don't go in summer This is Colorado Springs' peak tourism season, and prices are at their highest. You'll find brisk weather and cheaper rates if you visit in late spring or early fall.", "Limit the use of your car You will need a car to get to less central points of interest, but you can save money on gas and parking by exploring neighborhoods in the downtown area on foot.", "Colorado Springs has its fair share of global cuisines, but it's the American and Mexican restaurants that are the biggest crowd pleasers in this mountain town. University of Colorado Colorado Springs students rave about Shuga's, a casual restaurant and bar that's known for its creative sandwiches and spicy coconut shrimp soup. King's Chef Diner is another local favorite that's been serving up its famed green chili since 1956. Order it on eggs, on cheeseburgers or have it in a bowl with all the fixings. If you're craving a beer, head to Phantom Canyon, a brewery-meets-restaurant that pairs its brews with tavern classics like burgers, wings and homemade pretzels served with beer cheese. To start your day, head to Urban Egg for a hearty breakfast. This beloved Colorado chain dishes up everything from eggs Benedict to pancakes to toasts. When you want a date night or to splurge for an evening, try The Rabbit Hole. It wins rave reviews for its ambiance and its rabbit meatloaf.", "The best way to get around Colorado Springs is by car, since some of the city's most popular things to do – including the famous Pikes Peak – cannot be reached on foot from the city center. However, if you plan on spending the day in downtown Colorado Springs or nearby Manitou Springs, your own two feet and a comfy pair of shoes should suffice. You can rent a vehicle in town or at the Colorado Springs Airport (COS), which is located about 11 miles east of central Colorado Springs. The city also features an affordable public bus system with more than 20 routes, many of which start or end in the downtown area. But bus services here better serve commuters than they do tourists, offering reliable, yet limited, weekend service. Another option is to swap four wheels for two: Many Colorado Springs streets boast bike lanes and the area also shelters nearly 200 miles of paved and unpaved trails. The city also has a bike-share program called PikeRide, where you can borrow a bike for as little as $2."]}