{"name": "Perth", "description": ["Tucked into the coast of Western Australia, Perth is one of the world's most isolated cities. In fact, it's geographically closer to East Timor and Indonesia than it is to Sydney. But it also might just be one of the world's best secrets. This city of 2 million, which came of age during the 19th-century gold rush and then again after World War II, is experiencing yet another rise in popularity. And it's not hard to see why: Australia's easygoing energy is displayed all around Perth, from its gorgeous beaches to its humming coffee shops, expansive green space and lively neighborhoods.", "Plus, despite its isolated status – the nearest big city is Adelaide, and it's more than 1,300 miles away – Perth's sparsely populated surroundings are lovely. The Swan Valley contains lush vineyards and wineries, the port city of Fremantle is charming even with its reminders of Australia's penal colony past, and Rottnest Island is ringed with pristine sands and lapping turquoise waters. ", "The best time to visit Perth is in September, October or November when the city is aglow with the colors and perfumes of spring and sunny days are uninterrupted by rain. December through February constitutes Perth's summertime and is marked by scorching temperatures. The season that stretches from March to May is probably the second-best time to visit – its warm days are perfect for the beach and other outdoor activities. June through August is low season here thanks to chilly climes (for Perth) and lots of rain. ", "Although Aborigines populated what became known as Western Australia many years before Europeans settled it in 1826, the state was founded as a free colony – one of the few states in Australia to be established as such. Even though it wasn't a penal colony, convicts did help build the area's infrastructure, including the Fremantle Prison. The region also played important roles during the late 19th-century gold rush and both world wars.", "The coastal city is decidedly laid-back and casual, and it has quite a few Perth-isms – that is slang that is unique to the city. For instance, a \"Sheila\" is a woman, \"arvo\" is afternoon, \"bottle shop\" is a liquor store, and a \"shark biscuit\" is a body board. A resident of Western Australia is a \"sandgroper\" and a resident of Perth is a \"Perthite.\" Other than the occasional slang term, Americans should have no problem communicating since English is Australia's official language.", "Aussies drive on the left, so make sure you get your bearings if you hop behind the wheel or even cross the road as a pedestrian (always look right, then left and then right again before crossing the street). You do not need to obtain an international driving permit to operate a vehicle in Western Australia, but keep in mind that distances and speed limits are posted in kilometers.", "All Australian cities, including Perth, use the Australian dollar (1 Australian dollar is equal to $0.76). Keep in mind: the Australian to U.S. dollar rate can fluctuate, so check the latest exchange rate before you visit. Tips aren't expected in either taxis or restaurants, except if exemplary service is given.", "With its proximity to the wine country of the Swan Valley, it should come as no surprise that Perth is flowing with top-notch Australian wines. Many of Perth's restaurants and wine bars offer a curated selection of the area's vino, but to avoid racking up pricey bar tabs, heed the advice of fellow travelers and buy boxed wine at area groceries. If just a glass (or two) will do, head to neighborhood wine bars like Budburst or Halford.", "Perth's dining scene is also heavily influenced by Asian cuisine, and visitors can get a nice sampling at places like the Nao ramen bar and Nhu Loan for bahn mi, not to mention Hot Star Fried Chicken. And with its position alongside the Indian Ocean, Perth is a prime spot for seafood and freshwater fish. Don't miss specialties like Geraldton rock lobster and North West barramundi, as well as Exmouth prawns, Rottnest scallops and Mandurah crabs. Another must-do is digging into the fish and chips at the Fremantle Fishing Boat Harbour.", "The best way to get around Perth is via the city's free public Central Area Transit buses. Taxis, which can be hailed or scheduled, are another option, as are rental cars. But remember, Australians drive on the left side of the road and distances are measured in kilometers. Although walking is one of the best ways to experience the city's top attractions, the city and surroundings are too large to manage on foot alone. Biking has become increasingly popular, and Fremantle, a nearby port city, even offers a free bike-share service. ", "To reach the city, visitors can fly into Perth Airport (PER), which is located less than 10 miles east of central Perth. From the airport, visitors can take bus route No. 380, which offers service to several train and bus stations, including Elizabeth Quay. A one-way taxi ride from the airport to Perth's central business district will cost AU$43 (about $33).", "All American visitors entering Australia must have a valid U.S. passport and a tourist visa. For travelers staying less than 90 days, an Electronic Travel Authority (an electronic, label-free visa found on the Australian Government Department of Immigration and Border Protection's website) is required. Some airline and travel agents can apply for an Electronic Travel Authority on your behalf. To learn more about Australian entry and exit requirements, visit the U.S. State Department's website."]}