{"name": "Queenstown", "description": ["A trip to Queenstown means a trip filled with adventure. One day, you're bungee jumping: Your feet leave the ledge, and gravity drags your body downward. Then you're whitewater rafting: You're plummeting over waterfalls, the river water slapping your skin. And the next day, you're hiking the greenest hills you've ever seen. Later in the week, your stomach drops because you've just leapt out of an airplane into the blue sky: skydiving. And before you head home, you're grinding down a snowy mountain, a board strapped to your feet: snowboarding. What an adrenaline rush!", "If these visions seem more like a dream come true – and less like a horrifying nightmare – your fantasy destination is the easygoing daredevil, Queenstown. And at the end of a rip-roaring day, you can toast to yourself with some of the best pinot noir around. So, visit for adventure, friendliness, wine and ravishing vistas. And do bring your bucket list: You'll definitely be able to check a few things off.", "The best time to visit Queenstown is the summer (December through February), when the long, sunny days make outdoor excursions enjoyable. Because of the sheer number of outdoorsy activities offered in the summertime, you can expect some moderate crowds and busy hotels. Spring (September to November) and fall (March to May) yield unpredictable weather conditions, while winter (June through August) is prime for powder hounds.", "In New Zealand, \"kiwi\" doesn't just refer to a fruit. It refers to a native New Zealander and the national bird. Keep your eyes peeled for these endangered and flightless creatures. You can also find them at Kiwi Birdlife Park.", "English is the primary language here, although getting used to the accent may take some time. Kiwis are known for their friendliness and won't take offense should you need them to repeat themselves.", "The official currency here is the New Zealand dollar (NZD), which is roughly equivalent to $0.67. You should also note that tipping isn't customary here, although it is appropriate to leave 10 to 15 percent if the service was extraordinary.", "Like Brits and Aussies, Kiwis drive on the left side of the road. Those of you who are used to city driving should take extra care when driving on New Zealand's winding mountain roads. Narrow passageways and fickle weather conditions can throw even the most seasoned driver off course.", "Queenstown is a pretty safe place; car break-ins are the most common offense against tourists, so be sure to leave valuables at home or in your hotel room.", "Like other Kiwi cities, Queenstown specializes in fresh, local cuisine. However, unlike Auckland and Wellington, Queenstown's dining scene mainly consists of casual fare. No matter where you are in New Zealand, trying out the region's lamb is a must. For some of Queenstown's best lamb, grab some takeout (or takeaway as it's known locally) from Pedro's House of Lamb. Only one item is offered at Pedro's: a baked rosemary and garlic lamb shoulder with scalloped potatoes. The lamb is not only delicious, but one portion can easily feed two to three adults.", "Quintessential New Zealand seafood like whitebait, bluff oysters and green-lipped mussels can be found in Queenstown as well. Notable seafood eateries include Captains Restaurant, Botswana Butchery and Fishbone Bar & Grill.", "And before leaving Queenstown, visitors who are 18 and older should plan on checking out the region's top-notch wine. More than 70 wineries can be found in the area, most of which produce Central Otago's world-famous pinot noir. Some of Queenstown's best wineries include Amisfield, Gibbston Valley and Peregrine Wines.", "The best way to get around Queenstown is by car, since many of the city's activities are spread apart. Plus, there's limited public transportation to get you from point A to point B. That said, you can certainly walk around downtown Queenstown and get a feel for the city. If you stay in central Queenstown, you can likely get around without a rental car. To get into town from Queenstown Airport (ZQN), a distance of less than 5 miles, you can take a taxi, the No. 11 bus or your rental car.", "You'll need an up-to-date passport to visit Queenstown, but American citizens are not required to have a visa for stays shorter than three months in duration. For more information on New Zealand travel, visit the U.S. State Department's website.", "Ride the Skyline Queenstown gondola or take to the skies via a paragliding or skydiving excursion for incredible views of downtown Queenstown, The Remarkables and Lake Wakatipu."]}