{"name": "Wellington", "description": ["Wellington is not just the capital of New Zealand, some would say it vies (with Auckland) for the title of cultural capital, too. And those cultural attractions – museums, theaters and restaurants – are hemmed in by the glittering blue waters of the Cook Strait and the rippling topography of the Rimutaka Range. It's no wonder why fantasy films like \"The Adventures of Tintin\" and \"The Lord of the Rings\" and \"The Hobbit\" trilogies were filmed here, where gorgeous settings can be found at every turn. ", "Plus, the kiwis that call this windy city home are welcoming and friendly, traits you'll see behind the bars at the many craft breweries, wine bars and coffee shops dotting the city.", "The best time to visit Wellington is between March and May (the autumn shoulder season) when the weather is warm but the city isn't overcrowded. Winter, which spans from June to August, is considered low season, and it's typically characterized by strong gusty winds. The months between September and November are Wellington's springtime, while December, January and February constitute the peak summer season when families flock to Wellington on school breaks and holidays.", "Wellington is heavily influenced by its Maori culture. In fact, the Maori language became one of New Zealand's official languages back in the 1980s, and its part of the curriculum in some schools. Visitors will see the preservation of the Maori language in places like museums and the tie to its culture in events like Matariki, but the majority of locals speak English. ", "Down Under, travelers will find that locals drive on the left side of the road, so pedestrians should look right, then left, then right again before crossing a street. They should also remember that the seasons are swapped; Wellington's summer is America's winter (and vice versa). ", "In New Zealand, the official currency is the New Zealand dollar (which is equivalent to approximately $0.70), but you might want to check the latest exchange rate before you go. When it comes to tipping, it's customary to refrain from tipping in New Zealand unless exceptional service is given. But should you decide to tip, leaving 10 percent of your total bill is more than generous.", "Wellington takes its dining seriously. In fact, the city boasts that it contains more restaurants and bars per capita than New York City. But it's not just the food that earns high marks among epicureans. The city's coffee, wine and craft beer is just as revered.", "To start your culinary adventure, head to one of the city's favorite cafes. Memphis Belle Coffee House (which has a sister location in Maui), Fidel's Cafe and Customs by Coffee Supreme – all located in the city center – are some of the hot spots frequented by locals. Order a flat white – a velvety espresso drink made by pouring frothed milk over an espresso shot.", "When you're ready for some local eats, use the city's neighborhoods as your guide. Courtenay Place – the theater and party district – is filled with some of Wellington's top restaurants, such as Capitol Restaurant, famed for its artfully plated seafood entrees. You can also take a jaunt over to Cuba Quarter, which has a collection of ethnic restaurants, as well as award-winning establishments like Logan Brown and Matterhorn. Miramar, a neighborhood by the airport, is another gastronomic hot spot. And along the harbor, you'll find several highly regarded seafood spots (think: Ortega Fish Shack & Bar and Whitebait) that serve up local specialties like whitebait and fish and chips. ", "For a taste of New Zealand vino, head to Noble Rot, an unpretentious wine bar off Cuba Street, or Cafe Polo, which offers an extensive menu of New Zealand wines in the Miramar neighborhood. If you'd rather hit up some wineries, you could take a ferry across the Cook Strait to Marlborough, where much of the country's sauvignon blanc is produced. To stay on dry land, you can drive a little less than two hours to the Wairarapa wine region, which specializes in pinot noir. ", "Called the craft beer capital of New Zealand, Wellington contains a vast collection of purveyors pouring pints of craft beer, including Golding's Free Dive, Sprig & Fern Brewery and Little Beer Quarter, among others. For more help in finding craft breweries and bars, visit Craft Beer Capital's website.", "The best way to get around Wellington is on foot since the downtown area is compact. When your legs need a break – or you want to reach places beyond the central business district – Wellington also boasts a great public transportation system of buses, trains, cable cars and even ferries. Driving around the city can be frustrating for a number of reasons, including a profusion of confusing, one-way streets. Taxis and the ride-hailing service Uber are also available in Wellington, though they aren't the most cost-effective means of getting around. ", "To reach Wellington, many travelers fly into Wellington International Airport (WLG), which is located less than 5 miles southeast of the city center. Travelers can hail a taxi, hire a rental car or hop on Metlink's Airport Flyer (bus No. 91) to get to central Wellington.", "For U.S. citizens entering New Zealand, a passport that is valid for at least three months beyond the travel departure date is required. U.S. citizens do not need a tourist visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for more information on exit and entry requirements."]}