{"name": "Breckenridge", "description": ["Settled in 1859, Breckenridge retains the same Victorian-era charm it did during the height of the gold rush. Its down-to-earth and friendly atmosphere has also endured its transformation from a silver- and gold-mining town to one of the country's most beloved skiing destinations. What's more, Breck – as it's called by locals – is a quick drive from other popular Colorado destinations, including Vail, which is 40 miles northwest, and Denver, which is 80 miles northeast. It's also a popular departure point for many of the best Colorado snowmobile tours.  ", "Winter days in Breck are defined by runs on the Tenmile Range and nights spent refueling at downtown restaurants and bars – not to mention a collection of breweries and even a distillery. In the summer, winter sports are replaced with hiking and cycling. But no matter the season, the majesty of a Breckenridge sunset and star-studded night sky is a wonder to behold – and worth coming back to year after year. ", "The best time to visit Breckenridge is November through April when the slopes are ready and waiting for skiers and snowboarders. These months tend to see 300 inches of annual snowfall and average daytime temps hover in the upper 20s. But traveling between the months of May and October, when the mountain thaws out and hiking trails replace ski runs, isn't a bad time to visit either, especially if you're on a budget. ", "Beat altitude sickness Eating carbs, staying hydrated and easing into exercising in Breckenridge's high-alpine environment will help keep the nausea and headaches associated with altitude sickness at bay.", "Slather on the sunscreen Limited pollution and a thinner atmosphere means it's much easier to get a sunburn in the mountains. Protect against a painful burn with sunscreen.", "Breckenridge offers travelers quite a few ways to replenish all the calories burnt from skiing and snowboarding or hiking and cycling. For a quick lunch, visitors highly recommend Soupz On for its warming soups, such as sweet potato gumbo or mom's chicken noodle. If you're in the mood for a more formal dining setting, consider the popular Hearthstone Restaurant, where you can try some local game, like elk, or Briar Rose Chophouse & Saloon, where you should definitely order the ribs. Relish, with its seasonal Colorado-inspired cuisine, is another favorite among visitors and locals. ", "Breakfast is a popular meal in this active town, and there are a number of places to fuel up for a day on the slopes. Amazing Grace Natural Eatery offers traveler-approved breakfast burritos, and LoLo Juice sells a variety of healthy juices and smoothies.   ", "When you're ready to indulge in the town's après-ski scene, try the historic Gold Pan Saloon. Its claim to fame is that it possesses the oldest liquor license west of the Mississippi River. Like many Colorado ski spots, Breckenridge also boasts a collection of beloved breweries, such as the Breckenridge Brewery and Broken Compass Brewing. There's also the award-winning Breckenridge Distillery, which offers tours of its production facility for $10 and complimentary samples from its tasting room on Main Street.", "The best way to get around Breckenridge is through a combination of walking and driving. Although the restaurants, bars and shops of Main Street are best explored on foot, you'll likely need a car to reach places farther afield, such as Boreas Pass Road. If you don't want to rent your own wheels, you can get around on the Free Ride bus service, which connects much of the town and Breckenridge Ski Resort. Cycling is a popular pastime in the summer, and taxis and ride-hailing services are available year-round. ", "To reach Breckenridge, most travelers fly into Denver International Airport (DEN), which is more than 100 miles east, or Colorado Springs Airport (COS), about 115 miles southeast, and either rent a car or catch a shuttle into town. Colorado Mountain Express is a popular shuttle company with a variety of departures from the Denver airport to Breckenridge. If you're flying into Colorado Springs, consider the Colorado Springs Shuttle or Rocky Mountain Ride."]}