{"name": "Pittsburgh", "description": ["Steel City is still grounded by its industrial roots, but Pittsburgh is finally breaking down its blue collar image. A cluster of universities — like Carnegie Mellon and the University of Pittsburgh — inject a refreshing energy into the city. And many artists hail from Pittsburgh, including Broadway star Patti Lupone, the late Pop Art master Andy Warhol and the kid television host \"Mister\" Fred Rogers. Yes, Pittsburgh is known as the steel industry's main hub, but there's a fresh vibe bubbling to the surface. There are new (and quite tasty) restaurants opening across the city; the museums are bursting with world-class art and regional history; Heinz Field hosts some of the best football games in the country; and there are plenty of outdoor activities along the city's three rivers year-round.", "One of Pittsburgh's culinary staples? Pierogies. Plenty of natives have opinions on where to get the best pierogies in Pittsburgh, and when you're in town you should certainly try this popular Polish dish. Eateries that often win favor with critics and patrons alike include Pierogies Plus, Penn Brewery and The Church Brew Works. Pierogies Plus specializes in Eastern European food and offers several different takes on the traditional pierogi. Penn Brewery gets high marks not only for its tasty potato dumplings, but also for its craft beer. And The Church Brew Works is a particularly interesting venue housed in — you guessed it — a former church. The restaurant brews its own beer and serves pierogies multiple different ways.", "You may not think of Pittsburgh as having a happening culinary scene, but the city features a wide range of restaurants specializing in an array of cuisines at a mix of price points. Pittsburgh's got everything from upscale eateries like the contemporary American Eleven and Mediterranean-focused Casbah to casual joints serving bangin' burgers (Burgatory) and those famous french fry- and coleslaw-topped sandwiches (Primanti Bros.). You can find tasty Italian food, wood-fired pizza and a BYOB policy at Piccolo Forno, South American-Caribbean fusion dishes at Kaya, Thai food in a fun atmosphere at Pusadee's Garden and an impressive all-American breakfast or brunch at Pamela's Diner. "]}