{"name": "Berlin", "description": ["More than three decades since the fall of the Berlin Wall, the city basks in a cultural renaissance that boasts everything from museums and fashion to food and nightclubs. But that's not to say that this city has forgotten its dark past; in fact, attractions like The Memorial to the Murdered Jews of Europe, the Topography of Terror and the Checkpoint Charlie Museum are evidence of its steadfast reverence. And yet, Berlin is on the upswing. An afternoon of visiting a lively cafe, a biergarten or an all-night dance fest at a club will provide you with the proof.", "The best time to visit Berlin is May through September, when the weather is ideal for cafe sitting, relaxing in a park, and leisurely city strolling. Winter, on the other hand, is cold, however the city’s nightlife and arts scene continue to thrive and entertain travelers. Temperatures tend to range from 20 to 30 degrees Fahrenheit during the winter. However, this might be the best time for budget travelers to score deals on airfare and hotel rates.", "Don't risk it: Stamp your ticket All public transportation tickets must be stamped at the platform, bus or tram before you begin your journey. Tickets that are not stamped are considered invalid and are subject to a fine of 60 euros (about $65) upon inspection.", "Pack a phrasebook Berlin is a friendly city, but knowing a few German words will help you exponentially. For example, bitte is \"please,\" and danke schön is \"thank you.\"", "Visit in the winter Bundle up and enjoy Germany’s capital in the winter. You'll have to face some cold temperatures (ranging from the low 30s to the 40s), but the superb deals on flights and hotels may make it worth it. During the holiday season, you’ll have the opportunity to visit more than 60 Christmas markets.", "Party in Berlin East You should take advantage of the city's lively nightlife, but you don't have to pay a fortune to do so. Nightlife venues to the east of the city are generally more affordable than those in the west.", "Buy a Berlin WelcomeCard Visitors can enjoy not only free transportation by subway, bus and ferry with the Berlin WelcomeCard, but also discounted tickets to major attractions. You'll also receive a free downloadable map of Berlin with your purchase.", "Pack a picnic A variety of popular parks, such as Mauerpark or Tempelhofer Feld, are equipped with barbecues and vast green space suitable for a picnic. Consider packing a meal and enjoying it outdoors.", "East and West Berlin were historically united after the fall of the Berlin Wall in 1989. Since then, Germany has experienced a vast economic and cultural revitalization that has propelled it to become one of the most powerful countries in Europe – and the world.", "Although Germany's official language is German, you'll find that many Berliners are proficient in English, too. Still, you can't go wrong learning a few German words: Guten tag or hallo for \"hello,\" bitte for \"please\" and danke for \"thank you.\"", "Punctuality and order are two characteristics highly prized by German culture, so be on time to any business meeting or formal engagement. When in a restaurant, do not leave your money on the table after receiving the check. Hand the money to the waiter and ask for your change. Tips are already included in your bill, but if the service was exceptional, it's customary to tip an extra 10 to 15 percent.", "Berlin's official currency is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "Berlin's food options are wide-ranging, with an abundance of traditional German cuisine, a thriving international food scene and even healthier, vegetarian options. Still, you shouldn't miss the opportunity to nosh on authentic dishes Berlin is known for.", "A variety of sausages – everything from bratwurst to bockwurst (pork and veal) to the unique currywurst (sausage covered with ketchup and curry powder) – are ever-popular, as are staples like Wiener schnitzel (flattened, breaded, fried veal). German cuisine relies heavily on pork – so much so that you'll find eisbein (pork knuckle) served with potatoes and sauerkraut. Pop over to Zur letzten Instanz, the oldest restaurant in Berlin, for some traditional eats. It is one block off the Klosterstraße U-Bahn station.", "Berlin also has a large Turkish influence (around 150,000 Turks call the city home) and that's spilled over into the gastronomy. For a look at a variety of delicacies, check out Turkish Market along the banks of the Landwehr Canal in the Neukölln neighborhood (hop off the U-Bahn at U Kottbusser Tor or Schönleinstraße). Additionally, be sure to try a döner kebab sandwich, which was first introduced by Turkish immigrants (urban legend says it was invented in Berlin). The dish includes a special bread filled with thin slices of beef (or chicken or lamb ... take your pick) and topped with lettuce, tomatoes, onions and a yogurt-based sauce. You'll find these sandwiches at numerous street vendors all over the city.", "Finally, no trip to Berlin is complete without some (or lots) of bier (beer). Beer is a big part of German culture; the legal drinking age for fermented beverages is 16 (or 18 for distilled alcohol). Germany also takes the quality of its suds seriously. There are a number of regulations, known as Reinheitsgebot (literally translated to \"purity order\"), that limit the number of ingredients used in the brewing process to only malt, hops, yeast and water. There are biergartens all over the city, but one of the most beautiful, Cafè am Neuen See, is found in Tiergarten. Don't forget to say prost or zum wohl (cheers and bottoms up, respectively). ", "In general, pickpocketing tends to be a Berlin tourist's main safety concern. Watch out for pickpockets on public transportation, especially during rush hour and at major tourist attractions. Berlin’s tourism website advises travelers to also be aware of fake police officers who will try to steal cash or credit cards. Also, visitors should be aware that prostitution is legal in Germany, and a percentage of Berlin's sex workers are victims of human trafficking.", "The best way to get around Berlin is via the U-Bahn underground trains or S-Bahn regional, elevated trains, which are both a part of the city's extensive BVG public transportation system. You can even reach the new Berlin Brandenburg Airport Willy Brandt (BER), which opened in 2020, by S-Bahn (there is a railway station directly below Terminal 1, and the one-way trip takes about 45 minutes from the airport to Berlin’s city center in Alexanderplatz). Although service is significantly slower than the U-Bahn or S-Bahn, travelers can also take advantage of the city’s extensive bus and tram lines.", "As with every big metropolis, driving is discouraged: heavy traffic and scarce parking are the main culprits. For a bit of exercise, you can rent a bike and peddle along the city's bike lanes and through the parks. Many locals use bicycles as their main mode of transportation. Metered taxis are also abundant; they can be hailed on the street or scheduled ahead of time. Ride-hailing services, such as Uber, are also available and helpful for travelers.", "United States citizens can visit Berlin for 90 days without a tourist visa. A passport that is valid three months beyond your planned departure date is required for entry. For more information on entry and exit requirements, visit the U.S. State Department's website."]}