{"name": "Maui", "description": ["Maui is not nearly as large as the Big Island, nor is it as small as Lanai, as bustling as Oahu or as quiet as Kauai. For many Hawaii vacationers, Maui is just right – offering a taste of just about everything the Aloha State has to offer, from impressive wildlife to intriguing history and culture. While on a visit here, you can shimmy alongside professional hula dancers, golf along coastal fairways, sail down a zip line, snorkel alongside five different types of sea turtles or simply lounge along some of Hawaii's most notable beaches.", "One of the archipelago's most popular tourism spots, Maui can be found sandwiched between the Big Island and the much tinier Molokai (which you can explore by signing up for one of the best Maui tours). Maui is divided into five distinct regions: Many travelers base themselves along the coasts of South Maui (home to the famous Wailea Beach) or West Maui, where the sands of Kaanapali Beach and the music from the Old Lahaina Luau are located. But the rest of the island should not be missed. Travel along the Road to Hana to experience East Maui's scenic coastline, explore Haleakala – the world's largest dormant volcano – in the Upcountry and discover the former tribal battlegrounds of Central Maui's Iao Valley State Park. And for a bird's-eye view of it all, reserve a spot on one of Maui's best helicopter tours.", "The best times to visit Maui are April through May and September through November. The spring and fall shoulder seasons provide the pleasant weather Hawaii vacationers seek without the high rates and heavy crowds that accompany the summer and winter. However, if you're into surfing, you'll want to travel in the winter for the best conditions – just book as early as possible to get a discounted rate. Meanwhile, if you're traveling with kids, you may want to splurge for a summer trip as that's when the waters are calmest. If you plan to set out on one of Maui's adrenanline rush-inducing tours and adventures, consider a travel insurance policy with medical coverage just in case.", "Nothing is free Resorts may advertise free internet and gym access, but you pay for those with the resort fee. Unfortunately, the fees are not negotiable, but at least you now know to expect them.", "Pick your hotel wisely Maui is full of things to do, but the island itself is fairly large. Make sure you choose a hotel that puts you close to your must-sees.", "Mind the time Maui doesn't participate in daylight saving time. When the rest of the U.S. moves their clocks back or forward, Maui's time stays the same.", "Sign up for a tour Hoping to snorkel the waters surrounding Molokai, spot whales in the ocean or see Haleakala National Park at sunrise? The best Maui tours take the hassle out of planning these unforgettable experiences.", "Consider the bus Driving is by far the easiest way to get around Maui, but if you plan on spending most of your time in one single area, you may be able to save on rental fees by relying on the bus. However, if you do decide to rent a car...", "Know your insurance policy Some car rental agencies will try to convince you that you'll need collision insurance. (This is a no-fault state where you'll have to pay any damages before leaving.) But your personal insurance or your credit card might already cover this.", "Forgo the ocean view It's nice to look out at the water, but if you can wait to do so at the beach rather than from your room, you can save a considerable chunk of change of your nightly hotel rate.", "Maui is a great place to go if you're looking to learn more about Hawaii history and culture. In fact, legend has it that it was the demigod, Maui, who pulled the islands from the sea and lassoed the sun from the top of Haleakala. Travelers who are interested in learning more about island lore will have plenty of opportunities to do so: A visit to the scenic Iao Valley will offer a glimpse into the tumultuous era of tribal warfare, while a stroll through the small town of Lahaina will yield a better understanding of Hawaii's whaling, plantation and trade history.", "Today, Maui is one of America's most popular vacation destinations – probably because it's so drastically different from any place on the mainland. Vacationers will find all the makings of contemporary luxury at the island's resorts, but outside the hotel areas, the relaxed \"Aloha spirit\" permeates. If you're looking to blend in with the locals, you simply need to loosen up: Pack T-shirts, shorts and flip-flops (as well as some light layers) for everyday wear, and tone down the road rage (no honking here).", "Other cultural traditions continue to influence everyday life in Maui, one of the most noticeable being language. Unlike many other states, Hawaii has two official languages: English and Hawaiian, which is a member of the Polynesian language family. Though you won't have any trouble finding English-speakers, you'll benefit from learning a few basic Hawaiian phrases; \"aloha\" means both \"hello\" and \"goodbye,\" and \"mahalo\" means \"thank you.\"", "The arts are a mainstay on the island, with numerous festivals – like the one held twice a month in Lahaina's Banyan Tree Park – showcasing works by regional craftspeople. And throughout the year, Maui honors its vibrant culture through events like the Maui Steel Guitar Festival and the East Maui Taro Festival. ", "If you're more interested in discovering Maui's natural wonders than its heritage, you'll find plenty of places to do so – from flower-filled jungles to underwater reefs teeming with aquatic life. However, it's important that you leave the island as you found it. Resist the urge to collect living souvenirs or to have a one-on-one encounter with local wildlife, as these could result in hefty fines. ", "This is the kind of destination where you really should soak up as much of the local cuisine as possible, regardless if other options are available. Like the rest of America, Maui is on board with the local food movement – here, you'll find plates piled high with freshly caught fish and regional produce. To find these ingredients prepared the island way, you'll want to stray from resort-heavy areas and head to towns like Lahaina, Kihei and Paia, which are home to popular restaurants like Paia Fish Market, Mama's Fish House, Merriman's, Star Noodle, Lahaina Grill and Nalu's. The farther you get from Maui's resorts, the more local mom and pop joints you'll find. These local outposts serve such specialties as pork roasted in banana leaves, poi (ground taro root) and haupia, a creamy coconut custard. If you're not quite sure where to start your culinary tour, ask some local residents for recommendations or sign up for one of the best Maui tours.", "One very popular – and economical – way to get your fill of Hawaii cuisine is to eat big around noon. Many local eateries served what's called a \"plate lunch,\" which comes piled high with some sort of protein (usually beef, pork or fish), rice and macaroni salad. This tradition formed on the fruit and sugar plantations, where workers would gather for lunch with with bento-like boxes piled with rice and leftover meat from the previous night's dinner. Today, it's common to see residents and visitors alike chowing down on the mountainous servings dished out by plate lunch restaurants and stands.", "If you are staying in accommodations with a kitchen, make sure to schedule a trip to a farmer's market. In addition to the freshest produce, you'll also find fresh fish and some readymade items, such as banana bread and passion fruit butter. Go Hawaii offers a guide to all of Maui's farmers markets on its website. Fruit stands selling smoothies and juices are also a common sight, especially on the Road to Hana. ", "Maui is a very safe place with little crime. Your main concern should be staying safe in parks and on hiking trails and, most importantly, in the water. Never hike or swim alone, and be sure to consult weather and tide conditions before entering the water.", "The best way to get around Maui is by car, particularly if you're planning on exploring large swaths of the island. Maui features a fairly comprehensive set of roadways, so finding your way around shouldn't be too difficult. There is also a bus system and hotel shuttles depending on where you stay – but these won't always be a dependable option for wide exploration.", "You can easily rent a set of wheels upon arriving at Maui's main flight terminal, Kahului Airport (OGG), located on the island's northern coast. You'll find two other airports on Maui: The Kapalua Airport (JHM) is located on the north coast of West Maui, while Hana Airport (HNM) sits in East Maui. Kahului services several major airlines, including United, Alaska and Delta, but both Kapalua and Hana are usually only used for inter-island transfers. If you aren't renting a car, know you can also get a taxi from these airports as well as a Lyft or Uber. ", "Maui gets its nickname, the \"Valley Isle,\" from the fact that the it's broken up by two islands on either side: the West Maui Islands and Haleakala to the east. "]}