{"name": "Detroit", "description": ["For many travelers, Detroit isn't a vacation destination. It is a means to an end, either as a stop on a business trip or a conduit to reach the University of Michigan in nearby Ann Arbor. This characterization may be true if you're shaping your feelings about Detroit based solely on grim headlines, but upon closer inspection you'll discover that this city is a hidden gem for intrepid travelers. While it's true Motor City has fallen on tough times – both economically and politically – and some of its abandoned neighborhoods give the city an eerie, post-catastrophe air, there is grace in its determined reinvention (it self-branded as \"America's Great Comeback City\").", "If you can look past its recent history, you'll find a city with French roots: La Ville d'Etroit was established in 1701 and was later even compared to Paris for its great beauty (the \"Paris of the West\" was its nickname thanks to its architecture and grand avenues). Scratch a little under the surface and you'll find much of the city's beauty still remains (some of the old art deco skyscrapers still stand, such as the Guardian Building). You can find out more about the city's history by signing up for one of the best Detroit tours. Alongside these remnants of Motown's flourishing past, you'll also find signs of its rebirth, with Marriott investing in hotel renovations and openings, and reinvigorated green spaces (like the Heidelberg Project) bringing much-needed life to previously desolate areas of the city. So don't discount Motor City just yet. It could be the great comeback kid of the 21st century.", "This is a sports town Detroit is home turf for the Tigers, the Lions, the Pistons and the Red Wings. There's a good chance one of the teams will be playing during your visit; try to catch a game if you can.", "This is the birthplace of the Coney dog Many people (understandably) assume the Coney dog (or the Coney Island hot dog) got its start in Coney Island, New York. It was actually invented in Michigan. Head to Detroit's Lafayette Coney Island to sample the beef hot dog, topped with an all-meat, beanless chili, white onions and yellow mustard.", "This is not the place for urban exploring Abandoned buildings, city blocks and even neighborhoods are a major visual side effect of Detroit's economic downturn. It can be tempting to explore these haunting skeletons of the city's vibrant past, but most are now home to vagrants and criminal activity. Not only that, but many aren't structurally sound.", "Get the D Discount Pass This pass, which can be sent directly to your phone or email, allows you to save 20 percent or more on admission to some of the city's top attractions like the Motown Museum and the Charles H. Wright Museum of African American History. Sign up for the pass on the Visit Detroit website.", "Head to campus If you're on a student budget, check out the University of Michigan campus in Ann Arbor for cheap eats and reasonably priced entertainment. Though the university is about 45 miles west of downtown Detroit, many students will tell you that a Zingerman's sandwich is worth the drive. A trip to Ann Arbor is also one of the best Detroit tours.", "Detroit's dining scene is a reflection of both its past and its future. Not only is Motor City the birthplace of the saucy meat-topped Coney dog (locals suggest you head to Lafayette Coney Island to sample the city's best), but it's also home to the largest historic public market district in the United States (Eastern Market). But these stalwart establishments aren't the only things Detroit's food scene has going for it: New restaurants, coffee shops and bars are a major part of the city's overall revitalization. To see what we mean, head to Corktown, the city's oldest surviving neighborhood.", "When it's time for a nightcap, Corktown is home to Detroit's first licensed distillery since Prohibition, Two James Spirits. But downtown's Grand Trunk Pub, housed in a former railway station, is a worthy alternative. If it's just beer you're after, you can quench your thirst in several of the city's breweries, including local favorites Batch Brewing Company, Detroit Beer Co. and Motor City Brewing Works.  ", "Aside from its unusual attractions (which include a carousel and a Ferris wheel), Comerica Park is beloved for the skyline views afforded from its downtown perch."]}