{"name": "Shenandoah National Park", "description": ["Located in northern Virginia, about 75 miles west of Washington, D.C., Shenandoah National Park encompasses more than 200,000 acres and houses populations of white-tailed deer, black bears, salamanders and more. In addition to the scenic Skyline Drive, a 105-mile route running along the crest of the Blue Ridge Mountains, Shenandoah National Park's natural features attract hikers, cyclists, campers, rock climbers, birdwatchers, anglers and more. While stunning views are a given regardless of when you visit, the color of each scenic overlook and potential for adventure changes with the seasons.", "The best times to visit Shenandoah National Park are September through November and March through May, when the park is at its prettiest. Fall welcomes warm shades throughout the park, putting an autumnal twist on Shenandoah's panoramic views. Spring provides kaleidoscopic colors as wildflowers bloom along the park's numerous hiking trails. Crowds are abundant during both these periods, as well as throughout the summer, while winter's cool weather keeps all but the most dedicated hikers from venturing off of Skyline Drive.", "Not all of the hikes are easily accessible A few of the park's popular trails start at its boundaries, including Old Rag Mountain, so be sure to plan your hikes ahead of time.", "Understand the entrance fees Single vehicle entrance passes to Shenandoah cost $30 for a single, private, noncommercial vehicle with a seating capacity of 15 or less. Single motorcycle passes cost $25. Both vehicle passes are valid for seven consecutive days. Individual person entrance passes cost $15 per person, while children 16 and younger are admitted for free. You'll be able to skip potentially long lines by purchasing your pass online and in advance.", "Find a convenient entry point There are four entrance stations within Virginia that visitors can use to access the park. Take a look at the map and choose a station that's closest to your top sights or hikes.", "Go camping While the small towns surrounding the park have limited lodging options, campgrounds abound and are comparatively cheap, starting at $15 per night."]}