{"name": "Cartagena", "description": ["During the Spanish colonial period, Cartagena functioned as a key foothold for the Spanish empire in Colombia and South America. The coastal city's colonial walls (which began construction in 1586) defended against pirates, who were drawn by Cartagena's status as an economic hub. These walls were designated a UNESCO World Heritage site in 1984, and they are now one of Cartagena's most well-known attractions, drawing history enthusiasts from around the world.  ", "The city boasts an astounding number of historical attractions in addition to its famous walls. Travelers can wander the streets taking in the architecture, or opt to spend an air-conditioned day in one of the many museums populating Cartagena. Plus, with the Caribbean Sea to the west and the Cartagena Bay to the south, this South American city provides a number of playas for even the most selective sun-seekers.", "The best time to visit Cartagena is December to April. The city's tropical climate means that, although temperatures tend to stay around the mid-80s year-round, the amount of precipitation each season varies wildly. The dry season, December to April, coincides with Cartagena's summer and is also when the city welcomes the most visitors. Fighting the throngs of tourists turns out to be worthwhile though, as the winter seasons brings near-constant precipitation, accompanied by overbearing humidity, which makes it difficult to take advantage of the outdoors.", "Cartagena features a diverse culture, though visitors will primarily notice the Spanish colonial vibes that permeate the city. Consequently, Spanish is the dominant language of Cartagena; though, as a tourist city, most establishments can recognize the relevant English phrases. That said, travelers are more likely to avoid overpaying for services if they know a few simple Spanish words such as hola (“hello”), por favor (“please”), gracias (“thank you”), cuánto cuesta (“how much is it”) and dónde (“where”).", "Visitors to Cartagena ought to recognize the roles that different meals traditionally play in Colombian culture. Breakfast and dinner are auxiliary meals, with small dishes accompanied by coffee or water. Meanwhile, the majority of a Colombian's calories are typically consumed around lunchtime. While the role of each meal is more of a guideline, travelers have no reason not to subscribe to the country's dietary habit during their visits.  ", "After dinner, music-lovers should plan to spend at least one night out dancing to the sounds of the city. Music plays a particularly significant role in Colombian culture, with an eclectic variety of genres like champeta, cumbia and salsa echoing from the city's bars and clubs.", "Cartagena's street food provides a cost-effective and delicious option for full meals or snacks. Travelers can purchase an assortment of tropical fruit from las palenqueras, or local women selling fruit from the carefully balanced bowls on the tops of their heads. You'll be able to easily spot them thanks to their colorful dresses. Alternatively, Colombians and tourists alike enjoy feasting every morning on arepa de huevo, a deep-fried breakfast dish that consists of cornmeal dough and eggs.", "The city's coastal perch means that fresh seafood is also abundant. Ceviche, a hodge-podge of fresh seafood and vegetables, delights travelers from around the world. La Cevicheria is the most well-known ceviche eatery, in no small part because Anthony Bourdain once visited and praised the restaurant. Other traveler favorites include La Pescaderia Ceviches y Piqueo, Mangata and Porton de San Sebastian.", "A culinary trip to Colombia isn't complete without sancocho, a soup that combines local ingredients like seafood, plantains, yucca, corn and cilantro. Soup isn't the only liquid worth trying though, and a variety of bars, like El Arsenal: The Rum Box and Sinko Bar, wowed recent patrons with their expansive menus of custom cocktails.", "Following the Colombian government's 2016 peace accord with the Revolutionary Armed Forces of Colombia, violent crime in Cartagena has drastically declined. That said, Cartagena is still plagued by many of the same petty crime that you'll find in other major metropolitan areas. Because street crime is the most common threat to tourists, visitors should take common sense precautions: travel with friends, be aware of your valuables at all times, and stay alert for pickpockets and other scams.", "The best way to get around Cartagena is by taxi. Taxis make it easy to get between distinct points in the city, including Cartagena's Rafael Núñez International Airport (CTG), while short jaunts ought to be made on foot. According to area hotels, taxi rides from the airport to the central tourist areas cost about $10. Rental cars are available in Cartagena (an international driving permit is required), but the U.S. State Department advises against driving in Colombia due to lax traffic laws and poor infrastructure.", "For the same reasons, travelers should avoid taking the busses from nearby cities into Cartagena. Instead, visitors should opt to arrive by air, which is the most common means of arrival in the city. Local buses are also available at the airport and stops throughout Cartagena, but public transit can be challenging to navigate and is not recommended for tourists.", "A valid passport is required for entry into Colombia, and tourists from the United States can stay for up to 90 days without a visa. A yellow fever vaccine is required for travelers entering Colombia from Brazil, Angola, Democratic Republic of Congo and Uganda. For more information on entry and exit requirements, visit the U.S. State Department's website."]}