{"name": "Crete", "description": ["If there was one word to describe the Greek island of Crete, it would be \"diverse.\" Sandy beaches hide among soaring mountains, palm tree forests grow in the middle of sprawling plains, bustling modern cities share coastlines with centuries-old structures. And speaking of cities — in Crete, they reflect the people that came before. The streets are lined with architecture mirroring the styles of the Minoans, the Venetians and the Ottomans, as well as contemporary Greeks. Despite the visible contradictions, this island maintains a sense of unity, felt whenever you step onto the street, dine at a local taverna, or enjoy a glass of raki at a sidewalk café.", "Crete's experiences are as assorted as its history, so take some time to decide what type of vacation you're looking to have before you set anything in stone. For an urban setting with a variety of restaurants, bars and nightclubs, consider staying along the northern coast in Chania or Heraklion. Those who prefer the great outdoors should head to Rethymnon or Agios Nikolaos for the many beautiful beaches.", "The best time to visit Crete is from mid-May to June or from September to October. May brings with it warmer waters and beautiful wildflowers that can be spotted throughout the island's natural attractions. If you plan on going during the summer, travel experts strongly suggest to take your vacation in June, as July and August usher in lots of crowds, which may compromise the comfort of visitors who traveled to the island to escape. The heat from the high season cools down in September and October, along with room rates and tourists, making this the best time to visit.", "Plan ahead Crete is larger than its fellow Greek islands, so you could waste a lot of time traveling from site to site. Create an itinerary before you head out to make sure you budget enough time to do and see everything on your list.", "Drive very carefully Aside from the island's main highway, many roads outside of the big cities, especially in the rural areas are underdeveloped or poorly marked.", "Bring a change of clothes It's important to dress appropriately at the religious sites: long pants and skirts, and shirts that cover your shoulders and chest. If you're bouncing between the beach and the sites, pack an extra pair of clothing.", "Bring your own toiletries Shampoo, toothpaste, suntan lotion … all of these things cost more in Crete than they do in the U.S. And as long as they're not in your carry-on, you'll have no trouble getting them from point A to point B.", "Eat like a local When it comes to dining on a dime, you can't go wrong with a taverna. These unpretentious eateries serve up all the Greek favorites for a fraction of the cost of a fine restaurant.", "Determine your route in advance Gas prices tend to be high in Crete. If you're renting a car, avoid excess fuel use by mapping out your route and your itinerary.", "Greeks are known for their hospitality and Crete is regarded as a friendly tourist destination. However, understanding Greek etiquette will help you interact and blend in with the locals.", "Understanding body language is key. Be aware of your gestures; for example, the hand signal for \"OK\" using the thumb and index finger, is offensive in Greece. Greeks indicate \"yes\" (a slight downward nod) or \"no\" (a slight upward nod) differently than Americans.", "Because of Crete's warm climate, shorts and T-shirts are acceptable when walking around the cities or the beaches. However, if you are planning to visit any religious sites, make sure to dress more conservatively in long pants or skirts, and shirts that cover the shoulders and the chest area. You should dress more formally when dining at restaurants as Greeks tend to get dressed up when they go out. ", "Cretan restaurants are used to serving foreigners and generally accept most major credit cards. However, Cretans themselves generally pay in cash (the official currency of Greece is the euro). Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Like residents of many other countries in Europe, Greeks don't tend to tip, so you don't have to either. Service charges are often added to restaurant bills, but if you want to give something extra, a 10 percent tip is sufficient. ", "Don't expect any Caesar salads here — Cretan cuisine bears very little resemblance to Olive Garden. In fact, food on Crete often doesn't even resemble food on mainland Greece. Feta, a Greek staple cheese, isn't produced or popular on Crete. Instead, look for graviera, a hard cheese (similar to Swiss gruyere) aged in caves in the White Mountains. The soft, ricotta-like mizithra is also a Cretan mainstay.", "It's hard to go wrong with a meal at a local taverna. Because of its proximity to the sea, Crete's most traditional dishes contain snails; they may look alien, but eating them will gain you some serious Cretan cred. However, if griddled gastropods don't make your mouth water, don't worry: You will find some less adventurous dishes like souvlaki and rice pilaf. Another quintessentially Cretan dish is dakos, a twice-baked hard bread sprinkled with tomato, cheese, oregano and olive oil. If you're feeling lost when it comes to finding a truly authentic taverna, just ask a resident; Cretans are known for being friendly and helpful to tourists. Travelers suggest the Ferryman Taverna and Lotus Eaters, both located in the northeast town of Elounda, for an excellent dinner experience.", "One final note: You're in Crete. Don't even try to avoid the olive oil. Home to more than 1.5 million olive trees, Crete is famous for producing olive oil and it's a staple ingredient in most dishes. Even desserts contain olive oil: loukoumades, similar to doughnut holes, are deep-fried in the stuff. Wash 'em down with some raki, an alcoholic beverage distilled from leftover wine grapes.", "Crete is renowned for its safety, however, one safety concern of note is for those who decide to rent a car. Aside from the main highway that runs through the main cities in Crete's northern coast, the more rural mountainous areas can be a challenge for drivers, as many of those roads are underdeveloped and, in some cases, lack proper signage. Cretans strongly advise driving very carefully through these areas and asking locals for the best way to navigate. ", "The best way to get around Crete is via car. There are public buses that connect visitors to the major cities of Heraklion, Rethymnon, Chania and Agios Nikolaos. There are also a few lines that transport visitors to southern cities, but since all public bus timetables are subject to seasonal needs, the service may be too sporadic for those on vacation. You can rent a car in any major city as well as at Heraklion International Airport (HER) and Chania International Airport (CHQ). If you plan to do a lot of exploring, keep in mind that the island is larger than it may appear; you can avoid spending excessive amounts of time behind the wheel by planning your itinerary in advance.", "Driving in Crete, however, can be challenging depending on where you are. In the major cities along the northern coast, there are usually road signs in Greek and English. However when visiting more remote areas, especially in the more rural south, travelers are likely to run into unpaved roads lacking signs. Travel experts strongly recommend driving very cautiously among mountain roads and seeking advice from locals beforehand if possible. ", "To enter Greece, your passport must be valid through your stay and for at least three months after. You won't need a visa, however, unless your stay exceeds 90 days. Visit the U.S. Department of State's website for more information on entry and exit requirements."]}