{"name": "Kansas City", "description": ["Kansas City is a friendly place, filled with salt-of-the-earth Midwesterners who smile at strangers as they pass them on the streets. But KC is also cool: The Power & Light District brims with trendy bars and restaurants and equally trendy 20- and 30-somethings. The city's cultural, too, with some surprisingly great museums like the Nelson-Atkins. Plus, the city's history – as a trading post in 1821 and an important stopover on the Oregon Trail in the early 1800s – gives it an interesting narrative. You can view parts of this history at the National World War I and Arabia Steamboat museums. The city's jazz and barbecue are just about unparalleled, but Kansas City has also successfully delved into other types of music and food (more on that in the dining section). And just so you won't be confused, Kansas City straddles both the Show-Me State of Missouri and the Sunflower State of Kansas. If you're a tourist, you'll probably be spending most of your time on the Missouri side since that's where most of the city's top attractions can be found.", "Kansas City is home to some tasty cuisine, including its signature barbecue. In Kansas City, expect everything and anything to be barbecued: basically, no meat is off-limits (chicken, pork, ribs, beef brisket, ham, turkey, sausage and so on). Typically, the meat gets a spice rub treatment and then is slow-roasted over aromatic wood like hickory. Sauces vary by establishment but are usually thick, sweet, spicy and tangy all at the same time. Kansas City natives and travelers say some of the best spots to go are Danny Edwards Boulevard BBQ, Arthur Bryant's Barbeque, Jack Stack Barbecue and Char Bar.", "Once you tire of finger lickin' good barbecue, head to one of KC's casual eateries or upscale dining options. The Farmhouse and Providence New American Kitchen receive praise for their affordable prices and farm-to-table fare while Novel and Bluestem restaurants earn rounds of applause for their decadent multicourse prix-fixe meals.", "And don't forget about beverages. Kansas City boasts a growing craft beer scene and its hometown brewery, Boulevard Brewing Company, is one of the top brewpub operations in the Midwest. Locals say you should sample the \"Thundercloud\" – its version of a black and tan with the brewery's dry stout and wheat beers. Julep Cocktail Club, Ca Va and Green Lady Lounge are also lauded for their drink options and sophisticated atmospheres, plus Green Lady is a jazz bar with live performances nightly. "]}