{"name": "Joshua Tree National Park", "description": ["Joshua Tree National Park, established as a national monument in 1936 and then later as a national park in 1994, sprawls across approximately 800,000 acres. Joshua Tree is a deserted wilderness, with few facilities or services, however, those very reasons draw nearly 3 million yearly visitors. Located just outside Palm Springs, California, and about 140 miles east of Los Angeles, the desert park is actually made up of two distinct desert ecosystems, the Mojave and the Colorado.", "The stark and sometimes surreal landscape, shaped by fierce winds and rains, is famous for its Joshua trees. Still, a wide variety of other plants and animals call the park home, including bighorn sheep, coyotes and jack rabbits. Joshua Tree is also a magnet for rock climbers, as there are more than 8,000 established climbing routes scattered throughout the park. In the springtime, large swaths of wildflowers become a big draw for many visitors. Plus, the incredibly clear night sky, unpolluted by artificial lights, make the park a great place to stargaze.", "The best time to visit Joshua Tree National Park is March to May and October to November. Though the park is open year-round, temperatures are most comfortable in the spring and fall, with an average high of about 85 degrees. It's worth noting that temperatures vary depending on where you are in the park. Daytime winter temperatures hover around 60 degrees, while nighttime temps dip to 30 degrees. What's more, it occasionally snows at higher elevations. Summers can be sweltering, with temperatures reaching more than 100 degrees during the day and around 75 degrees at night.", "Bring water There is no water available in the park (though you can purchase some in the visitor centers). Bring at least one gallon per person, per day, especially if you will be hiking or climbing in the park.", "Wear sunscreen and protective clothing There is little to no shade in most places. Bring sunscreen, sunglasses, protective clothing, a wide-brimmed hat and think about bringing a parasol, too.", "Pack a map Cellphone service is often spotty or nonexistent in the park, so be sure to pick up a free map at a visitor center or download a map to your smartphone before starting your adventure.", "Camp out A campsite will cost you far less than a stay in a nearby motel or inn. Most of the eight campgrounds are first-come, first-served, except for peak season, which runs September through May. Some campsites close in the summer.", "Pack a picnic Stop by a grocery store in Joshua Tree, Twentynine Palms or other nearby communities and pack your lunch before your visit. You can enjoy it at several scenic picnic areas throughout the park.", "Split the fee If you share your ride with friends, you can split the $30 entrance fee, which grants the driver and its passengers admittance to the park for seven days.", "There are no restaurants or grocery stores inside Joshua Tree National Park, though you can pick up a few snacks at the visitor centers. Joshua Tree has eight picnic areas, where you can enjoy food you pack in yourself. Nearby communities, such as Joshua Tree and Twentynine Palms, offer shops and restaurants where you can dine.", "The Joshua Tree Saloon, a sprawling complex near the park’s West Entrance, is a popular stop for many visitors. It features indoor and outdoor seating and serves breakfast, lunch and dinner year-round, plus offers live music. The Jelly Donut, located in Yucca Valley near the North Entrance, is another favorite with many locals and visitors craving something sweet. Pie for the People is a great spot to get pizza and conveniently sits near the park's West Entrance in the town of Joshua Tree.", "Above all, make sure you have plenty of water and be conscious of the heat. If you are planning a long hike, especially in summer, an early start is a good idea. Leave the trail before temperatures become too excessive. The park recommends bringing at least one gallon of water per day, per person. Protect your skin with big shade hats, loose-fitting clothes and ample sunscreen. The park asks you to leave pets at home and off the trails for both their safety and the safety of wildlife. For more safety tips, visit the National Park Service's website.", "The best way to get around Joshua Tree National Park is by car. To reach Joshua Tree, most visitors fly into Palm Springs International Airport (PSP), which is about 50 miles east, or via Los Angeles International Airport (LAX), which is about 150 miles east. You can easily rent a car at either airport. There are spots where you can park and hike, but most visitors do not enter the park on foot."]}