{"name": "Ottawa", "description": ["Located in southeast Ontario near the Québec  border, Ottawa may seem an unlikely choice for Canada's capital when compared to larger cities like Toronto and Montreal. But that doesn't mean it should be ignored. Visit for yourself, and you'll see this city doesn't fall short. It's small yet lively, family-friendly yet nightlife-ready, somewhat chilly yet undeniably cool.", "Ottawa is a political and cultural hub that particularly caters to the out-of-towner. Its downtown overflows with jaw-dropping architecture, state-of-the-art museums, funky boutiques and fantastic snack joints that are all easy for you to explore on foot. Plus, this is a city that loves to celebrate, hosting dozens of festivals throughout the year. And while cold weather may seem like a deterrent, a few hours ice skating (or sipping hot chocolate) along the Rideau Canal will transform even the most stubborn summer-lover into a winter buff.", "The best time to visit Ottawa is between March and May, when temperatures begin to rise and the city starts to bloom. This is also when some of the capital's favorite special events – including the beloved Tulip Festival – take place. Thanks to its characteristically warm weather, summer is the most popular time for a visit, but it's also the most expensive, with average room rates costing as much as $140 per night. For those of you itching to find a bargain, consider a winter trip; although temperatures often drop below freezing, you can keep your blood pumping by practicing your figure skating or hockey moves on the Rideau Canal.", "As with other cities in Canada, Ottawa's culture is influenced by its mother country – England – and its aboriginal heritage. Whether you're sipping afternoon tea, watching the daily Changing of the Guard ceremony at Parliament Hill or embarking on an indigenous walking tour, you'll have multiple opportunities to experience the province's culture. To get a better understanding of how the country's earliest settlers shaped its present-day identity, start your tour of Ottawa at the Canadian Museum of History.", "Americans shouldn't have any trouble navigating Canada's capital. English and French are the country's two official languages, but most Ottawa residents speak English. If you venture across the Ottawa River to Gatineau (which is located in the French-speaking province of Quebec), you may want to come prepared with a few French phrases, such as \"bonjour\" (\"hello\"), \"s'il vous plaît\" (\"please\") and \"merci\" (\"thank you\").", "Ottawa's official currency is the Canadian dollar, which is roughly equivalent to the U.S. dollar (you should still plan to check what the current exchange rate is before you go). To avoid confusion when purchasing goods, familiarize yourself with Canadian currency. Coins are in denominations of $2, $1, $0.50, $0.25, $0.10 and $0.05. Canadian dollar coins are called \"loonies;\" $2 coins are called \"toonies.\" Paper bills are in denominations of $100, $50, $20, $10 and $5. Weight is measured in metric units; distance is measured in kilometers – pay close attention to this if you've decided to rent a car.", "Much like the U.S. capital, Ottawa boasts a diverse and top-notch dining scene that caters to everyone from policy-making politicos to camera-wielding tourists. Since it's located across the Ottawa River from the French-speaking province of Quebec, it should come as no surprise that French food plays a starring role in the city's restaurant culture. In fact, Ottawa is home to the only Canadian campus of Le Cordon Bleu, an international culinary school. The campus is also home to a fine dining eatery, Signatures Restaurant, which is housed in a Tudor Revival-style mansion. If you want to sample French cuisine without paying a hefty price tag, consider making a lunch reservation here, when three-course meals are offered for CA$34 (around $26) per person.", "Not one for French cuisine? How about Canadian instead? Several restaurants around the city offer Canadian or (\"New Canadian\") menus, including the award-winning Atelier, which serves a 12-course tasting menu every night. Though 12 courses may seem a bit intimidating, recent visitors raved about the interesting and creative dishes plated here. If you're looking for something a bit more approachable, consider Play Food & Wine, a small plates eatery that's lauded for its food and wine pairings and excellent service. Another small plates restaurant that's popular with locals and visitors: town. Visitors say this Italian-inspired outpost is a hit thanks to its convenient downtown location and its flavorful dishes. And when you're ready to sample some of the city's seafood, head to the Whalesbone Oyster House for (what else?) oysters. Though recent visitors do note that the restaurant is small and can be noisy, they can't deny the quality of the seafood.", "Finally, to gain a more comprehensive understanding of the city's food culture, you must take a spin through ByWard Market, one of the country's oldest and largest public markets. And for an equally wide-ranging sample of Ottawa's beer scene, head to CRAFT Beer Market.", "The best way to get around Ottawa is on foot. The city's vibrant downtown area is extremely condensed, and excellent signage makes it easy to navigate. If you do get tired of walking, the Ottawa-Carleton Regional Transit Commission (OC Transpo) operates numerous bus routes (all of which originate from the Rideau Centre) through downtown and into the more residential areas. To get to the downtown area from the Ottawa MacDonald-Cartier International Airport (YOW), you can take the No. 97 bus for CA$3.65 (roughly $2.80). Taxis are also available, but expect to pay upward of CA$30 (about $23).", "A valid travel document (preferably a passport) is required for citizens of the United States traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. If you are planning to drive, you can also use a NEXUS card, which allows for expedited border crossings for both private and commercial travelers through Canadian and U.S. border controls. For more information, visit the U.S. State Department website."]}