{"name": "Curacao", "description": ["The \"C\" in the ABC islands, Curaçao features historic settlements, rugged landscapes and plenty of fun in the sun. (Aruba and Bonaire are the other islands constituting the westernmost islands of the Leeward Antilles). Curaçao's main port city, Willemstad, is what an old-world European city would look like if it had been dropped it in the Caribbean. The brightly painted Dutch colonial buildings reflect pinks, yellows and blues into the cerulean St. Anna Bay. Once you leave the city, the landscape shifts to a desert scene, with spiny aloe and mesquite sprouting from atop weathered limestone cliffs.", "But Curaçao's real draw is the beach. Picture-perfect bays and coves flank the island, their turquoise waters lapping gently against powdery white sand. Curaçao's reefs teem with marine life, providing excellent underwater playgrounds for scuba divers and snorkelers. Best of all, the semiarid island is sheltered from the worst of the Atlantic's hurricane season. Gentle trade winds keep temperatures in the mid-80s, so you can enjoy the outdoors year-round.", "The best time to visit Curaçao is from December to April, when the island experiences the best weather. However, if you're hoping to plan a budget-friendly trip, the best time to visit Curaçao is from May to November, which constitutes the island's off-peak season. During these months, you'll find the lowest airfares and hotel rates, with rooms often priced up to 50% lower than they are in the high season (especially during summer). Plus, you won't be vying for beach chairs with throngs of other vacationers. What's more, Curaçao doesn't suffer the wrath of hurricane season. Curaçao's weather tends to be sunny even throughout the months that other Caribbean islands experience torrential rains. Only 12 degrees north of the equator, Curaçao's average temperature rests in the mid-80s all year. Most vacationers head to Curaçao between December and April, causing hotel rates and airfare to skyrocket. If you've come to dive or snorkel, you'll enjoy good visibility throughout the year. Because the island is located outside the hurricane belt, its marine life is mostly unaffected by seasonal changes.", "No hurricanes here! Located outside of the hurricane belt, Curaçao remains warm and sunny all year – but keep an eye on the weather, just in case the odd storm may pass.", "Look, don't touch Curaçao's coral reefs are gorgeous, but they are also extremely delicate. One slight graze from a human hand can have detrimental effects – plus, coral's surface can be sharper than it looks.", "Limit your taxi rides For short trips around Willemstad, taxis, bikes or Segways are a convenient option, but for longer journeys it makes more economic sense to rent a car as the cab fares are expensive.", "Stick to local eateries Touristy restaurants in Willemstad tend to cater to travelers with large budgets. Peruse the places where locals eat, including the amazing canteen-style markets serving local cuisine, and dine at a fraction of the price.", "Because of Curaçao's role in the slave trade, many of today's Curaçaoans identify deeply with their African heritage, as evidenced in their language and cuisine. Remnants of Dutch colonization are plainly visible as well, especially in the architecture in Willemstad and the countryside's Dutch plantation houses. Whether their ancestors came from Africa, the Netherlands or both, most of Curaçao's population speak Papiamentu, a Creole language derived from Portuguese, English, Spanish, Dutch, French as well as African and Indian dialects. English and Dutch is widely spoken throughout the island, and so is Spanish, but throwing a bon dia (\"good day\") or a danki (\"thank you\") into your daily interactions won't hurt.", "A large portion of Curaçao's population is Roman Catholic, and holidays are taken very seriously. Carnival, in particular, is huge here, lasting for more than a month. If you're visiting in January or February, be prepared for colorful masquerades and loud processions through the streets. The predominance of Catholicism also means that most businesses on the island are closed on Sundays.", "The Netherlands Antilles guilder (ANG) – also called the Florin – is the official currency of Curaçao. One guilder equals roughly $0.56, but U.S. dollars are widely accepted throughout the island. What's more, many ATMs dispense American tender. Dollars or guilders, most taxi drivers and waiters expect a 10% tip, but make sure to check your restaurant bill first – if you notice a 10% \"service charge,\" then you don't need to leave additional gratuity, although a few extra dollars are always appreciated.", "Crime is not a big issue in Curaçao, but you should still keep an eye on your belongings. Look after your valuables on the beach, always lock your car, and stay alert for pickpockets in urban and touristy areas.", "The best way to get around Curaçao is by car. Some of Curaçao's hotels offer area shuttles, and the public buses cover the majority of the island, but service is infrequent, especially outside of Willemstad. If you want to explore the island on your own time, then you'll want your own set of wheels. Taxis are available from Curaçao's major airport, Curaçao International Airport (CUR), about 8 miles northwest of Willemstad. However, cabs can be expensive, especially if you are planning to use them frequently.", "Check with your hotel to see if it offers an airport shuttle service. Otherwise, expect to pay at least $30 for a one-way taxi ride from the airport to Willemstad. Major airlines, such as American Airlines, JetBlue and United, service the Curaçao airport.", "You will need to present a valid passport to enter and leave Curaçao, and you may be asked to show your return ticket and proof of sufficient funds, as well as proof of lodging. Upon departure to the U.S., you will be required to pay an airport departure fee of $65.74. If you are continuing on to Aruba or St. Martin, you will be charged $40.74 or $22.74 if you're going to Bonaire. Some airlines, however, include these fees in the ticket price. You'll also be asked to complete an Embarkation and Disembarkation Card (ED-Card), which will most likely be handed out on the plane ride to Curaçao. For more information, visit the U.S. State Department's website.", "Although your main priority when traveling to the Caribbean may be lounging at the beach all day, don't overlook Willemstad, Curaçao's colorful capital. "]}