{"name": "Hawaii - The Big Island", "description": ["Geographically unique, the island of Hawai'i (or the Big Island, as it's more commonly known) boasts everything from black sand beaches to snow-covered peaks, from hardened lava deserts to steamy and lush rainforests. And it's still growing. Hawai'i's trump card – the active, fire-spitting Kilauea volcano – has been increasing the island's land mass since 1983. During the most recent eruption in May 2018, volcanic activity caused eruptions, earthquakes and the collapse of the Halemaumau crater. It's true that if you arrived here hoping for a stereotypical Hawaiian getaway that's full of luaus and a honeymoon-esque atmosphere, you've probably missed the mark. But the hiking trails and state parks that are here hold sights that no other Hawaiian Island can boast of. And the beaches are colors you've probably never seen. If you've only got a short amount of time to explore the island, sign up for one of the best Hawaii tours to take advantage of the expertise of an in-the-know local.", "The best time to visit Hawaii's Big Island is between September and November. That's when the island's generally reasonable room rates take the most significant plunge. Temperatures remain constant throughout the year – generally in the high 70s or low 80s – so you might want to avoid the priciest season, from December to March, unless you like to surf. Regardless of when you plan to go, take some time to review a few travel insurance policies, which range from travel medical insurance (ideal if you plan to trek through Volcanoes National Park) to COVID-19 travel insurance – useful in the event you and/or a travel companion gets sick.", "You will need a camera We did mention the flowing lava and the black sand beaches, right? Well, your best bet for seeing the former is at night, though you should call the Hawai'i Volcanoes National Park's visitor center to check on Kilauea before you head out.", "You will need a sweater Those snow-capped mountains aren't an optical illusion. The higher elevations of the Big Island make it cooler on this island than others in the chain.", "You will need all-wheel drive If you're driving (and we recommend that you do), you'll soon learn that the island's varied terrain is easier to cover in a sturdier car.", "Stay in Hilo You won't be near the west side beaches that tourists love so much, but there are a terrific selection of bed-and-breakfasts in this area. And you can load up on affordable souvenirs, snacks and more at the weekly Hilo Farmers Market. Plus, you'll be closer to Hawai'i Volcanoes National Park.", "Plan a fall trip Tourism slows on Hawaii's Big Island in October and November. It's only a small window, but you could find a great package deal on some of the four-star hotels around this time.", "Expect to encounter plenty of Hawaiian fusion restaurants in the hotel areas, serving shredded pork, poi (Hawaiian dessert) and other regional favorites. Those in the tourist industry expect vacationers to want what they perceive as authentic Hawaiian cuisine, and the restaurants are more than willing to provide. Fresh seafood is also a staple in many restaurants, as is locally grown produce. Kona coffee is also something you'll want to try in Big Island and perhaps take home a bag or two. To taste test at the source, head to Kona Coffee Living History Museum, Hula Daddy Kona Coffee or Mountain Thunder Coffee Plantation. Of course, you can also try a cup of Kona at Big Island coffee shops and breakfast joints. ", "You'll find the best eateries are the establishments on the Kohala coast, near Kona, but you should be prepared to pay the special \"tourist\" price. ULU Ocean Grill at the Four Seasons Resort Hualalai earns high praise for its delectable menu and ocean views, but it'll cost you. There are cheaper spots in Kona, such as 808 Grindz Café, but for more reasonable prices, head to Hilo establishments like Hilo Bay Café, which earns high marks from travelers for its sushi, and local favorites like Paul's Place and Pineapples. For cheaper eats, try Puka Puka Kitchen.", "Crime is rare on the Big Island. Your primary concern should be water safety. While the water temperature is almost always agreeable, winter surf can get very rough, especially along the north shore and on the beaches in the west coast. Strong currents have caused drownings in the past, so swim with caution and never enter the water alone or without the supervision of a lifeguard. If you plan to hike or walk along the coastline, be sure to wear sneakers or protective footwear so that your feet aren't exposed to sharp rocks. You should also wear sunscreen, especially at higher altitudes.", "The best way to get around Hawaii's Big Island is by car. The island is simply too large to affordably and conveniently navigate without one. You can pick up a rental car at either the Kona International Airport (KOA) or the Hilo International Airport (ITO), or if you want to let go of some serious cash, you could take a taxi from the terminal to your hotel. Once near your lodging, you might be able to get around town on the island bus system, just keep in mind that its schedule is not always convenient for tourists. ", "Many travelers who visit the Big Island have a connecting flight from O'ahu's Honolulu International Airport (HNL), from which you'll fly into Hilo airport on the eastern side. Kona airport near the west side will probably be more convenient if you're staying by the Kona or Kohala coast."]}