{"name": "Malibu", "description": ["From sunrise surfs to spectacular sunsets, the coastal haven of Malibu, California, is a beach lovers’ playground, where visitors from around the world flock to embed themselves in scenes made famous by films, television shows, magazines and music videos. And while the dazzling beach has the starring role, outdoor enthusiasts and nature buffs will fall for the area’s hiking trails and wildlife, while food and wine connoisseurs will love the oceanside restaurants and wine tours. Adamson House and The Getty Villa are also a must for those into art, architecture or history.", "Situated west of Santa Monica and east of Ventura, Malibu was originally the site of Chumash Indian settlements, before Spanish settlers moved in. In 1892, the land was reportedly purchased for $10 per acre by Boston heir Frederick K. Rindge, whose visions of a buzzing Mediterranean-inspired destination were brought to life by his wife May following his death. When faced with financial struggles, she began renting out beachfront lots to film stars, cementing the area as the celebrity hub it remains today.", "The best time to visit Malibu is around August and September if you want to make the most of warm temperatures, ocean swimming, a lively vibe and longer daylight hours. However, there are perks to a spring or early fall visit as well. If you don’t love the heat or want to save money on hotels by visiting off-peak, consider planning a trip between October and March.", "Malibu doesn't host many big annual events, but it does have its fair share of smaller community events that are particularly family-friendly. Most take place at Malibu Bluffs Park; check the online calendar before your visit to see if any coincide with your trip.", "Bring a sweater Don’t be fooled by balmy imagery – even during peak summer, Malibu can become chilly once the sun goes down, so if you plan to stick around for the evening, bring a warm sweater. During the day, the ocean breeze can also make the area noticeably cooler than inland Los Angeles.", "Check on closures Due to seasonal impact and weather damage, roads and trails may sometimes close, especially in the mountains. If there’s a specific trail or vantage point you want to visit, check for alerts before you go.", "Getting around Malibu is vastly spread out, so driving is the best way to get around. However, if you don’t have a rental car and want to catch some walkable highlights, start at Malibu Pier, which is within walking distance of Adamson House, Surfrider Beach, Nobu Malibu and Malibu Country Mart.", "Pack a picnic Stop by a grocery store and buy food to enjoy a picnic on the beach rather than eat out since many of the restaurants along the coast can be pricey. There are also eateries at Malibu Country Mart to grab takeout from.", "Rent a car If you plan to hike or explore multiple beaches, then cabs and rideshares will add up as many Malibu activities are spread along the coast and mountains. Plus, cruising down Pacific Coast Highway while trying to keep one eye on the road and one on captivating ocean views is all part of the Malibu fun! Alternatively, take public transport to Santa Monica, then catch the No. 134 bus, which heads along Pacific Coast Highway and stops near popular beaches and attractions.", "Stick to free activities The great thing about Malibu is the abundance of fun activities that won’t cost a cent. Most state parks and beaches are free, apart from parking fees, as is the Getty Villa Museum. The Passport Parking app offers parking discounts at some locations.", "Look for happy hours Take advantage of happy hour discounts to save some coin at popular spots like the Sunset Restaurant at Zuma Beach or Marmalade Café at Malibu Country Mart. Duke’s Malibu also has daily specials."]}