{"name": "Singapore", "description": ["Immaculate, efficient Singapore is a miraculous sight, particularly for travelers familiar with modern Asian metropolises. The city maintains a remarkable balance of green space and skyscrapers, in addition to sustaining substantial ethnic enclaves like Little India and Chinatown. This motley group of cultures has brought to this former British colony something special – a common mindset. Singaporeans are determined and patriotic; they are proud of what they have achieved (just look at Marina Bay and you might get jealous).", "But while their skyline accumulates monumental peaks and troughs, Singaporeans have not forgotten about their past or the importance of their natural surroundings. Museums stand tall and welcome amateur historians to explore their vast interiors. Plus, on an island (also named \"Singapore\"), large wetland preserves quietly rest in stark contrast to Singapore's modern achievements. This tiny nation with its massive city embodies a cosmopolitan aggregation in a manner that few others can. So leave your chewing gum at home (as it's illegal to import or sell), and hop on a flight to the pristine Singapore.", "The best time to visit Singapore is anytime. The island nation experiences a warm, tropical climate year-round with daily highs in the 80s. And with a steady stream of business travelers, the city's hotels are seldom at a loss for occupants and maintain reasonable to high room rates. To avoid exorbitant prices, steer clear of popular events or national holidays like Chinese New Year. But keep in mind, rain is likely year-round.", "Diversity is Singapore's crowning jewel. Not only are 40 percent of Singapore residents born abroad, but the city-state is considered to be the most religiously diverse country in the world. When exploring Singapore, it's not uncommon to find Chinese and Hindu temples as well as churches and mosques in one neighborhood. In some instances, these houses of worship share the same street. Various cultural holidays, events and festivals are held and widely celebrated for different ethnic groups throughout the year. Chinese New Year and Thaipusam, a Hindu Festival, are popular, as well as Vesak Day, a Buddhist holiday. It's important to note that people of Malay, Indian or Indonesian descent associate the left hand with the bathroom, so try to greet, wave or eat with your right hand while visiting. Also refrain from touching people's heads in social situations, as some cultures consider that area to be sacred. ", "Despite its strong Asian ties, English is very much a part of the culture in Singapore. The country used to be a British colony, and although the Brits are long gone, English remains a spoken language. Along with Tamil, Malay and Chinese, English is the national language. And although the national language title is shared, English is considered to be the country's \"working language,\" so the likelihood of running into residents who don't know any English is slim. Typical Singaporeans know two languages: English and the language of their ancestors.", "Singapore is the kind of destination where you should really study up on what's illegal before you go. The simplest of everyday occurrences in other modern societies around the world could land you in jail here. Although the country happily houses people with diverse cultural backgrounds, Singapore lawfully requires order and cleanliness from all its citizens. The country enforces strict measures against practices such as jaywalking, smoking in public places, littering and eating in the MRT. And believe it or not, selling or importing gum and not flushing the toilet are illegal, too. If you are caught doing any one of those things, you may get stuck with a hefty fine or even face arrest.", "The official currency is the Singapore dollar (SGD), which is almost equivalent to three-fourths of a U.S. dollar. This rough conversion rate will help you quickly estimate the price. Another monetary query that Americans encounter is tipping; however, it shouldn't be: Tipping is not a customary practice in Singapore. This is in part to an automatic 10-percent service charge at most hotels and restaurants. ", "Singapore's cultural melting pot creates quite an eclectic dining scene. Considering that the majority of ethnicities that comprise Singapore's cultural identity are Asian, expect to find a smorgasbord of delectable Chinese, Indian and Malay dishes during your stay. Seek out Chinatown and Little India for Chinese and Indian cuisine of course, but no trip to Singapore is complete without a visit to a hawker center for cheap and delicious street-style eats.", "The best known hawker enclave is the Maxwell Food Centre, which is packed with more than 100 stalls. Although the options are endless, consider seeking out Tian Tian Hainanese Chicken Rice, Jin Hua's Cantonese-style fish bee hoon soup and Maxwell Fuzhou's oyster cakes. Chicken rice is one of the country's signature dishes. Tian Tian's version is recommended with lots of chili and soy sauce. To take it up a notch, hit up the Tiong Bahru Market specifically for breakfast. The market's most popular dishes, including Jian Bo Shui Kweh's chwee kueh (steamed rice cakes with preservatives), Hui Ji's fishbowl noodles and Yong Tau Foo's pau (steamed buns with barbecued pork), are often consumed as early morning meals among locals. For Malay specialties, hit up Satay by the Bay, an open-air food center which serves up Malay-style grilled, skewered meats.", "Singapore's proximity to the ocean is definitely apparent in its local dishes. Chili crab features locally-caught crab soaking in a tangy sauce made up of tomatoes, chili paste and beaten eggs. There is also fish head curry, which, despite incorporating native Indian ingredients and Chinese delicacies, is a dish native to Singapore. Though beloved by locals, those who consider themselves squeamish might want to skip this dish. Hokkien hae mee, or Fujian prawn noodles, are a less adventurous alternative as is the rich Laksa, a noodle soup made with dried shrimp and topped with prawns, fishcake and cockles. For dessert, finish off your hearty meal with some sweet kaya toast (bread spread with traditional jam made from coconut and eggs).", "The best way to get around Singapore is via its Mass Rapid Transit (MRT) subway system. This underground network has lines that stretch across the entire city. However, once you're in the desired neighborhood, walking is your best option. MRT also operates bus routes that can get you just about anywhere on the island. We recommend avoiding car rental, as parking is expensive and traffic can be painful. If you wish to be in a car, take a taxi. Most travelers arrive through Singapore Changi Airport (SIN), which is connected to the city by the MRT system.", "Singapore requires that your U.S. passport be valid for at least six months from when you enter the country. You do not need to obtain a visa to visit Singapore, however, if you plan on staying 90 days or longer, you must apply for one. Also, in addition to the standard banned items, you're not allowed to bring in pornographic materials, CDs, DVDs, software or even certain religious materials. For more information, check out the U.S. State Department's website.", "This Asian metropolis stands out in more ways than one. Not only is Singapore one of the few city-states in the world, but its diversity, both in population and landscape, is renowned."]}