{"name": "Whistler", "description": ["Snow-capped peaks and powdered steeps; sparkling lakes and gushing waterfalls; challenging hiking trails and inviting restaurants – Whistler's offerings suit every season. However, its most popular attraction remains Whistler Blackcomb, and why wouldn't it? The massive resort spans more than 8,100 acres of land, sees nearly 40 feet of snowfall annually and boasts some of the most active après-ski spots in North America. The entire town, which sits about 75 miles north of Vancouver, embodies the ski-chic atmosphere, hosting dozens of ski and snowboard competitions and festivals annually. Whistler continues to buzz through the warmer months, when more outdoor enthusiasts come out to play. Visitors can try bobsledding, or hiking and biking up the mountains. And those who come to town looking for photo-ops will find plenty. The Coast Mountains offer a picture-perfect setting: You'll find the best views on a ride on the PEAK 2 PEAK Gondola, which spans Whistler and Blackcomb mountains.", "While Whistler is an ideal vacation spot for the active types, more mellow travelers will enjoy the area's museums and art galleries that are filled with informative exhibits. Plus, the town boasts family-friendly activities and attractions like ice skating, summer concerts and the Whistler Sliding Centre, along with plenty of shopping options and a deluge of dining venues. With pristine ski spots and plenty of outdoor pursuits, you'll see why so many just want to grab their gear and get to Whistler.", "The best times to visit Whistler are from June through August and between December and March. The mountains see peak skiing conditions from December to February, and March brings warmer temperatures but still offers quality snow. In June and July, Blackcomb Mountain reopens for glacier skiing while the rest of Whistler acts as a home base for camping and exploring the great outdoors. Meanwhile, September, October and November are a prime time for leaf-peeping. April and May bring moderate temperatures, making these months ideal for outdoorsy activities like hiking and biking.", "Drive slow for snow Whistler receives feet of snow each year. If you're driving in the winter, slow down and make sure to rent or come with a reliable SUV.", "Experts only Backcountry trails are prone to avalanches, so only advanced skiers should take to this off-the-map terrain. Check Whistler Blackcomb's website for avalanche advisories.", "Walk If you plan to do a lot of skiing or hiking, you won't need to rent a car to get around since everything you'll want to do is within walking or shuttle distance of Whistler Village.", "Spring for spring Springtime brings fewer crowds than wintertime, but that doesn't mean there are fewer things to do. Whistler Blackcomb stays open for skiing through late April. Plus, there are plenty of trails for hiking and biking.", "You'll find Whistler to be similar to many other North American ski towns, embracing an outdoorsy spirit. Hordes of visitors descend on the mountains annually to take advantage of prime skiing conditions and hiking and bike trails. Whistlerites speak English and dress casually – in the winter, expect to see plenty of people walking around in ski and snowboard gear.", "Whistler also has ties to the First Nations (the native people of Canada). The Squamish and Lil'wat tribes settled here thousands of years ago because of the area's rich wildlife and resources, making it an ideal home base for trading. You can learn more about the customs and heritage of the two groups at the Squamish Lil'wat Cultural Centre.", "The currency used in Whistler is the Canadian dollar (which equals roughly $0.78), but the U.S. dollar is also widely accepted throughout the resort area. All major credit cards are accepted as well. Tipping policies are similar with those in the U.S.: typically around 15 to 20 percent at bars and restaurants and for taxi services and ski lessons. But unlike the U.S., Canada follows the metric system, so you'll see distances in kilometers, liquid units (like gasoline) in liters and temperatures in Celsius.", "Dining in Whistler is all about the après-ski experience – grab some friends and head to the bars and restaurants near Whistler Blackcomb to enjoy brews and pub food. At many of the venues, you'll have the option of outdoor seating to admire the mountains or indoor seating to cozy up to a fireplace with a cup of hot cocoa. Basalt Wine & Salumeria and 21 Steps Kitchen + Bar are two spots in Whistler Village that recent visitors said they enjoyed. Many of the restaurants feature local ingredients like fresh game and hand-picked vegetables on their menus, and some showcase local bands with live music. If you're in the mood for something a bit more sophisticated and are willing to go for a drive, the Red Door Bistro and the Rimrock Cafe (which are less than 3 miles southwest of Whistler Village) receive glowing reviews for their ambiance and meat and seafood dishes. But remember, several restaurants close every October and November, so call ahead if you plan on visiting in autumn.", "The best ways to get around Whistler are on foot or by bike. Depending on what you want to see and where you stay, you should be able to get from point A to point B just by walking or biking. Or, you can take the complimentary shuttle buses from Whistler Village, which transport visitors to Lost Lake Park and the Marketplace in town. BC Transit – Whistler's small public transit system – also operates six fee-based lines, but only a few of the routes will be convenient for tourists. Meanwhile, having a car will allow you the freedom to explore top attractions a little farther from the heart of Whistler (like Whistler Train Wreck and Alexander Falls) without having to spend a lot of cash on a cab, but parking can be tricky and sometimes expensive.", "Travelers usually fly into Vancouver International Airport (YVR), which is about 85 miles south of Whistler, as it's the closest option to town. From there, you can rent a car, hop on a bus or catch a Rocky Mountaineer train to Whistler.", "Americans visiting Canada do not need a visa for trips lasting less than 180 days. However, they are required to provide proof of citizenship and proof of identity, which can be a U.S. passport, passport card or NEXUS card. Children younger than 16 only need to present proof of U.S. citizenship. To learn more about entry and exit requirements, visit the U.S. State Department's website."]}