{"name": "St. Martin - St. Maarten", "description": ["If you associate the Caribbean with a laid-back atmosphere, a tranquil beach and a quiet sunset, then you haven't been to feisty St. Martin and St. Maarten. What's the best part of visiting this dual-governed island? You can get a taste of two distinct, lively cultures all for the price of one vacation. Like much of the Caribbean, the island was hit hard by Hurricane Irma in 2017. Make sure you call or check the websites of any businesses you plan to visit in advance to check on their status. The 37-square-mile dot is popular with travelers who like to eat well, party hard and shop duty-free in between trips to the beach. The north side, St. Martin, is controlled by the French government. It's the home of the island's tastiest restaurants and party beaches. Whereas cosmopolitan St. Maarten shelters the most animated casinos, bars and clubs. A territory of the Netherlands Antilles, St. Maarten takes up the southern 16 square miles.", "But for all the excitement, St. Martin and St. Maarten still foster a stress-free vibe – starting out with how easily you can pass between both sides of the island. So catch a few morning rays on a quiet Dutch-side beach; later, take a leisurely afternoon stroll through a French-side mountain. You'll be more than primed to sneak back over the border for a night in the casinos.", "The best time to visit St. Martin and St. Maarten is May and June or between November and mid-December. These select weeks are times when hotels advertise their best rates. The island's weather is pleasant year-round, but these are times when rain showers are less likely. Summer and early fall are not good for a vacation; many hotels close in this offseason and there's a chance of hurricanes. Also avoid visiting in winter and early spring (mid-December to April) if you can. That's when St. Martin and St. Maarten milks its wealthy vacationers.", "The official language In St. Martin it's French. Meanwhile, St. Maarten's official language is both Dutch and English. Confused yet? Don't worry – English is widely spoken throughout.", "How to say \"watch out\" in Dutch You should definitely go to Maho Bay to see a few 747s land at the neighboring Princess Juliana International Airport. But uitkijken! This can be a scary, noisy and windy experience.", "How to say \"Live and Let Live\" in French St. Martin's beaches are well-known for their vivre et laisser vivre philosophy on swimsuits (in other words, expect to see a lot of bare chests and bottoms).", "Don't tip extra You'll see some restaurants have put an extra 15-percent \"tax\" on the bill that the wait staff might neglect to tell you is their service charge. Don't tip extra unless your service was really exceptional.", "Email, don't phone Making a call from the French side to the Dutch side, and vice versa, is considered an international call. Some businesses will have two numbers (to help you avoid this particular nuisance), but if not, attempt to make restaurant reservations and book island tours by email.", "Take the bus Things move at a more leisurely pace in the Caribbean, so take advantage of that by taking the bus to the top tourist sites. There's no set schedule for drop-off and pick-ups, but you'll get where you want to go for about $1.50 one-way.", "A true \"Tale of Two Cities,\" the island of St. Martin and St. Maarten is proud of its dual heritage and customs. There is no physical border between the French and Dutch territories and people and goods may travel freely between both sides of the island. The Dutch side's official currency is the Netherlands Antillean guilder (ANG) while the official currency of the French side is the euro (EUR). However, the United States dollar is widely accepted, as are most major credit cards.", "Bring your appetite to St. Martin/St. Maarten, because you'll most assuredly put it to good use. Fresh seafood is often the star of many menus here (it is an island, after all), but there is a rich variety of cuisines to be found, from high-end French to Lebanese to Italian to traditional barbecue. Typical Creole dishes often include conch, goat and oxtail. You'll also want to try the island's national liqueur, Guavaberry, made from rum, cane sugar and local, wild guavaberries. A bottle also makes a great souvenir to take home.", "Some visitors say the island's dining is some of the best in the Caribbean, especially in the Grand Case area on the French side. Bistrot Caraibes in Grand Case consistently earns rave reviews from diners, who praise both its food and service. The restaurant's signature dish is lobster, a big favorite with repeat diners. La Villa Restaurant, another Grand Case mainstay, is equally praised for its French-Caribbean menu and exceptional service.", "If you're looking for a casual meal, try one of the lolos, or open-air restaurants on the beach (outdoor cooking on large barbecues is very popular here). In the evening, live music is often a staple at these local spots. Recent travelers especially enjoyed the bars and grills along Simpson Bay. The Palms was a particular favorite thanks to its Caribbean and international menu. Popular dishes include the jerk chicken and curry chicken. Izi Ristorant Italiano was also a hit for those passing through Simpson Bay for its variety of Italian classics.", "The dual-nation island is just as safe as other island getaways. Crowds are denser in St. Maarten, however, so travelers should exercise common sense when moving around the tourist areas; leave your valuables at home, and only carry small bills. St. Martin and St. Maarten's visitors should also be mindful of the jet blast when watching the planes take off and land at Maho Bay. Blasts of sand can be powerful depending on where you're standing, and spectators should prepare by bringing a brimmed hat and umbrella, in addition to plenty of sunscreen (the strong winds can make it hard to determine when you're sunburned). For that matter, sunscreen and a hat should always be worn, since the island is located between the Tropic of Cancer and the Equator, receiving the full force of the sun. A good pair of sunglasses is also a good idea. ", "The best way to get around St. Martin and St. Maarten is in a rental car. But really, outside of walking, just about any means of navigating between the French and Dutch sides of the island is manageable. Having a car will allow you more mobility and you'll find reasonable rental rates. Agencies are clustered on the outskirts of Princess Juliana International Airport (SXM), located in St. Maarten. Unfortunately, traffic can be pretty heinous on both sides. The island buses also cater to tourists and are fairly cheap to ride. If you don't like the idea of waiting on a bus, consider splurging on a taxi. And if you're feeling adventurous you might want to use a scooter; there's nothing like feeling the sea breeze in your hair – ahem, helmet.", "You can travel freely between this island's French and the Dutch sides, but you will need to present a passport that has at least six months remaining validity (for the French side) when you first arrive. A valid passport is all that is required to enter the Dutch side. You might also be asked to present your return ticket, proof of sufficient funds for your trip and proof of lodging. For more information on customs, visit the U.S. State Department's  for information on St. Martin here and for St. Maarten here. Tourist visas are not required."]}