{"name": "Dublin", "description": ["Like many modern cities, Dublin is a melting pot. Along with its traditional Irish culture, Dublin has been infiltrated by a host of glorious international influences. The city is the largest in Ireland, and its fast-growing immigrant population brings people from all over the world. The influence of these cultures is evident in the diverse and vibrant culinary scene that can be found here. That said, Dublin has held on to some of its classic characteristics. Known for its traditions, fine literature, folklore, customary music and dance, and fresh pints of Guinness are never in short supply. Travelers should expect to experience the traditional alongside the contemporary on their next trip to Dublin. Signing up for one of the best Dublin tours is a great way to experience Dublin's duality. The Irish capital is a mixture of history with a little debauchery that can be found on nearly every street corner.", "The best time to visit Dublin is June through August when temperatures are warm (for Ireland anyway) and festivals fill the streets. This also constitutes the most expensive time to visit, with high hotel rates and airfare prices. It's also the most crowded time of year. If you're looking for a deal and fewer tourists, come in the winter (the low season) with your heaviest coat. Spring and fall offer a happy medium – moderate temperatures (again, for Ireland), crowds and prices.", "Pub proficiency Dublin is pub central. Blend in with the local scene by learning this tidbit: When ordering the requisite Guinness (or any other brew), you call a half pint \"a glass\" and a full 16 ounces \"a pint.\"", "Pack layers No matter the time of year, Dublin is prone to cold, rainy streaks. Pack layers and a rain coat as sometimes an umbrella is not enough to keep you dry when it’s pouring outside.", "Avoid eating and drinking in Temple Bar If you can, drink and dine in areas like Smithfield, Portobello or Phibsborough for more authentic food and drinks at better prices. Many of the Temple Bar neighborhood's restaurants and bars are known for being tourist traps.", "Consider a day trip If you're interested in seeing some of the country's most majestic places, such as Kilkenny Castle and Glendalough, sign up for one of the best Ireland tours. Tours are led by knowledgeable locals who take care of the transportation and planning for you. ", "The Irish are a very friendly people, especially compared to the reputation of their stiff upper-lipped neighbors (sorry, England), so get to know them.", "Dublin's official currency is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "As for tipping, all industries in Ireland have a mandated minimum wage so tipping isn't a large part of the culture. Some restaurants will add a service charge of 10 to 15 percent to the bill so no tip is expected. If there is no service charge, it's customary to tip the same amount. When it comes to transportation, taxi drivers don't expect a tip but many travelers will round the bill up to the nearest euro or leave 5% if the driver was especially hospitable. One place to never worry about tipping? The pub. ", "Ireland's economic revival in the 1990s was accompanied by a culinary renaissance of new, sophisticated restaurants that ditched meat and potatoes for more lively European cuisine. Now in Dublin you'll find a great mix of medium- to high-price range restaurants, which offer an astounding diversity of options. The best restaurants are found south of the Liffey, but you should be prepared to pay well for a meal. Dublin restaurants include a high value-added tax on dining.", "For cakes, pudding, tarts, tea and more, recent travelers highly recommend you visit Queen of Tarts, a Dublin bakery on Dame Street. But if it's an entire Irish meal you're after, try the traveler-recommended L'Ecrivain for its delicious menu and intimate ambiance, perfect for a romantic dinner. Meanwhile, foodies should check out the contemporary Chapter One in the Rotunda neighborhood. Other cuisines, such as Thai, Asian fusion and Indian, are very popular, too; recent travelers especially praise the Indian restaurant, Veda, in Cabinteely Village. For a crash course in traditional and contemporary Irish cuisine, sign up for one of the best Dublin tours.", "Dublin is relatively safe, especially the city center and surrounding attractions, even at the wee hours of the morning. Overall, visitors should take caution against petty crimes like pickpocketing and car break-ins. But visitors should note that the area around Temple Bar can get pretty raucous as all the drunken revelers exit the bars and clubs. There is also a drug problem within Dublin city, predominantly heroin, so visitors should be mindful of suspicious activity, street beggars and paraphernalia in alleyways. In the unlikely event that you are a victim of a crime, reach out to Irish Tourist Assistance Service, which offers free and confidential services to tourists. ", "The best way to get around Dublin is by foot. The city's compact size makes strolling to and from the top attractions a cinch. Plus, some brisk walking will help lessen the (caloric) effects of all those pints from the pub. If you're flying into Dublin Airport (DUB), you can take a taxi, bus or airport shuttle into the city center. To save some coin, you can purchase a DoDublin hop-on, hop-off bus tour and Dublin Express airport bus combo ticket (you can purchase fares on the airport bus without buying a DoDublin Card). Aircoach also offers service between the airport and the city.", "Once in the city, you can also try out the bus and tram systems, which have lines that crisscross the city. You'll find taxis lining up in ranks throughout Dublin. These are expensive, but preferred over driving a rental car. The ride-hailing app Uber also operates in Dublin, but only allows licensed taxi and limousine drivers to offer rides. Ireland has prohibited Uber from hiring out private cars.", "A valid passport is required for United States citizens traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. You won't need a visa unless you plan on staying longer than three months. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements.", "The Ha'Penny Bridge, Dublin's oldest pedestrian bridge over the River Liffey, earned its nickname from the halfpenny toll originally required to cross. "]}