{"name": "Istanbul", "description": ["Bridging East and West – Europe and Asia – Istanbul possesses a richly complicated heritage. Once the capital of the Ottoman and Byzantine empires, this city's prestigious history has left us with many monuments to cherish. Plus, it integrates its past and present to create a unique mix of architecture; a glass skyscraper next to a Byzantine church or a colorful bazaar in the shadow of a shopping mall. The natural landscape is also impressive. The Bosphorus, a narrow strait, cuts the city in two and connects the Sea of Marmara in the south to the Black Sea in the north. From the blue waters, visitors will see a skyline of domes, steeples and modern towers.", "Although Istanbul looks serene from afar, the internal atmosphere is wonderfully chaotic. Discover the bustling streets and busy bazaar stalls that have characterized the city for hundreds of years. Drivers will jockey for position; shopkeepers will barter in an avalanche of chatter; and you'll be struggling to digest all of the sights, sounds and smells. Speaking of smells – during your exploration, smell and taste the distinctly Turkish treats off the streets, including döner, Istanbul's version of fast food. And when the sun goes down, you'll see that Istanbul sheds some of its conservative facade to reveal a thriving nightlife. At the intersection of civilizations and continents for centuries, Istanbul surprises visitors with its fast pace, its ancient history and its present culture.", "The best times to visit Istanbul are from March to May and between September and November. That's when crowds at the city's attractions are manageable, room rates are average and daytime temperatures generally sit in the 60s and 70s. Peak season – from June to August – sees temps soar into the low 60s to low 80s, and accommodation prices increase to match the demand from incoming tourists. December through February, meanwhile, are the cheapest months to visit, but Istanbul's rainy, snowy and chilly conditions (temps are in the high 30s to high 50s) mean you'll have to don cold weather attire and lug an umbrella during your stay.", "Politeness is highly regarded here Many U.S. customs are different from those in Turkey. But, this one still applies: Be gracious, even if you don't understand what is going on.", "Using Turkish goes a long way Communicating with the locals can be difficult, although many Turks know at least some English. It is, however, best to try speaking Turkish first. Phrases such as \"merhaba\" (hello), \"hosçakal\" (goodbye) and \"tesekkür ederim\" (thank you) will come in handy.", "Kid-friendly? Not so much If you have kids in tow, you might want to vacation elsewhere. Istanbul does not have much for children to do, and they will likely quickly tire of touring Byzantine architecture.", "Pay for items with Turkish lira Vendors in tourist areas will accept dollars and euros as a form of payment, but you'll generally overpay when using these currencies, so use Turkish lira.", "Buy a Museum Pass Istanbul card Most of the city's museums have entrance fees of 200 to 700 Turkish lira (or about $14 to $25) per person. To save some coin, invest in a Museum Pass Istanbul card, which costs 2250 Turkish lira (about $80) for five days of access to attractions like the Topkapi Palace Museum and the Istanbul Archaeological Museums.", "Travel by ferry for Bosphorus cruises Bosphorus excursions offered by private companies can cost up to 79 euros (more than $88) per person, so if you want to take in your surroundings from the water without burning a hole in your wallet, use Sehir Hatlari, the city's ferry operator. Tour tickets start at 65 Turkish lira (about $3).", "Although Turkey is a secular state, the predominant religion is Islam, and travel writers generally characterize the country as conservative. During your stay, you might notice that practicing Muslims pray five times a day. During the ninth month of the Islamic calendar, Ramadan, Muslims fast from dawn to dusk.", "Casual clothing is not unusual in more modern areas like Beyoglu, but women should cover their legs, shoulders and heads in more conservative neighborhoods like Fatih and inside mosques and other religious sites. Also, make sure to bring a scarf if you're visiting these places, though some offer ones to borrow.", "In general, it is better and safer to travel accompanied by others. If you venture into the Grand Bazaar, keep a close eye on your belongings, as pickpockets are in no short supply here. And remember to be mindful of your surroundings at all times, especially at popular tourist attractions.", "Rather than shaking their heads to say \"no,\" Turks will throw their heads backward slightly and raise their eyebrows accompanied by a \"tsk.\" When shaking hands, never offer your left hand, as it is considered rude and unclean. Also, point the soles of your feet away from others when sitting on the floor; doing otherwise is very offensive.", "Turkish is the official language spoken in Turkey, and Turkish humor is a bit different from what you'll encounter in the United States. Extreme sarcasm should be avoided in conversation, as should discussions about political and religious views.", "Finally, the official currency here is the Turkish lira (1 Turkish lira is equal to about 4 cents). Some tourist locales will accept dollars or euros as a form of payment, but exchange rates are generally poor, so it's best to use Turkish lira at all times. Turkish lira to dollar rates often fluctuate, so check the latest exchange rate before you go.", "Turkish cuisine can best be described as a fusion of its seven regions (the Mediterranean, Aegean, Marmara, Black Sea, and Central, Southeastern and Eastern Anatolian), each of which has its own culinary identity shaped by its geography and multiethnic nature. In terms of cuisine, Istanbul is a microcosm of the entire country, with many different types of restaurants serving many different dishes.   ", "Some Istanbul staples include the simple esnaf restaurants, where classic homecooked dishes are made fresh daily and served cafeteria-style for lunch, including everything from meat stews and stuffed vegetable dishes accompanied by buttery rice or bulghur. There are fish restaurants that serve their freshest catch grilled and with a slice of lemon accompanied by a slew of meze (cold appetizers) that are either fish or vegetable based with plenty of olive oil. There are kebab restaurants where different meats are grilled in-house on a hooded charcoal barbecue. There are bakeries making sweet and savory pastries or dough-based specialties like lahmacun and pide (flatbreads with different toppings). There are the classic Istanbul meyhanes (taverns) serving meze and raki, the national licorice-flavored spirit made from the anise plant and mixed with water and ice. When the two liquids make contact, it forms a milky white color, giving the drink its nickname, aslan sütü (lion's milk).", "There are confectionary shops dating to the Ottoman period selling traditional treats such as baklava, lokum (Turkish delight) and akide sekeri (hard candies with different flavors). Istanbul's street food includes pilafs, stuffed mussels, roasted chestnut or corn, simit (a ring-shaped bread covered in sesame), fish sandwiches, böreks (pastry made of thin layers of dough with different fillings) and dürüm (a wrap with döner – thinly sliced lamb meat from a spit). And then there are the contemporary restaurants (some boasting Michelin stars) that serve reinterpreted Turkish dishes accompanied by wines from the country's thriving boutique vineyards.", "Classic Istanbul beverages include the ubiquitous Turkish tea, served hot in a tulip-shaped glass at the end of every meal or as a welcoming offering to guests. Turkish coffee is strong and is also enjoyed at the end of a meal with lokum, but make sure to not drink the grounds at the bottom of the cup. In the winter, there is boza, a drink made of fermented grains and served with cinnamon and leblebi (roasted chickpeas).", "For the most authentic experience, avoid the Sultanahmet area. The tourist-heavy neighborhood's restaurants, in general, serve overpriced and mediocre food. Take a short trip on the tram north across the Golden Horn to Beyoglu, where you'll find a mix of simple home cooking, as well as some of the trendiest options in the city.", "According to the U.S. State Department, travelers should exercise some caution when visiting Turkey, due to possible terrorist attacks. Tourist sites, major events, transportation hubs and popular locales (like restaurants and nightclubs) are most prone to terrorist attacks. Also, avoid protests, gatherings and demonstrations, and keep tabs on local news. Signing up for the free Smart Traveler Enrollment Program, which notifies the nearest U.S. embassy or consulate of your travels, is strongly advised. To learn more about security concerns and safety tips for Turkey, visit the U.S. State Department's website.", "The best ways to get around Istanbul are the buses and trams, which conveniently cover the touristy areas. But remember, buses don't have maps inside and drivers do not announce stops, so you'll need to remain vigilant and watch where you are going. The metro is also a reliable and cheap means of getting around; however, stops are farther apart and not as well-positioned for seeing the sights. When visiting Sultanahmet and Eminönü, walking between the area's attractions is doable, but you'll need to rely on another mode of transportation to reach other neighborhoods. Driving is strongly discouraged because of heavy traffic and since road signs are in Turkish and accidents are fairly common. Ferries are also available to get to the Princes' Islands and between the European and Asian sides.", "Even though Istanbul straddles Europe and Asia, you can travel freely between the two sides. To enter Turkey, you will need a passport that's valid for six months past your arrival date, as well as a visa. Visas cost $50 and are available on the Republic of Turkey Ministry of Foreign Affairs website. The sticker visa (which is placed in your passport along with an official stamp) is valid for 90 days. To stay longer, contact a Turkish embassy or consulate to apply for a residence, work permit or Turkish ID card. For more information, visit the U.S. State Department's website. "]}