{"name": "Brisbane", "description": ["When mapping out your Australian vacation, a visit to Queensland's capital may not be your first choice. The country's third largest metropolis is often overlooked in favor of Australia's more well-known tourist hot spots, such as Sydney and Melbourne. But Brisbane's subtropical climate, thriving arts and live music scene and bevy of outdoor to-dos make it a worthy destination for your next trip Down Under. ", "Tucked into the southeast corner of Queensland (aka the Sunshine State), Brisbane is as easygoing as it is sophisticated. The city's riverside setting makes it an ideal getaway for adventurers, but its trendy restaurant and nightlife scene will also appeal to those seeking a big-city ambiance. Thrill-seekers will delight in heart-pumping activities like climbing Story Bridge, while sports fanatics cannot miss a chance to catch a rugby match at Suncorp Stadium. Meanwhile, those craving relaxation will find it at the City Botanic Gardens, Roma Street Parkland and the Brisbane Botanic Gardens Mount Coot-tha.", "The best time to visit Brisbane is from March to May – autumn in the Southern Hemisphere. Temperatures during this season hover between the high 50s and mid-80s with little rainfall later in the season. But keep in mind that you will need to slather on the sunscreen: Brisbane sees an average of eight hours of sun per day thanks to its subtropical climate. The city's winter (June to August) and spring (September to November) are also popular times to visit thanks to the mild temps and dry days. But these two seasons also see plenty of hotels booked solid, especially in September during the month-long arts celebration known as the Brisbane Festival. If you're planning to visit during the arts festival, arrange your accommodations well in advance. You'll find better airfare and hotel room deals during Brisbane's wet, humid season, which spans from December all the way to early March. Just note that the soggy weather might put a damper on your outdoor activities.", "As Queensland's bustling capital, Brisbane is an energetic, trendy metropolis with a thriving arts and restaurant scene. But while it may have embraced a cool, contemporary disposition to match that of its siblings, Sydney and Melbourne, Brisbane still has one foot firmly tied to its Aboriginal roots. You'll see this in the song and dance demonstrations of the Yuggera tribe, which gathers at the base of the Kangaroo Point Cliffs (just south of downtown Brisbane).", "But Brisbane's Aboriginal birthright is only one part of its overall history: The city's military heritage is also remembered with several memorial sites, including ANZAC Square and the National Freedom Wall in the Brisbane Botanic Gardens Mount Coot-tha. ANZAC Day – a national day of remembrance in both Australia and New Zealand – honors the military contributions and sacrifices of each country's servicemen and women. ANZAC Day, celebrated annually on April 25, is a national public holiday similar to Memorial Day in the U.S., so if you're visiting in late April, be prepared for businesses and attractions to be closed.", "Americans should feel at home here, with English as the official language. However, getting behind the wheel will take a little getting used to since Aussies drive on the left side of the road. Also, Brisbane is located in the Southern Hemisphere, so the seasons are opposite of what those of us living in the Northern Hemisphere are used to: Our summer is Brisbane's winter. For currency, Aussies use the Australian dollar. AU$1 equals about $0.76, but currency rates tend to fluctuate, so consult a currency calculator before your trip.", "Sports are an important component of Brisbane culture. Two massive venues – The Gabba and Suncorp Stadium – host rugby, football (soccer) and cricket games with crowds of 40,000 to 50,000 screaming fans. But Brisbane's love of sport doesn't stop there. Thanks to the city's sunny weather and diverse public spaces (like Roma Street Parkland), Brisbanites are an active community.", "You'll find just about every type of cuisine in Brisbane, from Turkish and Chinese to Vietnamese, Spanish and, of course, Australian. Aussie staples served in Brisbane and throughout the country include meat pies (a meat and gravy-stuffed baked pastry), potato wedges and various meats coated with piri piri (a spicy sauce). Don't be surprised if you spot kangaroo, wallaby, emu or crocodile listed as specialty menu items. Given the city's proximity to the ocean, many of Brisbane's restaurants also feature locally sourced seafood, such as seasonal oysters, murray cod, barramundi and mulloway.", "Explore Brisbane's downtown area to experience some of the city's top restaurants. Esquire and The EURO are two popular eateries situated less than a mile from each other on Brisbane's north bank (a little more than a mile from the city center). Both restaurants receive a stamp of approval from locals and travelers alike for their delicious, inventive cuisine. Stokehouse Q, which sits just south of the city center in South Brisbane, is another visitor favorite thanks to its modern Australian menu (think roast lamb rump and smoked swordfish). Stick around the area's South Bank district for the best waterfront dining. This emerging culinary area boasts trendy, alfresco eateries that offer everything from classic Italian to Champagne and oyster bars. For more European-inspired menus, check out New Farm, a suburb on Brisbane's north bank. Quaint bistros, elegant wine bars and a popular local haunt, Chouquette Boulangerie Patisserie, can be found along the tree-lined streets.", "Farmers markets are another big part of Brisbane's foodie culture. The popular Boundary Street Markets set up shop in one of Brisbane's suburbs, the West End, every Friday and Saturday. But you can also find Jan Powers Farmers Markets stationed in various neighborhoods around the city, including downtown Queen Street, New Farm, Mitchelton and Manly. Other popular food bazaars include Brisbane MarketPlace Rocklea and Eat Street Markets.", "Don't expect to encounter any major crime when visiting Brisbane. However, as with any large city, you should take precautions. Stay alert when walking around unfamiliar areas, especially at night.", "While you won't have to worry about the threat of serious crime when visiting Queensland's capital, don't forget about another, often forgotten danger: the sun. Because of Brisbane's subtropical location, it's easy to get burned quickly – even on overcast days. Remember to wear sunscreen and a brimmed hat if you're out and about.", "The best way to get around Brisbane is by public transportation. Thanks to the combination of buses, ferries, trams and trains operated by TransLink, the central business district and outer suburbs are easy to reach. You can even take a train from the Brisbane Airport (BNE) to the central business district via the city's Airtrain system. (The airport is located about 11 miles northeast of the downtown area.) Or, rely on your own two feet to get around the city. Brisbane's compact size lends itself well to biking and walking, especially along the many paths that follow the river's winding curves. Only rent a car if you plan to drive to Brisbane's outer regions, like Moreton Bay or the Redlands; you won't need your own set of wheels with this city's reliable public transportation.", "To effortlessly transfer between the various public transportation modes, use a frequent rider pass, like a go card or seeQ card. A seeQ card allows you to use any TransLink bus, train, tram or ferry for three or five consecutive days. With this card, you can travel throughout Brisbane. Plus, the card includes two Airtrain trips. A go card differs from a seeQ card in that you can choose how much money to put on the card. You can refill the balance of your card online, at go card locations and at fare machines in train stations and select bus stations. Fares for Brisbane's public transportation are determined on a zone system. There are eight zones, but most of the top attractions in Brisbane are situated within Zone 1.", "To enter Australia, you must have a valid U.S. passport and a tourist visa. If you have a U.S. passport and plan to be in Australia for less than 90 days, you are required to have an Electronic Travel Authority, an electronic, label-free visa that you can obtain online through the Australian Government Department of Immigration and Border Protection's website. Your airline or travel agent can also apply for one on your behalf. For more information, visit the U.S. State Department's website."]}