{"name": "Big Sur", "description": ["Big Sur is not just a destination, it's a state of mind. Stretching 90 miles between Monterey Bay and San Simeon on the west coast of central California, Big Sur's remote location, peaceful nature and incomparable beauty entices visitors to change gears, both figuratively and literally. Pacific Coast Highway, which was built less than 100 years ago, is the main road that runs through the region and becomes the most scenic in Big Sur. Sitting high above the surf, the highway clings to the edge of the area's cliffs, providing spectacular views as it weaves in and out of the seemingly endless coastline.", "Today, Big Sur draws millions of visitors every year, but it still hasn't lost its sense of place. Independent art galleries dot the highway, sharing space with wellness retreats and cliffside eateries. But the diverse landscape remains the favorite amenity of the area, with state parks and beaches reigning supreme as the main attractions. Mountains, beaches, rivers, valleys, creeks, coves, wildflowers and wildlife linger at every turn. That is, if you can find them. Some of Big Sur's natural attractions are intentionally unmarked to preserve the sense of seclusion that the region is so famous for. Big Sur, however, is meant to be an experience rather than a typical vacation. So kick back, unwind, and open your eyes and ears to the sights and sounds of Big Sur.", "The best time to visit Big Sur is from September to November. Winter, especially December, is another good time to visit Big Sur for those looking to snag a deal on lodging. But these cheaper prices coincide with the rainy season and often road closures. Spring ushers in cooler temperatures and the bloom of the area's beautiful wildflowers. Summer is the busiest season, offering visitors pleasant temperatures and plenty of activities and programs offered by the region's parks and educational societies. But along with heavy crowds, coastal summer fog is another downside; it can hang around as late as midday.", "Beaches are not directly accessible The majority of the beaches in Big Sur require visitors to go through a trail to reach their destination, so make sure to bring appropriate walking shoes.", "Beware of poison oak Many of the trails in Big Sur, including the maintained state parks, contain poison oak. Know how to identify the plant before you go.", "Take the bus The Monterey-Salinas Transit System's Route 22 bus takes visitors to multiple points of interest in Big Sur, including Andrew Molera State Park, the Big Sur River Inn and Nepenthe Restaurant. You'll still get the quintessential Pacific Coast Highway drive without wasting any of your own gas.", "Stay in Monterey Monterey Bay is a 30-mile drive north of Big Sur and a must-visit city in its own right. Plus, there are more lodging options available for all types of budgets.", "In Big Sur, it's hard to come by a restaurant that doesn't offer spectacular ocean views. With most restaurants perched high atop the area's famous coastal cliffs, the quality of food might be the least of diners' concerns. But in Big Sur, quality remains a central character in its culinary story. Spectacular sights of the Pacific are regularly complemented with fresh, locally sourced fare both from the soils of Big Sur as well as the nearby waters of Monterey Bay. Because in Big Sur, great views and great food aren't mutually exclusive.", "Big Sur's eateries vary in style from prix-fixe fine dining menus to cozy cafes with daily changing chalkboard menus, but many are unified in their pursuit to honor Big Sur and its contagious laid-back lifestyle. Farm-fresh burgers and breakfasts starring local eggs–often inside breakfast burritos–and strong coffee are essential Big Sur eating experiences, ideally enjoyed al-fresco."]}