{"name": "Geneva", "description": ["Nestled in a valley at the western edge of Switzerland, Geneva is a serene setting for a slow-paced vacation. Its cobblestone streets are lined with outdoor cafes and independent shops, while the more cosmopolitan stretches of the city are brimming with designer brands and elegant restaurants. Plush seating cradles patrons as world-class orchestras perform inside the Victoria Hall. Even the fine dining here is considered an art. But despite all the luxury, Geneva can also make you sweat – sailing on the lake, walking or jogging in the parks and skiing down the nearby slopes of Mont Blanc are all popular activities.", "The best time to visit Geneva is in the small peak season of July and August. Though you'll rub elbows with hordes of tourists and pay extra to visit during these months, Geneva's weather is at its best for outdoor activities like hiking at Mont Salève and sunbathing at the Pâquis Baths. December to April, meanwhile, are prime times for skiing the nearby Swiss Alps, but you'll encounter chilly temperatures and some crowds. Hotel and airfare deals may be possible if you do not visit around Christmas and Easter. If you'd rather avoid winter's cold weather and summer's high prices, consider arriving between September and November or in May or June, Geneva's shoulder seasons.", "Clean up, clean up, everybody, everywhere The Genevese consider littering to be in very bad taste, so it's best if you sort your clutter into the proper receptacles.", "Check for restaurant closures If you're visiting Geneva in the summer, call restaurants in advance to ensure availability since some dining venues close for parts of July and August.", "Walk if off Geneva is a small city, only 6 square miles, and very accessible for pedestrians. Not only is walking free, but you'll get some great exercise.", "Buy a Geneva Pass If you plan on joining multiple city tours or visiting sights like Mont Salève and the Patek Philippe Museum, consider purchasing a one-, two- or three-day Geneva Pass for 26 to 45 Swiss francs (or $26 to $48).", "Book well in advance Because Geneva hosts so many conventions, hotels fill up quickly during major events. It's best to book at least four months in advance when hotels are more willing to drop rates.", "Ask for your Geneva Transport Card All hotels, hostels and campgrounds are required to give you this pass at check-in, letting you ride public transportation for free during your stay. If your feet tire from walking, at least you can enjoy complimentary rides on the tramway.", "Although the headquarters of the United Nations are in New York City, Geneva is where you'll find the Palace of Nations, the second largest U.N. building and institution in the world. As such, the city is hugely international; people that hail from towns and cities all over the world either make Geneva their home or are in the city for numerous conferences throughout the year.", "Switzerland has four official languages (French, German, Italian and Rumantsch), but French is the most widely spoken. English is fairly common as well, but it's best to come prepared with a few key French phrases, such as \"bonjour\" (hello), \"Comment allez-vous?\" (How are you?), \"Je ne comprend pas\" (I don't understand), \"Parlez-vous anglais?\" (Do you speak English?) and \"au revoir\" (goodbye).", "Even though one Swiss franc (Switzerland's official currency) equals about one dollar, exact rates can fluctuate, so check the latest exchange rate before visiting. And remember, Geneva is expensive. Restaurants serving up Swiss cuisine tend to charge quite a few more francs than you might be used to paying, but you won't be expected to tip since service charges are included in all published prices.", "Geneva is located just miles from the Switzerland-France border, so many of France's highly praised culinary techniques have infiltrated the dining scene. Italy, too, is only about an hour away, so go figure: French and Italian restaurants reign supreme here. For some of the city's best French cuisine, check out Bayview, Le Chat Botte and Bistrot du Boeuf Rouge. Popular Italian eateries include Il Lago and Luigia.", "Iconic Swiss dishes like chocolate and cheese fondue can be found on many restaurant menus. Other local specialties, such as Älplermagronen (a gratin, or casserole-like dish, made with potatoes, macaroni, cheese and onions served with stewed apples) and rösti (a flat, circular potato dish that's fried in hot butter or fat), are also available at a variety of dining venues. If you're craving Swiss fare, consider sitting down for a meal at highly regarded restaurants like Restaurant Edelweiss, Auberge de Saviese and La Buvette des Bains. Note: Some eateries close for parts of July and August, so call ahead to confirm opening hours.", "Geneva is a very safe city, as far as tourists go – though it does see some petty theft and vandalism, especially at train stations, airports and tram and bus stops. However, other cities in Europe (like London and Paris) have seen a spike in terrorism-related incidents, so it's best to avoid demonstrations and keep an eye on current events while staying in Geneva. To learn more about security concerns and safety tips for Switzerland, check out the U.S. State Department's website.", "The best ways to get around Geneva are on foot and by tram – the city is a small 6 square miles and is easily navigated. In addition to covering tram services, the city's free Geneva Transport Card for tourists can also be used on water taxis, trains and buses, but these services are often slower or less convenient than walking or taking the tram. Taxis can be hailed as well, though you'll pay a premium to use them. Driving in the city center is not necessary and will generally be more of a nuisance than a convenience due to limited parking and rush hour traffic.", "If you're getting to Geneva via Genève Aéroport (GVA), plan on grabbing a free 80-minute train ticket from baggage claim's Transports publics genevois (TPG) vending machine. The journey to downtown's Genève train station will take you approximately 10 minutes.", "To visit Switzerland, Americans must have a passport that is valid for at least 90 days after staying in the country. Proof of a return airline ticket is also required. A visa is only needed if your visit will last more than 90 days. Visit the U.S. State Department's website for the latest information on entry and exit requirements."]}