{"name": "Seoul", "description": ["The blue and red yin and yang emblazoned on South Korea's flag represent balance – an ideal that was thrown off-kilter during the Korean War. But after the 1953 armistice, a modern Seoul bloomed anew. Today, the city is characterized by stunning architecture, vibrant culture and a thriving economy – all testaments to Seoul's resilience.", "Seoul may seem like it’s blazing into the future, but South Koreans still hold fast to their rich heritage. Tucked between vast shopping districts and lively nightlife zones are relics of Seoul's history, windows into an old Seoul before the towers of concrete and steel. Gyeongbok Palace – the oldest and largest of five Joseon dynasty palaces in the city – stands on manicured grounds just minutes from downtown. Nearby, Bukchon Village's wooden, one-story homes sit in sharp contrast to the surrounding high-rises. Miraculously, Seoul's past and present do not clash; rather, they play off one another. This harmonious blend of old and new is the key to Seoul's allure and a central tenet of the city's identity.", "The best times to visit Seoul are from March to May and from September to November, when the weather is mild (average daily high temperatures stay below the mid-70s) and travel expenses are low. If you're a powder hound, you'll want to visit between December and February, when average daytime temperatures stay around the freezing mark and snow can be frequent. It's best to avoid the summer months which coincide with Korea’s rainy season, or jangma. During these months, Seoul is uncomfortably humid and full of tourists. What's more, hotel room costs are at fever pitch.", "Respect your elders Korean customs hold senior citizens in the highest regard. Do as the locals do and offer the priority seats on the subway to the elderly.", "Don’t rely on Google Maps It’s easier to navigate Seoul if you use Korean navigation and translation smartphone apps like Kakao Map, Naver Map and Papago.", "If it's late, call a taxi The subway is reliable during the day, but it's closed between midnight and 5:30 a.m. That means night owls will have to find alternate means of transportation in the wee hours (just remember that taxis hike up their prices between 20 and 40% between 10 p.m. and 4 a.m.).", "Purchase a Climate Card Tourist Pass This transportation card covers unlimited rides on Seoul’s public transportation. You can choose between one-, two-, three-, five- or seven-day passes.", "Eat on the street Food stalls and 24-hour Korean \"fast-food\" joints offer a wide array of food options that are as pleasing to your taste buds as they are to your wallet.", "Shop \"Tax Free\" Foreign visitors can be eligible for a tax refund for goods they take out of the country. Look for shops that display \"Tax Free\" signs. Before you leave Seoul, declare your items at airport customs and receive your refund. Find out more about tax refunds on the Seoul tourism organization's official website.", "South Korean culture is still deeply rooted in ancient Confucian principles, including a strong dedication to family and society. Because of Koreans' respect for the hierarchy system, family elders and ancestors are honored above all. To uphold Korean etiquette, bow to elders in greeting (younger people are expected to bow lower than the elders out of respect) and allow them priority seating on public transportation. A bow when meeting anyone else is customary. And don't get offended if someone asks your age. Since elders are held with such high regard in Korean culture, oftentimes people ask as a way to avoid disrespecting anyone in their company. ", "South Korea's official currency is the South Korean won (KRW). One United States dollar equals roughly 1,370 won; check the current exchange rate before your trip.", "Combat and instability are in South Korea's past, but it's important to remember that this peaceful, modern democracy's armistice with its northern neighbor has been called into question a number of times since the Korean War ended in 1953. There have been a few isolated skirmishes between the two Koreas over the past 60 years, but the Demilitarized Zone (DMZ) between North and South actually stands as a safe tourist attraction.", "While South Korea's crime rates are low, you should still exercise caution when it comes to personal safety. Seoul plays host to the same crimes symptomatic of any densely populated metropolitan area: Pickpocketing and purse snatching are more common in crowded areas. The State Department also recommends travelers not join in protests of any kind (demonstrations are common in Seoul). If you find yourself in an emergency, dial 119 for an ambulance and 112 for the police. ", "Chowing down on hansik (traditional Korean food) is a cultural experience you won't want to miss – but it's also not for the ultra-squeamish. Many Korean meals include pickled ingredients, like kimchi (spicy fermented cabbage or other vegetables) and gochujang (fermented soy bean and red pepper paste), among other Korean flavors. Don't let fear of the unknown dissuade you – you're going to want to taste some of this.", "If cabbage kimchi doesn't appeal to you, then perhaps Seoul's never-ending plethora of grilled meats will. Gather around a tabletop grill at a barbecue house and savor the aromas of sizzling samgyupsal (pork belly) or galbi (beef ribs). Truly adventurous eaters will want to head to Gwangjang Market, the oldest market in Seoul, where you can sample everything from mandu (dumplings filled with ground meat or vegetables) to jokbal (pigs' feet boiled in soy sauce, ginger, rice wine and garlic). And remember to save some room for bindaeduk, a fried pancake made from ground mung beans that is reminiscent of a savory funnel cake. ", "The best way to get around Seoul is via the subway. You can throw in a taxi ride here and there if you plan on staying out late, or a bus ride if your destination is too far to walk. Seoul is too massive to be explored solely on foot, but it does contain some neighborhoods that were made for walking (Bukchon Village, for example). Because Seoul's public transportation is so cheap and extensive, we advise against renting a car (plus, traffic in the city is legendary). If need be, you can rent a car at either of Seoul's two airports, Incheon International Airport (ICN) and Gimpo International Airport (GMP). ", "The vast majority of international flights come in via Incheon. You can take a taxi from Incheon or Gimpo into Seoul, or if you're looking to save a little coin, the AREX (Airport Railroad Express) train goes directly into the city, too.", "The Republic of Korea requires U.S. citizens to hold a valid passport for tourism and business trips lasting up to 90 days from when you enter the country. A trip lasting longer than 90 days or for another reason besides tourism or business requires a visa. For more information, visit the U.S. State Department's website."]}