{"name": "Luxor", "description": ["When you think of Luxor, you probably envision the city's multitude of temples and tombs. Though this UNESCO World Heritage-listed city is divided by the Nile River into two areas (the East Bank and the West Bank), there are remnants of the ancient Egyptian city of Thebes everywhere. Luxor's oldest ruins date back to the late 14th century B.C., and tombs belonging to famous pharaohs like Tutankhamun and Hatshepsut can be found at the base of the West Bank's Theban Mountains. But Luxor offers more than just historic sights. You'll find a strong Islamic culture here, as well as the hustle and bustle of a large metropolis.", "Luxor's downtown area is filled with contemporary buildings and amenities. As you move out of the city center, you'll quickly notice Luxor's ancient ruins. While most of Luxor's tombs reside on the West Bank side of the city, some of the most popular temples and museums can be found alongside the Nile's East Bank. Must-see East Bank sights include the Temple of Luxor, the Karnak Temple Complex and the Luxor Museum. Head west and you'll find more ruins like the Colossi of Memnon, Medinet Habu and the Temple of Hatshepsut. And if you continue toward the Theban Mountains, you'll uncover hundreds of tombs nestled within the Valley of the Kings, the Valley of the Queens and the Valley of the Artisans.", "The best times to visit Luxor are from March to April and between October and November. These brief shoulder seasons offer pleasant temperatures, small crowds and more affordable hotel rates. Luxor's coolest temperatures can be enjoyed in winter, but you'll also find hordes of tourists and high prices during this season. And though you'll snag great hotel deals once summertime rolls around, unbearably hot temperatures make touring Luxor's sights between May and September uncomfortable.", "Since Egypt's revolution in 2011, Egyptian politics and security, especially in Cairo, have been in a state of unrest. Luxor's sights are relatively safe, however, more terrorist attacks have occurred since former president Hosni Mubarak was overthrown, so it's best to avoid political demonstrations and stay alert. Pickpockets are also common, so guard your belongings. You'll notice a greater police presence at large sights like the Temple of Luxor and the Karnak Temple Complex to help thwart potential incidents.", "Luxor's street vendors, who linger outside of popular tourist attractions, are notoriously belligerent. Many are relentless with their offers, while others will promote free services and later demand a fee. Women are regularly subjected to inappropriate comments, gestures and physical contact. If a hawker is making you feel uncomfortable, find a tourist police officer. (They're stationed at most of Luxor's temples and tomb sites.)", "Though accepting tour offers and other services from street vendors is not recommended, if you decide to use unofficial services, expect to be asked for a tip. Restaurant employees, tour guides, drivers, restroom attendants and attraction guards will also demand tips. The primary currency in Luxor is the Egyptian pound (EGP); check the latest exchange rate before you visit. Average tips range between 1 Egyptian pound and 100 Egyptian pounds ($11) depending on the service. And remember, tips in Egypt are typically shared between multiple people and don't always get distributed evenly, so if you're interested in tipping a particular individual, it's best to do so discreetly.", "The official language of Egypt is Egyptian Arabic, however, Sa'idi Arabic (a local dialect) is most commonly heard in Luxor. Some key words and phrases to use while in Luxor include \"marhaba\" (hello), \"la\" (no), \"shukran\" (thank you) and \"inshallah\" (which means \"God willing\" and accompanies a variety of phrases). You'll also find that most locals who interact with tourists, such as tour guides and hotel employees, are fluent in English.", "When in Luxor, it's best to be mindful of what you wear. Although standard Western attire is widely acceptable in areas with a lot of tourists, exposing your arms and legs (especially as a woman) in local hangouts and while walking between destinations is often frowned upon. To avoid unwarranted attention, adopt some elements of Islamic dress during your stay, such as wearing long-sleeved shirts and jeans or floor-length skirts. Covering your head with a scarf (known as a hijab) is not necessary except when visiting a mosque. Additionally, plan on dressing more conservatively during Ramadan, an Islamic holiday that involves fasting to honor the first revelation of the Quran to the Prophet Muhammad. If you visit around this time but don't want to engage in fasting, pack some extra snacks to enjoy when shops and restaurants are closed between dawn and sunset.", "Luxor's North African location and popularity with tourists mean you'll find everything from authentic Egyptian establishments to European-inspired restaurants and Western fast food joints. However, most of the region's best restaurants specialize in Egyptian and Middle Eastern fare. No matter what kind of cuisine you choose, expect to find the bulk of Luxor's eateries within a couple blocks of the Nile's East Bank.", "Though you may not be familiar with Egyptian cuisine, many Egyptian dishes feature elements of Mediterranean and Middle Eastern fare. You'll notice, for instance, that most Egyptian meals incorporate bread, rice and vegetables like beans, lentils and onions. Because of the city's proximity to the Nile, fish is also offered on many restaurant menus. For some of Luxor's best Egyptian dishes, dine at Sofra Restaurant & Café and Al-Sahaby Lane Restaurant. Both restaurants sit within walking distance of the Temple of Luxor and serve a variety of traditional Egyptian specialties. Must-try items include aish baladi (Egypt's version of pita bread), hamam mahshi (pigeon stuffed with rice or wheat), mouloukhiya (a stew made of rabbit or chicken, garlic and mallow – a leafy green vegetable) and ful medammes (seasoned mashed fava beans commonly enjoyed at breakfast).", "International cuisines are also available throughout Luxor. Indian and Asian dishes like butter chicken and Thai red curry are on the menu at A Taste of India Asian & International Restaurant Lounge Bar. British- and Italian-influenced bites can be found at several popular restaurants, including the Jewel of the Nile and Pizza Roma.It. And if you crave an upscale, French-inspired meal, eat at the Sofitel Winter Palace Luxor's 1886 Restaurant. Seasonal specialties include grilled lobster, pressed duck and risotto. You'll even see American fast food franchises like KFC and McDonald's represented here.", "The most convenient ways to get around Luxor are by tour bus and bike. Driving can be a bit chaotic in the city, and taxis are likely to overcharge tourists who don't negotiate fares. Both, however, are great options for traveling to and from Luxor International Airport (LXR), which sits about 7 miles east of the city center.", "Ferries and minibuses are common ways for locals to get around but only operate at select times and in limited areas. Calèches, or horse-drawn carriages, are also available, though calèche drivers are regularly criticized by animal rights groups for mistreating their horses. And while you may be tempted to save some money by getting around on foot, Luxor's high temperatures and notoriously aggressive street hawkers can make walking around the city more of a hassle than a convenience.", "Traveling to Egypt will require a valid passport with one or more blank pages. You'll also need a visa, which can be requested from an Egyptian embassy or consulate before your trip or upon arrival at Egyptian airports. All tourist visas permit one entry into the country and are valid for 30 days. Egyptian officials have occasionally denied requests for visas in airports without explanation, so it's best to make arrangements ahead of time. All tourists coming from Israel must obtain a visa before arriving in Egypt. Tourist visas obtained from an embassy cost $15 per person, while visas received at Egyptian airports will set you back $25. For more information about entry and exit requirements, visit the U.S. State Department's website."]}