{"name": "Cambridge, MA", "description": ["This college town, home to two of the most famous universities in the country, if not the world (Harvard and the Massachusetts Institute of Technology), is certainly known for its highbrow intellectual pursuits. But it also has its fair share of world-class museums, a thriving music and arts scene, all sorts of boutiques, fantastic restaurants and independent bars and cafes. Even though it's a hop, skip and a jump from Boston, just across the Charles River, it's a destination in its own right, with its own character and charms.", "In the morning, you could be browsing through bookstores in Harvard Square with leagues of students, in the afternoon, enjoying cutting-edge architecture on the campus of MIT and in the evening, savoring virtually any kind of cuisine you could imagine, and you'd barely scratch the surface of all there is to do in this historic, yet youthfully vibrant city.", "The best time to visit Cambridge is from June to October. Though June, July and August see plenty of tourists, university students from the area head elsewhere, making it easier to get around. Fall, meanwhile, sees a dip in accommodation rates and an abundance of fall foliage. Spring is another good time to visit, with more deals to be had than summer, while winter generally offers the town's lowest hotel prices. Just don't forget your winter coat and boots!", "Walk the yard Even if you don't take a tour or have any interest in colleges, walking through Harvard Yard is a must, simply for the history and architecture.", "Go beyond Harvard Square Many visitors think that Harvard Square is all there is to Cambridge, when in fact it's much larger. If you walk from Harvard to MIT, you'll discover lots of places to eat and shop.", "Go to museums when rates are reduced or free Many museums offer free admission or reduced rates at different times. For example, the MIT Museum is free the last Sunday of the month from September to June. Check each attraction's website before you visit to find out if admission is waived or discounted on select days.", "Download self-guided tours Instead of paying for a guided tour, go when you want with a free app or downloadable tour, which many attractions provide. Both Harvard and MIT, as well as the Mount Auburn Cemetery, offer excellent guides detailing everything from history to art.", "Cambridge is home to virtually every type of cuisine and restaurant you can imagine, from four-star dining to casual food truck fare. Ethiopian, Vietnamese and more are served here, reflecting the melting pot of cultures that come to Cambridge to study. In Harvard Square, Harvest has dished up excellent modern New England fare for more than 40 years and is also where some of New England's most celebrated chefs made their start. Equally historic, but in a different vein, is Mr. Bartley's Gourmet Burgers, an iconic burger spot in the square that's been serving up tasty burgers since 1960. Others might argue that Charlie's Kitchen, another landmark, has better burgers, but we'll let you decide.", "In more recent years, restaurants like Craigie on Main (helmed by James Beard Award-winning chef Tony Maws) have made a name for themselves with menus that change daily. Another popular restaurant is The Smoke Shop by Andy Husbands, where a World Barbeque Champion offers his slow-cooked, competition-style barbecue. Oleana, helmed by James Beard Award-winning chef Ana Sortun, is also widely acclaimed for its Middle Eastern cuisine.", "The best way to get around Cambridge is on foot. Harvard Square is the best place to begin any visit to Cambridge, but driving (and parking) here is usually a nightmare. Do yourself a favor and take the subway (or, as it's known locally, the \"T\"), ride a bike (you can rent one from the bike-sharing company Hubway for just $8 a day) or walk. Of course, taxis and ride-hailing services like Uber and Lyft are also readily available should your feet get tired.", "Just across the Charles River, Cambridge is easily reached by taking the Red Line train outbound to any stop past Charles/MGH station. There are stops at MIT (Kendall Square), Central Square, Harvard Square, Porter Square and Alewife. To get to Cambridge from Boston Logan International Airport (BOS) via the subway, take the Silver Line bus to South Station, then hop on the Red Line. "]}