{"name": "Savannah", "description": ["Savannah, with its Spanish moss, Southern accents, historic bed-and-breakfasts and creepy graveyards, is a lot like Charleston, South Carolina. But this city about 100 miles to the south has an eccentric streak. Savannah College of Art and Design students mix with ghost hunters and preservationists, while Southern restaurants share street blocks with edgy cafes and restored theaters. The quirky characters in the true crime story, \"Midnight in the Garden of Good and Evil,\" say it all. Yes, eccentricity is the name of the game, but if that's not your \"box of chocolates,\" as Tom Hanks famously said in the Savannah-filmed \"Forrest Gump,\" maybe history or nightlife is.", "Savannah's antebellum past seeps from nearly every corner – it's home to one of the oldest Black churches in North America and Fort Pulaski acted as a safe haven for enslaved people to escape to freedom. But regardless of if you're in town to immerse yourself in history, see the sights, sample the tasty Southern cuisine or spend a few nights bar-hopping, Savannah knows how to show visitors a good time.", "The best time to visit Savannah is from March to July when warm temperatures coax the tree leaves and azalea blooms out of hibernation. A cache of festivals also fill this high season, though because the weather is ideal, hotel rates may be on the pricey side. Late winter – January and February – is low season, and the drop in temperatures comes with a drop in hotel rates. Shoulder season (mid-September to mid-November) is a sweet spot in Savannah tourism: The summer crowds clear (along with the sweltering temps) and lodging prices take a dip before the busy holiday season hits.", "Study up Read or watch \"Midnight in the Garden of Good and Evil\" before you visit. This work of nonfiction – in both book and film versions – will give you an idea of Savannah's ambiance.", "Take your time Did you know this Georgia city is sometimes nicknamed Slow-vannah? You're in the South now, so slow down and enjoy it at a snail's pace.", "Book a tour Whether you want to learn more about Savannah's historic squares, taste your way through the city's dining scene or go on a ghost hunt, there's a guided tour for you.", "Book a hotel near the airport The rooms near the Savannah/Hilton Head airport are very affordable – about $100-plus less than an inn in the Historic District. And you're only a quick drive away from all the downtown action.", "Yes, you're in the South. And yes, you'll find some fried food here, but if that's all you're expecting, then you've got Savannah all wrong. Thanks to its coastal location, Savannah offers a little bit of everything, and it's quickly becoming a formidable culinary rival to Atlanta. ", "If southern comfort food is what you're after, The Olde Pink House should be at the top of your list. Practically an attraction in itself, the restaurant is housed within a blush-colored stucco mansion built in the late 1700s for James Habersham Jr., one of Savannah's early cotton brokers. Before becoming a restaurant, it was also the site of the First Bank of Georgia in the 1800s. Because of its unique history, eating here feels like taking a step back in time, with the whole house (both upstairs and downstairs) used for dining. After dinner, sneak down to the speakeasy-like cellar underneath the restaurant for a drink by the fireplace and to hear some tunes by a local pianist or jazz musician.", "Next up on your list: Leopold's Ice Cream. Though this 20th-century soda shop isn't as ancient as The Olde Pink House, it's still considered a Savannah institution, featuring some of the same fixtures (including the black marble soda fountain) from the original store. Come here for an old-fashioned milkshake or a double scoop of one of the shop's original ice cream flavors like Tutti Fruitti.", "Savannah is also home to numerous Black-owned restaurants serving up incredible comfort food. Check out Sisters of the New South for traditional Southern dishes like smothered pork chops and oxtail, or Geneva's Famous Chicken & Cornbread Co. for succulent fried chicken, wings and cornbread.", "Though Savannah has its fair share of deep-rooted eateries that act as the foundation of the area's dining scene, the city also manages to host a collection of more contemporary spots that receive just as much acclaim from visitors and critics alike. You'll be transported to Melbourne, Australia, at Collins Quarter, a cafe that features staples from the Australian owner's hometown. And for some Savannah-style barbecue, head to Sandfly BBQ. For a more contemporary take on Southern cuisine and farm-to-table menus, consider making reservations at Local 11 Ten or Cotton & Rye. ", "Savannah is home to a rollicking nightlife scene (in part because of its lack of open container laws), so plan to go for a pre- or post-dinner cocktail to sample some of the city's more unique venues. If beer is your drink of choice, head to Southbound Brewing Company (Savannah's first microbrewery) or Moon River Brewing Company (which features an outdoor beer garden). For inventive cocktails and mouthwatering martinis, try Treylor Park or Jen's & Friends. For a comprehensive overview of Savannah's unique dining scene, consider tagging along with a local on a food tour.", "Savannah is known for its Southern hospitality and in turn, is generally very safe. Visitors most likely will not run into any problems, especially in the touristy Historic District. However, you should still use common sense when exploring the area and keep an eye on your valuables. Use a cab if you're unsure of where you're going, and walk in groups. River Street, in particular, can get quite rowdy at night.", "The best way to get around Savannah is on foot and by car. This compact city of 22 squares, filled with lively fountains, eclectic sculptures, shade trees and flowers, is most easily (and enjoyably) explored by walking or biking. Driving will enable you to go where your feet can't, but be sure to come prepared with lots of quarters to feed the hungry parking meters. Savannah also operates a fleet of buses, which make stops throughout the city and its outskirts. Cabs and ride-hailing services are another way to get around, and these can be hailed or called ahead. Visitors can also take a free ferry ride to Hutchinson Island via the Savannah Belles Ferry. To get from the Savannah/Hilton Head International Airport (SAV), located about 10 miles northwest of the city, you can take a shuttle, bus, rental car or taxi."]}