{"name": "Aix-en-Provence", "description": ["At its core, Aix-en-Provence is a small Provençal town brimming with quaint cafes and vibrant markets. But its university students — tens of thousands of them — keep this southern French city young, exciting and cosmopolitan. There may be 18th-century homes flanking the streets, but the French boulevards are filled with chic Paris transplants. The still-popular Aquae Sextiae thermal baths may have been discovered in Roman times, but these therapeutic waters are accompanied by the on-site spa's latest in luxurious treatments.", "You visit Aix for all of these reasons, but also for the French-Mediterranean cooking, trendy boutiques, Cézanne's artistic influence and the city's overall easygoing and sunny disposition. An added perk is its proximity to the lavender fields, vineyards and mountains of Provence, as well as the Côte d'Azur. Daytrip, anyone?", "The best times to visit Aix-en-Provence are from March to May and September through November, when the weather is as moderate as the crowds. The summer months see an influx of Parisians and international travelers escaping to the south of France, so hotel and restaurant availability is scant and prices soar. Cost-wise, December to February is the best time to visit; many hotels offer lower rates since it's the low season. However, some hotels may shutter their doors during the quiet months, so be sure to call ahead to confirm they're open.", "Like their relaxed town, the Aixois are generally known to be friendly and easygoing. And because the town is home to many universities, hundreds of residents (temporary and year-round) are students. Aix is a popular study abroad destination, playing host to students of different backgrounds that speak different languages (including English), which can be helpful for visiting tourists. If you have a question, don't be afraid to ask someone. When you travel to a foreign country, it's good to learn at least a few phrases in the native language. Some helpful French includes: Bonjour (hello or good day); pouvez-vous m'aider? (can you help me?); parlez-vous anglais (do you speak English?); merci (thank you) and excusez-moi (excuse me/sorry/pardon me).", "The currency used in Aix is the euro (€1 EUR) but you can also use major credit cards here. Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. When you're out on the town, the bills in most bars and restaurants will include a service charge or tip (service compris). If it's not included, rounding out your bill with some change will suffice. In clubs and bars, you should also expect to tip washroom attendants about a euro. If you're taking a taxi, you should tip 5 to 10 percent. Reminder: If you see the phrase pourboire interdit, it means \"tips forbidden,\" so no need to shell out any extra euros there.", "Aix-en-Provence is a safe city, but tourists should be wary of petty crime and pickpockets. Always be aware of your surroundings and keep an eye on your belongings. At night, try not to walk alone and if it's late, take a taxi back to your accommodations.", "Restaurants around Aix-en-Provence serve up flavorful Mediterranean cuisine with chefs utilizing the fresh, local ingredients found at the markets in their menus. Popular plates you'll have to try include bouillabaisse (a traditional, Provençal fish stew), anchoiade or tapenade (anchovy or olive spread) and ratatouille. And save room for dessert. From chocolate croissants and crepes to tarts and calissons (special cookies made with almond paste and topped with icing), there's no shortage of sweets in Aix.", "Some recent visitors suggest lunch at Le Jardin d'Amalula (7 rue Mignet), praising the restaurant's exceptional food and prompt service. Popular Aix-en-Provence dinner spots that are lauded for their authentic Provençal fare and tasty regional wines are Mitch (26 rue des Tanneurs) and L'Alcove (19 rue Constantin).", "The best ways to get around Aix-en-Provence are on foot or by bike. The city is rather small and boasts a laid-back atmosphere, which makes it conducive to leisurely strolls and exploratory bike rides. You can also choose to rent a car so you'll be able to get to some of the attractions that lie just outside of town, like the Fondation Vassarely and Camp des Milles. Aix does have a bus system, but with its unreliable service, the bus is not the most convenient or efficient means of transportation.", "If you're already in Europe, taking the Eurostar or TGV train to get to Aix-en-Provence is an option. Departure times and prices vary, but you can consult the Rail Europe website to find information on both lines. The Marseille Provence Airport (MRS) in Marignane, around 17 miles southwest of the city's center, is the closest airport to Aix-en-Provence with flights usually connecting in Brussels, Frankfurt, Paris or Amsterdam. From the airport, you can either rent a car or take a taxi or shuttle bus to Aix."]}