{"name": "Jasper National Park", "description": ["One of Canada's wildest places, Jasper National Park provides kaleidoscopic panoramas at every turn. Travelers can marvel at many views as they trek from the peaks of Mount Edith Cavell to the caverns of Maligne Canyon. Located on the eastern edge of Alberta, the park serves as a beacon for adventurers in the Northern Hemisphere. Jasper boasts the distinction of being the largest park in the Canadian Rockies and was designated part of a UNESCO World Heritage Site, along with Banff and a handful of additional parks. With more than 2.7 million acres of land to explore, travelers are sure to spot animals ranging from caribou to wolverine to moose. ", "The park offers all the natural wonders you'd expect, including mountains and rivers and even glaciers, but the town of Jasper elevates the park's possibilities. In addition to serving as a convenient base camp, Jasper provides a variety of tours and excursions for travelers to utilize. Not to mention, winter in Jasper means travelers can enjoy cold-weather activities like skiing in Marmot Basin or snowshoeing through the backcountry. No matter the season, there's always a reason to visit Jasper.", "The best times to visit Jasper National Park are March through May and September through November. While traveling in these seasons may mean chillier temperatures (think: highs around 60 degrees and lows around 20 degrees), it's a small price to pay for a quieter and less crowded park. Plus, camping, hiking and mountain biking are all still options during the shoulder seasons. If you don't mind a crowd, the summer offers slightly warmer temperatures, with highs hovering around 70 degrees and lows around 45 degrees, plus the opportunity for water activities. Otherwise, winter-weather enthusiasts can take advantage of downhill skiing and snowshoeing, but cold-weather explorers should keep in mind that areas of the backcountry are closed for caribou conservation in the winter. ", "Rent a car All those acres mean that trailheads and scenic overlooks are spread throughout the park. While a bike ride can make for an excellent afternoon, renting a car makes exploring the expanses of Jasper a breeze.", "Plan ahead Busy season, from June to August, means activities book up exceptionally fast in and around Jasper National Park. Early planning can help guarantee you won't miss out on your must-do activities.", "Drive slow Roads in Jasper are populated by potential hazards, from oblivious elk to sudden cyclists on the shoulder. Snow and wildfires are both possible in the summer, while winter ushers in black ice and even more snow.", "Get out of town While downtown Jasper is centrally located, staying in a hotel can put a dent in any budget. Instead, opt for lodging in the nearby towns of Grand Cache or Hinton. Alternatively, rough it at one of the park's many campgrounds.", "Stick to what's free In the park, travelers are inundated with potential (and pricey) additional excursions. You'll want to pick a few paid expeditions, but don't forget that a majority of the opportunities at Jasper National Park are available to enjoy at no additional cost.", "Understand the entry fees Single-day admission into the park costs CA$9.80 (about $7) for adults, CA$8.30 (about $6) for seniors older than 65 and is free for those younger than 17. Groups of three or more travelers can save money by buying group passes, which cover up to seven people and cost CA$19.60 (about $15).", "Because of Jasper's location in the heart of a national park, the small town revolves around outdoor pursuits, so you can count on its friendly residents to recommend the perfect strenuous hike, steep ski run or scenic drive. While there is plenty to keep travelers busy during the day, nightlife in the national park leaves something to be desired. So settle in and enjoy the area's designation as the second largest Dark Sky Preserve in the world. (Dark Sky Preserves are places where no artificial lighting is visible, and active measures are in place to reduce light pollution from nearby areas.) The distinction means Jasper National Park is an excellent place to observe the stars.", "The Canadian dollar to U.S. dollar exchange rate fluctuates; plan to check it before your trip. Most hotels and restaurants accept major credit cards. Similar to the U.S., an average tip in Canada is 15 to 20 percent, depending on the quality and nature of the service. Taxi drivers, tour guides and hotel bellmen are accustomed to being tipped about 10 percent, too. ", "Adventurers in Jasper National Park may be comfortable packing their lunches, especially for long hikes or to save some money, but downtown Jasper does offer an impressive array of eateries to explore too. In fact, travelers would be remiss to skip the restaurants and bars around the park, which run the gamut from fine dining to large bars.", "The Fairmont Jasper Park Lodge serves as a stalwart of fine dining options downtown with its eclectic restaurants: ORSO Trattoria, Moose's Nook Chophouse and Oka Sushi. The three restaurants lead Jasper's culinary scene with distinct Italian dishes, chophouse meats and seafood, and fresh sushi. The Fairmont outpost also boasts a lounge, a terrace and a cafe.", "Another popular sit-down option among recent travelers is the Tekarra Restaurant, a cabin in the woods that offers a menu of uniquely Canadian delicacies like poutine, the iconic Canadian dish of french fries, cheese curds and brown gravy. Evil Dave's Grill is a more affordable choice, where diners can choose between meatloaf and shrimp lollipops (both diner favorites).", "Meanwhile, Coco's Cafe is the go-to option for fresh vegan, vegetarian and allergy-friendly dishes (with meat-friendly options as well). The cafe serves everything from huevos rancheros to vegetarian chili. The Stand Easy, Japer's Royal Canadian Legion, is another favorite watering hole for Jasper locals, where patrons can enjoy delicious a variety of beers alongside traditional bar bites like nachos or burgers.", "The best way to get around Jasper National Park is by car. A car is practically essential for exploring the more than 2.7 million acres that make up Jasper. Otherwise, travelers can take advantage of the three taxi companies that service the area or opt for a guided tour. All three options are also helpful in getting to Jasper National Park itself, which is about 240 miles west of Edmonton International Airport (YEG) and about 270 miles north of Calgary International Airport (YYC). Shuttles between the two closest airports and Jasper are also available.", "For a more scenic journey, travelers can pay a premium of about CA$300 (about $230) round trip to take Via Rail to Jasper via Edmonton or Vancouver. The train provides luxury accommodations and stunning views, but those who choose to ride the rails should also be prepared to find a way to get around after they arrive in Jasper. "]}