{"name": "Manchester", "description": ["If you could see what Manchester was like a couple of centuries ago, you would've viewed an industrial city as it churned out cotton. In fact, it was the world's first industrialized city. Sure, Manchester pays homage to its roots with a handful of museums and the preservation of some historic buildings, but Manchester hardly dwells in the past. Rather than cotton, these days, Manchester is cranking out a contagious energy. Today, the Capital of the North is defined by music – bands like The Smiths, Blossoms and Oasis all got their starts here. The city is also fervent about its soccer (or football, in the U.K.): In fact, Manchester United might well be one of the world's most revered teams. And when it comes to food, you'll find that Manchester's restaurant scene is experiencing new energy. It's known for its vegan and vegetarian cuisine, as well as halal.", "The best time to visit Manchester is between June and August when the weather is warm and the city's events calendar is packed. The months between September and December act as a sweet spot before the rather dreary low season of January and February. March through May is another shoulder season when temperatures begin to rise. ", "Manchester is an ancient city Its history dates to A.D. 79 when the Romans built the Mamucium fort. But that doesn't mean Manchester is stuck in the past.", "Hop on the bus The Manchester free bus provides complimentary transportation around the city center, making it easy to access top attractions like John Rylands Library, the National Football Museum and the Manchester Art Gallery, among others.", "Don't even think about criticizing the beloved Manchester United or Manchester City football teams. Even though locals are known for their hospitality, they're also very loyal to their football teams.", "Although the official language in the U.K. is English, you might be surprised that some locals are hard to understand, as Manchester has its own unique dialect. They also use a number of words in different contexts. For example, \"scran\" is another word for \"food.\" Or to say, \"That's great,\" a local might say, \"That's mint\" or “It's top!\"", "When it comes to currency, you'll be using the British pound sterling. Since the pound to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops. And in case you're wondering about tipping, here are the rules: In sit-down restaurants, it has become customary to tip about 10%. In a taxi, rounding the fare to the nearest 1 pound (about $1.30) should be sufficient. No tip is expected in bars and pubs.", "The British are generally reserved and polite and generally don't do a lot of touching. You'll want to be sure to shake hands, with a light touch (unlike Americans who prefer a firm handshake), and keep your hands (not elbows) on the table during meals. The British also like their personal space, so don't stand too closely.", "Manchester has a vibrant restaurant scene. Check out its food halls and food markets at establishments like the Altrincham Market food hall where you can choose from multiple purveyors, or nosh on street food and craft beer at GRUB Food Fair open every Friday and Saturday. Don't miss The Corn Exchange, which houses multiple restaurants inside a beautiful building. We also recommend trying some Indian food on Curry Mile in Manchester, which has the highest concentration of Asian restaurants in the U.K. ", "When it comes to drinks, grab a pint or two at The Oakfield, a British pub in Chester Zoo or The Eagle Inn in Salford close to Victoria train station. For an upscale bar, Cloud 23 at the Hilton Manchester Deansgate has the city's highest views (on the 23rd floor of the hotel) with floor-to-ceiling windows. It offers light bites and desserts. And this city is especially known for its beer, boasting more than 30 breweries within striking distance. You can even tour some like Dunham Massey Brewing Company and Martland Mill Brewery, among others.", "Manchester is a pretty safe place to visit, but as with all major cities, you should keep your valuables out of sight to protect against pickpockets, muggers or \"snatch and grabs\" of phones, bags and jewelry. The most violent crimes occur in the city's Gay Village neighborhood. Picadilly Gardens also sees a high number of crimes, so take extra precaution in these areas. If you're taking taxis, make sure they are the licensed black cabs from a taxi rank. Terrorist attacks in Europe have also been on the rise; in 2017, 23 people died following a bombing at a concert at Manchester Arena. The U.S. Department of State advises signing up for STEP (the Smart Traveler Enrollment Program) to stay updated on security threats.", "The best way to get around Manchester is on foot due thanks to the city compact layout. It's also easy to get around by bike with many dedicated bicycle lanes. If you get tired, hop on a Metrolink tram, which can reach most places in the city quickly and efficiently. There's also a free bus network, covering most of the city center. If you need to get somewhere quickly, you can always rely on the city's regulated black taxis.", "Manchester Airport (MAN) is the city's closest airport (located 10 miles south of the city center), and the U.K.'s third-largest airport. Direct flights are available from many U.S. cities. You can take a black taxi from the airport to the city center for around 22 to 28 pounds (roughly $29 to $37) to travel 10 miles. You can also take a train to Manchester's Piccadilly Station or a Metrolink tram; trains run between the airport and the city center roughly every 10 minutes with one-way trips costing approximately 3 pounds (about $4) online. Metrolink trams, which run every 12 to 15 minutes, take airport travelers to Cornbrook outside the city center, and you can take a variety of trams into the city center from there.", "If you're coming from London, trains to Manchester leave from London's Euston station; the 200-mile trip takes around two to three hours. You can also get from London to Manchester by bus; a number of different coach companies offer the service, including Megabus and National Express.", "United States citizens will need a valid passport valid for the duration of your stay in order to visit the U.K. Note that U.S. citizens do not need a visa unless they plan on staying in the U.K. longer than six months. Visit the U.S. State Department's website for more information."]}