{"name": "Banff", "description": ["If you're itching to experience the lifestyle of a Swiss skiing village, but don't want to fork over the cash for a transatlantic flight, consider Banff. Thanks to its location in the heart of the Canadian Rockies near the southeastern border of Banff National Park – Canada's first national park – taking trips here will decrease not only your flight time from the U.S., but also your expenses. Banff caters to everyone from intrepid explorers who prefer to end the day in an upscale hotel, to tent and RV campers who fill the campgrounds from summer to fall. There’s even one campground that’s open year-round: Tunnel Mountain Village 2. ", "Opportunities for adventure abound, so pick your sport: Ski down Mount Norquay, mountain bike along Healy Creek or take a day hike to admire the massive, free-standing limestone pillars known as the Hoodoos from a distance. When you are exhausted, retreat to your cozy (and warm) resort, and replenish yourself with a delicious bison burger or a chocolate fondue.", "The best times to visit Banff are June to August and December to March. Nature lovers will want to get to the park when the weather is warm and welcoming (and while the hotel rates in town are at a reasonable level). The skiers, however, will want to vacation in the height of winter. Depending on what you want to do, Banff can be seen as an almost year-round destination (although fall can be a bit of a gamble). Temperatures fluctuate dramatically throughout the year; average winter temperatures can range from the single digits to the low 30s. During the summer, average temperatures can range from 40 to 70 degrees Fahrenheit. No matter when you choose to visit, plan to wear sunglasses, a hat and plenty of sunscreen to protect against UV exposure: The sun at these alpine altitudes is strong.", "You'll need a daily or annual national parks pass Banff town (and most local attractions) sit inside Banff National Park, so you'll need to buy a parks pass if you drive in or take public transportation. You can purchase the pass online, at the park gates or at the Lake Louise Visitor Centre. Daily passes start at $11 per adult.", "You'll spot wildlife Animals are often seen around the Lake Minnewanka area, the Fairmont Banff Springs Golf Course, the Bow Valley Parkway and Lake Louise Ski Resort.", "You'll need layers Temperatures can change rapidly in Banff, which is why it's best to wear layers even in summer. And don't forget to layer on the sunscreen: because of the alpine altitude, there's higher UV exposure from the sun.", "Sleep outside During the summer, camping in the national park is a cost-efficient alternative to overpriced hotels and a means to immediately access the wilderness that you came to explore.", "Consider the Big3 Season Pass If you know you're going to ski at all three of the area's resorts (Banff Sunshine Village, Lake Louise and Mount Norquay), you may want to purchase this pass, which grants you access to all three, plus discounts on rentals, dining and lessons, among other perks.", "The first Swiss guides arrived in Banff in 1900, hired by the Canadian Pacific Railway to guide tourists who were new to the sports of hiking and skiing. They brought their cuisine with them, and for many years, hearty, meat-heavy dishes of wild game, such as elk, bison, venison and trout, formed the bedrock of Canadian Rocky Mountain dining. Cheese, meat and chocolate fondues were also ubiquitous. These calorie-laden dining options can still be found around town and are welcomed by backcountry hikers after a day of conquering once-in-a-lifetime peaks. Lately though, the Banff restaurant scene has exploded with a plethora of international and fusion restaurants.", "Vegan and vegetarian dishes can now be found on virtually every menu, from casual eateries in downtown Banff to the decidedly upscale dining experiences in the AAA award-winning hotels perched on the snow-covered mountainsides surrounding the town. Several restaurants are as notable for their incredible views as they are for their innovative cuisine.", "Family-friendly fast food venues have also found a foothold in Banff, including budget-friendly hamburger joints, pizzerias and doughnut shops that open early for hikers and stay open late for partygoers. Because Banff is a favorite destination for weddings, it's not unusual to see bachelorette and bachelor parties celebrating at one of the new breweries or distilleries in town, where glacier-fed springs are turned into craft beers and sparkling cocktails. Their affordable menu options are worth a visit.\n ", "Some of the major safety issues facing intrepid explorers of Banff National Park include altitude sickness, weather-related ailments and animal encounters.", "Those who are not used to mountain climates may find themselves experiencing symptoms of altitude sickness, the most common being dizziness, headache, nausea and fatigue. Give your body time to adjust: Don't overexert yourself physically for the first day. Instead of an intense hike, plan on a leisurely stroll. Also, make sure to drink plenty of water, and remember that changes in altitude will cause your body to react differently to alcohol.", "Because of its location, Banff Town and Banff National Park experience cold, snowy winters. Dress in layers if you head into the park. It's always a good idea to bring an extra set of clothing in case you get wet. Also, make sure you bring a hat, scarf and mittens to avoid getting frostbite on your ears, nose and fingers.", "The park is home to many large animals, including bears. If you're hiking on your own, make plenty of noise (talking, shuffling branches) to warn animals of your presence. Avoid getting too close to wild animals, no matter how docile they may seem. Parks Canada says that bear attacks are extremely uncommon. However, if you do encounter a bear on the trails, you should not run. Instead, avoid eye contact and back away slowly while making noise and, most of the time, the bear will lose interest. Parks Canada also recommends carrying bear spray, a form of pepper spray used to forfend aggressive bears.", "The best way to get around Banff is on foot. But when weather prevents the casual stroll, this small resort town also has a bus system that is easy to use. Even more convenient, your hotel will most likely offer a complimentary shuttle that services the town and ski areas. All three ski hills also offer complimentary shuttle between the hills and the town of Banff. The closest airport, Calgary International Airport (YYC), handles most major airlines; from there you could rent a car to drive the 90 miles west to Banff or hop on the Banff Airporter, a shuttle that transports visitors from the Calgary airport directly to their hotel."]}