{"name": "Tucson", "description": ["Tucson is an exceptionally sunny city surrounded by mountains on several sides, with more than 340 days of sunshine a year. And with daytime temperatures rarely dipping below the mid-60s, Arizona's second-largest city makes a great place to escape the cold winter weather. But Tucson is much more than an incubator for snowbirds. Deeply rooted in Hispanic heritage, \"Old Pueblo\" (a nickname for Tucson) is a hotbed of historic and cultural attractions, not to mention a mecca for those in search of some spicy Mexican cuisine north of the border. In fact, Tucson was named a UNESCO City of Gastronomy (the first in the U.S.) for its rich agricultural history, culinary distinctiveness and vibrant food traditions.", "Despite its ever-expanding size, Tucson exudes a small-town atmosphere. Neighborhoods like the El Presidio Historic District and the Barrio Histórico – complete with colorful adobe buildings and quaint shops – make you feel like you're in a traditional Mexican village. Meanwhile, the high-end restaurants and resorts of the Catalina Foothills district add a contemporary flair that may soon rival that of Phoenix's ritzy suburbs like Scottsdale. And the trendy shops and rowdy bars surrounding the palm tree-laden University of Arizona campus infuse this city with a youthful spirit. Unlike the sprawling state capital, Tucson has yet to overpower its surroundings; nearby mountains and wilderness areas like Saguaro National Park offer a true taste of the Sonoran Desert.  ", "The best times to visit Tucson are from April to May and from September to October. These shoulder seasons offer pleasant weather and reasonable room rates. Winter's sunny skies and comfortable temperatures attract thousands of northerners in need of a thaw. And the summer months offer spectacular hotel discounts, but temperatures often hover in the triple digits for months, making outdoor activities insufferable.", "Beat the heat Prepare for scorching temperatures if you're visiting between May and September. What's more, most attractions reduce their hours in the afternoon during these months. Make sure to always have a full bottle of water and to reapply sunscreen regularly.", "This is a college town The University of Arizona dominates a large portion of Tucson, and school spirit is strong. Expect heavier traffic and a rowdier atmosphere on football or basketball game days.", "Consider a summer trip Although the weather can get unbearably hot, hotel rates drop as much as 60% from winter to summer. And if you visit in May or September (the shoulder season), you'll find both low rates and bearable temps.", "Fly into Phoenix The Phoenix Sky Harbor International Airport is a larger, more trafficked airport than Tucson International Airport. You'll save on airfare if you fly into Phoenix and either drive or take a shuttle to Tucson, which is about 120 miles southeast of Phoenix.", "Get a passport For $25, the Tucson Attractions Passport will grant you an assortment of deals at popular attractions like the Arizona-Sonora Desert Museum and Saguaro National Park. There is also a free mobile app with more deals.", "In December 2015, Tucson became the first UNESCO City of Gastronomy in the U.S. It earned this distinction thanks to its far-reaching food hertiage, which dates back 4,000 years and incorporates both Mexican and Native American traditions. To get acquainted with the ingredients local chefs rely on to build their menus, consider visiting a farmers market or two (St. Philip's Plaza Market and Heirloom Farmers Markets - Rillito Park are both popular among locals). And when you're dining out, look for ingredients like cactus, chiltepin and prickly pear to get a feel for Tucson's distinct flavor.  ", "It should come as no surprise that Mexican cuisine is Tucson's specialty. In fact, Tucson boasts \"the best 23 miles of Mexican food,\" a string of restaurants even die-hard foodies won't finish in a long weekend. You'll encounter smoky, sweet and spicy flavors throughout your visit, so prepare your taste buds. El Charro Café is an institution that's been around since 1922 and serves classic dishes like tamales, tacos and enchiladas. For even more tamales, head to the Tucson Tamale Company, which is a staple for locals. If you're looking for a more upscale dinner, try Penca, offering fusions of Central Mexican cuisine with centuries-old flavors of the Sonoran Desert.", "Mexican flavors may be the backbone of the city's culinary scene, but that's not all Tucson has to offer discerning foodies. Visitors and locals rave about the breakfast served at Cup Cafe, which sits inside a downtown hotel and serves a menu of inventive American favorites. For an even more eclectic menu, consider making reservations at Feast, which is praised for its inventive flavor pairings and extensive wine list. Wildflower is another new American favorite that often surprises diners because of its location within a strip mall. ", "When you're not getting to know Tucson through its distinctive eats, consider sampling the region's wine. Arizona wine country sits about an hour away from the city in the southern Arizona villages of Sonoita and Elgin, and the eastern town of Wilcox. For an easy daytrip to sample some local vino, book a guided and chauffeured trip with Arizona Winery Tours – one of the best Arizona tours.", "The best way to get around Tucson is by car. Although there are several public transportation options, you'll need your own wheels to reach top sites like Saguaro National Park and the Arizona-Sonora Desert Museum. Rental rates are reasonable, and there are rental companies in town and at the Tucson International Airport (TUS), which is located about 10 miles south of downtown.", "Although you can choose to fly into the Tucson airport, you'll find that airfare to Phoenix is cheaper (and may not require any layovers, depending on your departure destination). You can choose to rent a car and drive the 110 miles or so – southeast along Interstate 10 – to Tucson, or you can hop on the Groome Transportation shuttle, which will cost about $50 each way, depending on when you book and your final destination."]}