{"name": "Dominica", "description": ["Dominica is the Caribbean's best kept secret. Its towering mountains, lush green forests and winding rivers are practically begging for exploration. Plus, there are no chain resorts (yes, none) and limited nightlife; in fact, commercial development of any kind is extremely sparse. But if you've heard of this island, you know that you don't visit for only the resorts and beaches. Instead, Dominica attracts the adventurous eco-tourist that treasures authenticity while on vacation. And despite the deepening of the island's main port to accommodate large cruise ships, Dominica is adamant in its preservation and conservation of local forestry and wildlife, more so than any other islands in the region. In fact, the island is considered one of the most pristine and well-preserved spots in the Western Hemisphere. This makes Dominica's many unique natural features great destinations for outdoors and nature enthusiasts, as well as shutterbugs, but the island probably ought to be avoided by travelers who are particularly averse to hiking.", "Keep in mind: Dominica is still recovering from Hurricane Maria, which struck the island September 2017. While almost all of the major tourist destinations have been reopened, many hotels and tour groups are still offering voluntourism packages to speed up the recovery process.", "The best time to visit Dominica is from October to January, when the hotel rates are lower and the humidity is less stifling. Temperatures see little variance, with monthly averages residing around 70 and 80 degrees Fahrenheit. Dominica's rainy season occurs between August and October, and the island is susceptible to hurricanes and tropical storms this time of year, with peak hurricane season taking place between late August and early September.", "Dominica's culture is shaped by a combination of French, African, European and Creole ancestry. You'll find that many of the island's roads and attractions can be named in either English or French, while African language, foods and customs are mixed with their European counterparts. Dominicans, many of which are of African descent, are generally friendly and welcoming. You'll get a taste of Dominica's diverse culture if you're around for its annual celebrations, including Carnival and the World Creole Music Festival. There are also prolonged celebrations around Dominica's Independence Day, Nov. 3.", "English is the official language of Dominica, and it is universally spoken and understood. Dominica’s economy was originally based on agriculture (specifically bananas) but has shifted toward tourism in recent years. Despite this change, Dominica still has the fewest visitors out of the 22 Caribbean islands who track tourists.  ", "The East Caribbean Dollar (XCD), which is used on eight total islands, is Dominica's official currency. One East Caribbean Dollar is equal to approximately $0.37 but the East Caribbean Dollar to U.S. dollar rate often fluctuates, so check the latest exchange rate before you go. The U.S. dollar, the euro and the British pound are also all widely accepted. Money can be exchanged for East Caribbean Dollars at the banks throughout the island or withdrawn from ATMs at the airport or in some hotels. Major credit cards are accepted in most transactions, but some small vendors may only accept local currency.", "As far as restaurants go, your best bet is Roseau (Dominica’s capital and largest city), where you can find affordable Caribbean cuisine, as well as some standard European fare. Many of the best spots to grab a bite are hole-in-the-wall eateries scattered throughout Roseau. The downtown market sells freshly caught seafood, including conch, a type of snail that is a favorite Dominican dish. Other specialties include tee-tee-ree (small fish cakes) and crab backs as well as pumpkin soup, fried plantains and goat water, a rich stew made from goat meat.", "Kozy's Niche is a tourist favorite in Roseau. Diners praise its exceptionally accommodating service and fusion of Italian and Caribbean. Must-try dishes, according to recent visitors, include lionfish and grilled mahimahi.", "For those visiting the popular Trafalgar Falls, be sure to grab a meal at the Papillote Rainforest Restaurant. While the menu at this restaurant consists primarily of seafood (and receives rave reviews), the main reason for a visit to this specific eatery is its ambiance. Visitors can enjoy their meals in an actual rainforest, where the line between the Papillote Rainforest Restaurant’s one-of-a-kind exterior and its cozy interior is easily forgotten. ", "If you’re just looking for a drink or small plate, check out the Ruins Rock Cafe in Roseau. Previous visitors say that it has the best rum on the island. The cafe also offers a variety of fruit juices. ", "Dominica is a safe island in the Caribbean; tourist-targeted crime is rare and residents are more than willing to help you out. Common sense always prevails though, so be sure to keep close track of your valuables and lock your rental car when driving or parked.", "Dominicans are faster and more aggressive drivers than most Americans, plus the roads are often twisted and pothole-laden. Add in the fact that driving is on the left and many tourists face a culture shock on their first foray behind the wheel. Unless you have an adventurous spirit, many experts suggest you leave the driving to residents and seasoned visitors. Take a taxi instead, as they're inexpensive and easy to come by in the daylight hours.", "Dominica also has a reputation for clean water; those who live on the island often get their supply from roadside springs. We’d recommend steering clear of both roadside springs and tap water (which is heavily chlorinated, but otherwise safe), and asking for bottled water to avoid any health issues.", "The best way to get around Dominica is by taxi or car since the top activities are fairly spread out. Those who opt not to travel by automobile will end up confined on the southwest coast in Roseau. Rental cars and taxi services are available in downtown Roseau and at the island's two airports. And speaking of airports, there are no direct flights from the United States to either the Douglas–Charles Airport (DOM) or the Canefield Airport  (DCF). Instead, visitors from the U.S. and Canada will have to resort to island-hopping from Puerto Rico, Antigua, Barbados, St. Lucia, Martinique or Guadeloupe. Most visitors fly into the island's larger airport, Douglas–Charles, which sits on the northeastern side of the island, about an hour north of the capital city of Roseau.", "A valid passport is required for citizens of the United States traveling to Dominica. Immigration officials might also ask for proof of a return or onward flight, and they will charge a departure tax as visitors leave the country. Children 12 years old and younger do not need to pay the tax. Tourist visas are not required for stays less than six months. For more information on entry and exit requirements, visit the U.S. State Department's website."]}