{"name": "Bora Bora", "description": ["The small island of Bora Bora (just about 6 miles long and a little more than 2 miles wide) overflows with beauty. A dormant volcano rises at its center and fans out into lush jungle before spilling into an aquamarine lagoon. In fact, author James A. Michener, who wrote \"Tales of the South Pacific,\" called Bora Bora \"the most beautiful island in the world.\" The views of Bora Bora's vibrant blues and greens seen from above as you fly into Bora Bora's outer island airport make it worth visiting alone. The 18th-century British explorer James Cook even coined it the \"Pearl of the Pacific.\" The very definition of a tropical getaway, blissful Bora Bora abounds with luxurious resorts, sunny skies, warm waters and a laid-back way of life.", "And as you might've already guessed, the main industry on this petite island in French Polynesia and its swarm of tiny motu (islands) is tourism. To that end, you can snorkel with manta rays, scuba dive along coral reefs, explore the boutiques and markets in Vaitape (Bora Bora's main port), hike Mount Pahia and watch the sunset from the deck of your overwater bungalow. But there's a catch: Bora Bora is expensive – very expensive. In short, visit Bora Bora for natural beauty, visit for utter relaxation and visit if you have the money.", "The best times to visit Bora Bora are November and April. These short shoulder seasons offer fine weather with temperatures in the mid-70s to mid-80s. High season runs from May to October when rain showers are isolated and the number of tourists swells thanks to the sunny skies. Low season stretches from December to March when the weather is wet and visitors become mosquito bait. But really anytime is a good time to visit Bora Bora, since the weather is warm year-round.", "It's all about the lagoon Here's a secret: While Bora Bora's beaches are worth lounging on, you'll want to spend plenty of time cruising the turquoise waters of the lagoon.", "Try the miracle oil Pick up a bottle of all-purpose monoi, an oil made from coconut and tiare blossoms. It serves as a leave-in hair conditioner, a moisturizer and even a salve for insect bites.", "Visit in the offseason The room rate for an overwater bungalow in Bora Bora can exceed $1,000 a night, but you can find lower rates if you visit during the wet season, which falls between December and March. The only exception to this rule is the Christmas and New Year holidays.", "Bring your own alcohol And pack lots of sunscreen. Many shops on the island sell alcohol and basic necessities – such as sunscreen and bug spray – at high prices, so make sure to pack in surplus.", "The main languages in Bora Bora are French and Tahitian, but you'll find that many people also speak English, especially resort employees. French Polynesians move at a relaxed pace. They have a life philosophy called \"`Aita pea pea,\" which means \"not to worry.\" Try to go with the flow and enjoy life at a slower clip.", "Protestant missionaries, who came to the island in the 19th century, have heavily influenced the religion in Bora Bora: Christianity continues to play a major role in the island's culture. If you're interested, you might stop into the Église Protestante Maohi (Maohi Protestant Church) in Vaitape, which has roots dating back to the late 1700s.", "Since 1946, French Polynesia (a group of islands of which Bora Bora belongs to) has been an overseas territory of the French Republic. But French Polynesia has a lot of autonomy, which you'll see in everything from their currency to taxation. The official currency of Bora Bora is the French Pacific franc (CFP). One U.S. dollar is equivalent to approximately 110 CFP.", "Seafood features heavily on the menus of Bora Bora restaurants, and travelers would be remiss if they didn't try some of the local specialties, namely poisson cru, or raw tuna that has been marinated in lime juice and coconut milk. If you're keen to taste tropical fresh fruits, you'll find them at the markets along the road near Vaitape.", "Bora Bora's most popular, traveler-approved fine dining establishments are found within the five-star resort grounds or within a few miles of Vaitape. For a cheaper dining experience, visitors might want to stop by a beachside roulotte (think: food truck) for some inexpensive local fare. The best roulottes are found just outside of the Art Center of Vaitape. Embrace island time and jump in the queue with the longest line – there's often a delicious reason for its popularity.", "The best way to get around Bora Bora is by bike, especially when you consider that the entire island only takes a few hours to traverse. Rental cars are another option, but they cost significantly more than a rental bicycle. The local bus system, Le Truck, is notoriously unpredictable and taxis are quite expensive. Many restaurants offer free pickups and drop-offs around the main island. With a little planning, you could get from point A to point B with a meal stop in between.", "To get to Bora Bora, most travelers fly into Bora Bora Airport, also known as Motu Mute Airport. If you're coming from the U.S., you'll first stop at the Faa'a International Airport in Tahiti. Once you've cleared customs, you'll hop on a 45-minute flight to Bora Bora Airport, which is located on a small islet called Motu Mute, just northwest of the main island. From here, you'll have to take a quick catamaran ride to reach your final destination at Bora Bora's Vaitape quay (free). Many resorts offer airport transportation; check to see if yours does before your own making arrangements. Many resorts also offer transportation between Vaitape and the hotel.", "To visit French Polynesia, you'll need a U.S. passport valid for six months beyond the duration of your trip. If you're planning to stay in the country for more than 90 days, you'll also need to acquire a visa. For more information, visit the U.S. State Department's website."]}