{"name": "Quebec City", "description": ["The sight of winding cobblestone streets and towering cathedrals; the sound of French pleasantries and tourists' \"Oohs;\" the smell of fresh-baked bread and pungent cheese; the taste of creamy cafe lattes and buttery croissants. All your senses agree: You're in France. But they're wrong: You're in Québec.", "Québec City – the capital of the Canadian province, Québec – dwelled in the shadow of its neighbor, Montréal, for a long time, but the 2008 celebration of its 400th birthday catapulted Québec City back into the spotlight. Since then, travelers have flocked here to experience this UNESCO World Heritage Site's charm for themselves. Upon passing through the fortified walls of Old Québec, you'll discover a world straight out of a European painting: 18th- and 19th-century buildings house bakers, bistros and boutiques, while cobbled squares are drowned by a sea of cafe tables. And around every corner, a piece of Québec City's rich heritage awaits discovery.", "The best times to visit Québec City are June through September and December through February. During the summer and winter months, the city's social calendar is booked solid with festivals. Summertime is the most popular time to visit due to the warmer weather, but the Québécois relish winter's icy winds, protecting themselves from the cold weather with hefty parkas and plenty of coffee from a local cafe. The spring and fall shoulder seasons see fewer tourists because of the lack of special events, but that means travelers can take advantage of low rates as well as seasonal perks: Springtime is maple syrup season, while autumn dazzles with colorful foliage.", "Bienvenue à Québec Although French is the dominant language in the province, anyone in the hospitality industry will speak English almost fluently, and most residents speak a little English.", "You don't need a car Québec City is relatively compact, and public transport is extensive. Unless you're planning on taking day trips from the city, you will not need to rent a car here.", "Slow down and relax Much like the French, the Québécois are rather laid-back. The leisurely pace of the Québécois may annoy some Americans, especially those who are used to doing everything on the run; to fit in, you're going to have to slow down.", "Book a bed-and-breakfast Within the walls of Old Québec lie a handful of charming bed-and-breakfast accommodations. Although there isn't a huge price gap between these accommodations and other small hotels outside the walls, you'll certainly appreciate the convenient locale.", "Use your feet Québec City is compact enough to explore on foot, so save yourself the money and hassle of renting a car. And if you're in a hurry, the leBus operates several routes throughout downtown, and rides are only CA$3.40 (about $2.50) for a general ticket, or CA$3.75 (about $2.79) if you pay in cash.", "Québec City's 400 years of history and growth have led to a vibrant downtown rich in culture and teeming with festivals, walkable streets, museums, cafes and restaurants. Named a UNESCO World Heritage site in 2008, Québec City is the only walled city north of Mexico, and its French roots, castle-like architecture and historical Old Québec add to its European vibe. The city's updated bus system, popular shops and restaurants and sprawling Plains of Abraham give the city a modern feel, though, marrying the old with the new to create a hip, yet refined culture that attracts visitors and locals of all ages.", "Québec City is located in the French-speaking province of Québec. Although you won't have any trouble finding English speakers here (Canada has two official languages – English and French), you may want to come prepared with a few French phrases, such as \"bonjour\" (\"hello\"), \"s'il vous plaît\" (\"please\") and \"merci\" (\"thank you\").", "The official currency here is the Canadian dollar, which is roughly equivalent to the U.S. dollar. When it comes to most other cultural factors, including dress, restaurant and tipping etiquette, Québec City does not differ greatly from major American cities.", "Québec City's cuisine has strong French ties, which can be found in its hearty stews, meat pies, specialty chocolate shops, bakeries, crêperies and cafes that fill the streets. A popular dish to try is poutine: French fries smothered in fresh cheese curds and topped with a hot gravy. ", "For a distinctly Canadian meal, head to La Traite; the restaurant's menu features ingredients that have been locally caught or picked. Located in a building that dates back to 1677, Aux Anciens Canadiens' waiters don period-style clothing and serve authentic dishes that feature locally produced maple syrup. Le Clocher Penché's weekend brunches are also popular for visitors and locals alike. ", "The best way to get around Québec City is on foot. Once you pass through the walls of Old Québec, nearly everything you wish to see or do is within walking distance. But if your feet grow weary or the weather is just too chilly, the city's Métrobus shuttles visitors around the historic area with three different routes (1, 11 and 25). And for excellent views, consider a ride on the funicular, a steeply sloping railway connecting Haute-Ville (Upper Town) and Basse-Ville (Lower Town). You do not need a car in Québec City, but if you plan on taking a day trip or two, you can rent a car in town or at the Jean Lesage International Airport (YQB), located about 8 miles west of Old Québec. Another option for exploring is by bike. A series of bike paths start from the Old Port area and travel along the river and out to the suburbs.", "A passport is required for citizens of the United States to travel to Québec City, and to re-enter the country. If you are planning to drive, you must produce a passport, passport card or NEXUS card that allows expedited border crossings for both private and commercial travelers through Canadian and U.S. border controls. For more information, visit the U.S. State Department website."]}