{"name": "Fiji", "description": ["With its turquoise waters, glittering sands and luxe resorts, Fiji is similar to many other tropical getaways. Likewise, the set of 333 islands caters to lovebirds of all kinds. Plus, adventure-seekers, like surfers and divers, appreciate the archipelago's quality waves and coral reefs. But Fiji differs from other island destinations in its otherworldliness. Since it's more than 1,300 miles from New Zealand's North Island in the South Pacific Ocean, Fiji affords you the delectable feeling of seclusion. You'll be as far from reality as possible when you're sipping Fiji Bitter beer and watching the sun dip below the horizon. Fijian customs will make you feel a million miles away too: Ever tasted the dizzying kava drink? Or watched men defy fire and walk across scalding stones without burning their feet? If not, it's about time you did.", "The best time to go to Fiji is whenever you have the chance. This is Fiji we're talking about! Temperatures stay pretty constant through the year, with highs resting in the 80s; however, from November to April, you might have to contend with some tropical storms. For the Fiji experience that you've always dreamed of, the best time to visit is from July to September, but you will have to contend with sky-high prices as this is also peak season. The shoulder seasons are short – May to June and October – but they're nice times to visit since heavy crowds will either have just departed or have yet to descend.", "Although Fiji's official language is English, you will endear yourself to the friendly Fijians by learning a few words of their native Fijian tongue. \"Bula\" (pronounced mboo-la) is \"hello\"; \"vinaka\" (pronounced vee-nah-kah) means \"thank you\"; “kere kere” (kerry kerry) is “please”and \"moce\" (pronounced mow-they) is \"goodbye.\" If you're staying at a resort and choose to venture into town, dress modestly. When going to a village, avoid wearing a hat, as it will insult the village's chief.", "There are two safety concerns to keep in mind when visiting this tropical paradise: earthquakes and bug bites. Because Fiji is located in an area of seismic activity, earthquakes (that in turn cause tsunamis) are a possibility (albeit a very rare one). The more common threats are insects. Fiji has had reported cases of Zika, according to the Centers for Disease Control and Prevention, so talk to your doctor about potential risks before you leave. During rainy season, visitors should also be aware that they can contract the dengue fever from infected mosquitoes. Make sure you are sufficiently covered in bug repellent, especially at night. You'll also want to consult the CDC for potential vaccines.", "Fiji offers a variety of cuisine despite being a remote destination. Aside from seafood, Fiji has international cuisine ranging from Italian to Japanese. For some traditional Fijian food, try lovo: meats and vegetables wrapped in banana leaves and baked directly on hot stones. Recent travelers suggested heading to Nadina Authentic Fijian Restaurant at Port Denarau Marina to try lovo. (Bonus: Several travelers said that a local recommended the restaurant to them.)", "No trip to Fiji would be complete without sampling kava, a traditional Fijian beverage. It is made with the pulverized roots of the cava plant and mixed with water. Traditionally, it is served in a coconut shell cup and shared with friends. And if sampling local cuisine isn't enough of a reason to try it, kava may also help to reduce anxiety, which will help get you on Fiji time in no time.", "The best ways to get around Fiji are by bus if you want to explore one of the archipelago's islands, or by ferry if you want to island hop. You can also get to other islands by plane, but this mode of transport is more expensive. Driving a rental vehicle is a good option if you're staying on one of the few islands with acceptable roads, but you can also hire a taxi. You can walk around your choice resort or in Fiji's cities, but to traverse a particular island, walking is not an efficient method. Many international travelers fly into Nadi International Airport (NAN) or Nausori Airport (SUV), both of which can be found on the main island of Viti Levu.", "You'll need a passport that's valid for at least six months after your departure date to visit Fiji. You may need to show proof of return or onward travel, as well as proof of sufficient funds for your trip. For more information, visit the U.S. State Department's website."]}