{"name": "Birmingham", "description": ["Once a center of the iron, steel and railroad industries, this Alabama metropolis shares its name with Birmingham, England, a city with a similar industrial heritage. Many of the city's top attractions pay homage to its mining past, including Red Mountain Park and the Vulcan Park & Museum. This southern city was also at the epicenter of the civil rights movement, and visitors will want to explore the Civil Rights District and some of its significant attractions, including the 16th Street Baptist Church and the Civil Rights Institute.", "Once you've familiarized yourself with Birmingham's past, get to know its present-day identity. Check out the excellent art museum and then head to Railroad Park, known as \"Birmingham's Living Room,\" to socialize with the locals. More than one-fourth of Alabama residents call this vibrant city home, known today for its live music scene, verdant parks and championship golf courses. You'll also find an array of antique stores and art galleries, as well as a burgeoning food scene. ", "The best times to visit Birmingham are spring and fall, from March through May or September through November. Not only are these shoulder seasons easy on the wallet, but the weather is also great for outdoor activities like hiking and golfing. If you're really budget-conscious, a visit during the winter months from December through February is the most inexpensive. Winters are not brutally cold in this part of the southeastern U.S. and the average annual snowfall is around 2 inches. Summer is high season for tourists and can be incredibly hot and humid. ", "Voted the top up-and-coming food city in 2016 by Zagat's followers, Birmingham is about much more than barbecue and fried pies – those sinful crescents filled with fruit and pan-fried for a crispy crust – these days. Although you can still enjoy some down-home cooking, you'll want to check out some of the city's top restaurants, including those of James Beard Award-winning chefs, Frank Stitt and Chris Hastings.", "Stitt's Highlands Bar and Grill is the go-to for special occasions, offering French-inspired cuisine with a Southern twist, from Alabama oysters and fried quail to stone ground grits with prosciutto and mushrooms. If you're craving some mussels, steak frites or a croquet-monsieur, stop by his French bistro Chez Fonfon. Seeking Italian comfort food? Head to Stitt's Bottega. Chef Chris Hastings also operates two of the most popular eateries in the city, the Hot & Hot Fish Club and OvenBird. Hot & Hot Fish Club serves upscale Southern farm-to-table favorites, while Ovenbird dishes up Latin American cuisine cooked in wood-burning ovens. ", "Sunday morning jazz brunch at Galley and Garden is de rigueur: enjoy more French fine dining in the grand setting of the historic Merritt House. Want to grab a casual snack? Check out Melt, a food truck-turned-restaurant that specializes in an array of grilled cheese sandwiches, or grab some ribs or pulled pork at Saw's BBQ.", "The best way to get around Birmingham is by car or public bus. If you drive, you'll find free parking at or near most parks and attractions. Plus, many neighborhoods, including the Civil Rights District, are easy to explore on foot. The bus system, Metro Area Express, offers all-day ride passes for $3 with routes to all major attractions, as well as a shuttle to the airport. Birmingham-Shuttlesworth International Airport (BHM) is about 5 miles from the city center and is accessible via several interstates."]}