{"name": "Key West", "description": ["Known for warm beaches and eccentric residents with a live-in-the-moment philosophy, Key West offers a relaxed yet unexpected seaside adventure. Do as the residents (known as Conchs) do and see where that free spirit might take you (possibly on a guided tour or a snorkeling trip). Perhaps you'll end up at a Duval Street bar, in a Mallory Square shop or even touring Ernest Hemingway's old home.", "Key West once threatened to go rogue (in 1982 with a mock secessionist movement to create \"The Conch Republic\"), so this is definitely the place to throw a firm itinerary out the window. Take a stroll, sip a margarita, spy a six-toed cat and set your own pace. While hurricanes have impacted the area in recent years, Key West remains open for business as a bustling vacation destination, with charming bed-and-breakfasts and plenty of outdoor pursuits to keep you busy.", "The best time to visit Key West is between March and May. The winter crowds will taper off, the hotel rates become reasonable and the weather is remarkably similar to winter's blissful 70s and 80s. Speaking of winter – that season is the island's busiest and priciest. The rainy and humid summer months see the fewest tourists but the best hotel rates. The trade-off might be worth it, but you're still gambling against Atlantic hurricane season (June to November). Also, be aware that rates will surge during special events like Fantasy Fest.", "Far to the left Not only is this island farthest to the left in the Florida Keys, it's also very far to the left on the political spectrum. As the home to large Cuban and gay communities, Key West and the Conchs take pride in their inclusive attitude.", "In the shade There are museums, bars and sights aplenty on Key West; however, if you are looking for fast-paced water sports and serene beaches, some of the other Keys have more to offer.", "Literary tradition Ernest Hemingway and Tennessee Williams both wintered here. To perpetuate the island's wordsmith heritage, the Key West Literary Seminar brings celebrated authors to the island every January.", "Transportation with two wheels Renting bicycles and scooters is popular, but expensive. Bring your own and reduce your costs. And wear your helmet – who needs unnecessary medical bills?", "Key West is unique for its eclectic and diverse collection of residents, many of which are immigrants of European descent from the Bahamas and call themselves \"Conchs.\" Those who were not born on the island but have called Key West home for at least seven years are affectionately known as \"freshwater Conchs.\" The origin of the name is largely unknown, but the main theory stems from the American Revolution. Loyalists who had moved to the Bahamas started calling the locals Conchs after their shellfish-heavy diet.", "You might notice souvenirs with the phrase \"Conch Republic\" around the island. The term was coined in the early 1980s when the U.S. Border Patrol tried to set up a Key West inspection point to search for drugs and illegal immigrants and the city threatened a mock secession from the United States. Ultimately, the publicity from the event — and the Conchs' resistance — only increased tourism to the area.", "Key West's dining is unique and casual (it's not unusual to see the occasional rooster stroll by your table when dining outdoors). Seafood is the foundation of much of the local fare; however, Caribbean and Cuban influences add a bit of a kick to your standard fish dish. Some of the city's top guided food tours offer a more in-depth look at how Caribbean and Cuban flavors have shaped the local dining scene. Additionally, if you've spent the day on a fishing charter and wish to have your catch for dinner, a few area restaurants will cook it for you for a small fee. ", "You won't have any trouble finding budget-friendly outposts in Key West, and plenty of fun-loving bars dot Duval Street. If you're looking to experience one of the island's fine dining options, make sure to book your reservations in advance, especially if you're trying to get a table around sunset. You'll encounter fewer crowds than those at Mallory Square, plus you can enjoy fresh seafood and a glass of wine while you watch the sun dip behind the Gulf of Mexico.", "No matter where you choose to dine when in Key West, you'll find Key lime pie on nearly every menu. Though there is much debate as to where you can find the best slice, the confection has become so synonymous with the Sunshine State that it was declared Florida's official pie in 2006. ", "The crime rate in the Florida Keys is low, but you should still use common sense when exploring Key West, especially at night and around hectic Duval Street and Mallory Square.", "Exercise caution when going into the water as well; be sure to heed all flags and warnings from authorities. Take care when bicycling through the streets: You're required to use bike lights at night (a white light in front and a red light in back).", "The best way to get around Key West is on foot. Mopeds and bicycles are also popular, though mopeds can be dangerous. Taxis are available on the street, as well as in front of the Key West International Airport (EYW) in the middle of the island. Plus, the Key West Department of Transportation operates public bus routes around the island. Ride-hailing apps, such as Uber and Lyft, also service the island. Very few people drive around the island, but making the scenic 165-mile (nearly four-hour) drive from Miami is a popular way to arrive in Key West."]}