{"name": "Trinidad & Tobago", "description": ["The southern Caribbean islands of Trinidad and Tobago are a lesson in contrast. Trinidad, the larger of the two, is bustling with commerce and diversity. A cosmopolitan oasis of Creole culture and the birthplace of the steel drum and the limbo, Trinidad brims with natural resources like gas and oil. Its cultural eclecticism and, in some places, astonishing wealth, is all but unparalleled throughout the Caribbean. And then there's the sleepy island of Tobago. Just northeast, this island is rich in natural wonders and immaculate white-sand beaches, but it lacks the urban-sophisticate personality of its other half.", "Trinidad has several beaches, but it's Tobago's shores that are more renowned for their variety and beauty. Its pristine beaches line almost every side of the island and they range from crowded to desolate and festive to romantic. Trinidad's main draw is its lush flora and fauna, particularly its scarlet ibises — the blood orange flamingos that call the island's jungles home. But starting in late February, the island does a 180 when it pours on the glitter and turns up the volume for one of the best Carnival parties in all the Caribbean.", "The best time to visit Trinidad and Tobago is from January to May when the skies stay clear. Although the islands aren't on the hurricane belt, afternoon rain showers are daily occurrences from June to December. Hotels lower their rates to account for rainy weather during this wet season. At least the weather stays pleasant year-round: There's little humidity and average temps hover in the low 80s.", "Tip as the locals do Gratuity is usually included in your bill, around 10 to 15 percent. If you'd like to tip extra for exceptional service, it's considered polite to place the tip in the waiter's hand, not on the table, and never add it to the credit card balance.", "Watch your wallet Pickpockets are common among the crowds at Trinidad's Carnival, so keep your wallet in your front pocket and leave your passport and expensive jewelry locked up in the hotel safe.", "Bring your bug spray Trinidad and Tobago are home to lots of mosquitoes and pesky no-see-ums — very tiny gnats — so packing a strong bug repellant is a must.", "Take a chance on the late rainy season From September to December, hotel and airfare rates will dip to lure travelers. Just remember to pack your rain gear for the afternoon showers.", "Don't exchange your money on the street Less than reputable money changers will hang out in front of the banks offering to exchange money, but you'll get a much better rate inside.", "Trinidad and Tobago was nicknamed \"The Rainbow Country\" by Bishop Desmond Tutu for its abundance of flowers and the diversity of its population. Many Trinbagonians can trace their history to African, Indian, European, Chinese and Middle Eastern ancestry. Though the official language is English, it is spoken with many different accents or in the local dialect of Trinibagianese.", "The value of the Trinidad and Tobago dollar compared to U.S. currency fluctuates slightly, though $1 USD is approximately $6 TTD. U.S. cash is readily accepted, but some travel experts suggest you exchange money upon arrival in the airport. Don't panic though — traveler's checks and major credit cards are widely accepted, and traveler's checks can be cashed at most large hotels.", "With such a mashup of cultures present on the T&T islands, visitors will find food choices that range from Creole to Chinese, West Indian to European, African to Indian. Dining options on Tobago are more affordable, but travel experts recommend the restaurants on Trinidad, especially around Port of Spain, for good food.", "You'll find crab and dumpling on many menus, but some writers suggest you try some roti (flat bread stuffed with chicken, fish, goat or curry) instead. Wash it down with a planter's punch, a popular local drink made with fruit juices, grenadine, Angostura bitters, curaçao and rum.", "Experienced travelers stress using common sense when participating in Trinidad's Carnival: Don't carry around valuables or wear expensive jewelry, and if at all possible, leave your wallet or purse at home in favor of carrying your identification in a front pants pocket. This will help prevent getting pickpocketed, which is a common occurrence during this time of year because of the close proximity of partygoers during day and evening festivities.", "Carnival takes place during the dry season in Trinidad and Tobago, which makes it that much easier to get dehydrated while enjoying the festivities. Several tourist sites recommend drinking plenty of fluids, applying sunscreen at regular intervals, and wearing comfortable shoes and light clothing to prevent getting dehydrated.  ", "The best way to get around Trinidad and Tobago is by car, which you can rent at either Trinidad's Piarco International Airport (POS) or Tobago's Arthur Napoleon Raymond Robinson International Airport (TAB). If you don't plan to explore much, you can get by just fine with the cheap taxis. Buses are also available but are rather unreliable. When you're ready to switch islands, head down to the docks at Port of Spain or Scarborough and board one of the private ferries.", "A U.S. passport valid for six months or the duration of stay at the time of entry is required. Upon arrival, you must show proof of return travel. All visitors 5 years of age and older should also expect to pay a departure tax of $17 USD. Visit the U.S. State Department's website for more information on entry and exit requirements."]}