{"name": "Ocean City, NJ", "description": ["Located about 65 miles southeast of Philadelphia, Ocean City boasts 8 miles of New Jersey coastline. Ocean City's position, sandwiched between the Great Egg Harbor Bay and the Atlantic Ocean, means that visitors staying on the barrier island are treated to numerous nautical attractions. Since its founding in 1879, families have made the pilgrimage to Ocean City in search of its beaches, while its subsequent boardwalk was originally built in 1900. Ocean City was originally founded by four Methodist ministers, who intended the area to be a Christian seaside resort. The city's dry status, which prohibits the sale of alcohol within city limits, remains a carryover from its religious founding. (Travelers can still bring their own alcohol.)", "Ocean City attracts families every summer with the arcades, amusement parks, restaurants, shops and more that line the iconic boardwalk. Meanwhile, its northern neighbor, Atlantic City, offers adult entertainment in the form of casinos and bars. Whether you're driving in for a daytrip or intend to spend the night at one of Ocean City's hotels or vacation rentals, the coastal city always offers something to do. Keep in mind that many of the area's popular facilities shut down when the weather gets cooler, but a handful of stores, restaurants and attractions remain open.", "The best time to visit Ocean City, New Jersey, is from May to September. Average high temperatures range from 67 to 81 degrees during the peak tourist season, providing the perfect environment for soaking up the sun and strolling on the boardwalk. The dates that bookend Ocean City's tourism season are May 15 and Labor Day, the first Monday in September. During the offseason, when average highs range from 42 to 65 degrees, many of the boardwalk and beach and boardwalk rules become less stringent. For example, dogs are allowed on the beach from October through April 30 (but never the boardwalk) and boardwalk bike hours are expanded during the offseason.  ", "BYOB and don't drink in public Alcohol cannot be sold in Ocean City, though you’re allowed to bring your own alcohol into the city. The city enforces open container and public consumption laws and ordinances rigorously.", "Visit during the offseason Some storefronts won't be open, but an offseason visit (from October to April) means smaller crowds and more affordable rooms.", "Stay nearby Hotels, vacation rentals and campgrounds surround Ocean City, allowing visitors to stay adjacent to the barrier island without paying for oceanfront accommodations."]}