{"name": "British Virgin Islands", "description": ["The British Virgin Islands, or BVI for short, are some of the most-exclusive and least-developed islands of the Caribbean, but this only adds to their appeal. The resorts, villas, restaurants and other tourist attractions in this paradise are known to emphasize spare luxury over sprawling expansion, and they attract travelers with deep pockets and a love for sailing and seclusion. Many travelers who visit come by ferry boat from another Caribbean isle, especially as some find opulent exile too hard to enjoy for longer than a day or two. And some say it's better to split your time between here, the nearby U.S. Virgin Islands and Anguilla to the east.", "Others find more than enough to keep them exclusively anchored by these 50-plus islands and cays, which sadly were hit hard by Hurricane Irma in September 2017. Travelers will still be able to find evidence of the hurricane's handiwork, though BVI has done a valiant job of rebuilding. On Tortola, you'll find mountainous cliffs and chalk white beaches, characterized by changing tides and calm easterly winds. A brief sail away, sleepy Jost Van Dyke offers delicious Caribbean food and drink, one of the region's best New Year's Eve parties, as well as a few outdoor excursions like diving and fishing. On Virgin Gorda, you'll find The Baths, perhaps the most picturesque shore in the British Virgin Islands, and with good reason: It offers unique grottoes amidst gigantic granite boulders (just be mindful of the daytripping crowds). For supreme seclusion, try Anegada; its slow pace, flat terrain and sparkling sand lies almost overlooked in Caribbean Sea.", "The best time to visit the British Virgin Islands is from September to November, before the crushing crowds of the winter holidays. Though the fall months see the highest amount of precipitation, they also welcome some of the lowest hotel rates you'll find all year. Keep in mind: Hurricane season runs from June to November, so keep an eye on the weather if you're planning a summer or fall visit. Divers should plan a trip for winter or spring – the summer is the absolute worst time for visibility underwater – and sailors should try to visit in March, during the BVI Spring Regatta.", "It's all about the Benjamins This might be the British Virgin Islands, but the official currency is the U.S. dollar. And you'll need a lot of those dollars to spare.", "Make it a daytrip Staying among the U.S. Virgin Islands is probably cheaper; staying on Puerto Rico most definitely is. The cost to take a small plane or ferry round-trip from one of those islands is significantly less than planning an entire itinerary in the British isles.", "Avoid the duty-free Like much of the Caribbean, these islands boast duty-free deals on electronics, jewelry, liquor and perfume. But the selection is not as vast as shopping capitals like St. Thomas, USVI and St. Martin-St. Maarten.", "Carpool Keep in mind that taxis will charge you per destination, not per person. Find some travel buddies at your hotel who are willing to take a few island tours and excursions with you and then split the cab bill.", "The British Virgin Islands comprise four larger islands – Tortola, Anegada, Virgin Gorda, and Jost Van Dyke – and 50-some smaller islands and cays. They're a British overseas territory, and as such its culture is a mix of European, Caribbean and African facets. Often called \"the Sailing Capital of the World,\" boating is a popular pastime in BVI. Football (or soccer) and cricket are other popular sports, which hail from the BVI's English heritage. ", "Virgin Islanders dress casually but conservatively. Wearing a bathing suit – or even sandals – anywhere besides the beach marks you as a tourist. Most nightclubs are willing to accept you in boat shoes and a nice pair of shorts, but don't be surprised to find the residents in slightly better attire.", "Since the British Virgin Islands are located in the Caribbean, it should come as no surprise that seafood is a big part of the dining scene. Expect to find Caribbean spiny lobster, conch and fresh fish like mahi mahi and grouper on menus at various eateries throughout the islands. BVI's national dish is \"fish and fungi.\" Okra and cornmeal are boiled with butter and then flattened into a cake and served with braised fish, which is cooked with tomatoes, onions and other traditional spices. ", "Heavily spiced dishes are standard throughout the BVI, with chefs using everything from sea salt and pepper to strong curry, nutmeg, garlic powder and jerk seasoning. You should also try a painkiller when you're looking to wet your whistle. This alcoholic drink originated in the British Virgin Islands and typically consists of pineapple juice, orange juice, cream of coconut and a hefty dose of rum, garnished with fresh nutmeg. ", "When it comes to eating out, there aren't a wealth of dining options available as many people visiting the islands charter boats with their own chefs or are just staying for the day. However, there are a few mainstay bars and restaurants on Jost Van Dyke, Virgin Gorda and Tortola that travelers say are worth a visit. Anyone heading to Jost Van Dyke would be remiss if they didn't spend a few hours savoring drinks at Foxy's Tamarind Bar & Restaurant. It's known to host a raucous New Year's Eve celebration but it's just as festive the other 364 days of the year. The drinks, music and atmosphere make this one of the most fun bars around, according to travelers. ", "On Tortola, you'll find some traditional Caribbean fare and tasty seafood at the popular Sugar Mill Restaurant, which is currently closed and undergoing renovations due to hurricanes Irma and Maria. Travelers will find some terrific sunsets and Caribbean fusion cuisine at the BananaKeet Café. For more upscale fare, visit the Dove Restaurant & Wine Bar in the BVI capital of Road Town. On Virgin Gorda, experts and visitors suggest meals at the beachfront, seafood-centric CocoMaya Restaurant or the open-air (but pricey) Pavilion at Little Dix Bay.", "Crime is rare and hardly a concern for most BVI travelers. Your biggest safety hazard will be avoiding livestock as you try to navigate the many narrow dirt roads of the British Virgin Islands. But your best bet for avoiding the islands' goats, chickens and sheep is not renting a car at all: Between the animals, the left-side driving and the unpaved dirt paths masquerading as roads, it's not worth it.", "The best way to get around the British Virgin Islands is on a boat. You might even need one to arrive at your destination first – there are no direct flights from the United States to this island chain and many people fly into Cyril E. King Airport (STT) on St. Thomas in the U.S. Virgin Islands and then ferry over. You could also take a connecting flight from Puerto Rico, St. Thomas, Antigua, or St. Maarten to Tortola Airport (EIS). Once you're settled, you might end up on the water again – to ferry or to sail between the numerous islands that make up this archipelago. You should rent a car or take a taxi to move about larger islands like Virgin Gorda or Tortola.", "You'll need a valid U.S. passport with at least one blank page to travel to the British Virgin Islands and to re-enter the United States. Upon arrival on the islands, you'll also need to present proof of return flights or continuing travels, and you can anticipate a departure tax when you leave. Occasionally, officials will also ask to see proof of sufficient funds to cover your visiting expenses. Visit the U.S. State Department's website for the latest information on foreign entry and exit requirements."]}