{"name": "Barbados", "description": ["Barbados is a vibrant island known for its friendly people and delectable food, especially its fish. You can find a white sand beach, a sprawling golf course or a duty-free shopping plaza just about anywhere in the Caribbean, but in Barbados, visitors can taste the bittersweet Mount Gay Rum, dance to the thrum of a calypso song or take in a polo or cricket match. And though you could spend all your time on the beaches, you'll find plenty more to do when exploring this Caribbean paradise. This luxurious island is brimming with breathtaking architecture, a passionate sports culture and a party-loving attitude. ", "The easternmost island in the Caribbean, Barbados juggles two different cultures to create a distinctly Bajan personality. Even after gaining its independence from Great Britain in 1966, this island still holds tight to British traditions like afternoon tea, cricket and horse races. Trademarks of the Caribbean and West Africa are still evident, however, in the island's sugar cane fields, rum distilleries and lush landscapes. And then there are the many beaches. While all of Barbados' shorelines boast picturesque views and calming ocean breezes, some of the country's must-visit beaches include Dover Beach, Bathsheba Beach and the sands overlooking Carlisle Bay.", "The best time to visit Barbados is between July and November. Though these months fall within the Caribbean's hurricane season, hurricanes rarely hit the island, and you could attend one of the lively Crop Over Festival activities if you vacation during this time of year. Temperatures stay between the mid-70s and mid-80s year-round, so there's little reason to travel during the peak season, which occurs from late December to mid-April.", "This is Little Britain Though island attire is acceptable at the beach, thanks to its colonial history, Bajans are fairly conservative in attitude and dress. Don't be surprised to see men wearing pants and women in dresses.", "This is rum country White, aged and flavored are just some of the rum varieties you'll find produced on the island. To sample some of Barbados' best, take an interactive tour of a top-notch distillery like Mount Gay Vistior Center or St. Nicholas Abbey.", "This is where the sun lives Barbados is only 13 degrees north of the equator, meaning you'll likely enjoy plenty of sunshine and hot weather during your visit. To avoid dehydration, heat strokes and sunburns, apply sunscreen regularly and drink plenty of water.", "Be mindful of the exchange rate The Barbadian or Bajan dollar (BBD) is permanently fixed at Bds$2 for every $1. Although most establishments accept U.S. currency, you should pay in Barbados dollars – your money will go further.", "Independent since 1966, Barbados has maintained a political system similar to that of Britain, with a constitutional monarchy and a democratic parliamentary government. Bajan customs and ways of life are also similar. You should bring light colors and fabrics to wear on your vacation but note that Bajans tend to dress conservatively. Long pants for men and dresses for women are not uncommon.", "Throughout the country, the Barbadian dollar (BBD) is used (Bds$2 equals $1). When tipping in Barbados, travelers should expect to add an additional gratuity based on the service received. However, unlike the U.S., some restaurants will include a 10% to 15% gratuity in food bills, so be sure to check your receipt before you pay.", "And though English is the official language in Barbados, the Bajan dialect, which is typically used in casual conversations, may confuse some foreigners. Key phrases to remember include \"wha gine on\" (what's going on), \"aight\" (how are you) and \"ga so\" (go this way).", "An array of Caribbean and international cuisine, with African, Indian and British influences can be found in Barbados, though the island's fresh seafood is the focal point of many restaurant menus. Look for sweet plantains, rice and peas, curries and rotis (flatbread) on menus. Gourmet chefs have opened the most sophisticated establishments in the St. James and Bridgetown areas, but you should expect to pay a pretty penny for the experience.", "Popular fine dining restaurants include Champers Restaurant, The Tides and The Cliff. Make sure to plan ahead at these eateries since most require a reservation to get in the door. Recent visitors to Barbados mention that the food in St. Lawrence Gap is well worth the price; reasonable prices can also be found in Holetown on the central west coast.", "The best way to get around Barbados is by car or bus. Taxis are an option; fares are set by the government. For example, it'll cost between 26 and 179 Barbadian dollars (about $13 to $89) to get from Grantley Adams International Airport (BGI) to various parts of the island. There is also a public bus service that takes visitors to popular spots across the island, including Bathsheba and Harrison's Cave. ", "Barbados is also a popular port of call for cruise ships sailing to the eastern or southern Caribbean. Cruise ships dock at the Bridgetown pier, which is located about 3 miles from downtown Bridgetown.", "U.S. citizens will need a passport to enter Barbados; a visa is not required unless you plan to stay more than six months. One blank page is required in each passport. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements."]}