{"name": "Las Vegas", "description": ["Sin City, America's Playground, the Entertainment Capital of the World ... all worthy names for this Nevada hot spot. Think of Vegas as a theme park rather than a city – it can awe as much as it can overwhelm, and that's part of the appeal. This is a city where inhibitions are not welcome: Every night, Las Vegas draws pleasure mongers to the brightly lit Strip like moths to a flame. While you may not want to go as far as to reenact \"The Hangover,\" you certainly don't want to leave without experiencing a bit of \"Viva Las Vegas.\"", "Today, Las Vegas can provide any kind of vacation you can imagine. You can opt for the traditional high-roller getaway complete with all-nighters at the blackjack table or TAO Nightclub. Or you can make it all about luxury with visits to hotel spas, high-end boutiques and gourmet restaurants. Las Vegas is also a great jumping-off point for outdoor activities, such as ATV tours, hiking in Red Rock Canyon or visiting the Hoover Dam via a helicopter tour or a bus tour. You can even bring the kids along: Underage travelers will get a kick out of a Cirque du Soleil performance, the Bellagio Fountain show and the Neon Museum.", "The best time to visit Las Vegas is from March to May and from September to November. While you'll find plenty of travel deals throughout the year, the spring and fall shoulder seasons offer the most moderate weather. Sin City welcomes an influx of visitors during the winter months, especially surrounding New Year's Eve, the Super Bowl and Valentine's Day, and the sweltering summers see daytime temperatures exceeding 100 degrees. No matter when you decide to visit Vegas, try to plan a midweek trip – because this is a common weekend getaway destination, you'll find more rooms at lower rates between Tuesday and Thursday.", "Las Vegas is also home to hundreds of conventions each year, which can drive up room rates. Before setting travel dates, check the city's tourism board convention schedule to find out which hotels are hosting what and when – this will help you secure a better deal at your choice hotel. ", "Prepare for desert weather Days in Vegas can be extremely hot, but nighttime breezes (and casinos' AC) can be pretty chilly so be sure to bring a jacket. Ladies should also consider whether their high heels will be comfortable walking up and down the Strip.", "The house always wins No matter how well your winning streak is going, it's bound to come to an end at some point. Remain both optimistic and realistic.", "Bring the kids While the casinos aren't kid-friendly, there are plenty of attractions (like aquariums) that are wholesome fun for the entire family. Here are 25 top things to do in Las Vegas with kids.", "Take a tour Whether it's a food tour or a sightseeing flight above the Strip, there are a variety of guided tours in Vegas perfect for when you need a break from the casino.", "Do your research There's no shortage of online deals on flights and hotel rooms, so be diligent about making travel plans and save the spontaneity for after you've checked in.", "Cut yourself off Winning feels amazing, but there comes a point when the tables start to turn. Decide how much you're willing to spend at the casinos before you arrive in Vegas, and make sure to stop yourself before Lady Luck robs you blind.", "Book an affordable hotel There are plenty of cheap hotels located downtown or slightly removed from the city center that are more cost effective than those on the Strip.", "One thing's for sure: There's no shortage of culinary choices in Las Vegas. You'll find everything from high-end French fare to budget-friendly burgers. The celebrity chef craze hit Las Vegas by storm, with some of the world's most famous chefs – including Wolfgang Puck and Emeril Lagasse – establishing kitchens in Sin City. What's more, Las Vegas boasts more master sommeliers than Los Angeles and New York City combined. You can dine on Chinese fare at Wing Lei at the Encore at Wynn Las Vegas, indulge in Wagyu beef at Bazaar Meat by José Andrés at the Sahara or savor Italian cuisine with views of the Bellagio's fountain show at LAGO by Julian Serrano. ", "And while many of the big-name restaurants along the Strip come attached with high price tags, you don't need to spend a fortune to eat well here. Sin City caters to foodies of all budgets, and the city is also known as the king of the all-you-can-eat buffet, with food lines featuring everything from pizza and Chinese to crab legs and gluten-free cuisine. There's even a flagship Taco Bell restaurant that serves beer and frozen alcoholic drinks. Whatever you're craving, you're sure to find it at one of the buffets along the Strip, so come hungry. Foodie tours are another great way to try a variety of foods at a low cost.", "If you're smart and exercise common sense, your stay in Las Vegas should remain safe and enjoyable. As far as safety is concerned, you should take some extra precautions when on the Strip or in a casino. Cash and alcohol run wild, often placing travelers in compromising situations. Don't overindulge in alcohol, and keep your winnings to yourself to avoid attracting unwanted attention. When on the Strip, never walk alone in the evenings, be mindful of the busy road, and follow all street signals and applicable laws. The Las Vegas Metropolitan Police Department offers more tips on its website. ", "The best way to get around Las Vegas is by taxi, a ride-hailing option like Uber or Lyft, or by bus. The Regional Transportation Commission of Southern Nevada (RTC) offers bus routes 24 hours a day along the Strip and downtown area, providing easy, affordable transportation. If you're based on the Strip, the Monorail provides fast transportation to many of the casinos along the Strip like the MGM Grand and Harrah's Las Vegas. If you prefer to walk, you won't have an issue finding most of Vegas' top things to do, but you should arm yourself with plenty of sunscreen and water to avoid heat stroke. ", "To get to and from the Harry Reid International Airport (LAS), which sits about 10 minutes east of the Strip, you have a variety of options. You can hop in a taxi, use a ride-hailing service, or for a more affordable ride, use a shuttle bus or the public bus. RTC buses and shuttle bus companies offer service out of terminals one and three. Car rentals are also available at the airport (and throughout Las Vegas), but unless you're looking to take a trip to the Hoover Dam or the Grand Canyon, you should opt for another means of transportation. Traffic along the Strip is hectic and parking is both scarce and expensive. Plus, several of the best Las Vegas tours provide transportation from the Strip to local landmarks like the Hoover Dam or the Grand Canyon if you don't want to drive yourself. Helicopter tours can also be a memorable way to see these natural wonders or enjoy a bird's-eye view of the Strip's glittering night lights. ATV tours are equally unique ways to see the surrounding desert scenery."]}