{"name": "Munich", "description": ["Despite its reputation as one of Germany's most expensive cities, Munich attracts visitors in droves who are charmed by its blend of tradition and modernity. As well as hosting the iconic 200-year-old Oktoberfest, the city also serves as a European hub for publishing and technology. Nuzzling the Bavarian Alps and situated beside the River Isar, Munich boasts natural beauty as well as bustling streets lined with designer shops and shiny BMWs. In short, you should visit the Bavarian capital for both its provincial charm and progressive spirit.", "The best time to visit Munich is from March to May: the Christmas market crowds have long since departed, summer’s peak season hasn’t yet hit, spring blossoms bring color to the streets and temperatures are comfortable, averaging between 40 and 60 degrees Fahrenheit. In the summertime, temperatures linger in the 70s – ideal beer garden weather – but consider bringing a light sweater for Munich's slightly cooler evenings. If you’re one of the millions who want to party at Oktoberfest during the fall, you’ll need to pack a jacket. Winter, except for the holiday months of December and the beginning of January, is mostly this city's low season. Temperatures drop, so opt for a warm coat and layers.", "Munich’s beer is strong German beer has a higher alcohol content than American brews; U.S. visitors should pace themselves. Also, note that at Oktoberfest, beer is sold in liter quantities (also for certain beers at beer halls and beer gardens).", "Munich is expensive Keep in mind that Munich's vibrant culture and high quality of life come with a price tag, so budget accordingly for your visit to this beautiful city.", "Münchners speak German Many speak English, too, but do be polite to locals and begin your conversation with \"Sprechen Sie Englisch?\" (“Do you speak English?)", "Take public transit Because the city's systems are so efficient, a rental car is unnecessary. If you’re traveling elsewhere in Bavaria or Germany, the regional and long-distance train networks are easy to navigate and good value, particularly if you book in advance.", "Part of a culture that values planning and formalities, Germans are generally reserved. Punctuality is greatly prized. Rules are extremely important to Germans. Do not jaywalk or litter, as you may be subject to a fine.", "Although many people speak English in large cities like Munich, it is helpful to learn a few German phrases. Remember to say bitte (“please” and “you're welcome”), as well as danke (“thank you”), and you'll make a good impression.", "You should also be mindful of your mannerisms. Whistling at the end of or during a performance is considered a sign of displeasure. When interacting with people one-on-one, remember that touching during conversation or standing less than an arm's length apart on the first meeting is considered an invasion of privacy.", "Munich's official currency is the euro. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at some restaurants and shops, but cash is still king in Germany, so be sure to always have some with you.", "Bavarian fare is extremely hearty — think roast pork, sausages and piles of potatoes and dumplings. However, there’s also a wide range of international restaurants in Munich. To sample the city’s variety of cuisines, plan to visit the train station quarter (Bahnhofsviertel) for everything from Croatian to Uyghur dishes. For a traditional Bavarian breakfast, order a Weißwurstfrühstück (literally “white sausage breakfast”) – veal sausages with a pretzel, sweet mustard and a glass of wheat beer (Weißbier).", "Some say Munich is so safe, it borders on being boring. Still, there are a few things travelers should be aware of – namely jaywalking (it’s illegal) and walking along bike paths, which sidle many of the roads or take up part of sidewalks and are for bikers only. Cyclists are pretty territorial about them, so stick to the footpaths only. And if you're traveling to Munich during Oktoberfest, you might encounter some drunken revelry. Munich may be Germany’s safest city, but it’s still a major one, so keep an eye on your bags and pockets on public transport and touristy areas, and take care in quiet areas after dark if you’re on your own.", "The best way to get around Munich is on foot since many of the top things to do are located close to one another. If your feet grow weary, make use of the city's excellent public transportation – the underground train (U-Bahn), local rail service (S-Bahn), tram or bus. The S1 and S8 S-Bahn trains run frequently from Munich International Airport, also known as Franz Josef Strauss Airport (MUC), located just about 20 miles northeast of the downtown area, right into the center of the city. Taxis are available from the airport, too, but these are expensive. If you're on a budget, opt for the S-Bahn.", "You will need a passport that is valid for at least three months beyond your planned date of departure. Those who wish to stay in Germany longer than 90 days must contact an embassy or consulate before leaving the U.S. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}