{"name": "Tulum", "description": ["In the past decade, Tulum has grown into a coveted vacation for luxury travelers; however, it still tempts bargain hunters who remember when this tucked-away jewel of Mexico's east coast was more of a secluded getaway. When the sun goes down, you'll have the opportunity to indulge in the city's mixology scene and explore its sprawling nightlife. However, it's during daylight that Tulum truly shines. Here, you'll find some of the region’s best-preserved Mayan archaeological sites – sites that have the cerulean waters of the Caribbean Sea as a backdrop – and out-of-this-world wonders, including several cenotes (or underground water-filled caverns) and bioreserves. ", "Let's not forget Tulum's main draw for most visitors: its beaches. White sand and turquoise waters beckon travelers to spend their days lazing in the sun, listening to the waves. Whether or not you're a fan of the sand, visiting one of Tulum's many shorelines is a must-do.", "The best time to visit Tulum is between November and December. You'll get the benefit of post hurricane-season breezes, plus the hotel prices are reasonable. Not to say that it's hard to find reasonable room rates at other times of the year – this small pocket of Quintana Roo has one of the widest ranges of price points on Mexico's Caribbean coast. If you're concerned about crowds, though, avoid the region from January to March. For the best weather, avoid June, September and October – which experience the highest amounts of rainfall.", "Head to \"Pueblo\" The town center of Tulum Pueblo is quite a bit smaller than you might think it would be, but there are still a number of  lodging and food options to consider.", "Avoid visiting cultural sites on Sundays That’s when Mexican residents can enjoy free admission at museums and sites like Cobá and the Tulum Archaeological Site, meaning these attractions will be even more crowded than usual.", "Bring pesos Many of Tulum's restaurants and bars (including the upscale establishments) accept credit cards. You'll get more bang for your buck, though, if you pay with Mexican pesos. Several of Tulum’s top attractions also don’t accept credit cards, so plan to visit an ATM before heading out for the day.", "Pack reef-safe sunscreen or a rash guard Many of the region’s cenotes and lagoons ask visitors to shower before swimming to protect the ecosystems from the damaging chemicals commonly found in most sunscreens and bug repellents. To avoid a sunburn, make sure you wear a reef-safe sunscreen (meaning it does not contain oxybenzone and octinoxate) or a rash guard.", "Skip the luxe resort treatments As nice as the \"aloe vera wrap\" or \"Mayan chocolate massage\" at the spa sound, they aren't going to come cheap. Instead, consider how relaxing the (free) soft sugary sand and lapping waves can be.", "Pack a beach bag Visiting Playa Paraíso is free, but enjoying the water sports, the hammocks and ordering any food there is not. You'll cut costs significantly by bringing a snack, a beach towel and an umbrella.", "Enjoy the freebies Tulum is small, so instead of choosing a hotel by location, consider the incentives of each property. Some of the ritziest spots offer complimentary bottles of wine or free fitness classes, among other perks.", "The Riviera Maya is well-known as a North American getaway spot, but that doesn’t mean you won't discover Mexican and Mayan culture here, especially at its famous archaeological sites, cenotes and local eateries that highlight regional ingredients.", "Just outside the entrance to the Tulum Archaeological Site you can often catch a group of five costumed men performing flying and dancing stunts atop a tall pole. The performance and the men are loosely known as \"Voladores,\" and they're recreating a prehistoric ritual most often associated with the Totonac Indians of central Mexico. According to some travelers, that's all you need to know. The Voladores routine is an extremely acrobatic and unique spectacle, so it’s worth considering parting with a few pesos to show your appreciation. The performances do not happen on a structured schedule, but you can expect to spot one around the peak times to visit the archaeological site.", "It will be both helpful and respectful to know some basic Spanish vocabulary, and at the very least to say \"please\" (por favor) and \"thank you\" (gracias). Mexico is typically more conservative than some other beach destinations. Nude bathing is not allowed, but some female sunbathers (predominantly European) are known to go topless in the area. In general, the dress code remains similar to most beaches in the United States.", "Some Tulum residents keep an afternoon siesta, typically starting around noon or 1 p.m., to relax during the hottest part of the day. However, you won't find the practice as common in Tulum as you might in Spain.", "Tulum can get very crowded with international tourists and local vendors. It is common for vendors to approach tourists on the street or beach with several wares in tow. If you are not interested, politely say \"no, gracias\" and they will move on.", "Over the years, Tulum has cultivated an impressive parade of local and international chefs who have opened trendy, yet rustic restaurants that put the spotlight on some of the region's most celebrated ingredients, including huitlacoche (Mexican truffle) and cochinita pibil (slow-roasted pork). These new eateries blend seamlessly with the casual dives residents love. ", "Though traditional Mexican flavors are the focus of many of Tulum's menus, there are a variety of other cuisines represented here, including vegetarian and vegan-friendly restaurants that serve popular healthy smoothies and bowls. But if it's the traditional flavors of Mexico that your palate seeks, these are widely available across the beachside and jungleside stretches of Tulum Beach, as well as the downtown area. For more upscale meals, head to Tulum Beach, known for its trendy restaurants that specialize in mezcal and popular, locally-sourced dishes that make planning reservations ahead of time key.", "Travelers should exercise common sense when traveling in the downtown area: for example, don't walk around alone at night. If you're staying in a beachside cabana, be sure to lock your doors. Don't walk on isolated areas of the beach at night. Driving during the daytime is relatively safe, but take caution when driving at night, as some foreign travelers have experienced robbery. That being said, Tulum occasionally sees violent crime, though it's not usually against tourists. For the latest safety information, visit the U.S. State Department's website.", "You should not drink the tap water in Tulum. To avoid unnecessary illness, always make sure your bottled water is sealed, your ice has been tested for purity and your food has been prepared with bottled water. Food at your resort will likely not be an issue. Should you choose to venture out to other establishments, it's best to check with your server about their food preparation practices.", "The best way to get around Tulum is by taxi. In theory, you can walk or bike to the beaches, to the archaeological sites and to Tulum Pueblo, but there's a chance of overexerting yourself. Buses aren't a viable option – the only ones available are the shuttles that take vacationers to and from the other Riviera Maya areas, and to and from the airport in Cancún. Privately owned buses travel the difference between Tulum and the rest of Riviera Maya, as do colectivos, or chauffeured white vans. To visit the nearby island of Cozumel, you can take the bus to Playa del Carmen, followed by a ferry ride.", "Tulum's brand-new airport, Felipe Carrillo Puerto International Airport (TQO), opened in late 2023 and began welcoming international flights in spring 2024. The Tulum airport is located about 25 miles southwest of central Tulum, making it the most convenient option for travelers. The Cancún International Airport (CUN), which is about 75 miles north, is another option, though you’ll have to drive for about two hours to reach Tulum after landing in Cancun.", "Bring an up-to-date passport with you to Mexico, and expect to be issued a Mexican Tourist Permit when you arrive. Its cost is absorbed into your plane ticket, but you'll need to hold onto that card and present it upon departure (you may pay a fine if you lose the card). You can also fill out this card online in advance by requesting a form from the Mexican government on the Mexico Tourist Card website. For more information on entry and exit requirements, visit the U.S. State Department's website."]}