{"name": "Paris", "description": ["The City of Light draws millions of visitors every year with its unforgettable ambiance. Of course, the divine cuisine and vast art collections deserve some of the credit as well. The gentle River Seine rambles through the city, flanked by stately museums, centuries-old churches, and blocks of Rococo- and Neoclassic-design architecture, further enhanced by cascading trees and glowing streetlamps. Peppering the Seine's cobbled walks and graceful bridges are impossibly chic Parisians, probably on their way to the market, cafe or cinema.", "Containing world-class museums, fashion, cuisine and an atmosphere all its own, Paris is also a city of \"many splendors,\" as Ernest Hemingway recalled in his memoir, \"A Moveable Feast.\" Visit the beloved Musée d'Orsay, shop the biggest designers on the Champs Élysées or hit the boutiques in Le Marais, take in the view atop the Eiffel Tower, or even plan a day trip to Versailles Palace. But don't miss out on the simple pleasure of meandering the marvelous arrondissements (districts), or snacking on street crepes either.", "The best time to visit Paris is from June to August and September to October. Both summer and fall have its ups and downs. From June to August the weather in Paris is just about parfait (perfect). Average highs are in the high 70s and there are long days of sunshine. Unfortunately, summer is also the most crowded time – and the most expensive. For lower travel rates and significantly shorter lines at attractions, plan a visit in the fall. The seasonal foliage is known to stun, though the city's spring blooms are pretty famous too. If a travel deal is all that you're after, a visit during the winter will surely shave off travel expenses. Keep in mind though that Paris is one of the most visited cities in the world, seeing upward of 30 million travelers yearly. So no matter what time you visit, there will always be tourists and some crowds. ", "\"Parlez-vous Français?\" Parisians adore their native tongue – and will like you better if you try to speak it. \"Bonjour\" is hello, \"au revoir\" is goodbye, \"s'il vous plaît\" is please and \"merci\" is thank you.", "Coffee is a leisurely affair When you order a café in Paris, sit down and stay awhile. It's not common to see Parisians touting cups of Starbucks around town. If you're simply looking for a quick jolt of caffeine, order an espresso from the bar.", "Don't toss your ticket Hold on to your metro ticket until you exit the station (for proof of purchase). If you're caught empty-handed, you could be liable for a hefty fine.", "Consider a guided tour Sightseeing through Paris on your own can be a daunting challenge. Enlist the help of a local via a guided tour to make the most of your time here.", "Grab breakfast at the boulangerie Sitting down at restaurants in Paris (especially alfresco) will always be more pricey than getting things to go. Bakeries, or boulangeries, tend to sell quiche and oftentimes light sandwiches, perfect for a quick (and cheap) meal.", "Be here the first Sunday of the month May be tricky to plan, but you'll sidestep admission fees to the Louvre, Musee d'Orsay, parts of Centre Pompidou as well as Versailles and Musee Rodin during certain months.", "Walk Paris is big and shouldn't be traversed entirely on foot, however, a number of top attractions are within a mile of one another (such as the Musée d'Orsay, Louvre, Notre Dame, etc). If you map out ahead of time how far each attraction is from one another, you'll likely save some metro money.", "There's this idea that Parisians stick up their noses to Americans – that they're notoriously unfriendly and even rude. This is a stereotype. Like anywhere you visit, there's a chance you may run into friendly and unfriendly locals during your journey. A great way to bridge the cultural divide is to learn a little bit of the language.", "While many Parisians know English (especially in tourist areas and hotels), a little effort from your end really can go a long way. Pleasantries are highly regarded in French culture. A \"bonjour\" (hello or good day) or \"bonsoir\" (good evening) here and there will not only show that you're trying on their turf, which the French appreciate, but enhance your own cultural experience. \"Merci\" is thank you and \"s'il vous plaît\" is please. If you're at a loss for words, politely ask the waiter or shop attendant \"Pouvez-vous m'aider?\" (Can you help me?) or \"Parlez-vous anglais?\" (Do you speak English?). Another helpful phrase: \"Excusez-moi\"(Pardon or excuse me). If you are introduced to French people in social situations, stick to a handshake unless the person you are meeting initiates the les bises, or the greeting where people lightly kiss each other on the cheek once or twice. If you aren't comfortable, merely stick out your hand for a handshake.", "Speaking of trying to blend in... Paris is one of the most fashionable cities in the world. Everyone from Coco Chanel to Yves Saint Laurent and Christian Lacroix got their start in fashion in Paris – and their influence remains. Blend in with the locals by dressing stylishly, though don't feel pressure to dress to the nines. Parisians do dress casually but wearing items such as activewear, sweatshirts, running shoes, flip flops or even some shorts (denim cut-offs, for example) around town is not commonplace here as it is in the U.S. Parisians like to keep it simple and chic, opting for a black leather bag over logo-ladden designer bags and incorporating soft-spoken color palettes into their wardrobe. You won't see a whole lot of French people wearing neon. ", "France uses the euro, and major credit cards are accepted at most establishments in Paris. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Keep in mind the exchange rate when you tip and make purchases. Some smaller bakeries or bistros may only take cash, though, so keep some euros on hand just in case. Most restaurants and cafes will include a 10 to 15 percent service charge (service compris) on the bill. You can leave some additional change for exceptional service, if you wish. Taxi drivers tend to expect a 5 to 10 percent tip, though usually rounding to the nearest euro or two will often suffice. You may also encounter fees to use the bathroom in some restaurants and bathroom attendants in many bars in Paris. If the fee isn't collected ahead of the use of the facilities, it's polite to leave 50 cents to a euro for the attendants.", "Similar to many other international cities, Paris offers a surplus of restaurants that serve up everything from Asian fusion dishes to nouveaux bistro fare. And because France invented a widely adopted style of cooking, the food in Paris is très bien. Look for upscale establishments in the 1er arrondissement (1st district) and in Marais, as well as around Champs-Elysées and the Eiffel Tower. The 2ème arrondissement has a number of cheap eateries and cafes, as does Montmartre.", "No matter where you choose to dine, you should sample some French staples like soupe à l'oignon gratinée (French onion soup), croque-monsieur (a grilled cheese and ham sandwich smothered in more melted cheese), steak frites (steak and french fries) and coquilles St-Jacques (seasoned scallops topped with cheese and bread curmbs served in a shell). Those with a sweet tooth should save room to try some of the following French desserts: macarons, pain au chocolat (chocolate croissants), puits d'amours (large puff pastries filled with vanilla cream and drizzled with caramel sauce) or crêpes (fixins' range from Nutella to bananas and berries).", "For a meal on the go, pick up a baguette sandwich at a traiteurs or grab a quick savory crêpe at a crêperie or crepe stand. Chocolat chaud (hot chocolate), café crème (coffee with cream) and other drinks can be enjoyed at any of the city's many cafes. And if you want to save some euros, head to the local grocer and pick up some snacks for the day. Cheaper bistros and brasseries abound, but for some French fine-dining, splurge at Guy Savoy, Bistrot Paul Bert or Chez Andre, among other pricey yet delicious dining establishments.", "Famed foodie Julia Child wrote \"Mastering the Art of French Cooking\" because French meal preparation is an art. Even the art of perfecting French specialties (wine, cheese, pastry) are a reflection of the time and care put into a meal. Likewise, linger over your French fine-dining experience, realizing that the food is meant to be savored rather than gulped. And remember, elbows off the table! For a crash course in the Paris dining scene, sign up for a guided food tour.", "Paris is fairly safe, though you should be wary of pickpockets, especially on the metro and around the most popular tourist attractions like the Eiffel Tower and the Louvre. Visitors should also be very alert while at the Gare du Nord train station: Pickpocketing tends to be pretty common here. Thieves also tend to target tourists on their way from Charles de Gaulle Airport (CDG), so pay particularly close attention to your luggage and bags while taking public transportation to and from CDG.", "The best way to get around Paris is on foot and by metro. The elegant arrondissements are practically made for pedestrians. Still, Paris is very big, so you should take the efficient metro to travel long distances. The Régie Autonome des Transports Parisiens or RATP system, which runs the metro, also offers several bus routes around the city. Those traveling to Paris by plane can arrive at Charles de Gaulle Airport (CDG), about 22 miles northeast of the city center, or Paris Orly Airport (ORY), about 11 miles south of the city.", "To get to Paris from CDG, you can take a bus (No. 350 or No. 351), hop an RER train (an airport shuttle from CDG takes passengers to the Terminal 2 RER station and the nearby Roissypole RER) or hop on the RoissyBus. Travelers with a late arrival time can also take advantage of the Noctilien night bus, which runs to Paris from midnight to 4:30 a.m. For those coming into ORY, travelers can take an airport shuttle to the nearest RER station (Pont de Rungis) or hop on the Orlyval shuttle train that goes to the Antony RER station. Both RER stations go straight to Paris. Taxis are another option, but can be quite costly averaging anywhere from 30 to 55 euros (around $33 to $61); driving is not recommended.", "If you're traveling from other French or European cities, you can also take the train to Paris. SNCF rail and TGV high-speed trains run throughout France (the former also travels to other European countries). The city has six main train stations, all of which also act as bus stops and metro stations, so you'll be able to get from the station to your hotel quite easily. You can also take the Channel Tunnel (aka the \"chunnel\") underwater rail service via Eurostar from London.", "A United States passport is required for U.S. residents traveling to Paris; children of all ages must have them, too. Your passport must be valid for at least three months beyond your date of departure. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on exit and entry requirements."]}