{"name": "Beijing", "description": ["\"That is a sleeping dragon,\" Napoleon once said. \"Let him sleep! If he wakes, he will shake the world.\" In 1803, the future French emperor recognized China's potential. Presiding over the greatest military and economic power of his day, Napoleon had an eye for opponents. Less than two centuries later, China's gross domestic product surpassed that of both Britain and France and continues to steadily climb. If he arrived in Beijing today, Napoleon would undoubtedly say, \"I told you so.\"", "Nowhere is China's influence more apparent than Beijing. As China's political and cultural hub, Beijing offers a glimpse into the nation's expansive history and its rapid modernization. You'll find preserved palaces rubbing elbows with new subway stations and tranquil lamaseries sharing space with world-class stadiums. Many of the city's historical sites, such as the Forbidden City and Tiananmen Square, are well-known to the world. Yet, the most popular attraction is located outside Beijing: The Great Wall of China serpentines through the hills north of the city. When you witness this astounding accomplishment of ancient China, you too will sense the immeasurable potential of this modern country.", "The best times to visit Beijing are from March to May and from September to October. These temperate seasons provide the best climate, not to mention colorful scenery. In contrast, summer brings sweltering heat, and winter ushers in cold temps and sometimes snow. While you should be mindful of the weather, you should also steer clear of national public holidays. Millions of domestic tourists flood Beijing's historic and sacred sites. The surge pushes room rates through the roof. (Note that Chinese workers will receive the two days following major holidays off work.)", "Even for locals, Beijing has a confusing medley of languages. The official language is Mandarin, however, Chinese citizens from across the country arrive with their own regional dialects (and sometimes entirely different languages). That said, Chinese visitors will probably have an easier time getting around than you will. Combined with culture shock, the language barrier can get in the way of Western travelers. If you are traveling with a group, consider hiring a bilingual guide. He or she will be particularly useful on excursions outside of Beijing where it's more difficult to find English-speakers. In the city, you'll find that only some hospitality industry workers will speak some English. Be patient when you communicate with locals and bring a Mandarin phrase book.", "China's official currency is the Renminbi; however, amounts are often referred to in terms of \"yuan.\" Yuan is the primary unit of the Renminbi, like the \"dollar\" in the U.S. Vendors may announce prices in RMBs (the unofficial abbreviation for Renminbi) or yuan, but they are actually referring to the same thing. The current exchange rate is about $1 for 6.90 yuan. Tipping is not customary in China.", "With literally tens of thousands of restaurants in the China's capital city, Beijing certainly has something for every taste and cuisines from every corner of the globe. Peking duck, perhaps Beijing's most famous dish, is served all over the city and not to be missed. This tasty dish is composed of roasted duck, with crispy skin, served with pancakes, sweet bean paste, cucumber and scallions. Diners wrap the duck and other ingredients into the pancake and eat.", "Dumplings are another ubiquitous item and can be found everywhere, from street corners to fine dining restaurants. Another classic Beijing dish is zhajiangmian, made with thick wheat noodles, radish, cucumber, and other vegetables, combined with a sauce made from diced pork belly and sweet bean paste. You might see \"imperial\" cuisine touted at some restaurants, which derives from the kitchens of Beijing's former imperial palaces, and features pricey ingredients, elaborate preparations and fancy presentations.", "If you opt to use chopsticks when you eat, don't wave them around, stab your food or stick them upright in your rice. All of these are considered in bad taste in China.", "The best ways to get around Beijing are on foot and by subway. As one of the largest, most populous cities in the world, Beijing has its fair share of traffic problems. During morning and evening rush hours, the roads are clogged with a mix of cars and bikes. Therefore, the only ways to get around efficiently are on your own two feet and the subterranean route. Most of the top attractions are clustered together, so walking to each one is your best option. If you're traveling long distances, hop on the subway, get off at the station closest to your destination, and then flag a taxi. Whichever mode of transit you decide to use, be sure to purchase the newest possible map. Beijing's thoroughfares and transportation system are evolving at an incredible rate.", "Most visitors arrive through Beijing Capital International Airport (PEK), located about a 30-minute drive (sans traffic) from downtown. While visitors find taking a cab into the city very easy, others avoid the extra cost by using the Airport Express train to reach subway lines 2, 10 and 13. The ticket costs 25 yuan, or about $3.50. ", "In addition to a U.S. passport that's valid for at least six months from entry date with two blank pages, Chinese authorities require you to have a government-issued visa indicating the length of your stay. Visas are only available at Chinese embassies and consulates. Appointments are not required, and you do not need to show up in person. However, you must have someone hand-deliver your materials. Several regions, like Tibet, are restricted to tourists and demand special travel permits, which add additional costs. For more information, check out both the U.S. Department of State's website as well as the Embassy of the People's Republic of China's website."]}