{"name": "Telluride", "description": ["The origin of this Colorado mountain town's unique name is unknown, but there are a few dominant theories. The first is that Telluride comes from the word \"tellurium,\" the semimetallic element (often signifying the presence of gold deposits) that prompted 19th-century fortune-seekers to make their way to the region. Other historians say that \"to hell you ride\" was a common send-off for anyone heading by horse and wagon to reach the remote outpost in the craggy San Juan Mountains. The rallying cry may have also referred to the region's rowdy mining town atmosphere. Today, residents and visitors alike continue to enjoy a foot-stomping good time in Telluride's Main Street bars or at Town Park music festivals. And Telluride's biggest attraction, its 2,000-plus acres of ski terrain, regularly draws gleeful hoots and hollers from avid skiers and snowboarders – experts and beginners alike. In the end, it doesn't matter where the name comes from – all that really counts is the great experience you're bound to have here.", "The best times to visit Telluride are from Memorial Day weekend through September and from December to early April. Though these summer and winter seasons mean thicker crowds and higher room rates, they're prime times to take advantage of Telluride's popular festivals and world-renowned skiing. (With a caveat that early ski season snow can be fickle, and terrain is typically limited until Christmas week.) Save money by vacationing between mid-April and mid-May or between October and mid-November, the town's quiet spring and fall shoulder seasons. Keep in mind, though, that these months are when many shops and restaurants close for maintenance and to give hard-working staff a break. The free gondola also stops operating in the offseason.", "There are two tourist-friendly areas Telluride is home to two distinct villages: the original Victorian town of Telluride, founded in 1878, and Mountain Village, a pedestrian-friendly resort town developed in the 1980s and incorporated in the 1990s.", "Avoid the holidays Telluride's ski season is in full swing come Christmas. You'll find less crowded slopes and lower room rates if you book your ski trip in late November to early December or late March to early April.", "Plan ahead for party time If you're taking part in one of the town's world-renowned annual festivals, you'll save money by booking your trip well in advance.", "The valley that is now Telluride has a unique cultural heritage dating back to the Ute Native Americans who used the land as their summer camp until Spanish explorers discovered the region in the late 1700s. About 50 years later, the discovery of gold changed the area forever and led to the establishment of Telluride in 1878 and the coming of the railroad not long after. After the mining boom collapsed 20 years later, the town's population dwindled and its future was uncertain.", "Fast forward to the 1970s when Telluride resuscitated itself as a world-class ski destination. People flocked to the secluded slopes for their breathtaking views, fresh powder and vast number of hiking trails. A variety of annual festivals in the warmer months are also weaved into the fabric of Telluride's culture – bluegrass, independent film, hot air balloon, wine, playwrights, yoga – the list goes on.", "Even with large events that draw thousands of people year-round, Telluride remains a small village in the mountain valley with a laid-back vibe. Only about 2,500 residents live here permanently, which adds to its appeal with visitors looking to get away from the hustle and bustle of larger resort towns.", "For a small mountain town, Telluride boasts an impressive array of dining options. Keep things casual at bakeries, burger joints and barbecue restaurants. There's even a trailer serving top-notch Middle Eastern food and a shack for hot dogs and shakes. Pizzerias and plentiful brewpubs are other spots to nosh in a laid-back atmosphere in both downtown Telluride and Mountain Village.", "On the flip side, you can splurge on multi-course gourmet meals featuring locally sourced ingredients. Colorado alpine fare includes elk, lamb chops, Rocky Mountain trout and bison. Be advised that some resort restaurants are closed or have limited hours outside the peak winter and summer seasons.", "The best way to get around Telluride is on foot. The town is just 12 blocks long and eight blocks wide, so anything you could need – shops, cafes, restaurants, hotels – is just a short walk away. Plus, Telluride has an extraordinary public transportation system. The in-town bus, the on-demand shuttle service and the mountain gondola (all free) can usually get you where you want to go in town and to and from Mountain Village. If you're interested in exploring beyond Telluride and Mountain Village, you may want to rent a car – preferably one with all- or four-wheel drive. ", "The two closest airports servicing Telluride are Telluride Regional Airport (KTEX) and Montrose Regional Airport (MTJ). Upon arriving at either airport, you'll need to take a private or shared shuttle into town. Popular shuttle companies include Telluride Express, Mountain Limo, Alpine Luxury Limo, and TelluRides. Reservations are required for shuttle rides to and from the airport. You won't be able to simply hop in a taxi to get you to your destination as there are no local on-demand taxis. You'll also want to check with your lodging to see if it offers round-trip transportation to and from surrounding airports.", "Popular ride-sharing services Uber and Lyft are not authorized to operate at the Telluride airport. Not all peer-to-peer car-sharing hosts like Turo are authorized either. In-town ride-sharing drivers have come and gone over the years, so don't count on these methods of transport."]}