{"name": "Krakow", "description": ["Much more than the sum of its parts, Kraków is one of those cities you have to explore a little before its true charm becomes apparent. Although Warsaw is the political capital, many consider this southern city the true cultural capital of Poland. When you first walk into the medieval Main Market Square, a smile plays across your face as you realize a large part of your trip will be spent here. Lively restaurants, shops, cafes and bars lie along the perimeter and in the surrounding areas.", "The best way to orient yourself in Kraków is to break the city into three main sections. The Main Market Square is at the center of Old Town (Stare Miasto), which itself is at the center of Kraków. Most of the major tourist draws are clustered near the Old Town and just south in Kazimierz. Notable excursions further afield include the \"Wieliczka\" Salt Mine and the Auschwitz-Birkenau Memorial and Museum.", "The best times to visit Kraków are from March to May and between September and November. The weather is pleasant and the summer's throngs of tourists are nowhere to be found. July and August's weather often climbs into the mid-70s, while the average low in January is in the low 20s. However, there really is no bad time to visit Kraków. The summer features some of its most lively festivals. And while the winters can get quite cold, the city compensates with its surprising beauty and affordable rates.", "Many visitors come to Kraków to learn about its World War II and Cold War roots, but what you may not expect to find are flourishing nightlife, art and music scenes. In fact, the city is rumored to have the highest concentration of bars in the world, with the Old Town and Kazimierz neighborhoods being considered the best regions for drinking, live music and clubbing.", "Much of the Polish population (especially the younger generation) speaks English, so you shouldn't have trouble communicating. While Polish is not the easiest language for English speakers, saying basic words and phrases in Polish like \"czesc\" (hello), \"prosze\" (please), \"dziekuje\" (thank you) and \"do widzenia\" (goodbye) is appreciated.", "The Polish zloty is Poland's official currency (1 Polish zloty is equal to $0.27). Since the Polish zloty to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Poland's membership in the European Union means euros may also be accepted at select stores and restaurants. ATMs are easily found in the city center and tend to offer more favorable fees than money exchangers. Credit cards are also widely used in the central areas of Poland. And remember, tipping is not customary here, but if service is above average, feel free to tip 10 to 15 percent of your bill.", "While not known as a dining mecca, Kraków has made large strides in recent years. The dining scene has evolved with the surge of tourism that Kraków has enjoyed over the last decade. The city features a nice blend of affordable and fine dining establishments, and the Old Town is virtually overflowing with eateries of every type. For some of Kraków's best local fare – like zurek (a sour rye soup made with sausage and potatoes that's commonly served in a bread bowl) and pierogies (potato-filled dumplings) – visit Starka Restaurant & Vodkas and Przystanek Pierogarnia. Recent travelers also recommend Taste of India for Indian dishes, Nago Sushi & Sake for sushi rolls and Bianca Restauracja for Italian cuisine.", "If you're craving authentic Polish bites on the go, try some of Kraków's street fare. Sold at food trucks and curbside vendors throughout the city, local street fare is hearty yet affordable. Must-try items include zapiekanka (a baguette half loaded with mushrooms and cheese that's often garnished with ketchup, chives or fried onions), obwarzanek (thin bagels generally topped with poppy seeds, sesame seeds, salt or cheese) and kielbasi (grilled sausages served with a roll or on a bun with mustard).", "Kraków has a reputation for being a rather safe city in a rather safe country. However, as its popularity as a travel destination has grown, so has its pickpocketing community. Keep an extra eye on your valuables when you're hanging around popular tourist sites like the Main Market Square, and try to stick to well-lit areas at night. You'll also want to avoid public demonstrations and rely on ATMs or legitimate exchange kiosks for changing money. Additional safety tips for Poland are provided on the U.S. State Department's website.", "The best ways to get around Kraków are on foot and by tram. Walking is best suited for visitors who plan on spending the majority of their time in and around the Main Market Square area; to reach outlying areas, hop aboard one of the city's trams. While taxis will get you from A to B in a hurry, getting into Kraków from John Paul II International Airport Kraków–Balice (KRK), located roughly 8 miles west of the city, is easy enough – for less than $3, you can take the S1 train from the airport to downtown's Kraków Glówny station. You can also take the train to select neighborhoods and attractions like Oskar Schindler's Factory.", "Americans do not need a visa to stay in Poland less than 90 days. However, a passport that's valid for at least three months after your departure date is required. You'll also be asked to prove you have sufficient funds and a return airline ticket upon arrival. To find out more about entry and exit requirements, visit the U.S. State Department's website."]}