{"name": "Portland, OR", "description": ["From its manicured green spaces to its deliciously diverse food scene, Portland has become a must-see destination in the Pacific Northwest. The city overflows with cultural offerings – whether it's the stacks at Powell's City of Books or in one of the roughly 70 craft breweries in the Portland metro area. The city of many nicknames (Stumptown, the City of Roses, Bridge City, P-town, PDX) has emerged as an urbanite's dream, with some of the most pedestrian-friendly streets in the country, many of which are lined with food carts that have given Portland some of the best, most affordable and diverse street food anywhere.", "It's also full of adrenaline, with plenty of trails for hiking and biking (miles of them are found in Forest Park), as well as access to water sports along the Willamette and Columbia rivers that dissect and border the city – not to mention the volcanic Mount Hood. But the most-loved attractions are low-key and intangible: a sip of locally roasted coffee, a late afternoon chat at a brewery, a stroll through open art galleries on the first Thursday evening of the month. Hip, alternative and unrelentingly progressive, Portland is one of the most flourishing cities on the West Coast. ", "The best time to visit Portland is from June to August, when consistently warm weather allows the city's outdoorsy culture to thrive. Plus, summer is when the city's roses (especially at the International Rose Test Garden) are in full bloom. However, this is also the peak tourist season, so you'll have to book at least a couple months in advance to ensure availability and the best room rates. If you're looking to score a bargain on a hotel, consider a winter trip. Chilly temperatures repel sightseers, but Portland's proximity to Mount Hood makes it a great destination for winter sports enthusiasts. No matter what time of year you visit, you'll find a variety of niche local events to choose from. ", "Be cautious This is a relatively safe city, but that doesn't mean you should let your guard down. Be careful walking through unfamiliar areas after dark.", "Only rent a car if necessary Parking at downtown hotels is expensive, and at some properties charge as much as $50 per night. Unless you're planning a daytrip, avoid renting a car.", "Dodge the lodging tax Be aware that Multnomah County (where Portland is located) charges an 11.5% lodging tax for hotels and short-term rentals. Avoid it by staying across the Columbia River in Vancouver, Washington.", "Portland has emerged as a hub for all things artistic, alternative and intellectual. The city is home to a vibrant arts and music scene, and as such it attracts young, progressive citizens looking for a laid-back lifestyle in the Pacific Northwest. Even if that lifestyle isn't your thing, Portland probably has something you'd be interested in. From jazz to classical, there's plenty of music flowing through the city, and the hipster community has also opened up a variety of vinyl record stores for those craving a bit of musical nostalgia.", "Art lovers can soak up everything from the contemporary to the Native American-inspired to the quirky during free monthly art walks that take place on the first Thursday of each month. Those who love performance art can take in shows that range from live storytelling to ballet to theater, as well as an international film festival that's gained traction in the last few years.", "Portlanders are also known for being very environmentally conscious, so plan to recycle and don't litter. Green spaces of all sizes are scattered throughout the city, and Portland citizens also love the outdoors, rain or shine. Bring a rain jacket and some hiking boots to enjoy all the City of Roses has to offer.", "Known as one of the best foodie cities in the country, Portland has a multitude of options – from the high-end to affordable. You won't have to look hard for cheap eats, as the city boasts of hundreds of food carts and trucks (more than 600) throughout the city, many concentrated in \"pods\" throughout the downtown area. Check out these maps to see where many are located. For a crash course in the city's culinary scene, consider signing up for a food tour; past visitors recommended Forktown Food Tours for its friendly guides and their ability to accommodate a variety of diets. If you can't make a tour, you'll want to stop by the Portland State University farmers market, where more than 200 local vendors set up camp every Saturday on the PSU campus.", "More upscale options also abound – like the top-rated Le Pigeon that serves French-inspired food or the modern Spanish gastropub Ataula. Other popular options include Peruvian fare at Andina, Argentinian-inspired cuisine at Ox and classic seafood at Roe. If you're looking for a dose of Pacific Northwest fare, check out Imperial. You'll also want to enjoy a few meals at the city's top Asian eateries. Nong's Khao Man Gai, Departure, Saucebox and Bamboo Sushi, among many, many others. Chefs (and residents) pride themselves on using only fresh, local ingredients, so no matter what price point or type of cuisine you're looking for, you won't go hungry in PDX.", "And don't forget the beverages Portland are known for – coffee and beer. Although you can't go wrong with any beans that are locally roasted, Stumptown Coffee Roasters is a popular choice. When it comes to beer, you'll have your choice of dozens of craft breweries within the city. If you have a hard time narrowing down your options, consider a tour, such as BREWVANA Brewery Tours, which comes highly rated among past visitors.", "Remain cautious when traveling through downtown, Old Town, The Pearl, 82nd Avenue and Sandy Boulevard at night. During the day, the city and its tourist centers remain safe relative to other large cities. Still, you should take mind and guard your belongings on subways and other public transport. Getting around the city on a bicycle is definitely worthwhile, but plan to wear a helmet.", "The best way to get around Portland is public transportation, although you shouldn't rule out your own two feet. This city is known for having one of the easiest and most tourist-friendly public transportation systems in the country, with extensive routes from TriMet buses and light rail trains. You can hop on the light-rail from the Portland International Airport (PDX) and get into the city for a little more than $2, which is much cheaper than cab fare (around $35). Rental cars from the airport can come in handy for making daytrips outside of the city to places like Mount Hood and the Willamette Valley."]}