{"name": "Martha's Vineyard", "description": ["This triangle-shaped island – sitting about 8 miles off the coast of Cape Cod, Massachusetts – has been a secret summer hideaway of the rich and famous for more than a century. Today, the \"Hollywood East\" reputation is going strong thanks to frequent visitors like former President Barack Obama, David Letterman and Bill Murray, among many others. But despite the all-star summer lineup, a laid-back lifestyle rules the island. The main draw rushing Vineyard visitors off the ferry is the chance to let their hair down for a long weekend. Sure, you'll find insanely expensive summer cottages and pricey restaurants in some corners of the island like Chilmark. But low-key towns and villages like Vineyard Haven and Menemsha are still predominantly focused on their marine industries and offer a more casual experience. Even the island's must-have souvenir – a Black Dog sweatshirt – is informal. So swap the stilettos for your scrappiest flat sandals, and do play it cool when you spy some film stars in Edgartown; everyone deserves a slice of a Vineyard vacation.", "The island is divided into six towns You'll probably spend most of your time \"down-island\" in Edgartown, Oak Bluffs and Vineyard Haven (also referred to as Tisbury).", "BYOB Despite changes to beer and wine licensing in past years, the town of Chilmark remains dry. If you want to sip some wine with your meal, you'll have to bring your own (just be prepared to pay a hefty corkage fee). Even in the other towns that do serve alcohol, you may run into rules, such as a required food purchase with your drink.", "Leave the car on the mainland Not only will you have to fork over as much as $220 to take your car on the ferry, but you'll also have to navigate tourist-clogged streets. Plan to rely on your own two feet and the island's affordable bus system instead.", "Visit in September Hotel prices drop drastically once peak summer season passes. Plan a trip after Labor Day and you'll enjoy more affordable lodging rates and fewer crowds. Plus, the Atlantic's waters are still relatively warm this time of year.", "Martha's Vineyard is famous for its lack of fast food restaurants, but with all of the delicious seafood and locally grown produce populating the island's eateries, you won't miss those takeout menus. In fact, you'll eat very well. ", "If the thought of a Starbucks-less vacation sends you into a spiral, don't worry: There are plenty of breakfast spots on the island that can fulfill your daily caffeine and pastry fix, including Espresso Love and Nat's Nook. For a bigger menu and a unique dining atmosphere, head to The Right Fork Diner. Situated on the Katama Airfield in Edgartown, the diner offers unobstructed views of the biplanes taking off and landing, making it a popular spot for families.", "When you're ready to sample some of the island's marine bounty, critics and locals agree: Larsen's Fish Market should be your first stop. Sitting pretty in the fishing village of Menemsha, Larsen's offers some of the freshest lobster and oysters in town. And if you're craving lobster rolls, you won't have a hard time finding them. For the best deal, head to Grace Episcopal Church in Vineyard Haven. On Fridays during the summer months, the church offers a lobster roll, chips and a beverage for a bargain, with proceeds going to local nonprofits. Offshore Ale Co., a restaurant and brewery in Oak Bluffs, is well-known for its East Chop Lighthouse Ale and casual atmosphere (go ahead, throw those peanut shells on the floor), but it's also home to one of the island's best lobster rolls. And, of course, no visit to the Vineyard would be complete without a stop at Black Dog Tavern. Considered by many to be an island institution, this waterfront eatery is just steps from the main ferry and features some of best casual seafood dishes in town. Don't leave without trying the quahog chowder.In the mood for something a little more formal? The vineyard has you covered there, too. The Port Hunter (try the raw bar) and State Road (try the scallops) are both worth the hype, according to recent visitors. And when you're ready to let loose and dance with some locals, head to The Ritz, a legendary dive bar in Oak Bluffs that features live music and karaoke. ", "Leave the car on the mainland and get around Martha's Vineyard via bike. It's a cheaper, more pleasant way to tour the island, according to recent visitors."]}