{"name": "Marrakech", "description": ["For the organized, logical traveler, Marrakech may seem like a nightmare. Its labyrinth of twisty alleyways are almost impossible to navigate, not that its array of snake charmers, fortune tellers and spice sellers will let you go anywhere fast. The problem here isn't the city: It's your state-of-mind. Leave your structured daily routine behind and let the ebb and flow of Marrakech draw you deeper into its colorful chaos.", "Start your visit within the salmon-pink walls of the Medina of Marrakech, which contrasts with the white, jagged peaks of the nearby Atlas Mountains and serves as the inspiration for the city's nickname, the Red City. This ancient part of Marrakech houses the famous Jemaa El Fna square that brims with food vendors selling everything from sheep's heads to snails beneath creamy awnings. From here, allow yourself to be lured down the shadowy alleyways to souks (or markets) filled with cones of burgundy-, auburn- and citrine-hued spices exuding an aromatic haze. Stroll past the carpet sellers, with their cobalt-, jade-, and crimson-threaded merchandise, and make your way to architectural marvels like Koutoubia Mosque and the Bahia Palace. Should you desire a break from the medina's bustling streets, retreat to a hammam (public bath) or Majorelle Garden.", "The best times to visit Marrakech are from March to May and between September and November. These shoulder seasons are known for their desirable weather (with average daytime temps in the low 70s to low 90s) and affordable hotel rates. Avoid visiting in the brutally hot summer when highs regularly top 100 degrees and the city sees a large influx of tourists and expats. The winter months offer temperatures in the low 40s to upper 60s but also see a spike in tourism, with visitors from colder climates flocking to the Red City in search of warmer temps. Be mindful of religious holidays, such as Ramadan and Christmas, as well as national holidays that follow the lunar calendar, which can affect everything from public transportation to attraction hours to room rates. ", "Hire a guide Professional guides can help you navigate Marrakech's maze-like alleyways. But don't let them do your shopping for you: Some guides will steer you toward specific vendors (and higher prices) in exchange for a commission.", "Dress appropriately Most Moroccans are Muslims, so pack conservative attire that covers your shoulders, chest, midriff and knees. You'll want to be especially mindful of your appearance while visiting Koutoubia Mosque and other religious sites.", "Watch your pockets Pickpockets run rampant in heavily visited areas like Jemaa El Fna. Carry any valuable items in zippered bags under your arm or in your front pockets.", "Choose your room wisely When making hotel or riad (traditional guesthouse) reservations, ask where the nearest mosque is located. The first of six calls to prayer takes place between 3:30 and 6 a.m. and can wake even the heaviest sleeper.", "Pay in cash You can use credit cards at some restaurants, but you'll avoid any problems with the exchange rate – not to mention credit card scams – if you pay with cash instead. Plus, most shopkeepers do not accept credit cards.", "Exercise willpower It's hard to resist the medina's beautiful crafts, but don't let a hawker's stubborn sales pitch dupe you. If your bargaining skills don't sway them, walk away. There's always another shop.", "Eat in the streets Marrakech boasts an impressive array of restaurants, but you can savor authentic flavors and save some coin if you get your meals from street vendors. You'll find plenty of options in Jemaa El Fna.", "Imagine holding the past in one hand, the present in the other and mashing them together – Marrakech would be the result. The ancient ramparts seem to keep time from escaping the medina and its bustling Jemaa El Fna, which is filled with lively Berber chemists, snake charmers and more. Meanwhile, in Ville Nouvelle (New Town), located just outside the medina walls, you'll discover a city reminiscent of quintessential France. Wide boulevards contrast the old city's narrow alleyways, while chic cafes take the place of crowded spice stalls.", "Marrakech's dueling influences – French and North African – have created a hybrid of cultural traditions. While you'll most likely hear locals speaking Darija (Moroccan Arabic), residents will often greet you with a hearty \"bonjour\" (hello). Many residents know limited English as well, but carrying around a French phrasebook and learning a few key phrases in Darija and French – such as \"Labas?\" and \"Comment allez-vous?\" (How are you?), \"Ma'arft\" and \"Je ne comprend pas\" (I don't understand), and \"shukran\" and \"merci\" (thank you) – won't hurt.", "Christians and Jews make up a fair portion of Marrakech's population, but Islam is the dominant religion here. The city is speckled with dramatic domed mosques, including Koutoubia Mosque in the medina. Visitors can admire the ornate arches from the outside, but the interiors are reserved for practicing Muslims. Although strict dress codes aren't enforced, wearing conservative attire (think: shirts and pants that cover your shoulders, chest, midriff and knees) is strongly advised, especially in older parts of the city.", "The Moroccan dirham is Morocco's official currency. One dirham is equal to $0.11. Euros (1 euro equals approximately $1.22) are also accepted by some vendors in Marrakech, but exchange rates are generally more favorable when using dirhams. Most shopkeepers and restaurants do not accept credit cards. Dirham to dollar rates often fluctuate, so check the latest exchange rate before you go.", "There is no standard tipping policy in Morocco, but it is generally best to leave at least 10 percent of your restaurant bill when you receive great service. Some eateries in areas frequented by tourists will automatically add a tip to your bill, so be sure to check before tipping. For taxi services, round up to the nearest 5 dirhams. When visiting a hammam, it's customary to leave 20 to 25 dirhams (or $2 to $3) per attendant. And at hotels, expect to give 10 to 20 dirhams ($1 to $2) to bellhops and 20 dirhams (about $2) per day or 100 dirhams (less than $11) per week to housekeepers. Professional tour guides are paid well, so tipping for their services is not expected.", "One of North Africa's most unique cuisines is Moroccan, and one of the best places to sample it is in Marrakech. Known for their unconventional flavor combinations and subtle spices (think: cinnamon, saffron, cumin and turmeric), Moroccan dishes are featured on many restaurant and cooking class menus throughout Marrakech. Must-try delicacies include tagines (stews baked in traditional clay, cone-shaped pots that go by the same name), couscous (a fine wheat pasta commonly served with a protein and vegetables) and salads made with ingredients like carrots and dates. Traveler-approved restaurants that specialize in authentic Moroccan fare include Corner Cafe, Dar Chef and Libzar.", "No visit to Marrakech would be complete without savoring the city's world-renowned street fare. Areas like Jemaa El Fna are packed with food stalls selling an array of tasty items. Traditional options include b'stilla (a layered pastry made with pigeon, almonds, eggs and various spices), harira (a tomato-, chickpea- and lentil-based soup generally served during Ramadan) and snails simmered in a citrusy, herb-filled broth. Another delicacy prepared by some street vendors is steamed sheep's head, which is sold by the half or whole head. For less adventurous travelers, Marrakech also offers kabobs (grilled, skewered meats), makouda (deep-fried potato balls) and chebakia (fried sesame cookies molded into flower shapes).", "To cool off after a long day in the sun, Moroccans love to sip orange juice, which is made with oranges grown in Marrakech's alleys and courtyards. Additionally, locals enjoy serving mint tea to guests or drinking it while catching up with friends. This flavorful tea combines gunpowder tea (a kind of Chinese green tea), sugar and fresh spearmint leaves, and is poured from high above the glass to create a crown (or froth). Both beverages are available at food stalls and restaurants throughout the city.", "The best way to get around Marrakech is on foot. Sure, this is a big city, but most of the main attractions are clustered at or within walking distance of the medina. Alternatively, if you're looking for a fun way to get from the medina to other parts of the city, consider taking a calèche (horse-drawn carriage). Or, you can take one of ALSA's Tourist Buses to many popular Marrakech sights. Upon flying into Casablanca's Mohammed V International Airport (CMN) and taking a train to the Marrakech Train Station or continuing on to Marrakech Menara Airport (RAK), located about 5 miles southwest of the medina, you can either take a taxi or an ALSA bus to the city center. Many hotels also offer airport shuttle services.", "You will need a valid passport with at least one blank page to enter Morocco, and you can stay up to 90 days without a visa. While in Marrakech, carry a photocopy of your passport (leave the physical copy in a secure location) in case local officials stop you to check your ID. To learn more about entry and exit requirements, visit the U.S. State Department's website."]}