{"description": ["Exploring Albuquerque's history is like reading the rings on a tree trunk: The city has expanded outward over time. At its heart is Old Town, the site where the original city was founded in 1706 and where Native American and Spanish cultures still mingle. You'll also find a certain level of kitsch, deposited from the heyday of the bona fide Route 66 that runs through the heart of town. Head farther out and you'll find expansive homes and lush vineyards in the North Valley and Corrales.", "Despite this ongoing urban sprawl, Albuquerque stays true to its roots. Hispanic flavors can be found in many of the city's restaurants (prepare for the ear-popping heat of New Mexico's favorite ingredient, the chile pepper). Native American arts adorn many a gallery window. But despite its old age – the city celebrated its 300th birthday in 2006 – Albuquerque is nothing short of cosmopolitan, boasting funky boutiques, top-notch performance venues and exciting nightlife. To top it all off, the city's proximity to the stunning Sandia Mountains makes it a great home base for Southwest discovery.", "The best time to visit Albuquerque is from September to November. The fall season sees pleasantly warm temperatures (ideal for a stroll on the Paseo del Bosque Trail) and many a party as festival season goes into full swing. Skiers flock to town in the winter months, hitting the slopes of the Sandia Mountains and contributing to the raised hotel rates. However, tourists often overlook spring and summer, meaning hotel deals are plentiful at those times.", "Beware of the sun Albuquerque sees 310 days of sunshine and experiences an average relative humidity of 44%. Though you likely won't need to pack an umbrella, you will need to slather on the sunscreen and drink plenty of water to prevent heat exhaustion.", "Beware of the altitude ABQ sits at 5,000 feet above sea level. Since the air is thinner at this elevation, you may become tired faster, especially during physical activities.", "Beware of the chile pepper The chile pepper is one of the official state crops of New Mexico, so you can expect to experience its spicy flavor fairly often. If you can't handle the heat, nosh on some local barbecue specialties instead.", "Take the bus If you're planning to spend most of your time within city limits, you can save on car rental fees and gas prices by using public transportation. ABQ RIDE offers bus service throughout the greater metro area.", "Skip the celebration Albuquerque hosts several major festivals throughout the year, including the very popular Albuquerque International Balloon Fiesta in October. You'll find cheaper room rates if your trip doesn't coincide with any of these events.", "Take advantage of deals Visit Albuquerque offers a selection of coupons and specials on its website for everything from golf and spa packages to dining deals.", "When dining in Albuquerque, you'll encounter your fair share of strong and spicy flavors, and in doing so you'll also gain a deeper understanding of how food plays into the city and state's history and defines its identity. New Mexican cuisine is a combination of Mexican, Native American and Spanish flavors. Dishes are built on a foundation of native ingredients, namely corn, beans, squash and, perhaps most importantly, chiles. The chile comes in two varieties: red and green. If you're at a restaurant that serves New Mexican cuisine, you'll likely be asked, \"Red or green?\" If you want to taste both, say you'd like your dish served \"Christmas-style.\" High Noon Restaurant and Saloon in Old Town is a favorite New Mexican eatery that's as popular for its steak as it is its tequila. But if you really want to heat things up, plan on attending the annual National Fiery Foods & Barbecue Show in March, which features more than 200 booths filled with more than 1,000 products related to chile peppers.", "Another element that makes Albuquerque's food scene so unique is the city's wine. Spanish missionaries planted the first grape vines in New Mexico in 1629, which means the Rio Grande Valley is the oldest wine making region in the country. You'll find a variety of wineries around Albuquerque and Corrales, New Mexico (the visitors bureau offers a directory), but if you want to sample a bit of everything, consider visiting during the Albuquerque Wine Festival, which takes place in May. Prefer suds to grapes? The city is also home to a variety of craft breweries. You can map out your own brewery crawl, or attend one of the city's beer events like ABQ Beer Week, ABQ Blues and Brews or the Albuquerque Hopfest.", "Beyond its New Mexican eateries, Albuquerque offers a variety of fine dining restaurants. Travelers and locals particularly enjoy Restaurant Antiquity and Artichoke Cafe. If you'd like to sample some authentic Native American cuisine, both travelers and the visitors bureau suggest you head to the Indian Pueblo Cultural Center, which has its own cafe and bakery.", "The best way to get around Albuquerque is by bus. ABQ RIDE operates bus routes throughout the city, making it easy and affordable to get from one neighborhood to another. Once you've reached a specific district, you'll find it fairly easy to explore on foot. ABQ RIDE also offers transportation to and from Albuquerque International Sunport (ABQ), which is located less than 5 miles south of the downtown area. If you'd like to take the bus into town from the airport, head to the west end of the lower level and look for the No. 50 bus. Keep in mind: If you're looking to take a daytrip into the mountains, a rental car will come in handy. Rental agencies are available at the airport and in town. Ride-hailing apps, such as Uber and Lyft, also operate in the Albuquerque area."]}