{"name": "Cairo", "description": ["The desert heat, the noisy streets and the sheer size of Cairo will leave even the most adaptable traveler with a serious case of culture shock. The constant bombardment of street vendors, the inescapable aroma of livestock and the seemingly chaotic way of life will joggle the senses. But be patient. Take some time to relax over a cup of tea, to wander the ancient streets and to watch the sun lower over the mighty Nile River. It won't take long for the city's treasures to reveal themselves.", "Most visitors flock to Egypt's capital to explore the wonders of the ancient world, following the footsteps of the pharaohs. But there are two sides to Cairo; the city's residents embrace their history and rejoice in their progress. The ancient pyramids of Giza, Dahshur and Saqqara fight with the trendy bars of the Zamalek and Heliopolis neighborhoods for spotlight. Honking taxi cabs vie for space with braying donkeys in the narrow streets. And the traditional Islamic call to prayer, lounge music and boisterous banter can be heard simultaneously. The only way to get a true sense of Cairo is to take the old with the new.", "The best times to visit Cairo are from March to April and from October to November. These short shoulder seasons welcome comfortable temperatures, fewer crowds and low hotel rates on most days of the week. Winter is by far the most popular time to visit Egypt's capital because the days are warm and sunny and the evenings are cool and breezy. If you're planning a trip between December and February, you can expect swarms of tourists. You'll find the best deals on hotels during the summer, but for many, battling the heat isn't worth the savings.", "Following the Egyptian revolution of 2011, Cairo has suffered from a lack of political stability. This shouldn't affect you as a tourist, but to stay on the safe side, avoid any public protests. You should also ensure that someone at home knows your itinerary. Once you arrive in the city, determine how far you are from the American embassy – located in the Garden City neighborhood in central Cairo – and the most convenient route there.  ", "A visit to Cairo is like an assault on your senses: The city's barrage of noise – shouting merchants, screeching traffic and braying livestock – is a lot to process. The key to adjusting to Cairo is succumbing to its organized chaos and letting yourself fall into its rhythm. One of the hardest aspects of Cairo's culture to adapt to is the residents' chatty nature. The primary language here is Arabic, although residents may also speak English or French. You're likely to be approached by fellow passersby who wish to strike up a conversation or con you into an unofficial tour or an unwanted souvenir. If you're not in a chatty mood, simply smile and continue on your way. Just make sure you keep a vigilant eye on your belongings; it's easy to get distracted by a market vendor or a street performance only to later discover that your wallet is missing.", "Cairo's frenzied atmosphere lulls during Ramadan, the Islamic month of fasting. The majority of the city's population participates in this ritual, abstaining from eating and drinking during daylight hours. During Ramadan – which takes place during the ninth month of the Islamic calendar – Cairo exudes a sense of calm. But once the sun sets and the evening call to prayer begins, the clamor resumes as thousands of Cairenes take to the streets in search of a place to break the fast (a ritual known as Iftar) or to nab a good seat at one of the many free concerts taking place. You should note that finding a daytime snack or drink can be tough during Ramadan; some recent travelers recommend adjusting your schedule (sleeping in and staying up late) and joining in the fast.", "You should also follow suit in terms of how you dress. Cairenes tend to dress conservatively in long pants or skirts and shirts that cover the shoulders. This is especially important for women, who often become the object of unwanted attention. Bear in mind that you're less likely to get hassled if you're traveling with a male companion or in a group. If you're visiting a mosque, you'll need to remove your shoes and put on a hijab (or headscarf), which will be provided to women whose heads aren't already covered.", "The primary currency here is the Egyptian pound (EGP), which is roughly equivalent to $0.11 USD. Like Luxor, you'll be expected to tip for any service, including getting your bags carried and having a door held open for you. Be prepared with a pocketful of small change. Depending on the service, you should expect to tip between 1 Egyptian pound and 100 Egyptian pounds ($11).", "Cairo's dining scene reflects the people who frequent the city's streets and sights. While many restaurants are influenced by Cairo's geographic location, there are also a variety of internationally inspired eateries for tourists. Some of Cairo's most popular restaurants include Birdcage for Thai dishes, Shogun Japanese Restaurant and Left Bank for European-focused fare. American fast food franchises like McDonald's, Burger King and Pizza Hut are available as well.", "However, when you visit Cairo, expect to try Egyptian cuisine. Egyptian meals – like Middle Eastern ones – typically include bread, rice and vegetables like lentils and onions. Fish from the Nile River is also offered on many restaurant menus. To sample local dishes like aish baladi (Egyptian-style pita bread), hamam mahshi (rice- or wheat-stuffed pigeon) and mouloukhiya (rabbit or chicken stew with garlic and mallow – a leafy green vegetable), dine at restaurants like Abou El Sid and Felfela. For a more upscale atmosphere, try fine dining Middle Eastern and Egyptian restaurants like Sabaya and Sequoia.", "Keep in mind that Egyptians eat later in the day: Lunch is typically served from 1 to 4 p.m., while dinner service is offered between 8 p.m. and midnight. If your stomach starts to grumble in between meals, snack on street food favorites like koshari (a dish with rice, pasta and lentils covered in a thick tomato sauce) or ful medammes (mashed fava beans with seasonings).", "The best ways to get around Cairo are by metro train or taxi. Egypt's capital is constantly choked by traffic. But below Cairo's congested streets, the metro system is clean, affordable and extremely efficient. If you prefer to stay above ground, several fleets of buses can take you where you need to go for very little money. However, aside from those operated by the Cairo Transport Authority, buses here can be very crowded, tough to navigate and likely to carry pickpockets. Tour buses are safer and more convenient, but you'll have to pay more and stick to a set schedule. Taxis are the more affordable way to get to places that the Cairo Metro doesn't cover, especially from Cairo International Airport (CAI), which is located about 13 miles northeast of the city center. However, taxi drivers are some of the best con artists in the city. Arm yourself with inside knowledge of the city and you should be fine.", "Americans visiting Egypt will need a visa and a valid passport with one or more blank pages. Visas can be purchased upon arrival at Cairo International Airport for $25 – though Egyptian officials have occasionally denied visa requests without explanation – or through an Egyptian embassy or consulate before your trip for $15. Tourists who arrive from Israel will need to get a visa before landing in Egypt. All tourist visas are valid for 30 days. To learn more about entry and exit requirements, visit the U.S. State Department website."]}