{"name": "Minneapolis - St. Paul", "description": ["In the last half of the 20th century, famed architects like Jacques Herzog, Pierre de Meuron and Frank Gehry transformed the quiet Midwestern farming cities of Minneapolis and St. Paul into a booming cultural metropolis, complete with the contemporary Walker Art Center and the Weisman Art Museum. Minneapolis and St. Paul's artistic, architectural and theatrical renaissance has made this region of the Midwest culturally fertile. Case in point: Check out the cities' innovative live music and nightlife scenes, which once nurtured the careers of greats like Prince and Bob Dylan.", "Joined by roughly 10 miles of urban sprawl, these fraternal twin cities were named as such to remind outsiders looking in of their differences. Originally, Irish and German immigrants built St. Paul, while Scandinavians settled in Minneapolis. St. Paulites hold tight to their heritage, continuing architectural styles and beer brewing traditions. However, the Minneapolitans proudly favor modern progress. Residents are quick to distinguish the two, but visitors usually find it difficult. The buildings act as good markers of distinction: Minneapolis is cutting-edge, tall and modern; St. Paul is short, historical and modest. The contrast (and competition) only enhances the character of this coupled metropolitan area.", "The best time to visit Minneapolis-St. Paul is from June to August. Daily highs flutter around 80 degrees Fahrenheit, and residents and visitors venture outdoors and onto the lakes. Summer marks the peak tourism season and sees festivals and farmers markets in large numbers. Early fall is another pleasant time to visit, especially with the changing leaves and comfortable temps. Winters, on the other hand, are frosty. The temperature rarely rises above freezing. November through April is usually marked by plenty of snowfall – in fact, around 50 inches fall per year (on average), but there's still plenty to see and do at this time, and hotel and airfare deals are abundant. Minnesota is slow to warm up in spring (residents have been known to suffer through an April blizzard); May is a safer bet than March or April.", "Cheering and jeering The Minnesota Lakers moved to L.A. in 1960 (thank disappointing ticket sales). But since then, the city has gained a fervor for home teams like the Timberwolves (NBA), Vikings (NFL), Wild (NHL) and Twins (MLB). If you have time, get tickets to root for one of them.", "Warm up with a brewski Several breweries are scattered across the two cities and a few offer tours. St. Paul's Summit Brewing Co. has received particularly good reviews.", "Follow the college crowds The Twin Cities have a large college student population. Follow them, and you'll see the food and bar prices drop. Dinkytown is a sure bet.", "Make your way to a museum The city is chock-full of museums – and free ones, at that. The Minneapolis Institute of Art and the Weisman Art Museum are gratis.", "\"Minnesota Nice\" is a phrase often used to describe the courteous, mild-mannered character of Minnesotans. Whether or not you encounter this genial attitude, you will find that this big business hub is more humble than some of its East Coast counterparts. The Upper Midwest accent that elongates certain vowels, especially \"o,\" is another cultural mark that's often associated with Minneapolis, in part because of the dark comedy and subsequent TV series \"Fargo.\" You'll be able to detect the accent with certain words, especially when a native says, \"Minnesota,\" which you'll probably hear as, \"Minesooota.\"", "Although this area was once an agricultural hotspot, Minneapolis has experienced a cultural revolution. Today, this city features top-notch art museums and a collection of performance venues that rival New York City. Its improved cultural cachet has also lured award-winning chefs to the dual cities, including Andrew Zimmern. Pick up a copy of the Minneapolis St. Paul Magazine to learn more about what's going on during your visit.", "Minneapolis-St. Paul is a Midwestern mecca for foodies. No matter what you're craving, you can find it south of the downtown area on Nicollet Avenue, fondly known as \"Eat Street.\" Travelers who are looking to spend the day exploring downtown should have no trouble finding a great midday meal nearby, though choices can be limited to steakhouses and burger joints.", "For those with a more eclectic palate, head to the university areas in Nordeast and Dinkytown, where all types of international cuisines are represented. Popular Minneapolis spots include Butcher & The Boar and trendy Spoon and Stable, among many others. Some St. Paul favorites include Cossetta and Meritage. No matter which neighborhood you decide to dine in, keep an eye out for some of foods Minnesota is known for, including Juicy Lucys (cheese-stuffed burgers), Tater Tot casserole (or hot dish, as it's known in these parts), wild rice, walleye and cheese curds.", "If you're looking for a place to grab a pre- or post-dinner cocktail, head over to the Cathedral Hill area near St. Paul, where many young professionals gather for happy hour. Whether you prefer an elegant spot to nurse a glass of wine or a rowdy sports bar, you'll find it in this neighborhood.", "Also an emerging beer destination, the Twin Cities feature several breweries stationed around the metro area. If you're in Minneapolis, stop by Fulton Brewery or 612 Brew. If you're in St. Paul, Summit Brewing Company is your best bet.", "Minneapolis-St. Paul is a very safe place to visit. Residents are friendly and willing to help you out if you lose your way. But as is the case in most cities, being cautious never hurts. Stick to well-lit areas when walking around at night, and be extra mindful of your valuables, especially when riding the light rail. If you're visiting during the winter, keep an eye out for icy patches on the road, which can sometimes be hard to spot when driving at night.", "The best way to get around Minneapolis-St.Paul is by car and on foot. Take to the streets downtown via the Minneapolis Skyway, a system of enclosed heated walkways that allow visitors to meander the dense areas of town in comfort. A car is also a great option – it will allow you to venture into the suburbs and around the lakes, while taxis are useful downtown. Because of numerous garages, parking in the downtown area is rarely a problem, but similar to other big cities, traffic can still be a hassle. Metro Transit operates convenient bus and light rail routes that course through both cities. The Minneapolis-St. Paul International Airport (MSP) is also accessible by Metro Transit. If you're planning to take a cab from the airport to downtown Minneapolis, expect to pay between $39 and $49. Trips to downtown St. Paul generally cost between $31 and $38. Ride-hailing apps like Uber and Lyft also service the Twin Cities."]}