{"name": "Those Dam Boat Guys", "category": "Boat Tours", "hours": "10:00 AM - 10:00 PM", "address": "Nieuwe Leliestraat 2 1015 SP Amsterdam The Netherlands", "rating": 4.8, "number_of_reviews": 0, "reviews": [{"review": "Captain Andy was amazing! This is a must do in Amsterdam! The tour started at the shop where you can purchase drinks and snacks and pet a couple cats. The boat tour itself was informative and entertaining. Best part is adults only and a small boat. Hats off to Captain Andy for a lovely time.", "rating": "5", "visited": "Sep 8, 2024"}, {"review": "Awesome experience! It was great to get out on the water and see from a canal eye view. Would recommend this smaller intimate tour for anyone who wanted a canal tour.", "rating": "5", "visited": "Sep 16, 2024"}, {"review": "Those Dam Boar Guys is a great company to go through if you want to travel by boat though the canals of Amsterdam. It was a nice 90 minute tour and well worth it.", "rating": "5", "visited": "Sep 5, 2024"}, {"review": "There is no better way to explore the canals of Amsterdam than with Those Dam Boat Guys. Don't hesitate. Book your tour now! This was such a magical experience and such a memorable part of our trip to Amsterdam. This is also easily the best canal boat company for so many reasons.First, they only seat 8 people per tour, so you can expect an intimate trip. You'll see those big tours sailing down the canals and the people just look miserable on them. They're listening to those little audio guides and it just looks so boring. The intimate setting allows for a really personalized tour. We were able to chat with the others on our boat and it was so great to meet people from around the world. Our tour guide was so knowledgeable. He actually works as a historian and is recording a podcast for the Netherlands about their history. He was able to provide us with such rich information about the city, but did so in a way that was so fun and entertaining! The tiny boat also allows you to get into parts of the canals that aren't as accessible with the big boats. You can bring whatever drinks, snacks and smoke you want to enjoy! Even during the winter, we were able to take a ride without the windows up and they provided blankets and heat pads. This was truly a unique experience and the best way to explore the dam!", "rating": "5", "visited": "Mar 19, 2024"}, {"review": "Had a great second trip with these guys. The skipper adapted the tour to what we wanted, and we had a relaxed informational tour. Easy to book online, whole process is very smooth.", "rating": "5", "visited": "Jul 18, 2024"}, {"review": "This was so fun. Our skipper Mark was hilarious. We went in the evening so the sights were illuminated, it was beautiful. Mark wad both informative and entertaining. We went on a friend's recommendation and were so glad we do, this excursion is highly recommended.", "rating": "5", "visited": "Aug 10, 2024"}, {"review": "Loved meeting our friendly and outgoing tour guide,  Leroy! Thoroughly enjoyed how the tour conversation could veer into a guests specific areas of interest and we saw a lot more parts of the city in the canals than we would have known about otherwise. Very glad we took this tour and would 100 % do it again if we come back to Amsterdam! Thanks for a memorable trip TDBG and Leroy!", "rating": "5", "visited": "Jul 27, 2024"}, {"review": "Had a holler of a time on the THOSE DAM BOAT GUYS Amsterdam tour... The group was small - 12 people total - so it was a very intimate experience, which was great. If you are NOT comfortable with off-color jokes, cursing, and smoking, then this is not the tour for you. The vibe was more adult-friendly and I would not recommend any young kids.My only piece of feedback would be that the tour was less informational about the city than I would have liked it to be. I loved the unconventional way that our tour guide approached the tour, but it lacked any information. Based on the other reviews, I can only guess that it was our specific tour guide, rather than a company-wide issue.", "rating": "3", "visited": "Aug 31, 2023"}, {"review": "Captain Julian killed it! Exactly what I was hoping for; a leisurely tour of the city with a \"real\" person, conversational as opposed to someone just rattling off generic factoids you'd find on wikipedia. Facetious humor but underscored with an obvious respect for Amsterdam and the people that inhabit it. Also, shoutout to the office staff! Chilled in there before the cruise for a minute and they were very welcoming and set the tone for the tour to come.", "rating": "5", "visited": "Oct 20, 2024"}, {"review": "I first heard about the damn both guys on social media. I decided to book them for my canal cruise, and it was great! I think what I enjoyed most is that they use a small though, so it was only about eight of us plus the captain. So it made the experience more intimate, you could ask questions just chat and talk. Our captain was super awesome, too, gave us a lot of history, but also was very entertaining. They let you bring your own food and drinks on board! Their office is not too far from the loading dock, so make sure you stop in and use the bathroom before or after. They are super friendly!!", "rating": "5", "visited": "Oct 27, 2023"}], "reviews_count": "143"}
{"name": "A'DAM Lookout", "category": "Lounges,", "hours": "Local Flavor", "address": "Overhoeksplein 5 1031 KS Amsterdam The Netherlands", "rating": 4.2, "number_of_reviews": 0, "reviews": [{"review": "Swing Over The EdgeUsed the I Amsterdam Card to go to the top of the A'DAM Lookout Tower for a beautiful 360 birds-eye view of Amsterdam. Definitely climb up the stairs to the roof for an open air experience. Want a little extra adrenaline rush? Swing over the edge on Europe's highest swing. Dangle your feet in the sky and enjoy the feel of the open air. SO MUCH FUN!! Take the free ferry from Amsterdam Centraal to reach the A'DAM Lookout Tower. The A'DAM Lookout Tower is on the I Amsterdam Card. The swing is 7.50 euros in addition to the entry for the tower. So worth it.", "rating": "5", "visited": "Aug 10, 2024"}, {"review": "I was afraid to do this, as I don't like rollercoasters because of the motion making me sick. I was in Amsterdam with 4 other girls and they all encouraged me to go on the swing. It's about a minute if I'm remembering correctly and was under $20. It was actually raining a little bit while we were set to get on the swing. You are still allowed to get on if the rain isn't too bad. They take a video of you, which you get on the QR code from when you take your pictures before getting on the swing. It was a good experience although I was ready to get down after my legs swung twice lol you can ask them to let you down before the time if you want to. The views were pretty and so was the whole building itself. Pretty cool experience and I can't forget the elevator ride. We actually ate next door and didn't do the food bundle here so I can't quite speak on that.", "rating": "5", "visited": "Oct 10, 2024"}, {"review": "This is one of our least favorite tourist attractions that we did. I was really excited for the lookout because of the videos I saw online, but it was pretty expensive for a extremely short amount of time. There are two different ticket options. One is a ticket to just get you up to the top of the observation deck and then there is a separate ticket in order to do the swing. The swing lasted about a minute and that included being raised up and lowered down. So for the amount of money that you pay, I don't think it's worth it because you don't really get to experience being up and out swinging for very long. It's almost like you blink and I and it's over. so my suggestion would be to pay for the ticket option to get you to the top of the observation deck. There a place that you could take a picture with the name and you could see all around the city being up that high.", "rating": "3", "visited": "Jul 17, 2024"}, {"review": "This place is pretty amazing and has something for just about everyone! Came here to ride the swing that takes you out over the edge of the building! Also wanted to have a beer and some appetizers on the top floor which hosts a trendy bar / restaurant with great views and a section of glass floor you can look down! Service was extremely slow in the restaurant. Took a long time to be greeted and given menus. Another long wait for drinks and even longer for food ( thought they forgot about our food). Friendly but slow.", "rating": "5", "visited": "May 20, 2024"}, {"review": "This was such a cool experience, my husband and I travelled to Amsterdam for his 40th birthday and we thought the best way to celebrate such a big milestone was for him to swing off of the A'Dam Lookout. Super easy to purchase tickets online and get across from the Amsterdam Central, the staff here are really friendly. We had a suitcase from our shopping spree at Primark and the team member let us leave it with him.I am afraid of heights so I really rallied for my husband, I took videos of him swinging along and I even got some courage to take photos close to the edge, such a cool experience!", "rating": "5", "visited": "Feb 27, 2024"}, {"review": "Super cute activity I did with my mom. Loved all the different interactive activities along the way. We took a green screen photo together, explored the mini museum, they even have a scenic bathroom, and a really cool rooftop. Lots of space to take in the views, lounge on some beanbags, and take photos on platforms. A great 360 view of the city and a really fun, slightly terrifying swing. It's really safe and the staff were extra friendly and helped take really cute photos. Definitely a nice activity for a tourist.", "rating": "5", "visited": "Oct 3, 2023"}, {"review": "My goodness. Where do I start? Heard about this place on social media. Wanted to see the views that it offered. Upon entering, there were ticket packages that you could choose between VR roller coaster, swing, drinks etc. From there, we were escorted to the top. There was a bar, music, outside things to do and more. The views were absolutely amazing. To stand and lookout over the city... it was breathtaking. I'm ready to go back.", "rating": "5", "visited": "Nov 19, 2023"}, {"review": "The high rise tower is right across the river from Amsterdam Central Station. There is a free ferry that runs day and night. This was my third trip to Amsterdam, I'm glad that I discovered the free ferry and this side of the river. The 22 story high rise was formerly offices for Royal Dutch Shell. They did a complete overhaul into a tourist destination. The swing off the side of the building is one of the World's best thrill rides. The VR roller coaster (Premium VR headset Meta (Facebook) Oculus) was a great way to get introduced to VR virtual reality headsets.", "rating": "5", "visited": "Jul 24, 2023"}, {"review": "I came here on a weekday morning at 10am and the entire lookout was basically empty. Although I had a timed ticket for 11, they let me hop on the swing early. I'm so glad I came here, the view was great and the service was excellent. I did not realize how much \"swing over the edge\" was true!! The swing goes both up and out pretty high, making for an exhilarating experience, with a view. I would recommend stopping by and if you go when they first open in the morning, you'll be able to avoid a crowd!My one thing that I would like to add is that the elevator ride up has a \"light show\" that was not notated anywhere and is no epilepsy friendly--for anyone wary of that.", "rating": "5", "visited": "Aug 25, 2022"}, {"review": "I took the free ferry across the water to A'DAM lookout, staff were welcoming, friendly and helpful. I went early so it wasn't too busy. You are asked to sit in front of a green screen and get photos with Amsterdam as the backdrop, then you will enter a lift that has an exciting light show all the way up to the 22nd floor where there is more photo opportunities with the A'DAM sign and atop a horse and of course there is the over the edge swing which was such a thrilling experience. It was scarier and faster than I imagined it was going to be but once over that initial fear it's a great experience and I would highly recommend and afterwards grab yourself a drink and a bean bag and think about what the hell you just did and pat yourself on the back! You are given a card with a barcode in order to purchase and download photos and a video as proof that you went on the swing and you survived. The gift shop is great too with cool 3D postcards, posters, pens, homeware games, toys and sweets. However it is quite costly and if it wasn't for the swing there is not much else that I would want to see or do here.", "rating": "4", "visited": "Sep 10, 2023"}], "reviews_count": "109"}
{"name": "Rijksmuseum", "category": "Museums", "hours": "9:00 AM - 5:00 PM", "address": "Museumstraat 1 1071 XX Amsterdam The Netherlands", "rating": 4.5, "number_of_reviews": 0, "reviews": [{"review": "If want to get lost for a day or three, the Rijksmuseum is amazing. Rembrandt's amazing work is one of the major exhibits, and you'll be blown away.  The Night Watch is literally larger than life.  There are stanchions to keep visitors far away from this beauty, and you will want to stand there forever just looking at this masterpiece. There are so many of his beautiful works of art, it's  like walking through history. The entire museum is like the movie \"A night at the museum\". Everything feels so alive. One exhibit is better than the next. If you want to do justice to the experience, you'll easily spend an entire day, and possibly a day and a half. Purchase your entrance tickets well in advance, and go when they open. The secret sauce ... they have a Michelin star restaurant in the museum. You'll need reservations for that too.  This is one of the best experiences you can have, and you don't want to miss it!", "rating": "5", "visited": "Sep 17, 2024"}, {"review": "The museum is located a bit south of the city center (maybe a 20 minute walk).  There are at least 2 tram lines that service this area and which can get you to the central station in about 20 minutes (you can just use any tap-to-pay credit card on it). I reserved museum tickets a couple of months in advance. We visited on a Tuesday around 1:15 p.m. We arrived a bit early, so we checked out a gift shop nearby (that covers both the Van Gogh and Rijksmuseum) and a garden area associated with the Rijksmuseum.We rented the audio tour devices.  My unit did not work (it had lost its Wi-Fi connection) but the staff was helpful and replaced it promptly. My wife and I then used it to take the highlights tour.  I generally enjoyed this. I paused at several places to look at other works beyond just the highlights, but it generally led us on an accelerated path through the museum. Towards the end, the map leading to the next stop failed to work, so we had to ask directions to some of the stops. Overall, I liked the collection of works, especially the works by Vermeer. It was hard to see The Night Watch due to the conservation work being done, but I appreciate that such work is sometimes required. All in all, I enjoyed this visit. The museum has a number of worthwhile artists / works to see.", "rating": "4", "visited": "Oct 8, 2024"}, {"review": "Incredible collection and comprehensive history of the Netherlands.For a museum of its size, I only wish they had another cafe since it can get busy. Can spend many hours in here so plan accordingly. Also very centrally located.", "rating": "4", "visited": "Sep 17, 2024"}, {"review": "The Rijksmuseum is a world class museum.  It is on a par with any of the world's famous art museums.  The Rijks is huge inside, floor after floor.  You could easily spend several days here and still not see everything.  Along with the nearby Van Gogh Museum, the Rijksmuseum is a testimony to Vincent Van Gogh's family, particularly that of his brother Theo's, who worked hard to keep his memory alive after his death.  After his suicide, he worked tirelessly to organize and catalog all his brother's paintings.  The last two years of Vincent's life were a world wide of productivity but bitter sweet.   Most remember his argument with Paul Gauguin, on which was the most serious artist ... it sadly ended with Van Gogh's disfigurement.  But in those remaining two years, Van Gogh produced some his best, awe inspiring work.  This Museum, along with the nearby Van Gogh and Musée d'Orsay, house some his best works.  From his Yellow Room and Almond Tree, to the portraits of the local town folk in sleepy French city of Arles, or his self portraits, to Starry Night.  It can take your breath away seeing them in person.We came here for the Van Goghs, but it was the Rembrandts from the Dutch golden age including Jacob van Ruisdael, Frans Hals, Jan Steen, and of course Johannes Vermeer that wowed us.", "rating": "5", "visited": "Aug 28, 2024"}, {"review": "Expansive museum housing great works of art in a beautiful building.  Bought tickets ahead of time and I'd highly recommend doing so to avoid waiting for a long time in line. You can easily spend a full day here, but at the very least, allot three hours to browse the galleries. There is a cafe inside and though overpriced, it is nice to be able to rest your feet. You order through your phone but the waiters can help if needed. They do have kids options. You can take pictures of the art, though be sure to follow all posted signs. The Night Watch was under restoration when I went so I was unable to view it fully, but many other works including the dollhouses, the Swan, and the Milkmaid were all there. The library is especially nice to see, and is a working library. Overall, a great spot to visit if you love art/culture.", "rating": "5", "visited": "Oct 14, 2024"}, {"review": "I really rate museums based on their pamphlets and the pamphlet at Rijksmuseum is a massive slay. Having mistakenly not had a plan for the Louvre in Paris a few months ago, thus dampening my overall experience of the museum, I knew better this time. Show me the masterpieces like the peasant I am and I'll find things to be delighted and surprised by along the way. Two hours later, thanks to A VERY WELL ORGANIZED QUAD FOLD PAMPHLET WITH HIGHLIGHTS AND A STRUCTURED PEOPLE MOVEMENT SYSTEM THANK YOU VERY MUCH, I had done just that.The gift shop didn't have the magnet I wanted of the Renaissance woman with her dog but that didn't feel like enough to dock a star, what with the point of the museum being the ART and not the MAGNETS. I do love me a museum gift shop, though. I loved the Rembrandt section and spent most of my time there, and also really appreciated the lack of crowding and photo taking around important works. More bonus points for Rijks? They have these great construction paper-sized guides to specific works in English - highlighting key elements of the work and opening up more room for thought. I don't like doing major art museums with a guide (first of all hurry up and second of all shut up and let me think), so these opportunities for further discovery on my own terms were welcome. Look at the guide for the angry goose! I ended up getting the angry goose magnet, of which the gift shop has plenty.I will remember this museum, it's bathroom (a story for another time), and it's stunning garden for a lifetime and am so glad to have had the opportunity to enter it's iconic doors.", "rating": "5", "visited": "Aug 9, 2024"}, {"review": "After much debating which museum I should spend a few hours in, and chatting with as many locals that felt like chatting, I landed on Rijksmuseum. Tuesday morning, I bought tickets online for 1PM entry for 22.50 euro and made my way by bike over to the massive and absolutely gorgeous museum. Maybe because it was a weekday, but it really wasn't as busy as I would have suspected it to be! I waited in a short line to get in, made my way over to information for a map and some tips on how to best navigate the huge space, and made my way to the second floor. Hot tip! Bring your headphones and download the app for the audio tour. You can input the number of any paintings you'd like info on one by one, or start at the beginning and let it play through as you walk around. Another hot tip I try to stick to with all massive museums, do a little research into what pieces or artists you are most excited to see and then try to seek those out, otherwise you'll be wandering for longer than you like and can wind up a bit exhausted. I planned to only stay an hour or so because it was such a beautiful day outside, but about 2 hours later I still wasn't ready to leave. You'll find works by some of your favorite Dutch artists like Vermeer, Rembrandt and Van Gogh and of course, those will have a bit of a crowd around them, but there are also thousands of other incredible pieces to marvel at. While some museums in Amsterdam sell out fast, it seems like you can find available same day tickets here and it is 100% worth the visit.", "rating": "5", "visited": "Jul 30, 2024"}, {"review": "Place was amazing. Big but not impossible to see in a day, well payed out with maps and sights. All info signs were in both English and Dutch. Be careful not to book tickets for the wrong day-- for a future day they'll let you in, for past days you will need to rebook.", "rating": "5", "visited": "Aug 18, 2024"}, {"review": "Amazing museum by canal.  You need a whole day to get through the Rijksmuseum but the art is incredible.  Collections of Rembrandt and Vermeer and many other masters documenting the life in the Netherlands. Wonderful place to restore your soul", "rating": "5", "visited": "Nov 12, 2024"}, {"review": "We loved this museum. Let me first start by saying you should create a game plan before entering because it is definitely over whelming (in a good way). I don't even know where to start with the review. This is the most extensive painting collection I have ever seen. This museum has some of my most favorite paintings ever and I never realized I would have the chance to see them in real life. The model ship collection is amazing and so intriguing and intricate. The sword and gun area was also just so intriguing. There was not anything I was dissatisfied with. This museum met and exceeded any expectation I could have. I would return here and go through it again. The staff was friendly and there were free lockers for your belongings too!", "rating": "5", "visited": "Sep 30, 2024"}], "reviews_count": "463"}
