{"name": "San Miguel de Allende", "description": ["Vibrantly colored buildings line the cobblestone streets of San Miguel de Allende, a romantic city with 16th-century origins, nestled among Mexico's central highlands. Through the past 50 years, this quaint city has evolved into a respite for expats and a popular destination for tourists looking to delve into the music, food and arts scene of off-the-beaten-path Mexico. It's easy to swoon over the 500-year-old colonial city's narrow walkways, baroque architecture and artisan shops selling crafts, jewelry and handmade accessories. Breaks from shopping can be spent exploring the city's elaborate, shimmering pink church, the Parroquia de San Miguel Arcángel taking classes at the well-recognized Instituto Allende Allende art school, or tucking into some of the country's best cuisine.", "San Miguel's location — about 170 miles northwest of Mexico City in Guanajuato state — plays a key role in its dynamic history. Once full of wealth from nearby silver mines, San Miguel was left dilapidated after multiple wars (the early 20th century's Mexican Revolution among them). In 1937, Chicago native Stirling Dickinson stumbled upon the small town, established an artist's colony and quickly got San Miguel's renaissance off the ground. Today, evidence of that compelling re-emergence can be seen tucked into every lively corner of the diverse, arts-driven destination.", "The best time to visit San Miguel de Allende is November through April; there's minimal rainfall and high temperatures hover around the mid-70s. Winter nights can get cold as the city sits at an altitude of around 6,000 feet, so plan to bring warm layers for when the sun goes down. The summer is rainy season, and it gets a bit hotter – but if you don't mind the climate, you'll find a slew of festivals offering a lively cultural experience.", "Come prepared to shop Artisan crafts and paintings can be found in locally owned stores throughout the city. You'll find plenty of high-end artwork at Fábrica La Aurora – a former textile factory now home to a myriad of galleries.", "Pack comfortable shoes San Miguel de Allende's winding walkways are best discovered on foot, and you'll certainly be getting the steps in – so choose your footwear wisely, and be prepared for the cobbles.", "Festivals are frequent At almost any time of the year, a festival will be taking place in this small but lively city, so listen out for the sound of fireworks and live music. Keep an eye out for the giant, colorful mojiganga puppets, which are typical of the region.", "Stick to local markets San Miguel isn't short on pricey artwork, particularly in the galleries near the main square El Jardín. If you're looking to make some savings, head to the Mercado de Artesanías, and don't be afraid to barter a little. If you want to veer off the tourist trail and you're here on a Tuesday, head to El Tianguis, a huge artisan market just outside the city.", "Enjoy free entertainment Many of the city's music and theater events can come with a steep price tag, but you can find regular mariachi music and street performances free of charge at San Miguel's plazas (especially El Jardín). If you hear something you like, tip the musicians.", "Try street food Taco carts parked along the streets of San Miguel serve up low-priced tacos, carnitas and tortas that are lauded as some of the tastiest food in the city. You'll also find several markets serving cheap eats popular with locals, including Mercado Ignacio Ramirez, which sits right next to the Mercado de San Miguel.", "San Miguel has long been renowned for its art scene, so if you're looking for culture, you won't be disappointed. Many expats and well-heeled retirees spend their days relaxing in coffee shops or meeting friends on San Miguel de Allende's central plaza, El Jardín. Artists work in studios throughout the city, and crafts, jewelry and other folk art is sold along winding cobblestone streets.", "While Spanish is the national language of Mexico, nearly everyone in San Miguel speaks some English. Most tours and services are offered in both languages, and you shouldn't have too much trouble finding someone who can speak English should you need some help. If your Spanish could use some improvement, San Miguel de Allende is a good place to learn; language classes are a popular activity for visitors and new residents.", "The Mexican peso the national currency and it's accepted throughout San Miguel. One peso is equal to about 5 cents. Visitors can exchange international currency at the city's various casas de cambio (currency exchange offices). ATM machines will tack on a service fee per transaction, but they're likely to offer better exchange rates than the local banks or exchange offices. You may not need much cash, though – most of the city's restaurants and shops accept major credit cards. Regardless of how you pay at restaurants, it's customary to tip servers 10% to 20% of your total bill, and to tip hotel staff too.  ", "San Miguel is considered one of the safest cities in Mexico, but that doesn't mean you should let your guard down completely. Always keep your belongings close and stay alert when walking through the city at night. And although Guanajuato state has a drinking water supply, it's not recommended to drink from the taps, so avoid any risk at restaurants or elsewhere by sticking to bottled water.", "San Miguel de Allende has garnered a reputation for its culinary scene and for good reason; you'll find everything from authentic, traditional Mexican taquerias to fine-dining Italian, French and other international restaurants here, influenced by its expat community.", "Alongside tacos, tamales and other classic Mexican staples, favorite dishes here include enchiladas mineras (fried tortillas filled with potatoes, vegetables and pork, smothered in guajillo chili sauce); gorditas (masa dough stuffed with beans, cheese, meat or other fillings); enmoladas (enchiladas covered in rich, chocolatey mole sauce); and pacholas guanajuatenses (fried beef fritters cooked with spices and ancho peppers).", "For a local experience, head to one of San Miguel's markets – especially worth a visit is the vibrant Mercado Ignacio Ramirez, where colorful fruit stands sit beside food stalls selling quesadillas, tortas, molletes and other Mexican delicacies.", "The best way to get around San Miguel de Allende is on foot – the center is compact enough to be walkable, and some of the most exciting discoveries can be found along its winding walkways. While a car won't be convenient for navigating San Miguel, it will be useful if you choose to take day trips. There are also several local bus routes in the city, and you can access all corners of San Miguel by taxi or Uber.", "Getting to the city is relatively easy: Querétaro Airport (QRO) is about 55 miles southeast (or around an 80-minute drive), while Leon/Guanajuato Airport (BJX) can be found approximately 60 miles west (around a 90-minute drive). There are direct flights from several major U.S. cities to both, including from Atlanta and Dallas to QRO; and from Los Angeles, Oakland and Houston to BJX.", "Taxis from either Querétaro or Leon/Guanajuato airports to San Miguel will cost about $90 to $100; Ubers are generally cheaper (around $60 to $70). Shared shuttles are also available from QRO and BJX with companies such as BajioGo for around $30. It's around a 3.5-hour drive – or about 170 miles – from Mexico City's Benito Juarez International Airport (MEX).", "You'll need a valid passport to enter Mexico, and you'll need to fill in an Official Entry Immigration Form (FMM), provided by your airline or at a border-crossing point. Hold on to the tourist card until you depart – you'll be asked for it when you leave the country. You don't need a visa unless you're staying more than 180 days. For more information, visit the U.S. State Department's website.", "At this textile-mill-turned-art-district, you can catch a glimpse of artists working in their studios or purchase elaborate artwork on sale at galleries and shops"]}