{"name": "Edinburgh", "description": ["Burrowed beside long-dormant volcanoes and reigning over green moorlands, Edinburgh (or Ed-n-bruh in Scots speech) is known for more than its staggering landscape. The Athens of the North, as Edinburgh is sometimes nicknamed, also claims a cast of near-mythic characters: Rebel leader Sir William Wallace (aka Braveheart); the tragic Mary, Queen of Scots; the Enlightenment thinkers David Hume and Adam Smith; \"James Bond\" actor Sean Connery; and prolific wordsmiths Sir Arthur Conan Doyle and J.K. Rowling – are all woven into this very old, yet very relevant city.", "But if your impression is confined to bagpipes, tartans, crests and kilts, you'd be wrong. The second most-visited city in the United Kingdom (after London), Edinburgh offers an abundance of things to do. History buffs will enjoy Edinburgh Castle, Holyroodhouse Palace and other attractions found along the Royal Mile. Those in search of an authentic live-as-the-locals experience will find it in the outer-lying neighborhood pubs, shops and parks. Shoppers will find retail bliss in New Town; art aficionados will enjoy the free Scottish National Gallery; and theater hounds will meet their match at August's Edinburgh Festival.", "The best time to visit Edinburgh is June through August when the average high temperatures rise to a balmy 65 degrees Fahrenheit. But this is also the city's busiest time for tourism, especially in August when festivals fill up the calendar. To avoid spending a small fortune, you'll have to bundle up: winter (November to March) offers the best low-season deals, except during the city's New Year's celebration, Hogmanay. Spring and early fall are the sweet spots – relatively mild weather and thin crowds pair with the chance to find hotel and airfare deals. ", "Know the ingredients Scottish specialties, such as haggis and black pudding, have some ingredients American palates might not be accustomed to. A food tour is a great way to sample Scottish favorites with the guidance of a local.", "Visit in the winter An influx of visitors come to Edinburgh during the summer for festival season. The colder months see fewer visitors and lower room rates.", "Veer off the beaten track Stray from the touristy Royal Mile and Princes Street and you'll likely find better shopping and dining options for a fraction of the price.", "Although the language is the same, Scots inflect their speech with a Sean Connery-esque brogue, which might be difficult to understand. You shouldn't be afraid to ask Scottish people to repeat themselves; no one will be offended. But be advised that residents are extremely proud of their city; don't exalt Glasgow at the expense of Edinburgh unless you're willing to argue it out. For the most part, visitors will probably be surprised by the warmth and friendliness of the Scots.", "The official currency is the pound sterling. Since the pound to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops. Much like the rest of the U.K. and Europe, tipping is not required. However, if you feel so inclined and your service was exceptional, a 10% tip will be more than enough.", "Scotland is known for haggis, which – if you really want to know – is sheep's heart, liver and lungs minced together with onions, oatmeal and some seasoning. It's usually served with neeps and tatties, or mashed turnips and potatoes. But note that Edinburgh also offers an array of international cuisine as well, from Thai to Italian. Edinburgh's pubs offer traditionally British cuisine and other comfort food items, including fish and chips and hamburgers, which are also reasonably priced. But if you're willing to take on the haggis challenge, pop on over to Greyfriars Bobby's Bar, the pub located in front of the Greyfriars Bobby memorial, which honors the dog who guarded his deceased master's grave for more than a decade, or Arcade Haggis & Whisky House.", "Not keen on trying haggis? Not to worry, Scotland has plenty of other food offerings. One traveler favorite is Makars Gourmet Mash Bar Company, which dishes up hearty favorites like sausages, lamb shank and vegetarian haggis atop mashed potatoes. For a small snack, pop by Pickles. It serves charcuterie boards along with pate, wine and other beverages. For a special occasion, visit Aizle for its delicious seasonal fare. ", "Many of Edinburgh's restaurants are clustered around Old Town's Royal Mile and New Town's Princes Street. Thanks to its location right by the water, the northern village of Leith is the place to go for fresh seafood. South Edinburgh, or anywhere outside of the city center, also has a variety of cheaper cafes and restaurants for budget-minded travelers. If you want a little help navigating the Edinburgh dining scene, consider signing up for a food tour led by a local.", "Edinburgh is a safe city. It's generally safe to walk around at night, but make sure to know where you're going. Parts of the city, especially Old Town, are filled with winding alleys, closes and wynds, making it easy to get lost at night. Exercise caution for pickpockets in tourist areas, but keep in mind that Edinburgh's low crime rate make pickpockets uncommon in comparison to other big European cities.", "The best way to get around Edinburgh is by foot. This hilly city may have you a little out of breath at certain points, but it's still small enough that walking makes the most sense. When you grow tired or want to explore out-of-the-way areas, the city's efficient bus can cart you the rest of the way.  A bus – Airlink Shuttle, to be exact – can also bring you from Edinburgh Airport (EDI) into the city center in about the same time as a cab, but for fewer pounds. Once there, you can hop on the city's tram system or explore the city via bus or black cabs, which can be found on high streets (main thoroughfares) and other points of interests throughout town.", "A valid travel document is required for United States citizens traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. A United States passport is the preferred form of documentation, and children must have them, too. Note that U.S. citizens do not need a visa unless they plan on staying longer than six months. Visit the U.S. State Department's website for the latest information on the U.K.'s foreign exit and entry requirements."]}