{"name": "Bend", "description": ["Tucked on the sunny, drier side of the Oregon Cascades, Bend enjoys the best of the Pacific Northwest with little of the rain that many associate with the state. The city sits about 165 miles southeast of Portland where the Cascades transition into the high desert and has grown rapidly over the past few decades. Founded as a farming and timber town in the early 1900s, Bend – a shortened version of the original name for the area, Farewell Bend – has blossomed into a bustling four-season hub for outdoor adventure enthusiasts. Wander off in any direction and you'll end up on millions of acres of public land riddled with trails, lakes and snowy peaks. That makes it one of the country's top destinations for mountain bikers, skiers, paddlers and more.", "Though the town is undoubtedly sporty, not everything is sweat and Gore-Tex. You'll find well curated shops downtown and at the Old Mill District, where big musical acts also perform at its outdoor amphitheater. There's an exceptional museum, the High Desert Museum, just south of Bend with otters, history and art. In almost any part of town you can find plenty of fun restaurants where no one will care if you're eating sushi in your ski boots. And let's not forget the beer: You'll find roughly 30 breweries in and around town ready to help you refuel from an epic day of play.", "The best time to visit Bend is pretty much any time, depending on the outdoor activities you like, though winter and summer remain the most popular seasons. Skiing, snowboarding, cross-country skiing and snowshoeing adventures unfold from about Thanksgiving well into spring. The lifts typically run at Mount Bachelor until Memorial Day, and start up again for downhill mountain biking, scenic dinners, zip lining and hikes come summer. June, July and August are Bend's most popular months, often with very little rain (about half an inch a month), plenty of sun and lots of outdoor concerts. Activities include swimming, paddling, fishing and sailing; virtually limitless hiking and biking; and camping areas are also in abundance. Trails into the high Cascades often aren't free of snow until early July. Spring and fall can be prime mountain biking time in the lower elevations with tacky trails that tend to get loose and dusty in the hotter months. The fall brings much needed rain, cooler evenings (high 30s to low 40s) and warm days (mid-70s to low 80s) that make for blissful adventures as summer crowds thin.", "Bring layers Weather in Central Oregon can be notoriously temperamental, with temperature swings of 40 degrees or more, especially in spring and fall. In summer, the direct sunlight can be devastatingly hot while the shade can be surprisingly cool. Wear layers of wool or synthetic fibers and pack a water bottle and rain jacket. (Bendites almost never use umbrellas.)", "Keep it casual You can wear almost any outfit into any restaurant any time of day and blend right in, though outdoorsy is generally the theme. Ski pants, yoga pants, jeans, cycling jerseys, overalls, muck boots, cowboy boots: It's all good. Suits and evening gowns? Not so much.", "Plan for winter Century Drive, the road that leads to several areas for skiing, is often very icy in winter. It is imperative that you have proper snow tires (\"all season\" tires are insufficient), carry chains, leave lots of space between cars and significantly adjust your speed to conditions. To avoid the heaviest traffic, head out by 7 a.m. or wait until about 1 p.m. for what locals call \"the second shift.\" Alternatively, consider taking the Winter Shuttle (aka the Mount Bachelor bus).", "Plan for summer In summer, you need a permit to hike many of the trails in the Three Sisters, Mount Jefferson and Mount Washington wilderness areas. Cascades East Transit runs shuttles that stop at many of the trailheads in the Deschutes National Forest that are popular with mountain bikers. The bus has a trailer that can haul up to 20 bikes.", "Be mindful Like many popular mountain towns, Bend struggles with the impacts of tourism on local life. When you visit, be on the lookout for pedestrians and cyclists and don't tailgate or speed (especially on mountain roads) when driving. If you've brought Fido, pick up after them (and carry any used waste bags with you until you've found a trash can). Finally, in cafes, at food cart pods and restaurants with counter-service, order your food, then find a table. Don't be afraid to share with other people.", "Embrace the outdoors Many of the things that make Bend fun cost little to nothing. There are countless miles of hiking and biking trails. (You'll need a forest pass or a Sno-Park Permit to park at certain trailheads in national forests.) You can float the Deschutes River and splash your way through the whitewater park right in town. Be sure to catch free live music in Drake Park during the summer.", "Ski Thursdays From January through March, \"Play Forever Thursdays\" are the cheapest days to ski at Mount Bachelor, with $99 lift tickets. Watch for \"Thrifty Thursday\" specials from January to March at Hoodoo ski area, where all-day lift tickets go for a fraction of the normal price. (Think: $33)", "Buy more beer Craft brew is a big part of Bend's identity, but it's not cheap. Head to the Midtown Yacht Club where you can buy a six-pack of great local beer for the price of about two draught pints. You can share those beers with your (legal age) friends; the bar staff will give you pint glasses and keep the unopened cans cold. You can take home whatever you don't drink. Win. Win. Win."]}