{"name": "Auckland", "description": ["With picturesque beaches, towering skyscrapers, volcanic islands, magical hikes and a thriving hospitality scene, New Zealand’s largest and most cosmopolitan city is a must for global explorers. Situated on New Zealand’s North Island, Auckland, known as \"Tamaki Makaurau\" in Maori (the native language of New Zealand, aka \"Aotearoa\"), seamlessly blends majestic scenery with the hustle and bustle of city living. ", "For adventure junkies, there's everything from zip lining on Waiheke Island to leaping off the Sky Tower in a bungee-style experience. Sports lovers will enjoy the city's local rugby and cricket unions, as well as the national All Blacks rugby team. Foodies will appreciate Auckland's world-class array of dining options, which range from casual pubs to celebrity chef-owned fine dining establishments. And for culture enthusiasts, the city offers the perfect blend of Maori, European and Asian influences at sights like the Auckland War Memorial Museum and the Auckland Art Gallery Toi o Tamaki.", "The best times to visit Auckland are from March to May and between September and November. These shoulder months offer pleasant temperatures and fewer crowds. During peak season (December through February), you'll contend with swells of visitors and high airfare and room rates, but this is the best time to visit if you wish to experience summer fun with warmer temperatures and fewer rain showers. Between June and August, both temperatures and tourism drop off, however this is the time to go if you’re looking for a ski vacation in North Island hot spots like Mount Ruapehu. Before you pick your travel dates, you should note that the seasons are reversed here: Winter in New Zealand coincides with summer in the U.S., and vice versa.", "It's relatively safe Kiwis are known for their hospitable nature, so it's hardly surprising that the country has some of the lowest crime rates in the world. Like any city, crime does occur in Auckland, though, so be mindful of safety, particularly at night, and carry as little cash as possible.", "You'll encounter Maori words Maori is the native language of New Zealand and you’ll encounter it everywhere from city names to news articles. Books like \"Beginner’s Maori\" may be useful, while key letters to remember include \"wh\" (pronounced like the English 'f') and 'r' (which is not enunciated and is oftentimes rolled into the following letter)", "Expect rain No matter what season you visit Auckland, odds are you'll experience a rain shower. To avoid getting soaked during your travels, pack an umbrella or a rain jacket.", "Leave each place as you found it Tourists are asked to abide by the Tiaki Promise – a pledge to exercise care and consideration for the country’s environment (by leaving each destination as you find it), people and culture.", "Stay on the North Island Areas like Waiheke Island, Tiritiri Matangi Open Sanctuary and Rangitoto Island are free to visit, but are only accessible by ferry. To avoid paying as much as NZ$95 (about $59) for a round-trip ferry fare, stick to attractions on the mainland.", "Travel in the low season The months between May and September constitute Auckland's low season. During this time of year, you'll find discounted airfare and hotel rates. Remember to bring a jacket, though, since the bulk of these months fall within Auckland's winter season.", "Eat in and pack lunches Many Auckland hotels offer apartment-style rooms with kitchenettes. To avoid high food costs, book accommodation with a kitchenette and buy groceries.", "Though most of the country is now made up of Europeans, Maori traditions are prominent throughout Kiwi culture. The country's All Blacks rugby team famously performs the \"haka\" (a traditional Maori war cry) at the start of all rugby matches. Maori \"hangi\" (or the tradition of cooking food under heated rocks, much like the Hawaiian \"kalua\") meals are commonly found throughout the island. And in Auckland, visitors can explore popular attractions like Waiheke Island, Waitekere Ranges Regional Park and Rangitoto Island, all of which have ties to the Maori language. To learn more about Maori culture, consider visiting the Auckland War Memorial Museum.", "New Zealanders invented bungee jumping, and they're very proud of their extreme sports. Kiwis also take pride in their country's natural beauty. If you've ever seen any of \"The Lord of the Rings\" or \"The Hobbit\" films, you'll understand what they're bragging about. Though most of the movies' picturesque settings are found on the South Island, just outside of Auckland sits the Hobbiton Movie Set, one of the only remaining sets left from the movies.", "When visiting Auckland, keep in mind that several aspects of Kiwi life are opposite of what you'll find in America. Auckland's summer takes place during the Western Hemisphere's winter (and vice versa), and driving is on the left side of the road. Pedestrians should also make sure to look right, then left, then right again before crossing a street.", "The official currency throughout New Zealand is the New Zealand dollar (NZD); make sure to check the exchange rate before you go. Like Australia, New Zealand practice is to refrain from tipping unless exceptional service is given. Should you decide to tip, it is customary to leave approximately 10% of the total bill.", "Kiwi cuisine is all about fresh, local fare. In Auckland, expect to find top-notch seafood, plenty of lamb and a handful of signature desserts. Local seafood offerings include green-lipped mussels, fish and chips, whitebait fritters and bluff oysters. You'll also find roast lamb on most Auckland menus. And for dessert, you can't go wrong with a scoop of hokey pokey (vanilla with pieces of honeycomb) ice cream or a slice of Pavlova (a meringue-based treat topped with fruit and named after Russian ballerina Anna Pavlova). Everything from casual pubs to fine dining establishments can be found in Auckland. Specialty cuisines (think: Indian, Japanese and French) are also prevalent throughout the city. ", "If you're 18 or older, save time to sample some of the City of Sails' world-renowned wine. Bordeaux-style red wine and chardonnay are the most commonly produced wines in Auckland's three wine regions: Waiheke Island, Matakana and Kumeu.", "The best way to get around Auckland is via the cheap and efficient Link buses. Walking is another viable option in the city center, while train services are also available. Taxis, rental cars and ride-hailing services are also available, but these are more expensive and prone to frustrations like traffic and limited parking spots. To get to one of Auckland's islands, you'll need to hop aboard one of the city's ferries. ", "The Auckland Airport (AKL), which sits just 13 miles south of downtown Auckland, can be reached by bus, taxi or car. Taxi fares from the airport to the central business district range from NZ$62 (about $40) to NZ$80 (about $50), depending on the company you ride with.", "To visit New Zealand, Americans need an up-to-date passport that's valid for at least three months after their departure dates. Passports must have at least one blank page for stamps, but visitors do not need to obtain visas for stays lasting less than three months. For more information about New Zealand's entry and exit requirements, visit the U.S. State Department's website."]}