{"name": "Vancouver, Canada", "description": ["Even by North American standards, Vancouver is a young city (it was incorporated in 1886). But what it lacks in history it compensates for in culture. Experience Vancouver's Indigenous culture (including First Nations, Metis and Inuit people) in an array of historic sites, boutiques, and museums. The city's high-fashion boutiques and fondness for health-conscious eating make it an attractive urban playground. Plus, Vancouver and its breathtaking backdrop of mountains and beaches has been the setting for a bevy of popular television shows and major motion pictures (including \"Riverdale,\" \"X-Files\" and \"Deadpool\"), so don't be surprised if you recognize landmarks from your favorite scenes or stumble upon a production in progress.", "But this mitten-shaped city on Canada's western edge draws in more than pop culture junkies. Hiking, mountain biking, kayaking, whitewater rafting and skiing will beckon to your adventurous side (and are especially accessible on one of the best Vancouver tours). Looking for a little rest and relaxation? Try lounging along the 11 miles of beaches or in one of the numerous parks. During the cold weather, you can duck inside one of the top-notch museums or take the kids to one of the family-friendly attractions, like Granville Island or the Capilano Suspension Bridge. When you add excellent shopping, dining and nightlife scenes to the mix, you'll see why many praise Vancouver as a go-to getaway for the multifaceted traveler.", "The best times to visit Vancouver are from March to May and from September to November when the weather is mild and hotel rooms can be found at bargain rates. Summer is the most popular time thanks to the promise of warmer weather; however, if you're planning a trip then, make sure to reserve your hotel room at least two or three weeks in advance. If you're a winter sports fanatic, then don't let the biting temperatures deter you: This city makes a great home base for skiers and snowboarders looking to challenge the powder at Grouse Mountain or nearby Whistler. Regardless of when you visit, packing layers is a must to keep you comfortable.", "Bring comfy shoes Central Vancouver is ideal for walking. Forget the car and get to know this outdoorsy city on foot. Plus, you'll have to hoof it on several of the best Vancouver tours anyway.", "Pack a rain jacket You'll likely encounter an occasional rain shower no matter when you visit Vancouver. If you're planning a winter trip, you'll also want to throw in a pair of rain boots to your suitcase.", "Keep an eye on your stuff Although Vancouver is relatively safe, crimes of opportunity do take place. Make sure to keep a close watch on your valuables.", "Travel during the shoulder seasons Summer and winter are both popular times to visit. If you're hoping to find some deals on hotels, consider planning a trip for the spring or fall.", "Fly into Seattle International flights tend to be more expensive. You can save on airfare by flying into Seattle's SeaTac Airport and taking the Quick Shuttle into downtown Vancouver.", "Leave the car behind Gas is priced by the liter in Canada (not by the gallon) and tends to be more expensive than what you'll find in the United States. Forget the pump and rely on public transport instead.", "Vancouver boasts a diverse multicultural identity thanks to the many different groups that call the city home. Though English and French are the two official languages, you'll also likely hear Chinese, Punjabi, German, Italian, French, Tagalog (Filipino) and Spanish.", "Perhaps the biggest difference American travelers will encounter is the use of the Canadian dollar and the international metric system. One U.S. dollar is equal to about CA$1.30, but since the exchange rate fluctuates, be sure to check it before your trip. You can avoid confusion by familiarizing yourself with Canadian currency. Coins are in denominations of $2, $1, $0.50, $0.25, $0.10 and $0.05. Canadian dollar coins are called \"loonies;\" two dollar coins are called \"toonies.\" Paper bills are in denominations of $100, $50, $20, $10 and $5. You can dodge high exchange fees by withdrawing Canadian money directly from an ATM in Vancouver, though you should still be mindful of fees. Along with differences in currency, you'll also encounter some disparities in how temperatures, distance and weights are measured (in metric units); distance is measured in kilometers – pay close attention to this if you've decided to rent a car.", "Aside from these fundamental differences, Americans should feel right at home in Vancouver, especially hockey fans. True to its Canadian stereotype, Vancouver is a hockey-obsessed city, and autumn marks the beginning of the season. The Vancouver Canucks are the city's hometown team; games are held downtown in Rogers Arena.", "Thanks to its seat along the Pacific Coast, Vancouver boasts its fair share of delectable seafood. You'll find casual fish and chips at any one of the city's markets like Granville Island (the first stop for any foodie), but if you're craving something a little more formal, head to Yaletown. This area of Vancouver is home to Blue Water Cafe and Rodney's Oyster House, just two of the city's favorite seafood restaurants. If you venture beyond Vancouver to Richmond, British Columbia (about 8 miles south of the city center), you'll also find plenty of fresh catches in Steveston Village, where wild-caught salmon, halibut, crab, prawns, tuna and mussels are served fresh from the docks.", "When you're ready to sample cuisine from other parts of the globe, you'll see that Vancouver has you covered there, too. Venture just south of Vancouver to Richmond, a city that's considered to have the best Asian food in North America. Richmond is also home to the Richmond Night Market, the largest night market in North America that features more than 70 food stalls. ", "Aside from providing the city fresh regional ingredients, Vancouver's coastal location also provides a picturesque backdrop for many of the top restaurants. For dinner with a view, try the Teahouse in Stanley Park, Lift Bar Grill View or Cardero's Restaurant, to name only a few. For guidance from a local, sign up for a foodie tour (many of which are included on our list of the best Vancouver tours).", "Vancouver is a safe city to visit, however \"crimes of opportunity,\" such as pickpocketing and stealing valuables from unlocked cars, are common. Take extra precaution with your valuables when walking around areas like Gastown and Chinatown. Visitors should be aware that panhandling occurs regularly in touristy areas. Because of the city's mild climate, it's not uncommon to spot transients or even drug dealers after dark, particularly in the Downtown Eastside neighborhood. If you're hoping to visit Gastown or Chinatown, do not walk through the Downtown Eastside neighborhood, which is plagued by open drug use, homeless encampments and crime.", "The best ways to get around Vancouver are on foot, by bike and via public transportation. Many major attractions and popular neighborhoods are located within walking distance of one another in this condensed city. However, if you feel your feet growing weary, the TransLink system – which includes the SkyTrain, the SeaBus ferry and numerous bus routes – is both manageable and affordable.", "Getting into town from the Vancouver International Airport (YVR) is also easy: you can use the Canada Line rail system or you can hop in a cab. Taxis fares from the airport to downtown Vancouver cost roughly CA$32 to CA$39 (about $25 to $31). The airport is located about 10 miles southwest of the city center. If you've chosen to fly into the Seattle–Tacoma International Airport (SEA), you'll find plenty of car rental companies there, too. You can also take a shuttle from Sea-Tac to several locations in Vancouver: Ticket fees vary depending on your drop-off location.", "A passport is required for citizens of the United States to travel to Canada, and to re-enter the U.S. If you are planning to drive, you must produce a passport, passport card or NEXUS card that allows expedited border crossings for both private and commercial travelers through Canadian and U.S. border controls. A visa is not required for visits less than 180 days long. For more information, visit the U.S. State Department website."]}