{"name": "Valencia", "description": ["Valencia is as pleasing to the eyes as it is to the wallet. The green hues found in the Jardí del Túria contrast with the shimmering golden sand and sparkling cerulean waves lapping against its beaches. And the color of its oranges is as rich as the taste. Those who say this Spanish coastal city lacks any sense of charm may have never walked under the citrus trees as they drop blossoms onto the cobblestone streets or listened to the hum of the Valencian dialect amidst the produce stands of the Mercado Central. Although it has spent years hiding in the shadows of larger cities, Valencia now offers a mixture of Madrid's history and Barcelona's contemporary atmosphere for a slightly more wallet-friendly price tag.", "The best times to visit Valencia are in April and May and September to October, the sweet spots full of warm weather and void of crazy crowds. In general, the city boasts a Mediterranean climate with consistently pleasant weather most of the year, although the extreme heat of August sees most locals shutting down businesses and fleeing north for cooler weather. Valencia sees an average of 300 days of sunshine per year. While average high temps range from 60 degrees in the cooler months to 85 degrees in the height of summer, don’t go unprepared for scorching hot days (and weeks), when the thermometer hovers around 95 to 100 degrees in July and August. Wintertime is pretty comfortable – between the mid-40s to mid-60s – and the city is more or less tourist-free. The downside is that certain attractions shorten their hours of operation.", "Drink like a local Valencians soak up their 300 days of sunshine on cafe terraces with a glass of wine or cold beer and several rounds of tapas. Don't be afraid to embrace their laid-back lifestyle.", "Sleep like a local Do not expect to make plans with Valencians for the early afternoon. That time is reserved for the midday siesta, and many businesses are closed, apart from places like large department stores and eateries. Because of this, the Valencians generally do not sit down to dinner until 8:30 to 10 p.m.", "Dine at the Mercado Central Plenty of restaurants centered on the Mercado Central offer prix fixe menus and great tapas for about 13 to 15 euros (around $14 to $16) per person.", "Purchase a Valencia Tourist Card It comes with unlimited travel on the city's mass transit as well as free admission to municipal museums and monuments, discounts at the major museums, attractions and shops. Available in one- to three-day denominations, the cards are available for purchase at most tourist desks, in vending machines at the airport and online here.", "Valencia is the capital of both the province and the autonomous community of the same name. It has two official languages, Spanish and the Valencian dialect of Catalan. (Be aware that Valencians prefer to call Spanish, or Espanol, Castellano, since Valencian, which locals consider a language and not a dialect, is Spanish too.) While Spanish predominates, the local government uses Valencian. This can create some confusion for visitors, as one or the other language (and sometimes both) may appear on streets signs. The bilingual residents of the city won't expect travelers from outside the province to know Valencian.", "The siesta is observed in Valencia, meaning many businesses, including shops and some museums, will close for part of the afternoon, typically from around 1:30 or 2 p.m. to 4:30 or 5 p.m. The exceptions to this practice are restaurants, which may operate during the traditional siesta time, but close for a couple hours before reopening for dinner service around 8 or 9 p.m. (the standard starting time for the meal). Shopping malls and large supermarkets tend not to close for siesta. Many businesses (other than museums, cinemas, bars and restaurants) do not open at all on Sundays, or, if they do, will have shorter hours.", "The official currency in Valencia is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check the current exchange rate before you go. Most restaurants and stores accept major credit cards. As in the rest of Spain, tipping is not common in Valencia.", "The best Spanish cuisine in located on the winding streets of Center City (especially in the Mercado Central), while another top option are the cafes and tapas bars near La Avenida del Puerto. Many restaurants offer prix fixe lunch menus, which are a great way to sample Spanish cuisine without spending too many euros. Remember that the Spanish do not normally sit down to dinner until 8:30 p.m. at the earliest. If you find that your stomach is rumbling before it's time to eat, follow the Valencians to one of the many tapas bars located throughout the city.", "Valencia is the birthplace of one of Spain's most popular dishes, paella. The paella Valenciana is a mixture of rice, seafood, meat and vegetables flavored with saffron.", "Valencia is also known for its orange groves. Don't miss your chance to sample this juicy fruit the way Valencians do. If you're looking for some refreshment after a long day of sightseeing, order an agua de Valencia – a cocktail typically made from gin, vodka, cava (Spanish sparkling wine), sugar and freshly squeezed orange juice – at a sidewalk cafe. ", "Visitors should relax while in Valencia: Although the city sees its fair share of petty theft, for the most part it's very safe. Guard against any petty theft by keeping an eye on your possessions, especially on the beaches. You should also exercise common sense at night: Solo travelers should stray from walking through unfamiliar neighborhoods at night, and all should refrain from strolling the Turia gardens after dark.", "The U.S. Department of State recommends exercising increased caution when traveling through Spain due to threats of terrorism. Consider signing up for the Smart Travel Enrollment Program (STEP) to stay up to date on any alerts.", "The best way to get around Valencia is by metro, which reaches as far as the Valencia Airport (VLC) about 5 miles west of the city. Public buses help supplement the metro coverage, but these can be confusing. Instead, consider walking or renting a bike to the closest sights and activities. We recommend forgoing the rental car: parking is near impossible to find, and the city's narrow streets can make driving difficult for visitors. If you think you'll be relying heavily on public transportation during your trip, consider purchasing the Valencia Tourist Card, which offers free travel on metro, tram and bus for 24, 48 or 72 hours.", "From the airport, you can take metro lines 3 or 5 – both of which link the airport to the city center. Alternatively, the Aero-Bus connects the airport directly to the city center, whereas bus route No. 150 stops several times in the towns of Manises and Quart de Poblet, as well as the Mislata suburb, along the way. Taxis are another (more expensive) option. Fares cost a minimum of 20 euros (around $21.86) and include an airport surcharge of 5.40 euros (around $6).", "You'll need your U.S. passport to enter Spain, and remember that it must be valid for at least three months after your departure. To stay longer than three months, you'll need to obtain a visa before you arrive in Spain. Families should be prepared to show proof of relationship if they are traveling with children, since the Spanish government is working hard to prevent international child abduction. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}