{"name": "Toronto", "description": ["Toronto is as cosmopolitan as they come. To newcomers, Toronto may seem like just another big city. Downtown is dotted with skyscrapers and the city's streets bustle with people on the go. Toronto is considered one of the most culturally diverse cities in the world, with more than half the population born outside of the city. Toronto houses 200 ethnic groups that speak over 140 languages, making this Ontario destination a world all its own. With Greektown, Little Italy, Koreatown and Chinatown all within city limits, travelers may feel as if they've seen more than a couple of countries after a visit to Toronto.", "The city is also home to one of the tallest freestanding towers in the world, the CN Tower, and the world's largest underground shopping mall, PATH. But aside from visiting its most prominent attractions, Toronto should be experienced like any other big city: sipping a cocktail in a corner restaurant, browsing multicultural shops on quirky neighborhood blocks and hopping on and off the subway or GO Transit for a night on the town.  ", "The best times to visit Toronto are late April through May and September through October. Peak tourist season occurs during the summer months: the sidewalks come alive with pedestrian marketplaces, patio restaurants and numerous cultural events. However, as temperatures rise, so do prices. If you're looking to save money on hotels, pack a parka and book your trip during the wintertime. If you want lower prices and temperatures above freezing, spring and fall are your best bet.", "Winters are long Toronto's winters are both bitter and interminable. Residents don't consider winter officially over until late April; plan accordingly.", "Bring a map Aside from the city's cultural diversity, Toronto is geographically diverse. There's downtown, yes, but there are also various beautiful beaches along Lake Ontario, including Toronto's famous islands, Cherry Beach and Bluffer’s Beach.", "Hockey is a religion. This sport is as big as they say in Canada. Top athletes are household names, and when the season arrives, it's huge. You must go to a game if you're around during hockey season.", "Forget the car Unless you're planning a daytrip to Niagara Falls, having a car will be both expensive and a pain. Instead of worrying about the gas price or finding a parking space, use public transit, a ride-hailing service like Uber, or walk to your destinations.", "Summer, in some other place Warm, sunny weather attracts hordes of tourists and drives hotel prices through the roof. You'll find much lower rates during the winter and shoulder seasons. Or you can stay in other cities near Toronto, such as North York, Etobicoke, Mississauga, Vaughan and Scarborough.", "Consider the CityPASS Admission to some of Toronto's biggest attractions, such as the CN Tower, the Toronto Zoo and the Royal Ontario Museum, are included. So, if you plan to visit all three, you'll save time and money by opting for the pass.", "Though English and French are Canada's two official languages, you'll also likely hear Spanish, Russian, Ukrainian, Polish, Mandarin, Cantonese, Punjabi and Tagalog, a language of the Philippines, among others. This is all thanks to Toronto's diverse residents and ever-increasing immigrant population.", "Perhaps the most significant difference American travellers will encounter is the use of the Canadian dollar and the international metric system. One U.S. dollar equals about CA$1.35, but since the exchange rate fluctuates, be sure to check it before your trip. You can avoid confusion by familiarizing yourself with Canadian currency. Coins are in denominations of $2, $1, $0.50, $0.25, $0.10 and $0.05. Canadian dollar coins are called \"loonies;\" two-dollar coins are called \"toonies.\" Paper bills are in denominations of $100, $50, $20, $10 and $5. You can dodge high exchange fees by withdrawing Canadian money directly from ATMs in Toronto. Along with differences in currency, you'll also encounter some disparities in how temperatures, distance and weights are measured (in metric units); distance is measured in kilometers – pay close attention to this if you've decided to rent a car.", "It should go without saying that one of the world's most multicultural cities holds the same distinction for its dining scene. Not only does Toronto have a Little Italy, but there's also Chinatown, a Koreatown, a Greektown, a Little Iran, Russia, and Turkey in North York and Little Portugal about 2 miles west of downtown. Moreover, the Bazaar neighborhood offers top-notch Indian and Middle Eastern fare. Roncesvalles Village (formerly called Little Poland) is known for its Eastern European eateries and independent coffee shops, not to mention its popular annual Little Poland festival in September. There are so many foodie enclaves worth exploring here that you may have to plan another trip or two to sample the city's robust palate. Luckily, no matter which area of town you choose to visit, locals assure you that good food isn't hard to come by in this city.", "Hence, for a diverse culinary experience, head to the St. Lawrence Market in Old Town and the Kensington Market. At St. Lawrence Market, indulge in Canadian classics and international dishes like the famous peameal bacon sandwich from Carousel Bakery or Portuguese-style chicken at Churrascos. In Kensington Market, you'll find a mix of Jamaican-Italian fusion at Rasta Pasta, California-style tacos at Seven Lives, vegan options at Urban Herbivore, delightful pies at Wanda's Pie in the Sky, and Berlin-style doner kebabs at Otto's Berlin Döner. Plus, various Asian cuisine is available within a short distance on Spadina Avenue.", "The best way to get around Toronto is by public transportation. The Toronto Transit Commission (TTC) runs three modes – subway, streetcar and bus – throughout the city and suburbs. You will need a token or a pass to travel on TTC; day and week passes allow unlimited rides on all three forms of public transport. If you decide to take advantage of the city's public transportation system, be prepared for frequent delays and don't be surprised if you see a heavy police presence, especially in the subway stations, where violent incidents have occurred in recent years. If you're not comfortable using the city's public transit system, walking or biking is your next best option.", "The subway and taxis connect the city to the Toronto Pearson International Airport (YYZ). However, you can expect to pay around CA$50 to CA$70 (about $38 to $54) for a cab or an Uber, while the subway will cost just CA$3.35 (around $2.60) for adults and between CA$2.30-$2.40 for youth (ages 13 to 19) and seniors. ", "A valid passport is required for citizens of the United States travelling outside the mainland and for U.S. citizens trying to re-enter the country. If you plan to drive, you can also use a NEXUS card, allowing expedited border crossings for private and commercial travelers through Canadian and U.S. border controls. For more information, visit the U.S. State Department website."]}