{"name": "Kaua'i", "description": ["Brilliant sunsets, pristine beaches, aquamarine skies – Kaua'i has mastered seduction. But the oldest island in the Hawaiian chain doesn't have to resort to over-the-top luxury or tourist traps to entice; instead, it appeals to a no-muss, no-fuss type of traveler. Resorts are no taller than a coconut tree (literally).You prefer rural to resplendent? Kaua'i's your island – there are only two major highways, and some regions can only be explored on foot or via one of the best Kaua'i boat tours.", "Some would say that you need little more than a good pair of hiking boots, an umbrella and an adventurous spirit to visit. But we should warn you: You might also need a little cash. Kaua'i has put a premium on its natural beauty and prized hiking trails, and room rates during the winter can exceed $500 a night. To get the most and save the most, consider visiting during the shoulder seasons. ", "The best times to visit Kaua'i are between August and October and from April to June, when the weather is pleasant and airfare and hotel rates drop. The rainy season that occurs from November to March doesn't deter visitors looking for a winter getaway, but a word to the wise: You'll face the highest markup on rooms and flights if you visit at this time (it's peak travel season in Kaua'i). If you fancy whale watching, however, this is the time to go as the season generally lasts from January until spring. If winter is too pricey for your liking, consider the spring and fall months as a compromise: Kaua'i sees a slight dip in prices during these shoulder seasons. Vacationing in Kaua'i during the summer won't yield the same high prices as winter, but they won't be a whole lot lower either.", "It will probably rain Kaua'i is the rainiest of the Hawaiian Islands. Though rainy season officially occurs from November to March, the Hawaii tourism board recommends travelers bring rain gear with them no matter what time of year they visit.", "Don't visit in winter if you want to swim Due to rough conditions, many of the beaches in Kaua'i – especially on the North Shore – become unsafe for swimming during the winter months. If you want to do a lot of swimming at many different beaches, come just before or during summer.", "Always check conditions before you hike or swim Conditions in Kaua'i can change hourly and unanticipated changes have resulted in serious injury and even death. Always check conditions with an official before starting a hike or entering the water.", "See the island from the air Much of the island is inaccessible from land. Helicopter tours are a great way to view the valleys and coast from a bird's-eye view.", "Plan ahead if renting a car While driving may offer the best way to get around the Garden Island, rental cars are in high demand. Make reservations well in advance, as cars may be difficult to come by if you try to rent one once you arrive.", "Rent wisely Car rentals are increasingly hard to come by on Kaua'i. Book early and plan to rent a compact car to save money. Also, car rental rates for vehicles of all types vary by time of year, which you may want to factor into your planning.", "Reread your car insurance policy Some car rental agencies will try to sell you insurance. Hawaii is a no-fault state, which means your existing personal insurance will cover accident-related expenses in most cases. Double-check before you book to ensure you don't pay extra for unnecessary coverage.", "Stick to farmers markets if you want to buy groceries Because so much is imported in Hawaii, you'll balk at the high prices of food at grocery stores. Do what the locals do and go to as many farmers markets (aka sunshine markets) as possible. Roadside stands and farm pickups are also option for buying locally grown produce.", "Classic Hawaiian dishes often come in the form of comfort food (don't expect a whole lot of salads) and are typically a unique blend of the many different cultures that have immigrated to Hawaii. One of the best examples of this cultural immersion is reflected in a dish called saimin. What appears to be plain ramen is actually a combination of broth, noodles and green onions which can be topped with anything from sausage to kimchi to dumplings. It's thought that the dish originated on plantations in the 1800s, when workers of all ethnicities would gather for meals and contribute what ingredients they had. Hamura Saimin in Lihue, situated in southeastern Kaua'i, is said to have some of the best saimin on the island.", "Saimin is just the start of imports with a Hawaiian twist. There's also Spam musubi, which resembles sushi, but instead of fish, you'll be treated to a slice of flavored Spam. If that's a little too unconventional for your liking, try manapua. Manapua resembles traditional Chinese pork buns and are packed with delicious fillings such as sweet potato, barbecue pork or curry chicken, to name a few. For something sweet, sink your teeth into a malasada. This dessert was brought over by Portuguese immigrants and is basically a hole-less doughnut coated with sugar and sometimes filled with a custard, chocolate or fruit filling.", "Another tradition is the plate lunch, a robust dish that always consists of two scoops of rice and macaroni salad alongside a serving of meat that could range from kalua pork (the type of meat traditionally served at luaus) to mahi-mahi. Loco moco is another favorite, comprising a slab of teriyaki-flavored beef that sits on a bed of rice and topped with a fried egg and gravy. If that sounds a bit too heavy, try huli-huli chicken, a grilled chicken dish coated in a sweet teriyaki marinade.", "You also can't leave the island without trying poke, the Hawaiian classic has become increasingly common on the mainland. Traditionally, poke is marinated, cubed raw fish typically accompanied with rice, but it can also be made with shrimp, tofu or other ingredients. Whatever meals you decide to sample in Kaua'i, be sure to top it all off with flavored shave ice (not shaved ice), Hawaii's delicious cold dessert.", "Safety in Kaua'i isn't so much about watching out for crime as it is watching out for Mother Nature. Weather is known to be fickle in Kaua'i, especially when it comes to rain. It's not unusual for a bright, sunny day to suddenly experience unscheduled downpours. When hiking or going to the beach, it is highly advised to consult local resources about the conditions. Hawaiian state park officials recommend all hikers bring a hiking partner (hiking alone in Kaua'i is not safe), don proper hiking boots, and wear waterproof attire, sunscreen and a hat. You should also bring plenty of water to stay hydrated during your hike. HIOceanSafety.com provides recommendations for beach safety as well as a list of lifeguarded beaches. ", "Another key feature on of trails and popular outdoor adventures on Kaua'i is crossing streams. Streams are subject to flash floods and have resulted in numerous deaths on the island. If you see a stream start to rise, or it has a high water level, do not cross it. Wait until it goes down. If you're uncomfortable taking on the terrain by yourself, consider booking a tour with an experienced operator. ", "It's equally important to be mindful of the weather conditions when at any of the island's beaches. Generally, winter sees rougher conditions unsuitable for swimming, especially on the northern and western shores. It is advised to only swim at beaches where lifeguards are present. If you are going to a beach but not swimming, you'll still want to be mindful of the ocean. High tide can quickly sweep in and take an unsuspecting beachgoer close to the shore out to sea. ", "The best way to get around Kaua'i is in a car. The bus system, though inexpensive, does not cater to tourists. Taxis are virtually nonexistent, though you will see them congregate at Lihue Airport (LIH), which is near the town of Lihue on the southeastern side of Kaua'i. Some hotels provide free shuttle service to and from the airport.", "There are direct flights into the Lihue Airport from several North American destinations, but many travelers choose to fly through Daniel K. Inouye International Airport (HNL). If you opt for the layover, try to get a seat on the left side of the plane as you island-hop: You'll have an awesome view of Kaua'i as you approach the island."]}