{"name": "Porto", "description": ["Porto has long been a hot destination for wine lovers – it's the go-to place to find the best of that sweet, tasty port wine. But this city by the sea has more to offer than vinho. Porto (or Oporto, as it's sometimes called) is an attractive European minimetropolis on Portugal's northwestern coast where visitors can get their fill of culture and the outdoors. Travelers can visit the city's wealth of museums, admire its varied architecture, relax in its verdant parks and, of course, hit the beach.", "The city earns its nickname Cidade das Pontes, or \"City of Bridges,\" from the six arches spanning the Rio Douro (Douro River), which runs along Porto's southern edge. Views of the Douro River are best enjoyed from the Dom Luís I Bridge, the most iconic of Porto's six structures. From here you can get a sense of Porto's unique charm, from its colorful UNESCO World Heritage historic district to the north to the neighboring town of Vila Nova de Gaia just south, where you'll find the region's famous wineries. You could spend a long weekend or a week here strolling the city, discovering the contemporary art in the Serralves Foundation complex and appreciating the history behind Porto's old churches like the Sé and Igreja de São Francisco. No matter what you choose to see and do in this captivating city, you'll leave with an appreciation of Porto's diverse offerings, some great photos and, ideally, a bottle or two of its best wine.", "The best time to visit Porto is from May to September when the weather is often sunny and warm. Overall, Porto experiences a moderate climate. Summertime temps are high but bearable, and the breezes and nearby beaches will help you stay cool. The fall brings lower temperatures and occasional drizzle, while in the winter you'll certainly encounter some rain. Springtime also sees showers (though fewer than in the winter) and moderate temperatures.", "Speak Portuguese Yes, Spain and Portugal are neighbors and the languages are similar, but it's rude try to communicate in Spanish instead of Portuguese. Learn some Portuguese phrases like por favor (please), obrigado (thank you) and desculpe (excuse me).", "Beware the appetizers As soon as you sit down at a table, a waiter may bring you a plate of olives, sardines, bread or cheese. These snacks are not free and will be added to your bill if you touch them.", "Purchase a Porto Card This card will give you free or reduced price entrances on select museums, discounts at restaurants and unlimited access to public transportation. Porto Cards range in price from 13 to 33 euros (around $14.50 to $37) depending on the length of their validity and whether or not they cover transportation.", "Sightsee on Sunday Many museums, such as the Serralves Foundation and the Museu Nacional de Soares dos Reis, offer free entry on select Sunday mornings and early afternoons. Plan to squeeze in your sightseeing then to save some cash.", "Porto has long been known for its production of wine. The Douro Valley region's unique landscape of mountains and valleys paired with a warm, dry climate makes the soil here challenging but unique. The harvest process is similar to that in other wine regions, but here, they add some grape brandy during the fermentation process and then transfer the mixture to casks for aging. The result is a sweet (typically red) port, which is consumed with (or sometimes as) dessert.  ", "Aside from its famous wine roots, the city is experiencing a tourist boom thanks to its newer museums and its historic center's designation as a UNESCO World Heritage Site. Culture hounds have their hands full with everything from art and architecture to history and religious sites. Plus, the city appeals to leisurely folk with its abundance of activities and sights on land and sea like biking, boating and swimming.", "The people of Porto are warm and hospitable, often greeting locals and visitors alike with a hearty bom dia, boa tarde or boa noite (good morning, good afternoon or good evening). Portuguese is the language spoken in Porto, so you'll hear words like por favor (please), obrigado (thank you) and de nada (you're welcome) – which are also good to know for yourself. Try your best to learn some Portuguese phrases before you arrive as English is not as widely spoken in Porto as in Lisbon.", "The official currency in Porto is the euro. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Most major credit cards are widely accepted throughout the city, though some restaurants or small cafes will only accept cash so make sure you always have enough on hand. An appropriate tip for a meal is 5% to 10% at a restaurant, and tips for taxi rides are usually 10% or just rounded to the nearest 5 euros.", "Porto's local cuisine features lots of seafood (because of its seat along the Atlantic Ocean) accompanied by plenty of wine. Traditional dishes in Porto range from the Francesinha (a toasted meat, cheese and beer-based gravy sandwich served with fries) to tripas à moda do Porto (tripe cooked with white beans, sausage and vegetables). You can find appetizing tripe dishes at many restaurants, but travelers say the best places for Francesinha are Bufete Fase (which sells nothing else) and Café Santiago (just southeast of Mercado Bolhão). Cod (or bacalhau) is also a popular main dish in Porto – a common saying is that there are more than 365 ways to cook cod. It can be served with potatoes and chickpeas (bacalhau com batata e grão), with scrambled eggs, potatoes and olives (bacalhau á Brás), or boiled with tomatoes and garlic (bacalhau á portuguesa), among other variations.", "The city's namesake sweet dessert wine, port, is especially popular in the region, so be sure to sample some. Meanwhile, visitors with a sweet tooth should try the pastries, gelato or reqeijão com doce de abóbora (a ricotta pie-like dessert with pumpkin jam) at any of the bakeries.", "If you're on a budget, you should still be able to find a great meal in Porto. Many restaurants feature pratos do dia (or plates of the day) for lunch, with the daily specials typically including fresh fish or meat dishes (and sometimes even a glass of wine and dessert) for a set price starting around 5 euros (about $5.50). Keep in mind, meals are served a bit later in Porto, with diners sitting down for lunch between 12:30 and 3 p.m. and eating dinner between 7:30 and 11 p.m.", "Porto is a fairly safe city with a low crime rate. However, you should always be aware of your surroundings and belongings, especially if you're a solo traveler. Pickpockets tend to lurk around the touristy areas and on public transportation, so keep a hand on your purse or wallet. Be especially careful after dark and avoid walking through any alleys, where the homeless and some gangs congregate.", "The best way to get around Porto is by metro, by bus or on foot. Porto boasts an extensive public transportation system operated by the Sociedade de Transportes Colectivos do Porto (which includes the metro, buses and trams) that helps visitors reach the top attractions in and around the city. The metro lines are identified by different colors and letters, plus many of the lines travel above ground and offer splendid views of the city. Porto's extensive bus system can be a bit confusing, and the metro reaches most major attractions, but the bus is a nice alternative to get to some harder-to-reach places, including Foz, the Serralves Museum and Vila Nova de Gaia. Once you're in the city center, you can explore on your own two feet.", "Porto's nearest airport is Francisco Sá Carneiro Airport (OPO), which is located on the northwestern edge of the city. (It's often simply referred to as Porto Airport.) You can get from the airport into Porto by taking the E (purple) metro line toward Estádio do Dragão; the Lapa, Trindade and Bolhão stops are nearest the city's center. Various shuttle services also ferry travelers between the airport and the city. Or, you can get a cab to or from the airport, but it'll cost you about 20 to 30 euros ($22 to $33); and on the weekends it may cost you nearly 20% more."]}