{"name": "Innsbruck", "description": ["For a taste of the Austrian Alps with the charm of a small mountain town, consider spending a few days in Innsbruck. You'll tour historic sites, ski its gorgeous peaks and take in stunning views from its cable cars and funiculars. The host of both the 1964 and 1976 Winter Olympics, Innsbruck is a lovely mountain town dotted with history and in love with winter sports. With the arrival of the first snow, skiers and other cold-weather junkies flock to Innsbruck for its fresh powder and Old-World charm. And while winter brings out the best in this town along the Inn River, the picturesque summers are also worth your notice with ample opportunities for hiking, mountain biking or just sightseeing.", "The best times to visit Innsbruck are the winter and summer. This is a winter-sport enthusiast's paradise, so you will find it full of skiers and snowboarders during the long winter months. In the summer, days can be warm, with temperatures reaching the mid-70s, though you could still need a jacket when temperatures drop at night. Fall is the cheapest time to visit, but you'll find many attractions close for the month of November, so you may miss out on some of the top things to see. Innsbruck also experiences an alpine wind that, while warm, can be quite strong, reaching speeds of more than 90 miles an hour, so hold on to your hat!", "Innsbruck is home to a lot of local traditions and self-described \"oddities\" that knowing about ahead of time can help you acclimate to with the locals. For example, Innsbruck residents tend to be blunt, so don't take offense, and try greeting them with a casual “Hallo.” Keep an eye out for the Tyrolean Shooters, too. This band of marksmen, so named for this region of Austria and clad in traditional Austrian dress, are a part of most festivals and celebrations.", "You'll also hear the church bells ring throughout the day, recalling a time when people would stop and say a prayer when they heard the bells. When visiting churches in Innsbruck, cover your shoulders and knees. A long skirt or pants may work well for women, along with a scarf to quickly cover the shoulders during the warmer months. Men should remove any hats before entering, as well.", "Austria's official currency is the euro; you may want to check the current exchange rate before your visit. Additionally, German is the official language, though many residents speak English, especially in the areas frequented by tourists. A 10% tip will suffice for good service when drinking or dining, or for a single drink or low-cost meal, simply round up to the nearest euro.  Also, keep in mind that many restaurants and pubs close on Sundays, which are observed as a day of rest. Those that are open may serve the traditional Austrian Sunday meal of pork and dumplings. If you'll be having a drink when in Innsbruck, just like you'd say \"cheers\" in America, you'll want to say \"prost\" while looking each person in the eye as you clink glasses.", "Austria and the Alps have their own unique style of cuisine, which borrows from German fare. Innsbruck incorporates a good bit of Viennese-style foods, as well, like traditional pastries, strudels (go for apple) and cakes, which you'll find throughout the city, as well as Gruner Veltliner wines, beer and varieties of schnapps.", "When in Innsbruck, you'll want to try Kaspressknödel, a cheese dumpling that is crisp on the outside and soft on the inside. Other local dishes include Tyrolean bacon dumplings, spinach dumplings and \"Schlutzkrapfen\" (crescent-shaped ravioli with potato filling).", "For a taste of this traditional cuisine, head to Agidihof for Tyrolean fare crafted from locally-sourced ingredients. The restaurant is known for its homemade pastries, ice cream and veal dishes. What's more, the menu changes with the seasons to incorporate fresh produce. Restaurant Ottoburg sits in one of the oldest buildings in Innsbruck and serves traditional Tyrolean fare with hints of Mediterranean flavors. On the menu, you'll find homemade Schlutzkrapfen, steaks, monkfish and pike perch. Who could turn down a homemade apple strudel for dessert?", "You'll also want to make time to dine (and drink) at a traditional beer hall or biergarten. Stiftskeller located in the city's Old Town area is a popular option. You can pair your traditional Tyrolean food with Bavarian beer for the ultimate Austrian foodie experience. Typical dishes include barley soup, whole suckling pig with sauerkraut and pretzel dumplings, and, of course, wiener schnitzel.", "Innsbruck is a pretty safe place to visit, and according to the U.S. Department of State, Austria has one of the lowest crime rates in Europe with violent crime rarely occurring. You might find pickpockets and bag snatchers in public areas and on public transportation, so be vigilant with your belongings. It's also a good idea to keep your bags with you when traveling by train. The U.S. Department of State advises that many cities in Austria have occasional public demonstrations, which are usually not violent, but can disrupt transportation.", "The best way to get around Innsbruck is on foot. It's a walkable city with many of the top attractions in the old town or within walking distance from one another. There is also plenty of hiking, should you have the energy to head up into the mountains for fabulous views. The city's dedicated cycling lanes and the small amount of traffic also make Innsbruck bike-friendly.", "If you need a little more help getting in between attractions, the city has a simple bus system, which is free with an Innsbruck Card. Cable cars and funiculars will take you into the mountains for hiking and other outdoor activities, not to mention great panoramas, while trains may be best left for when you need to get to other nearby towns or major European cities.", "While driving a car is an option in some areas, it can be difficult in winter when many mountain roads close. Taxis are available, and many visitors take a cab to get from the airport to town. Innsbruck Airport (INN), which serves the city with flights from around Europe, is situated less than 3 miles from the center of old town and is easily accessible by taxi or bus.", "U.S. visitors to Austria must have a passport that is valid for at least six months beyond the date of departure, as well as at least one blank page available for stamping. Americans can stay up to 90 days without a visa. There are no vaccinations required to visit Austria. For more information, visit the U.S. Department of State's website."]}