{"name": "Tasmania", "description": ["If you're dreaming of a remote destination filled with historical charm, pristine beaches, unique wildlife and jaw-dropping mountains, then consider vacationing in Tasmania (or Tassie, as the locals call it). Situated about 150 miles south of Australia's mainland, this island appeals to anyone looking for an adventure. Families will enjoy walking across the suspension bridge at the Launceston Cataract Gorge & First Basin, while adrenaline junkies can hike Wellington Park's Organ Pipes or embark on a multiday trek along Cradle Mountain's Overland Track. Freycinet National Park is an ideal spot for water sports like snorkeling and kayaking, and once the sun goes down, you can get your heart pounding during an evening ghost tour of the Port Arthur Historic Site. In between sightseeing and exploring your surroundings, you'll find a variety of shops and art galleries, as well as eateries that serve fresh seafood and produce alongside locally made wines, beers, ciders and spirits.", "The best time to visit Tasmania is between December and February, Australia's summer season. Though crowds are at their thickest and room rates at their highest, these months offer the most comfortable temperatures for enjoying the island's abundant outdoor activities. Additionally, summer is filled with food and culture festivals. If you're hoping to hike but want to save some money, consider visiting in late spring (October and November) or early fall (March and April). June, July and August are also months where you're more likely to find accommodation and airfare deals, but you'll want to pack appropriate attire and snow boots to help you cope with the region's chilly temps and ample snow.", "Cider is big here Known as the \"Apple Isle,\" Tasmania grows roughly 55,000 metric tons of apples annually in its Huon Valley. Many of the apples harvested are turned into cider, which you can sample on The Tasmanian Cider Trail.", "Some hiking paths require reservations The Three Capes Track requires advance bookings year-round, while the Overland Track in Cradle Mountain-Lake St Clair National Park only grants access from October through May to visitors with reservations.", "Go camping Tassie hotel rooms can cost more than $100 per night, while campgrounds range from 6 to 13 Australian dollars (or $5 to $10) per night, per person to AU$30 to AU$50 (about $24 to $40) for stays lasting up to seven nights. Plus, kids 17 and younger stay for free at any national park campground.", "Plan a winter visit Accommodation prices are generally higher when the weather warms up between December and February, Tasmania's summer and peak season. Also, most trails are free to access in the winter.", "Skip the national parks If you want to explore the great outdoors without burning a hole in your wallet, check out natural wonders like the Launceston Cataract Gorge & First Basin and Wellington Park. Both are free to visit.", "The bulk of Tasmania's art- and culture-focused attractions reside in Hobart, and a variety of music, film and craft events – including the Junction Arts Festival and the Tasmanian Craft Fair – are hosted every year. For an in-depth look at the island's art scene, check out the Tasmanian Arts Guide website.", "Tassie's atmosphere is relaxed and its residents are friendly, which makes navigating this island as a tourist relatively easy. English is the official language here and throughout Australia, but Aussie English is a bit different from American English, so you'll want to know a few key words and phrases – like \"g'day\" (hello), \"reckon\" (for sure) and \"ripper\" (great) – to help you get by. Aussies are also known for having a dry sense of humor; expect to hear some sarcastic or frank remarks while visiting.", "When walking, you'll need to look right, then left and then right again before crossing a street. If you're driving, remember to stay on the left side of the road. Aussies use the metric system, so road signs post distances in kilometers, and speed signs list speed limits in kilometers per hour. One kilometer equals about a half-mile.", "Should you decide to hail a cab, keep in mind Australia's tipping policy. No passenger is expected to tip cab drivers or restaurant staff unless exceptional service is provided, but to make receiving change a bit easier, locals often round up to the nearest Australian dollar (Australia's official currency, which equals about $0.79). Currency rates may fluctuate, so check the latest exchange rate before you visit.", "Tasmania's cuisine highlights fresh produce grown on the island and seafood farmed on land and caught offshore. Weekly markets like Hobart's Salamanca Market feature an array of food stalls that sell raw and prepared foods, and restaurants commonly incorporate local specialties like Tasmanian Atlantic salmon, wild abalone, black truffles and leatherwood honey into their menus. Landscape Restaurant & Grill and Blue Eye in Hobart, Black Cow Bistro and Cataract on Paterson in Launceston and The Rectory and Mrs Jones Restaurant Bar Lounge in Devonport are just a few eateries that highlight some of these ingredients in regional dishes like scallop pie (a pastry stuffed with scallops in a creamy curry sauce).", "Hobart is also known for offering a plethora of international cuisines, from Chinese to French to Argentinean. Some of the city's most popular restaurants include the Italian-focused Solo Pasta & Pizza, the Lebanese-inspired Syra Restaurant and the Greek-influenced Urban Greek.", "Although Tassie's dining scene is growing, the island is best known for its alcoholic beverages. Nicknamed the \"Apple Isle\" because of its abundance of apple orchards, cider is one of the most commonly produced drinks in the region. Tasmania's pure water also makes it a great place for creating distilled spirits like whiskey, vodka and gin. Many craft breweries are spread throughout the island as well. If you're interested in sampling some of Tassie's brews and spirits, consider exploring the area's beer, cider and whiskey trails.", "Tasmania also features seven wine regions, where vineyards produce everything from pinot noir to sauvignon blanc to various sparkling wines. The island's oldest and largest wine district is the Tamar Valley, which sits near Launceston and has more than 30 vineyards. Other wine regions include Pipers River (also near Launceston) and the Derwent Valley (just north of Hobart). Puddleduck Vineyard, Bruny Island Premium Wines and Josef Chromy Wines are a few of Tassie's most popular wineries.", "Tasmania is considered a relatively safe place to visit, but you should take precautions when enjoying the island's outdoor activities. Be mindful of any undertows at Tassie beaches. If you find yourself caught in one, swim parallel to land until you're out of the rip current, then swim to shore. You'll also want to travel with a companion and wear insect repellent and adequate boots when hiking. If you're anticipating going on a multiday trek on trails like the Three Capes Track and the Overland Track, Parks & Wildlife Service Tasmania strongly suggests telling someone your plans before you depart.", "Additionally, you should stay alert while in any part of Australia, since terrorist threats have increased recently. For up-to-date information regarding Australia's current threat level, visit the Australian Government's Australian National Security website. And when visiting larger cities like Hobart, be mindful of your belongings. Foreigners are occasionally targeted by pickpockets and petty thieves in popular tourist areas. To learn more about how to stay safe while visiting Australia, check out the U.S. State Department's website.", "The best way to get around Tasmania is by car. Though you'll have to get used to different driving norms, such as traveling on the left side of the road and calculating distances in kilometers, hiring a car is an affordable and convenient way to see many Tassie cities and sights. Organized bus tours from local companies are also available but are often more expensive and require sticking to set itineraries. Within major cities like Hobart and Launceston, public and private bus services are also an option. Keep in mind that bus operators vary by destination, and routes between cities are generally limited. Additionally, you can hail a taxi, but cab fares are high and are dependent on the location and time of day.", "To get between smaller Tassie destinations, you may have the option of flying into regional airports, though you'll need another way to get to and from attractions. The Spirit of Tasmania offers ferry service between Devonport and Melbourne, however, this mode of transportation cannot be used to reach other mainland cities in Tasmania; some ferries do travel to and from smaller Tasmanian islands. If you don't reach the island by ferry, plan on flying into Hobart International Airport (HBA).", "To visit Tasmania, you will need a valid U.S. passport and a visa. If you're staying in Australia for less than 90 days, you can apply for your Electronic Travel Authority (an electronic, label-free visa) on the Australian Government Department of Immigration and Border Protection's website. Some airlines and travel agents can apply for an Electronic Travel Authority on your behalf. For more information about entry and exit requirements, check out the U.S. State Department's website."]}