{"name": "Zurich", "description": ["Switzerland's largest city is set on the banks of two rivers and a lake, with the snow-topped Swiss Alps rising in the background. The modern city sprawls into the surrounding foothills, but in the heart is the historic city center, which features clean cobblestoned streets that hug a hilly terrain, with medieval church spires pointing heavenward. Despite its reputation for being a banking hub, a Google base and a capital for top-notch chocolate, Zurich is also a very modern city that chooses to meander through life at a punctual, steadied pace. Travelers desiring an authentic experience should strive to do the same. ", "Ulrich Zwingli came to proselytize. James Joyce came to write \"Ulysses.\" Bankers came to make money. Dadaists met at Zurich's Cabaret Voltaire to change or ruin art, depending on your position. But you should come for the decadent chocolate, grilled sausages, locally grown wines, amazing museums, medieval architecture, extravagant shopping, breathtaking vistas and restorative swims in the city's clean, clear alpine-fed lake and river. Zurich is a popular gateway to the alps, but stay a bit longer and the city's austere charms reward you by unfolding quietly.", "The best time to visit Zurich is between June and September, when average temperatures, which hover in the high 70s, make lake and river swimming possible. December, January and February (the winter offseason), see hotel rates spike due to the city's proximity to the Swiss Alps' ski slopes. Springtime is colorful and festive, and the period from March to May often surprise visitors with its temperate weather and reasonable room rates. October and November are gray due to nebelmeer season, when fog fills the valleys all over the alps.", "Zurich is expensive Although the Swiss franc and euro currencies are fairly equivalent, high living expenses make Zurich one of the world's priciest cities to visit.", "Cars are a hassle Getting around Zurich is easy to do on foot or by public transportation. Plus, a boat ride on Lake Zurich (which is included with your tram ticket), is a lovely way to see the city. What's more, farther locales like Uetliberg are just a 30-minute train ride away.", "Sunday is for relaxing Most shops, pharmacies and grocery stores (and many restaurants) are closed on Sundays, the day when Zurichers reboot. Be sure to buy your essentials on Saturday.", "Buy the Zurich Card According to travelers, this card is worth its price as it grants you unlimited travel on public transportation and free or discounted entry to dozens of museums.", "Skip the taxi Taxis are very expensive in Zurich, with the meter starting at 8 Swiss francs (about $9). If you need to travel by car, Uber is cheaper. Or, save money by walking or cycling instead.", "Visit in the summer or spring If you plan your visit to coincide with one of these shoulder seasons, you'll likely find a reduced rate on your hotel room.", "When visiting this beautiful Swiss city, don't litter. Zurich still holds on to its 16th-century Protestant past, as displayed throughout the immaculate city. In fact, Zurich is so clean that you can fill your water bottle from the city's 1,200-plus fountains.", "Switzerland has four official languages: Swiss German, Italian, French and the least commonly spoken, Romansh. In Zurich, the majority of residents speak Swiss German, though French phrases like “adieu” (goodbye) and \"merci\" (thank you) are often used here as well. Nearly everyone speaks English, even used as a neutral language among Swiss from different linguistic regions. But to really know Zurich, learn to speak a few guttural Swiss-German phrases just in case. En guete (\"bon appétit\"), prostli (\"cheers\"), shoggi (\"chocolate\"), kaffeli (\"coffee\"), and the most difficult, chaschuechli (\"cheese quiche\"), are a few to get you going.", "Unlike other European countries, Switzerland does not use the euro for currency. Instead, stock up on Swiss francs after arriving, (1 Swiss franc equals about $1.12). Though a few rare shops and restaurants will take euros for payment, change will be given in francs. To ensure you are up-to-date on the Swiss franc to U.S. dollar exchange rate, look up the latest exchange rate before your trip.", "Switzerland incorporates tips into advertised meal and service prices, but it's common to round up to the nearest 5 or 10 francs, though few expect it. Sales taxes are also included in all bill prices.", "Much like its languages, traditional Swiss food is heavily influenced by Germany, France and Italy. Because of Zurich's equidistance to the German, Austrian and French borders, most of the city's food has German, Austrian and French roots, but grew to be its own flavor over the centuries. \"Nach Zurcher art\" (or dishes cooked in the traditional Zurich style) typically consist of meat, potatoes, mushrooms, butter and cream – a mix of German heartiness, but with doses of saucy French influence, a reminder that Zurich was once at the frontier of Burgundy and has Carolingian heritage, as evidence by a bust of Charlemagne on the city's Grossmunster Cathedral. For classic Zurich cuisine, head to Old Town. Quintessential local dishes include Zurcher geschnetzeltes (Zurich-style sliced veal in gravy), rosti (shredded fried potatoes) and burli (crusty bread rolls).", "In addition to the city's predominantly savory cuisine, Zurich offers several spots for authentic Swiss chocolate and melted cheese, like raclette and cheese fondue. A trip to Confiserie Sprungli's flagship store in Kreis 1 is also a must for chocolate and pastry. There's also the themed Fondue Tram, which departs from Bellevue station and travels throughout the city every November through February. For more information about Zurich's Fondue Tram, visit Zurich Public Transport's website.", "There have been no major recent terror attacks in Switzerland, and threats of violence are extremely rare. Demonstrations in Switzerland can become surprisingly heated and often cause disruptions to transportation, so unless you are participating, it's best to avoid protests (locally called a streik). As a whole, Swiss cities are typically very safe to visit. Zurich sees very little tourist-directed crime and visitors are more likely to have their lost wallets, phones and computers returned to the lost and found than stolen. For more safety tips, check out the U.S. State Department's website.", "The best way to get around Zurich is on foot or by bike. If your feet need a break, you can take the city's efficient tram system. From Zurich Airport (ZRH), you can also take a train for 6 miles (around 20 minutes) into Zurich. Though expensive, traveling by taxi to the city center from the airport is a viable option, as is Uber. If you take a taxi from the airport into the city, expect to pay around 50 Swiss francs (around $54). Driving within Zurich is not recommended due to the city's constant traffic and intentionally limited amount of parking.", "Currently, for visits up to 90 days, Americans do not need a visa to enter Switzerland and the surrounding Schengen Zone. If you plan on staying longer, proper visa documentation – which can be obtained from the Embassy of Switzerland – must be completed prior to departure. A passport that is valid for at least three months after your return is also required. In 2024, American will be required to fill out an ETIAS travel authorization to receive authorization to travel in the Schengen Zone. To find out more about entry and exit requirements for Switzerland, visit the U.S. State Department's website."]}