{"name": "Virginia Beach", "description": ["Virginia Beach is one-third affordable party spot for local college students, one-third haven for families with small kids and one-third renaissance beach town. This coastal city aims to lure beachcombers from Ocean City, the Outer Banks and Myrtle Beach to its own revitalized stretch of East Coast sand and boardwalk. Like those other towns, \"VA Beach\" offers scenic coastal views, enough sand and sun to keep the kids entertained, and enough affordable nighttime diversions to satisfy unpretentious adults. Sure, the hotels, restaurants and attractions aren't super-luxe, but the point is that here, no one needs them to be. Virginia Beach is for those who want a relaxing good time without any hassle.", "The best time to visit Virginia Beach is from late May to early September, when you'll experience oceanfront culture in full swing. But fair warning: This is the peak season. The city and beach can get crowded during these months, plus room rates at beachfront hotels are generally higher between Memorial Day and Labor Day. For lower prices and relatively comfortable temps, arrive in spring (from March to mid-May) or fall (between mid-September and November). You can also save some coin if you visit in December, January or February, but you'll need to bundle up and may encounter reduced hours at select attractions.", "Keep safe at the beach Swim near a lifeguard and avoid rip currents, which are recognizable by particularly foamy and choppy waters. If the conditions are especially dangerous, lifeguards will raise a red flag to keep people out of the water.", "Keep it family-friendly You'll find lots of signs warning against cursing and an abundance of law enforcement patrolling the streets and boardwalk, so be on your best behavior. Virginia Beach is serious about preserving its PG image.", "Choose your accommodations wisely Although hotels by the boardwalk are generally more expensive than those outside the resort area, parking fees in this part of town can quickly add up, so consider staying within walking distance of this main thoroughfare or at a property with free parking. For even more savings, rough it at First Landing State Park.", "Visit in the fall or winter Hotel rates are at their lowest from September (after Labor Day) through February, plus you'll save $2 on weekend admissions to First Landing State Park.", "Some of the freshest seafood is caught just north of this coastal city in the Chesapeake Bay, so it's hardly surprising that seafood is the overwhelming theme of the food scene here. Regional staples (think: crab cakes, fried shrimp, raw oysters and she crab soup) are dished up at many local restaurants, including traveler-approved seafood eateries like Blue Seafood & Spirits, Tautog's Restaurant and Waterman's Surfside Grille.", "Virginia Beach is also home to a lot of chain restaurants, but discerning stomachs can find more elegant and diverse establishments, such as Mannino's Italian Bistro and Mahi Mah's Seafood Restaurant & Sushi Saloon. The boardwalk has your typical spread of restaurants, including burger joints and pizzerias.", "The best way to get around Virginia Beach is by car, even though parking and summertime traffic can be tough. Most people drive to the area, but you could also fly into Norfolk International Airport (ORF), which sits about 20 miles northwest of the city. If you plan on staying in the downtown area, you could rely on your own two feet, a bicycle or the VB Wave trolley system to get to and from locales by the boardwalk. However, none of these options are practical for reaching farther attractions like Cape Henry Lighthouse and the Military Aviation Museum. Taxis and ride-hailing services can also be used, but the fees for these modes of transportation can quickly add up."]}