{"name": "Cape May", "description": ["Known as America's original seaside resort, Cape May has been a premier summertime getaway for generations. Part of the Jersey Cape's stretch of beaches and boardwalks, this tiny town is located about 45 miles south of Atlantic City, New Jersey, 95 miles southeast of Philadelphia and roughly 160 miles south of New York City. It is home to less than 3,500 residents but welcomes upward of 50,000 vacationers every year. In addition to its pristine beaches, Cape May's roughly 600 preserved Victorian buildings and collection of quaint bed-and-breakfasts transport visitors to a bygone era. Its military presence also cannot go unnoticed; Cape May played a major role in defending the country during World War II, and about 30% of the population today is involved in the armed forces. Whether you choose to spend your days bird-watching (Cape May offers some of the best birding spots in the world), visiting wineries or touring historical sites, you're bound to quickly recognize the charm of this coastal escape.", "The best time to visit Cape May is from May to September when the air and water temperatures are warm enough for sunbathing and swimming. While summer is when the Jersey Shore comes alive, this seaside destination still boasts plenty of activities throughout the year. Visit around Christmastime to see twinkling lights draped across the city's Victorian homes, or opt for an autumn trip to enjoy the Cape May Fall Festival in October. Even spring draws some travelers – especially those looking to celebrate Easter. No matter what time of year you choose to visit, the personality of this tiny coastal town is sure to shine through.", "Beach tags are required To visit Cape May's beaches during the summer, vacationers ages 12 and older must have a beach tag. Daily tags cost $6 per person and seasonal tags cost $30. Travelers can buy tags at beach entrances and Cape May's city hall.", "You won't find any chain hotels The oldest resort town in the U.S. stays true to its roots and, as such, is home to zero major chain hotels. Instead, you'll have your pick of charming bed-and-breakfasts and quaint rental cottages. Just remember that not all lodging options accept credit cards, and no accommodations are located directly on the beach.", "If you're going to cook, plan ahead Cape May has a couple of small grocery stores and markets, but you won't find superstores like Costco or Sam's Club. If you'd like to stock up on a week's worth of food at one of these giants, plan to make a stop on your drive down. ", "Whales are visible year-round Whale watching enthusiasts are bound to get lucky in Cape May, as these majestic marine mammals can typically be spotted no matter the month. Hop on a boat tour (most companies run from March to December) to admire humpbacks, finbacks and other ocean life.  ", "Travel in the offseason Winter and early spring constitute Cape May's offseason, which is a great time to score hotel and travel discounts. Just keep in mind that some businesses close up shop or have limited hours during the quieter months.", "Rent a house To save some money on lodging, rent a vacation home instead of staying in a hotel. If you're traveling with a group, you can pocket even more coin by opting for a large home and splitting the costs between everyone.", "Explore on foot Driving through (and parking in) Cape May can often be a headache. Instead, adopt the \"carfree, carefree\" mantra and explore the city on foot or by bicycle. Saving money will be the cherry on top. "]}