{"name": "Marbella", "description": ["A city and resort destination located along Spain's southern Costa del Sol, Marbella (pronounced mar-BAY-ya) is backed by the Sierra Blanca Mountains and fronted by the azure waters of the Mediterranean Sea. In between them, visitors will find luxe resorts, gleaming designer storefronts, see-and-be-seen restaurants, and remnants of historic Andalusia in the twisting cobblestone alleys of the city's Old Quarter. Although Marbella is a favored destination of the rich and famous – Antonio Banderas lives here – mortals are invited too. In fact, if done right, the other half can enjoy a luxurious vacation filled with beach days, delicious food and cultural encounters, just like their celeb counterparts, but maybe without the hassle of paparazzi.  ", "The best time to visit Marbella is in September and October when summer's tourists have departed but temperatures are still warm enough for a dip in the Mediterranean. The months that span November and March see lower temperatures and fewer tourists, while April is another nice shoulder season of moderate temps and bearable crowds. Summertime's peak season attracts throngs of tourists, but temps and rates on everything from flights to hotels, are at their highest this time of year.", "The culture in Marbella is shaped by its rich, centuries-old history. At different times, the swath of Spanish coast was home to Phoenicians, Visigoths and Romans. These days, the shoreline attracts some of the world's wealthiest jet-setters to its luxe resorts and glitzy restaurants.   ", "Locals in Marbella speak Spanish; some residents may speak with an Andalusian dialect. Though many within the tourism industry will likely speak English, it's recommended you brush up on a key phrases, including \"por favor\" (please); \"gracias\" (thank you); \"hola\" (hello); and \"adios\"(goodbye).", "The official currency in Spain is the euro. Visitors can exchange their U.S. dollars for euros at the airport or at various money-changers throughout Marbella. Since the exchange rate tends to fluctuate, plan to check it before you go.", "Although Marbella is generally a very safe place to travel, it's wise to be aware of your surroundings, especially in parking garages near Avenida del Mar, where some pickpocketing incidents have been reported. It's also smart to carry water bottles and wear sunscreen during your Marbella trip to avoid dehydration and sunburns.", "For years, Andalusian cuisine hasn't gotten the credit it deserves. Some say it's because the locals were embarrassed about serving their regional dishes to travelers. But these days, the dining scene in the region is changing and chefs and restaurateurs are starting to welcome in others to its tastes and traditions. ", "The region's mild climate lends itself to growing olives for delicious olive oils, grapes for wines, as well as mangoes and avocados. Plus, the region's goats provide much of the milk France uses to make its cheeses. With its Mediterranean locale, Marbella also dishes up lots of delicious seafood, including anchovies and shellfish. Visitors can find these and more at the Mercado Municipal de Marbella, located on the northern stretches of Old Quarter. ", "While spending lazy days on Marbella beaches, travelers must stop into the chiringuitos, which flank many of the city's shorelines. These affordable snack bars serve fried boquerones (fresh anchovies) and tortillas espanola (Spanish omelets), and allow visitors to rent  beach chairs, umbrellas and paddle boats. ", "To appeal to its jet set crowd, Marbella also offers an array of fine dining establishments, such as Paco Jimenez, with its artistically plated Spanish and Mediterranean fare, and Restaurante Messina, which gets high marks among travelers for its delicious and delicate tasting menu.", "The best way to get around Marbella is by car, but many travelers use a combination of walking and driving during their Marbella vacation. The city also offers bus service for those who would rather let someone else do the driving. ", "To reach Marbella, most travelers fly into Malaga-Costa del Sol Airport (AGP), which is located about 35 miles northeast of Marbella in Málaga. Travelers can rent a car to traverse the distance between the airport and Marbella, or they can take a taxi or a city bus. The A Express Line (No. 75) brings travelers from the airport to the city center in just 15 minutes. Tickets, which cost 3 euros, can be purchased on the bus. ", "If you're visiting other cities in Spain, such as Madrid or Barcelona, you can also travel to and from Marbella by high-speed Renfe train. The nearest station, Estación María Zambrano, is located in Málaga, which sits a little less than 40 miles from Marbella.  ", "To enter Spain, travelers will need a passport that's valid for at least three months beyond their departure date (though six months is recommended). To stay longer than three months, travelers will need to obtain a tourist visa before arriving in Spain. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}