{"name": "Normandy", "description": ["Skirting the English Channel and occupying a hefty portion of northern France, Normandy is known for its Camembert cheese, its apple orchards (thus, cider and brandy too) and its cow-peppered landscape, complete with quaint cities and towns like Rouen, Bayeux and Giverny. But it's also revered for its momentous place in history. The site of the 1944 D-Day invasion, Normandy's beaches, saw a death toll in the thousands but also a changing tide in World War II. Its military cemeteries, memorial museums and the D-Day landing sites bring a huge number of visitors to the region.", "Another highlight of Normandy is one of France's most famous tourist sights, the stunning Mont Saint-Michel, but almost at every turn, you'll find historic castles, churches and charming small towns. You should visit Normandy for the history, the food and slow pace of life, but you should also come for a taste of France at its friendliest. This is not glitzy Nice or Cannes – neither is it cosmopolitan Paris – this is where France's salt-of-the-earth citizens congregate. ", "The best time to visit Normandy is June to August. Though this is the height of the peak tourist season – which can last from May to mid-October – this period also promises the most pleasant weather. Fall and spring can be optimal shoulder seasons if you're hoping for fewer crowds and better accommodation rates, but a visit during this time will likely require coats (highs hover around the 50s). Winter will usher in the best hotel rates, but some of the businesses in the region's small towns and cities will likely close up shop for the season. Plus, some of the region's top museums close for the month of January.", "Normandy as a whole is quite friendly to travelers, and areas around the D-Day Beaches are used to American tourists. A great way to bridge the cultural divide is to learn a little bit of French. While many locals know English (especially in tourist areas and hotels), a little effort from your end can go a long way.", "Pleasantries are highly regarded in French culture. Saying a bonjour (\"hello\" or \"good day\") or bonsoir (\"good evening\") will not only show that you're making an effort, which the French appreciate, but enhance your own cultural experience. Merci is \"thank you\" and s'il vous plait is \"please.\" If you're at a loss for words, politely ask the waiter or shop attendant Pouvez-vous m'aider? (\"Can you help me?\") or \"Parlez-vous anglais?\" (\"Do you speak English?\"). Another helpful phrase: Excusez-moi (\"Pardon\" or \"excuse me\"). ", "France uses the euro, and major credit cards are accepted at most establishments in Normandy. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Keep in mind the exchange rate when you tip and make purchases. Some smaller shops, bakeries or bistros may only take cash, though, so keep some euros on hand just in case. Most restaurants and cafes will include a 10 to 15% service charge (service compris) on the bill. You can leave some additional change for exceptional service, if you wish.", "Restaurants around Normandy love to celebrate their dairy products and their fruits, which they are rightly proud of. The region's rich pastures and bucolic farmlands produce a rich bounty of these staples. Don't miss any opportunity to sample Normandy's four distinct cheeses: Camembert, Livarot, Pont l'Evêque and the heart-shaped Neufchâtel. There is even a Route des Fromages that highlights the four cheeses through stops at museums, farms, towns and restaurants. These cheeses are often served as dessert and pair well with the ever-present apple-based beverages from the region, such as cider, perry, Calvados and Pommeau, made from local apples and pears. Le Volet qui Penche in Bayeux is a popular wine bar known for its charcuterie and local cider.", "Considering Normandy boasts hundreds of miles of coastline, seafood is another favorite, with lobsters, scallops and shrimp on many menus. Michelin starred-restaurants are also easy to come by in Normandy. If you're willing to splurge, restaurants like Jean-Luc Tartarin, Gill and Le Pily come highly recommended.", "The best way to get around Normandy is by car. Many travelers fly into Paris, then drive or take the train to Normandy. However, Normandy does have two regional airports, Aéroport de Caen-Carpiquet (CFR), which welcomes regular flights from Air France and regional airliners, and Aéroport de Deauville-Normandie (DOL). Rental cars are readily available at any of the airports. Other options from Paris include traveling by train, bus or with an organized tour, of which there are any number of companies offering daytrips.", "SNCF trains depart from Paris' Gare Saint-Lazare and Paris-Montparnasse several times a day to a variety of towns in Normandy, including Rouen, Giverny, Caen and Le Havre, among others.", "A United States passport is required for U.S. residents traveling to France; children of all ages must have them, too. Your passport must be valid for at least three months beyond your date of departure. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on exit and entry requirements."]}