{"name": "Santorini", "description": ["Around 1600 B.C., one of the largest volcanic eruptions in human history forced the center of what was then a single island to implode and succumb to the sea. Some say that this was the original home of the lost city of Atlantis, which long ago disappeared into the ocean's depths. Whatever remains of this mythological metropolis is now guarded by beautiful beaches and stately whitewashed homes. Today, Santorini consists of two inhabited islands and several islets. Most visitors spend their time on Thira (the archipelago's largest island), which is home to Santorini's major towns, including Fira and Oia. Sleepy Thirassia makes for a relaxing day trip too. And don't count out the quieter islands: Nea Kameni and Palea Kameni are also worth exploring.", "Your first order of business in Santorini is to hit the colorful beaches – the black and red sands make for a memorable visit. Next up, indulge in the archaeological delights of the impressively preserved Ancient Akrotiri or hike to Ancient Thera to see the ruins of three empires, including the Romans. From there, catch a breathtaking view of the caldera, a brilliant turquoise pool of water that serves as the nucleus for the varied isles of this archipelago. To properly drink in all of Santorini’s charm, you’ll need at least a few days. Then you'll have plenty of time to learn there's more to these comely dots of the Cyclades than meets the eye.", "The best time to visit Santorini is from September to October and April to May when the weather is warm and the crowds are lighter compared to the summer months. Like all of the Cyclades, Santorini welcomes the most visitors during the summer, so you'll need to make your reservations four to eight months in advance if you plan on visiting anytime from June through August. This is true for both hotels and restaurants. Looking for a bargain? Try winter, when room rates tend to drop. Keep in mind that winter’s average highs only reach the 50s (not good for sunbathing) and the region sees plenty of precipitation. However, all that rain does make for a very flowery (and warm) spring season. Crowds will be at a low in the spring as well, though tourists will begin invading the islands come May.", "Drink up Santorini's rich volcanic soil is ideal for growing grapes, making wine the beverage of choice here. Local wineries offer tastings and vineyard tours.", "Don't go to the beach barefoot Santorini's black sand beaches are primarily made up of eroded volcanic material and lava fragments, making them extremely hot after a couple hours in the sun. To avoid burns, make sure to wear sandals or water shoes.", "Santorini isn't all cliffs The pictures you see of Santorini situated high on the caldera are actually on the west coast of the island. The east coast, including Kamari and Perissa, are generally flat.", "Vacation in the shoulder seasons The fall and spring are known for warm weather, but not as many tourists take advantage of it compared to summer. You can find some great deals on hotels if you skirt the summer crowds.", "Hungry? Head inland While the thought of munching on fresh Greek fare at the beachfront or caldera side is no doubt tempting, these restaurants charge higher prices solely for the location. Definitely take advantage of these scenic restaurants, but balance it out by heading inland, where you'll likely find more budget-friendly menus.", "Stay on the east coast Hotels along the caldera in towns like the popular Oia tend to attract the most travelers, especially honeymooners. You'll find much more reasonably priced rooms in southeastern towns like Kamari and Perissa.", "Greek is the official language, though considering the large influx of visitors the island receives (as many as 8,000 cruise ship tourists alone come ashore daily), you're more likely to run into English-speaking Greeks than not, especially in tourist areas. Understanding body language here though is key. Be very aware of your gestures. For example, using the thumb and index finger to signal \"OK\" is offensive, as is holding up your palm to anyone. If you want to wave goodbye, make sure your palm is facing you. As for indicating nodding your head to indicate 'yes' and shaking your head to indicate 'no.' Greeks do it differently. A slight downward means 'yes' while a slight upward nod means 'no.' These gestures are often subtle and quick, making it hard for foreigners to understand. The best thing to do is avoid trying to communicate with gestures here to avoid getting lost in body language translation.", "Shorts and T-shirts are acceptable when walking around the towns or the beaches, some of which are clothing optional. Dress continues to be casual even in restaurants, but Greeks tend to dress up a little more nicely when dining out in the evenings. Other than on the beach, never waltz into a restaurant or public space in your bathing suit or barefoot, even along a beachfront promenade. ", "Santorini's currency is the euro. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops. When eating at a restaurant, a service charge may be included. As such, tipping isn't commonplace. It's still a good idea to carry euros with you, as taxis prefer cash payment to cards.", "While in Santorini, take full advantage of the fresh Greek fare. The island's climate in combination with its volcanic soil enhance flavors of the fruits and vegetables grown here. As such, Santorini has made a name for itself in the wine community, making a visit to one of the island's wineries a top attraction. In addition to delectable grapes, make sure cherry tomatoes (especially sun-dried), capers and white eggplant are part of one or more of your meals during your time in Santorini. The sweetness and white color of the eggplants here are a direct result of being grown in volcanic soil. Cherry tomatoes are another fruit that can attribute their taste to the unique soil. If you like eggplant, then you'll no doubt enjoy moussaka, a Greek-style lasagna that features layered eggplant, minced meat and spices topped with béchamel sauce. Other must-try Greek specialties include anything with olives and olive oil, especially a traditional Greek salad, as well as fava, a traditional dip made of fava bean puree.", "Greeks are all about their dips. Along with fava and the famous tzatziki sauce (yogurt, cucumber and garlic), another must-try and uber-traditional dip is taramasalata, made from smoked fish roe and mixed with olive oil and lemon juice. Other popular small bites include dolmades and keftedes. Regularly served before meals, dolmades are seasoned rice often mixed with meat or vegetables and wrapped entirely in a grape or vine leaf. Keftedes are fritters commonly mixed with cherry tomatoes (tomatokeftedes) or grated zucchini (kolokithokeftedes). If you're after something heartier, you're in luck: The island, as well as the whole of Greece, have a penchant for grilled meats. Souvlaki, or seasoned skewered meat, often topped with tzatziki, can be found all over. Octopus, which you'll likely find hanging by its tentacles outside seaside tavernas, are also popular. And, of course, you can't leave without grabbing a gyro. Whatever you choose to eat, make room for dessert – baklava, a filo pastry layered with honey and ground nuts and loukoumades, or deep-fried donut holes sprinkled with hot honey and cinnamon, are local favorites.", "Santorini is pretty safe. Travelers report feeling comfortable walking around the streets both day and night. Even pickpocketing is few and far between here. In terms of getting around, there are not many sidewalks in Santorini, so be careful when walking the streets as you may need to dodge the occasional wayward, speedy scooter. Use caution when navigating Santorini's beaches as well. Most of if not all of the beaches are composed of small rocks rather than sand, and during the summer, can become too hot for bare feet to touch. Bring with you sandals to wear on the sand or water shoes to avoid burns. You can use tap water for bathing and brushing your teeth, but it's best to stick to bottled water for drinking.", "The best way to get around Santorini is on foot or by bus. You'll see that it's easy to walk around the tiny seaside towns, but the bus is best to get from one town to another. There are KTEL bus routes from Fira (the capital city) to many different destinations around the main island. KTEL also services the Santorini (Thira) Island National Airport (JTR), but you might find it easier to rely on a cab to get you into town. If you're planning to do a little island hopping, you can catch a ferry from Athinios (about 5 miles south of Fira).", "To enter Greece, you must have a passport that will be valid for your stay and for at least six months after. You won't need a visa, however, unless you're planning to stay longer than 90 days. Visit the U.S. State Department's website for more information on entry and exit requirements.", "The neighborhood of Oia is what you often see in photos of Santorini. The neighborhood is filled to the brim with white- and pastel-colored buildings cascading down cliffsides. Considering its popularity and bounty of luxurious hotels, staying here will cost you a pretty penny. "]}