{"name": "Columbus, OH", "description": ["New parks. Expanding museums. A lively state fair. A growing culinary scene. These are just a few reasons Columbus is attracting more and more visitors every year. This affordable Midwest destination may surprise you – it's brimming with culture and sights that appeal to all kinds of travelers. Art lovers can indulge in their passion at the Columbus Museum of Art, while foodies hit the North Market and the city's varied dining establishments. Meanwhile, sports fans can catch a baseball game at Huntington Park or cheer on the Buckeyes football team at Ohio Stadium. Hundreds of thousands of visitors also flock to Columbus in the summertime for its annual – and impressive – state fair, offering concerts, amusement rides, local eats and more.", "Speaking of culture, this capital city is also a college town, as The Ohio State University's nearly 50,000 students fill a sprawling campus north of downtown. The requisite cheap restaurants and rowdy bars hem the campus, but you can also find more upscale establishments in areas like Easton Town Center and the picturesque German Village. (Did you know that Columbus was settled largely by German immigrants in the early 19th century?) Well, like this city's namesake, you should hoist the sails and let your compass help you explore this central Ohio city. After you visit, you just might want to move here. ", "Beware football game days Traffic can be unbearable on Saturdays in the fall as fans flock north to Ohio Stadium (aka The Horseshoe) to see Ohio State take on Big Ten rivals and other opponents. On the flipside, the downtown area will be less crowded for sightseeing.", "Rent a bike The city's grid-like layout makes it easy to navigate to the top things to do and the Scioto Mile's riverfront trails. Using Columbus' bike-share program CoGo is much cheaper than renting a car.", "Enjoy the free fun It costs nothing to explore some of the city's vibrant neighborhoods, markets and parks, including the German Village and North Market.", "Chances are when you hear Columbus, you don't automatically think foodie destination. The city is actually the birthplace of several classic fast-food joints, such as Wendy's and White Castle, however Columbus' burgeoning cuisine scene offers much more than burgers and fries. You'll likely encounter typical Ohio specialties like buckeyes (chocolate peanut butter candies), goetta (a German-American dish of oats and ground pork) and sausages (travelers highly recommend Schmidt's in the German Village).", "When it's time for a meal, Bodega serves up snacks, sandwiches (like its famous grilled cheese) and craft beer (47 varieties), while Northstar Café offers unique items made with organic ingredients; its menu also features several vegan and vegetarian options. Meanwhile, upscale options include the Spanish atmosphere and tapas at Barcelona and the Italian plates and extensive wine lists at Basi Italia and Marcella's. And visitors, locals and experts say you can't leave Columbus without sampling some of Jeni's Splendid Ice Creams. The popular national brand opened its first shop in Columbus in 2002 and dishes out uniquely flavored scoops, such as darkest chocolate, brambleberry crisp and wildberry lavender, in several locations across the city."]}