{"name": "Park City", "description": ["Park City is known for three things: skiing, snowboarding and the Sundance Film Festival. Located 35 miles southeast of Salt Lake City, Park City is easily accessible and home to a wide range of accommodations that attract throngs of vacationers during the winter season. Sandwiched between two premier resorts, Deer Valley and Park City Mountain, this former mining town sits in the shadow of the rugged Wasatch Mountain Range. In 2002, both resorts hosted events during the Winter Olympics, and the Utah Olympic Park, which sits just north of the main street, is still a major training facility for winter athletes, including the United States Ski Team.", "But you don't have to be an Olympian to experience all that Park City has to offer. Stroll down the city's charming Historic Park City area or visit the High West Distillery and Saloon. For family fun, grab your warmest winter gear for an afternoon of snow tubing at Gorgoza Park. And after a long day schussing the slopes (or lounging in the lodge), enjoy the city's bustling après-ski scene.", "The best time to visit Park City is from December to March, if you're a winter sports enthusiast. Ski season generally runs from mid-November through mid-April, depending on the weather and snowfall totals. The winter months are the coldest, with temperatures averaging in the low 30s and dropping to single digits by nightfall. Park City sees an average of 300 to 400 inches of snowfall annually, and the city is the busiest in January, when in addition to skiers, thousands of film fans flock to attend the annual Sundance Film Festival. And while the ski season is the primary draw for this small mountain enclave, local Utah residents often visit for a cool break in the summer months, when Park City temperatures are typically 20 degrees lower than in other parts of the state.", "Book early during peak season Book up to a year in advance for visits during peak season (December through mid-March), especially for holidays and special events like the Sundance Film Festival.", "Rent an appropriate vehicle If you're planning to rent a car during a winter visit, you'll need to reserve a vehicle with four-wheel drive or all-wheel drive during to safely navigate the snow-heavy roads.", "Use free public transportation All Park City buses and the Main Street trolley are free to use and offer routes to major locations in town, as well as to both ski resorts.", "Despite the city's relatively small size, Park City's dining scene packs a punch thanks to its wealth of highly-regarded eateries, many of them serving dishes inspired by locally sourced, regional flavors. Several of the city's top restaurants are located on or near Main Street. Featured on the Food Network's \"Diners, Drive-Ins and Dives,\" the Silver Star Café dishes up what it calls \"roots cuisine\" (essentially, from-scratch regional foods), accompanied by \"roots music\" (acoustic performances). Try duck confit tacos or hearth-fired pizza at lunch and seared elk burgers or osso buco for dinner. Handle specializes in small plates and creative cocktails: try the Rattlesnake, a local creation featuring High West double rye and absinthe, topped with egg white foam decorated with an \"H\" brand. Signature dishes include buffalo cauliflower and smoked trout sausage.", "High West Distillery & Saloon is a Western-inspired gastro-pub with a menu that serves up dishes like High Country pot pie and caribou sausage rolls, accompanied by craft whiskeys, bourbons and ryes. It's also the only distillery in America with ski-in, ski-out access. Robert Redford's restaurant, Zoom, is located in a renovated train station and serves comfort food with a twist: expect entrees like pecan-crusted trout with collard greens, apple-marinated pork loin or a decadent mac and cheese. ", "For something slightly more formal, Riverhorse on Main is a longtime favorite. For the past 16 years, this rustic-chic restaurant has been awarded four stars by Forbes. Riverhorse features fresh seafood like macadamia-crusted halibut, as well as standards like rack of lamb, baby back ribs, steaks and pork chops (don't miss the chocolate soufflé for dessert). Live entertainment and a sizeable outdoor deck for alfresco dining are an added bonus. ", "If you need to grab a bite while you're on the slopes, both major resorts provide an array of options from casual grab-and-go offerings to fine dining and everything in between. ", "The best way to get around Park City is on foot or via free public transportation. The Main Street trolley runs up and down the steep historic street for short jaunts, and bus routes service all major locations in town, as well as both ski resorts. Rideshare services, including Uber and Lyft, are available, and a new UberSki service guarantees you get a driver with all-wheel drive and room to carry skis and snowboards during the winter months. ", "The closest major airport, Salt Lake City International Airport (SLC), is located 35 miles northwest of Park City. You can rent a car for the drive to Park City or take a shuttle van, bus or rideshare service to reach your accommodations."]}