{"name": "Omaha", "description": ["With its placement along the mighty Missouri River, Omaha was once the \"Gateway to the West\" – and an important stop for those continuing to the coast. Now the city's sustenance is large Fortune 500 companies (like Warren Buffett's Berkshire Hathaway) which have planted their headquarters here.", "But Omaha is a city that's still coming into its own, even as it holds to its past. The Durham Museum, for instance, chronicles the city's history while the Union Stockyards of Omaha – once the country's largest – are now a mass of caved-in corrals and pens. Yet the downtown skyline gleams with skyscrapers belonging to international companies – performing arts venues, museums and sculptures. And people are flocking here to be part of it all: Maybe it's time for you to come, too.", "Omahans are very friendly True to the Midwestern hospitality, Omahans welcome visitors to their city and are happy to help you with directions and recommendations.", "Getting around is a breeze Visitors can choose to drive (rental cars are available at the airport), walk or take the Metro, the city's public bus system.", "Take public transportation Omaha's public transportation system, the Metro, offers riders 28 routes throughout the downtown area and costs adults just $1.25 per ride.", "Travel in the winter Omaha is pretty affordable no matter the season, but to save even more on hotel prices, consider visiting during the winter months when lodging rates will be much lower than other seasons.", "Take the airport shuttle Almost all of the downtown Omaha hotels offer free shuttle service to and from the airport, which is located about 3 miles northeast of the downtown area. Simply call your hotel in advance for booking information.", "Omaha is known for its steakhouses, and you'll certainly see your fair share of those throughout the city, but a recent boom in farm-to-table cuisine has taken center stage, with local purveyors providing restaurants with farm-grown produce, meat and homemade cheeses.", "To get a taste of some of the best in the city, head to Kitchen Table, a casual eatery that serves modern-style comfort food (think meatloaf sandwiches, bourbon pulled pork and seared chicken breast). Almost everything here has been made in-house or carted in from a local farm.", "For a celebratory feast, reserve a table at The Grey Plume, a highly acclaimed restaurant known for its top-notch meat dishes and seasonal cuisine, including whole-roasted steelhead trout, wagyu beef and french fries cooked in duck fat.", "Pitch Pizzeria is beloved for its coal-fired crusts and unique toppings, such as shrimp scampi, Thai peanut sauce and spicy Sriracha, among others. For the less adventurous, there are traditional favorites like meatball pizza and margherita pizza. Other menu highlights include the lobster mac n' cheese, chicken fried steak and wings. My Pie, a popular pizza chain with other locations in Arizona and Nevada, is another local and traveler favorite."]}