{"name": "Antigua", "description": ["Historic sites, tasty cuisine and a lively cultural scene can all be found on Antigua. But most often it's the beauty and versatility of the island's 365 beaches that draw travelers from afar. Do you like to party in the sand? Are you looking for safe, shallow waters where your kids can play? Would you be interested in exploring the ocean deep? This paradise in the Leeward Islands has you covered with one beach for every day of the year.", "Save your breaks from the sand and sun for the go-to sights of Antigua; its easygoing sister island, Barbuda, has a more relaxed, less touristy feel. If you venture to Antigua's attractions, you'll find the panoramic view from Shirley Heights or the fascinating history of Nelson’s Dockyard is largely overlooked by the sun worshippers who have set up camp along the shores. That will just make your sightseeing trips all the more pleasant – you'll have fewer people to wrestle with as you uncover some of this island's fascinating history.", "The best time to visit Antigua is from May to November, the island's offseason. Rates are cheapest at this time, and although there is a threat of hurricanes (Antigua sits in a region of the Atlantic known as \"hurricane alley\"), the weather remains in the 80s. You'll encounter less rain between December and April, but rates are more expensive and crowds are abundant.", "Taxi or bust Don't plan on exploring Antigua on foot; the off-resort attractions are quite far apart. If you don't have your own set of wheels, take a cab instead, but make sure to agree on a price in advance.", "Consider a day trip Most visitors stick to Antigua, but Barbuda is just a 90-minute ferry ride from Antigua and makes for a great day trip if you need an escape from the tourist crowds.", "Book in the offseason Hotel rates drop significantly between May and November. However, there is also a threat of hurricanes, so travel insurance or refundable bookings may be a good idea.", "Rent a car If you plan on staying for more than a few days, this could be a better investment than taking numerous taxis. However, you'll be required to obtain an Antiguan driving permit, which costs $20.", "Pack the bug spray Mosquitoes are a notorious pain during the wet season, so if you'll be visiting between July and November, don't forget to pack your bug spray.", "Antiguan culture is heavily influenced by African tradition and British colonialism. Many of Antigua's residents are of African descent, as their ancestors were forced to come to Antigua at the hand of the British slave trade. The effects of British colonialism can also be seen in the presence of Christianity, specifically the Anglican religion, on the island as well as through the popularity of historically British sports like cricket. To learn more about the history and effects of British colonialism on the island, visit the historic sites within Nelson’s Dockyard, specifically the Dow's Hill Interpretation Centre.", "There are many uniquely Antiguan traditions that make this island nation special. Calypso music, which was originally created by enslaved people as a means of communication, can be heard all around the island. Not to mention, the national dish, \"fungee\" (the island's take on polenta or grits), wouldn't be served anywhere else in the Caribbean. The country's massive Carnival event – which is celebrated annually from the end of July to the beginning of August – commemorates the emancipation of Antiguan slaves, and offers visitors a crash course in the complexity and diversity of Antiguan culture.", "When it comes to typical island customs, like tipping for service, a bit of extra generosity is always accepted. Many restaurants and hotels add a 10% service charge to the bill, but if they don't, be sure to leave a 10% or 12% tip. Use those guidelines to tip bartenders and taxi drivers as well. The currency of Antigua and Barbuda is the East Caribbean dollar (XCD) but United States dollars are widely accepted. One U.S. dollar is equal to about 2.70 East Caribbean dollars.", "Similar to neighboring Caribbean destinations, Antigua offers a wide variety of cuisine styles and restaurant settings, ranging from beachfront bars to fine dining eateries found at most of the island's top resorts. Restaurants on Antigua offer an eclectic mix of West Indian, Italian, French, Chinese and Swiss-German dishes. No matter where you decide to dine, you'll want to look for a few distinctly Antiguan foods on the menu.", "Conch is a popular shellfish ingredient found in chowders, curries, ceviches and fritters. Since it’s sourced right from the waters surrounding Antigua, you can bet the conch here is fresh and best enjoyed as a ceviche. Ducana, which is typically served as a side dish, has the appearance of a tamale since it's wrapped in a banana leaf. The dish is made from grated sweet potatoes and coconuts and seasoned with a variety of spices before being steamed. Fungee, Antigua's national dish, is similar to polenta or grits in that it's made from combining cornmeal and okra paste into balls. It's usually served with stews or meats and frequently served alongside saltfish, a salt-cured and flaked white fish.", "And, of course, no visit to Antigua would be complete with a sample of its rum. Popular rum punch doesn't usually include high-quality rums as these are traditionally enjoyed straight, so if you're hoping to indulge in the island's most famous variety, ask for the Cavalier Rum or English Harbour Rum from Antigua Distillery Limited.", "Crime is relatively low on Antigua, but robberies targeting visitors do occur. Be sure to stay alert and exercise common sense. Your valuables should be kept in the hotel safe, not resting unattended on a beach blanket.", "And speaking of the beach, take it easy on your first day on the island. The Caribbean sun can take it out of you, especially in summer, and there are not many beaches with lifeguards to assist you should you feel unwell. Drink plenty of water while outside, wear a hat and apply sunscreen at regular intervals.", "The best way to get around Antigua is by car or taxi. Having a car can save you money, especially on longer visits, but the island can be difficult to navigate due to bumpy dirt roads and hilly areas that flood easily. A handful of rental agencies, including Budget, Avis and Hertz, are stationed in the arrival hall of Antigua's V.C. Bird International Airport (ANU), located on the northern part of the island just outside of the village of Osbourn. Travel to neighboring islands by air on LIAT charter planes or by sea aboard a cruise or a ferry, such as the Barbuda Express and Island Escape", "The taxi ride from the airport to your hotel will cost you at least $25. The fares aren’t managed by the government and vary depending on the location of your resort and the company you ride with, as well as the number of passengers in your group (you’ll pay more for a single passenger than you will for a group of three or more).", "A valid passport is required for citizens of the United States traveling in and out of Antigua. Immigration officials might ask for proof of accommodations while in Antigua or Barbuda, as well as proof of a return trip and proof of commensurate funds for the trip. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}