{"name": "Mexico City", "description": ["Mexico's capital is one of the liveliest and largest cities in the world, with a renowned arts and culture scene (an entire district was designated a UNESCO World Heritage Site) and some of the best cuisine in the Western Hemisphere. Even better, Mexico City is affordable – and safer than you might expect of a city its size. It promises visitors an unforgettable stay, perfect for the frugal, culture-loving traveler who feels at home in a large, crowded place. If you want the full experience, some say you should spend at least a week in the city so that you'll see most of the historic and popular sights. Even after a week, you'll find plenty more to explore. In short, it's best to plan extensively before diving in.", "Founded in 1325 as Tenochtitlan, the city was colonized by the Spanish in 1521 and later dubbed \"Mexico.\" Today, at nearly 500 years old, its pre-colonial history is alive throughout much of the modern-day capital. The city is overflowing with opportunities to study the country's rich and conflicted past. But it's also one of the most densely populated cities in the world, and although it does grapple with common urban problems like crime and pollution, many neighborhoods – including Condesa and Polanco – are as safe as any city in the United States or Europe. To experience this bustling metropolis with the help of a local, consider signing up for one of the best Mexico City tours.", "The best time to visit Mexico City is between March and May, even though the streets are pretty crowded this time of year. Your trade-off is beautiful weather, especially considering the city's winters can be chilly and the summers can be rainy. You'll want to prepare yourself for the high elevation – Mexico City sits about 7,382 feet above sea level – by drinking plenty of water, slathering on sunscreen and taking it easy (and limiting alcohol intake) your first few days. Another thing to keep in mind: Mexico City's air pollution is notoriously poor, so on days when the pollution is the worst you'll likely want to travel with a mask and relegate yourself to indoor activities.", "You're high in the sky The city is more than 7,000 feet above sea level, so you can expect a tougher time breathing, and maybe sleeping, for the first few days. Try not to exert yourself in the thin air and limit the amount of alcohol you consume. Also drink plenty of water.", "And speaking of water You've probably heard it before, but let us reiterate, you should never drink from the tap in Mexico. Most hotels have lots of bottled water on hand.", "You're not at the beach Many people associate Mexico with the balmy temperatures of the coast – but Mexico City has a temperate climate. Pack some long sleeves and anticipate chilly evenings, even in summer.", "Enlist the help of a local Whether you want help navigating the local food scene or are hoping to plan a day trip to Teotihuacán, a guided tour can help you make the most of your time in Mexico City.", "Stay in the city center Also known as the Centro Histórico, this part of town is close to the key sights (so you'll spend even less on transportation), and it has the lowest hotel rates.", "Mexico has a vast and varied history that still impacts its culture today. The culture blends native traditions and beliefs of the Mesoamerican natives (largely Aztec in the capital) with customs brought by the Spaniards, plus a great sense of pride brought by Mexican independence in 1810 and the Mexican Revolution in the early 20th century. ", "Spanish is the official language of Mexico and is universally spoken in Mexico City and throughout the country. But Mexico has a still-vibrant indigenous tradition, and more than 100 Native American languages remain alive in the country. One of the most popular indigenous languages in Mexico is Nahuatl, which is spoken by about 1.5 million people in Mexico. Because the city is a business and tourist hub, it caters to travelers who speak a variety of languages – including English – meaning you should have little trouble communicating.  ", "Typically in Mexico, women greet each other with a pat on the arm or shoulder, while men shake hands. Late arrivals are customary – and even considered polite – at most gatherings. Keep in mind that it's not advised to drink the tap water, but most establishments have a large supply of bottled water. Also, if you encounter the word \"gringo\" (defined by a person, especially an American, who is not Hispanic or Latino), don't be offended. It's simply the only word in Spanish that describes a white person. ", "One thing you'll find an abundance of in Mexico City is comida (food). After all, there are almost 9 million people to feed in the city. Chances are you're familiar with some Mexican staples, such as tacos, quesadillas and tamales. But there's more to Mexico City's culinary culture. ", "You'll find that lunch (or almuerzo) is typically the largest meal of the day, and yours may include cerveza (beer) or tequila. Dinner doesn't usually take place until later at night and consists of lighter dishes. Street food is ingrained in the culture here, dating back to pre-Hispanic times. You'll likely find anything you could want at these street stalls, and even some specialties like chapulines (roasted grasshoppers). Several of the best tours in Mexico City are specificially designed for discerning foodies in need of a little guidance navigating the city's colorful markets.", "Some foods that are unique to the Mexico City area are tacos al pastor – which includes marinated pork that's been cooked on a rotisserie (called a trompo) and thinly sliced off before being served in tortillas with onion and pineapple. Another Mexico City original is huarache (fried corn tortillas topped with meat, cheese, beans, potatoes, cream and salsa). Is your mouth watering yet? ", "Establishments range from hole-in-the-wall mezcal bars to fine dining restaurants and everything in between. One of the best foodie neighborhoods is Condesa, which offers popular restaurants and booming nightlife. But you could stumble upon amazing flavors all over the city. ", "While some travelers fear that Mexico City is too dangerous; the city has managed to keep its distance from the drug war that has affected many other parts of the country. Still, common sense and wise precautions should be used to ensure a safe vacation. To avoid robberies in cabs, call for a \"sitio\" or \"turismo\" car from your hotel or hostel. These cars are registered with the government and remain very safe and affordable options for travel around the city. Some do suggest you steer clear of the yellow or green libre cabs.", "Avoid carrying large amounts of money or valuables while in the city, due to high incidences of pickpocketing. Although the U.S. State Department warns citizens to exercise caution when traveling to certain parts of Mexico, it does not caution visitors against traveling to Mexico City. However, it is advisable to avoid any political demonstrations that are frequent in the capital city. ", "The best way to get around Mexico City is via Uber or a taxi. The metro is another option. Not only is it fairly clean and quick, but you can ride for approximately $0.25. Plus, most popular tourist attractions are easily accessible by train. Several different types of buses motor through the main square (el Zócalo) and its busiest streets – they are also an affordable option.", "Taxis are slightly more expensive, but they are a hassle-free means of getting to the city center from the Benito Juárez International Airport (MEX), which is about 6 miles east of the Centro Histórico. Uber is a safe and more affordable way to navigate the city. Driving yourself is not a great idea – either to and from the airport or around town.", "To travel to Mexico, U.S. residents require a valid United States passport. You must also fill out a tourist card before arrival. Tourist cards – and the accompanying fee – are usually provided by your airline. For more information entry and exit requirements, visit the U.S. State Department's site."]}