{"description": ["The moment you enter Historic Annapolis, life seems to slow. It's as if history is yanking at your heels and hindering your pace, so you might pause and absorb the past. Indeed, Queen Anne lent her name to the city way back at the start of the 18th century, and it's retained its courtly status for more than 300 years, attracting visitors to its Colonial architecture and cobblestone walks.", "Once known as the \"Athens of America,\" Annapolis has always been a city enriched in its culture and history. From the Maryland State House to the Frederick Douglass Museum and Cultural Center, its intimate port city setting welcomes more than 4 million visitors a year.", "The best time to visit Annapolis is in the spring when the city is redolent with blossoms and the sailing season is just beginning. But each part of the year has its charms. In summertime, you'll find the harbor teeming with boats and restaurant patios filled with diners. In the fall, the changing trees against the historic homes are postcard-worthy. And in the winter, even when a chilling cold settles in the city, Annapolis still appeals with its glowing storefronts and cozy restaurants.", "Take to the water Annapolis is sailboat central. Take a cruise with a sailing tour operator or at the very least, book a boat tour of the Annapolis Harbor.", "Learn the lingo \"Mid\" is short for the \"midshipmen\" over at the U.S. Naval Academy. \"Johnnie\" is short for the students that are enrolled at the liberal arts St. John's College.", "Eat like a native Don't leave without sampling some Maryland blue crab. There's an art to selecting the best steamed crabs, but when in doubt, pick a heavy crab – this signifies a lot of muscle.", "Book a hotel in Parole, Maryland The bed-and-breakfasts in downtown Annapolis are pretty high in price; you can save some cash by booking accommodations less than 4 miles west in the nearby town of Parole, Maryland.", "Owing to its idyllic perch on the harbor, you might guess that dining in Annapolis would be seafood-heavy. And you'd be right. Steamed crabs, in particular, are one of the city's specialties, and you can try them at any number of restaurants. Mike's Crab House and Cantler's are among some of the old favorites. For ice cream, the Annapolis Ice Cream Company is a popular spot. If you're looking for a wine bar, you might try the well-reviewed Vin 909 Winecafe. Chick & Ruth's Delly is legendary, namely for their \"colossal challenges,\" which involve downing a 6-pound milkshake or munching your way through a 3-pound sandwich. ", "The best way to get around Annapolis is by car. Although Historic Annapolis is small and best explored on foot, the greater Annapolis area requires wheels to see. You can also call a taxi. And although the city does offer bus service, it's really not a convenient or efficient way to explore the city.", "The closest major airport is Baltimore/Washington International Thurgood Marshall Airport (BWI) in Baltimore. To traverse the 20-some miles south to downtown Annapolis, you can take a taxi or hire a rental car. The Airport Shuttle also offers service between BWI and Annapolis."]}