{"name": "Jamaica", "description": ["To many, Jamaica is the heart of the Caribbean. The birthplace of reggae music, the Rastafari movement and all-inclusive resorts (at least as we know them today, the concept originated with Club Med in Europe), Jamaica symbolizes many of the things most loved and, perhaps, most misunderstood about the region. A simple remedy to clear the confusion? Come to the land of sugar cane, coffee and limestone, and form your own opinion. Your new ideas are bound to be swathed in cream-colored beaches, bordered by rugged Blue Mountains and anchored in foamy waterfalls. ", "Most who travel here don't leave the comforts of their all-inclusive resort; those who do typically don't venture too far outside their immediate area. As the third-largest island of the Caribbean, Jamaica is hard to cover in one trip. Rather, it's best to choose your activities and vacation priorities, then make your hotel plans accordingly. Of the three main tourist pockets on the island, westernmost Negril is popular for its beaches and upscale accommodations; northwestern Montego Bay is well-liked by golfers; and Ocho Rios in the northeast appeals most to adventurous types who might be interested in climbing waterfalls like Dunn's River. Some visitors choose the eastern area of Port Antonio to try top-notch surfing at Boston Beach, hiking amongst the Blue Mountains and rafting on the Rio Grande River. If you want to explore areas of the island not often seen by tourists, sign up for one of the best tours in Jamaica.", "The best time to visit Jamaica is November to mid-December. That's when the island's already beautiful weather (ranging from mid-70s to the high 80s all year-round) is the most pleasant and the hotel and flight deals are the easiest to find. Rates are also cheap during the summer, but you'll risk the wrath of hurricane season (which runs from June through November). January to March is the peak travel season to the island – room rates can spike to more than $700 per night at some hotels.", "It's the home of reggae From ska, rock steady and dancehall to anything by Bob Marley, you'll hear a lot of great music wafting through hotel lobbies and vibrating poolside.", "It's the home of jerk seasoning This spicy-smoky rub tastes good on many types of meat, fish and even tofu. Try it for yourself and then take a few jars home.", "Learn to haggle Bargaining for a better price is expected and encouraged in many souvenir shops. When visiting the craft vendors or taking a cab ride, don't accept the first amount quoted to you.", "Pay for it all upfront Jamaica is the nerve center of the all-inclusive. Many of the resorts include more than just food and drinks in their packages (think: water sports equipment and gratuities for resort employees).", "Jamaican culture has often been lumped together with Caribbean culture – though it is true that the music, food and phrases from Jamaican culture have pervaded other nearby islands. But more so than other Caribbean islands, Jamaica's strong ties to its African history play a large role in its modern culture. ", "Jamaicans speak English, but use a number of idioms that may not easily translate for tourists. In fact, many have been adopted from the Rastafarian religion and culture. For example, when a Jamaican says, \"all fruits ripe\" it indicates that all is well. ", "Jamaica's currency is the Jamaican dollar; roughly one U.S. dollar is equal to about 151 Jamaican dollars. You can pay in U.S. dollars at most of the island's resorts, especially those that are all-inclusive. When dining out, servers in restaurants usually expect a tip equal to 10% to 15% of the bill; if the service charge is already included, travelers can add an additional 3% to 5% based on good service. Note that at most all-inclusive resorts, tipping is included in the cost. Don't worry about carrying cash with you at all times; most hotels and restaurants accept credit cards. ", "Jamaica is known for unique cuisine that fuses flavors and ingredients from different cultures. Seafood is a staple, and no Jamaican vacation is complete without sampling some of the island's fresh produce or main courses enhanced with some zesty jerk seasoning. Where to dine largely depends on where you're staying, but many area restaurants serve traditional dishes like ackee (the island's national fruit) and saltfish, callaloo (a stew-like soup made with callaloo leafy greens) or fried plantains. To try some spicy jerk seasoning, look for the nearest roadside stand and order a jerk chicken skewer or jerk pork with rice and peas. ", "Although many travelers choose to dine from the all-inclusive options at their hotels, Jamaica has hundreds of restaurants – some of which are worth venturing off the beaten path for. The beachside Blue Mahoe Restaurant in Negril, attached to Ocean Cliff Hotel Negril, earns high marks among travelers for its views (especially at sunset) and diverse menu. Scotchies is an affordable restaurant known for its delicious, local fare in Montego Bay. Meanwhile, Miss T's Kitchen in Ocho Rios serves up a colorful experience and a menu of healthy plates.", "Keep in mind that some parts of Jamaica are safer than others. Exercise caution when moving around at night, avoid traveling in buses and stay in groups when at all possible. Petty theft has been reported in the past, so make sure to keep your valuables near you at all times. According to the U.S. State Department, violent crime can occur too, even at all-inclusive resorts. Areas of Kingston, Montego Bay and Spanish Town are particularly prone to violence. Visit the state department's website for more details. ", "The best way to get around Jamaica is by taxi, whether you're coming from one of the airports – Montego Bay's Sangster International Airport (MBJ) is the most accessible to the tourist areas – or making your way around town. Renting a car is also an option, but driving on the left side of the road can be confusing, road signs are unhelpful, drivers can be aggressive and potholes are rampant. Many cruise lines, including Carnival, Celebrity and Holland America, make stops in Jamaica. They usually head for Montego Bay on the northwestern side or Ocho Rios in the northeast.", "All United States citizens will need a passport for entry into and exit out of Jamaica. And keep in mind that customs officials may ask you to provide evidence of sufficient funds for your stay plus evidence of a return trip to the U.S. or an onward journey. A departure tax is generally included in the cost of your airfare; you won't be charged an additional fee upon leaving Jamaica. For more information on entry and exit requirements, visit the U.S. State Department's website."]}