{"name": "Marseille", "description": ["Founded 2,600 years ago as a port city, Marseille – after some years in decline – remains a dazzling metropolis on the Mediterranean, especially after its turn as the European Capital of Culture in 2013. With some of its rough edges polished and even a smattering of new museums and a handful of Michelin-starred restaurants, France's second-largest city is making a comeback. ", "Its long, vibrant history and its hilly landscape of gritty streets and whitewashed buildings that tumble to the yacht-filled waters also add to its allure, as is the feeling that Marseille is a place where it seems possible to stumble on something secret, something all your own – something not listed in the travel books. But you'd better hurry: The rest of the world seems to be catching on.", "The best time to visit Marseille is from September to November, when tourists visiting during the peak season of May to August have returned home, freeing up the beaches, attractions and accommodations. The months that run from December to March are low season, characterized by average temps in the 40s and an emptied-out city. April is another nice time of year, where travelers may see discounted rates on flights and rooms, along with pleasant weather and relatively thin crowds. ", "In 2013, Marseille was named the European Capital of Culture – and several new museums, including MuCEM, opened. What's more, the Old Port was redesigned and pedestrianized, and a concert venue and a shopping center were added with an aim of turning around a city that had, in parts, drifted into decline and crime. The world seems to be taking notice at a revamped Marseille, which still retains its old-world charms and some of the grit of recent years, but is nonetheless safer and more cosmopolitan.", "The official language in Marseille is French, but most professionals in the tourism industry will speak at least a little English. However, learning a few basic phrases isn't a bad idea: Bonjour means \"hello;\" au revoir means \"goodbye;\" sil vous plait means \"please,\" merci means \"thank you.\" ", "As is the case throughout France, the euro is the official currency in Marseille. Visitors can exchange their dollars for euros at an exchange booth at the airport or at various kiosks throughout the city. Since the exchange rate tends to fluctuate, travelers should check the current rate before exchanging their currency. Keep in mind that bills at restaurants and bars will usually include a service charge; it's customary to round out the bill with a small tip. It's also customary to tip hotel staff, who carry your bags or clean your rooms, a euro or two. ", "Marseille's dining scene is heavily influenced by its Mediterranean location, meaning fish, oils, vegetables and herbs feature prominently in many restaurant menus. Marseille is known for its bouillabaisse, a fish stew made with ingredients like rascasse, sea robin and hake, and served with a deep red orange-colored sauce called rouille, which is a mayonnaise flavored with saffron and peppers. That said, there are a variety of ways to make the traditional stew – and no two chefs make it alike. Restaurants like Miramar offer cooking classes for those interested in learning the art of bouillabaisse. But if you'd rather let someone else do the cooking, Restaurant Chez Michel is praised by recent visitors for its \"authentic\" bouillabaisse. ", "Michelin-starred L'Epuisette, located on the edge of Vieux Port, regularly earns high marks from travelers for its flavorful tasting menus and picturesque location in a fishing village called Vallon des Auffes. According to recent diners, L'Epuisette is a prime spot for celebrating special occasions thanks to the impeccable service. Another Vieux Port spot with inventive dishes (and a high price tag) is Une Table Au Sud, which is helmed by Ludovic Turac – a former competitor on the French edition of \"Top Chef.\" ", "Along with its bouillabaisse, navettes (boat-shaped sweet cookies flavored with citrus) are another Marseille specialty. You can find them at places like Le Four des Navettes or Navettes des Accoules. For other sweet treats, bakeries like Au Petit Amandier or Boulangerie La Banette du Pharo are also popular among recent visitors. ", "The best way to get around Marseille is on foot, since most of the neighborhoods are pedestrian-friendly and easy to navigate. However, the metro and tram lines are fast, affordable and efficient ways of getting around, too. Driving around the city, however, is not recommended, since parking can be a hassle. Taxis (or Uber) are another option, but fares can add up quickly. The city's bike-sharing program is a transportation option as well. ", "To reach Marseille, visitors usually fly into the Marseille-Provence Airport (MRS), located less than 20 miles northwest of the city. To traverse the distance between the airport and Marseille, visitors can hop aboard a shuttle bus, which costs 8.30 euros (about $10) for a one-way fare, or rent a car. Taxis from the airport to the city center cost 50 euros (about $60) during the day and 60 euros (approximately $72) at night. "]}