{"description": ["Once pegged as a blue-collar town with a high crime rate and a gritty underbelly, dramatized by pop culture portrayals in series like \"The Wire\" and \"Serial,\" Baltimore today has a new sheen, transforming itself into a vibrant, culture-rich East Coast mainstay. And though it clings to its working-class roots, Baltimore – or \"Balmer\" as some residents say – also boasts contemporary museums, a sophisticated dining scene and a reimagined Inner Harbor that's luring art-loving types, outdoor enthusiasts and history buffs alike. This revitalized Charm City offers Yankee-Southern fusion architecture and a rich and eclectic culture, jam-packed with trendy art galleries, lively theaters and world-class collections at the Walters Art Museum and the Baltimore Museum of Art.", "You can opt for a traditional Baltimore experience, filled with forays to historical sites like Fort McHenry National Monument, leisurely strolls along the Inner Harbor and Federal Hill Park and, of course, freshly caught blue crabs steamed and seasoned with a heavy dose of Old Bay. Or, if you've traveled to Charm City before, experience Baltimore's literary side with a trip to the Edgar Allan Poe House and Museum before blending in with other baseball aficionados as you cheer on the Orioles at Camden Yards. And there's no way better to get a sense of Baltimore's quirky culture than at HonFest in June, when swarms of ladies sport leopard prints and sixties-era beehive hairstyles to support Baltimore's hard-working women. As the sun goes down, take back a pint of locally crafted beer at one of the up-and-coming gastropubs and nightlife venues scattering Fell's Point or Federal Hill. With its laid-back vibes, plentiful historical and cultural attractions and picturesque setting along the Chesapeake Bay, there's a good chance Baltimore will charm you. ", "The best time to visit Baltimore is from June to August, but you'll have to book early. While summer brings heavy crowds, peak season hotel rates and soaring temperatures, the city overflows with unique events and festivities. Spring and fall usher in milder temperatures, but the winter months can get quite chilly, so be sure to arm yourself with plenty of layers if you plan to visit Cham City at this time of year. And don't forget your boots – precipitation is common year-round.", "Try the crabs Crab soup, steamed crabs, crab cakes – Baltimore is in love with its signature crustacean in any edible form. Dust on some Old Bay seasoning and dig in.", "Welcome to Balmer, Hon The \"Hon\" culture thrives in Hampden. You'll find Beehive hairdos, brightly colored dresses and distinct accents flourishing in this vibrant neighborhood.", "Lights! Camera! Action! The city has been displayed on the big screen. In recent years the city's been featured in the popular HBO show \"The Wire,\" the Netflix series \"House of Cards\" and the motion picture and musical \"Hairspray.\" Take a driving tour around East Baltimore and Mount Vernon and to see a few film locations.", "Locals can set sail Baltimore's cruise port is home to Carnival and Royal Caribbean ships that typically sail to Florida and the islands of the Caribbean. Explore cruises from Baltimore »", "Visit free attractions Baltimore boasts exceptional art collections and trails. You can check out Renaissance paintings at The Walters Art Museum or take a guided tour along the Inner Harbor, for free. Consult the Baltimore Visitor Center to find the city's best daily giveaways.", "Purchase a harbor pass If you plan on visiting multiple Baltimore attractions and museums that charge entrance fees, invest in this pass to save nearly 30% on admission prices.", "The Baltimore dining scene is as varied as any other big city, however, due to its close proximity to the water, visitors tend to gravitate toward the seafood here first. The most popular seafood dish by and far is Maryland crab. This famous crab is the blue crab, which resides in the Chesapeake Bay. The blue crab is such a hot commodity that 50% of the country's supply of blue crab comes from Maryland. If your main foodie mission in Baltimore is to grub down on these tasty crustaceans, make sure to come during the season (April through November) and seek out a restaurant that has True Blue certification, a distinction given to restaurants that use more than 75% of local crabmeat. Since restaurants in Maryland aren't legally required to identify the source of their crabmeat, you could easily walk into a seafood restaurant and end up eating blue crab from the gulf coast, or any crab from anywhere in the world. Popular seafood restaurants with True Blue certification include Gertrude's Chesapeake Kitchen and Phillips Seafood Restaurant.", "While crab is certainly a star attraction in Baltimore's dining scene, there's more to the city's foodie landscape than seafood. In order to properly soak up Baltimore's culture as a whole, you'd be remiss not to grub down at one or more of the city's many Black-owned eateries. African Americans make up more than 60% of the city's population and as such, have shaped Baltimore to be what it is today. One of the most lauded Black-owned restaurants in Baltimore is Ida B's Table, which serves modern soul food. There's also Land of Kush, which has been praised by locals for its delectable vegan dishes. Ekiben serves Asian fusion fare and boasts two locations in Baltimore while Union Craft Brewing is a leader in Baltimore's brewery scene. For a cozy cafe experience, schedule a detour for Dovecote Café or Water for Chocolate. For baked goods, hit up Crust by Mack, located in the popular Whitehall Market, which serves everything from cookies to crab pies. ", "Other standout restaurants in the area include Clavel, a taqueria and mezcaleria that serves top-notch cocktails and makes its tortillas by hand. La Cuchara stands out for serving Basque cuisine (a province in northern Spain) while Woodberry Kitchen will charm those who appreciate farm-to-table fare. The fine dining venue Charleston is known for combining French and low country cuisine cultures together. For a casual setting that doesn't skimp on quality, hit up comfort food haven The Food Market. Wherever you choose to eat, make sure to save dessert for Sacre Sucre, an impressive pastry shop that could easily stand tall next to a proper Parisian patisserie.  Or, you could take the easy route and get all of your courses in one go thanks to Baltimore's several food markets, including Broadway Market, Lexington Market (the oldest continually running market in the country) and Mount Vernon Marketplace. ", "Over the years, Baltimore has carried a less-than-stellar reputation for safety, perpetuated by crime-heavy HBO series \"The Wire.\" Although some parts of town might live up to those portrayals, well-traversed tourist areas are generally safe for visitors. While tourists will most likely not encounter any kind of violent crime, including drug-related activity, especially in busy areas like the Inner Harbor, Mount Vernon, Fells Point and Federal Hill, you should still use common sense and stay vigilant of your surroundings. Like any large city, Baltimore has its fair share of robberies and muggings. Stay prepared by stowing away your valuables and sticking to busy streets, especially at night. If you're unsure of where you are going, take a cab or drive yourself, since neighborhoods can quickly change from block to block.", "The best way to get around in Baltimore is via car, whether it be your own or a rental; most visitors use the agencies at the Baltimore-Washington International Thurgood Marshall Airport (BWI). A range of taxis and shuttles are also available to drive you the 10 miles north from the airport to the city's downtown area. Once you get there, you can use the public transit systems, run by the Maryland Transit Administration (MTA), which offer a convenient and cost-effective way to navigate the city. The MTA offers bus, Metro Subway, Light Rail and MARC train services, along with the Charm City Circulator, a free bus service introduced in 2010 that connects visitors to a variety of popular attractions."]}