{"name": "Cancun", "description": ["Cancún is nothing if not resilient. Consider the debilitating effects Hurricane Wilma had on the region in 2005 – drowned shores, destroyed storefronts and capsized boats. But now, this skinny \"7\"-shaped barrier island in southeastern Mexico is once again a go-to spot for beaches, golfing and nightlife. Cancún also remains one of the most affordable vacation destinations in the Western Hemisphere, especially if you book a cruise. ", "So what's there to do here? Cancún's beaches are spectacular spots to try some Jet Skiing and parasailing. If you want to explore beyond Cancun, the city's top guided tours offer daytrips to idyllic spots like Isla Mujeres and Isla Contoy. And there's also a host of after-hours activities; be sure to check out the acrobatic dance performances at the Coco Bongo Cancún. This area is also close to one of the most recognizable sites of Mexico – don't miss out on the chance to behold Chichén Itzá, a large Mayan archaeological site that is one of the new Seven Wonders of the World.", "The best time to visit Cancún is from December to April during the peak season. Even though the crowds are heavier, you'll experience near-perfect weather and find some of the cheapest flight and room rates for a winter getaway at the beach. Just try to avoid traveling from mid-March to early April – that's when spring breakers descend on the Yucatán's shores. There are also significant discounts in late spring, summer and fall, but Cancún summers are sweltering and the fall months are prone to storms.", "Don't stop to chitchat Cancún is crawling with timeshare representatives. They'll try to grab your attention in the airport, in the hotel lobbies and around the shopping areas. If you're not interested, give a polite but firm, \"No, thank you,\" and keep moving.", "Exchange your dollars for pesos While most businesses accept U.S. dollars and credit cards, you will want to have some pesos in your pocket if you're planning to ride the bus or shop at the local markets.", "Go all-inclusive Cancún is heavily populated with all-inclusive resorts. Some of the best packages include all your meals, alcoholic and nonalcoholic drinks, gym access and even gratuity.", "Avoid overpriced souvenirs Vendors will be hawking souvenirs along the beaches and outside historical sites. If you don't want to overpay, politely decline and purchase your mementos elsewhere.", "Cancún's popularity with college-age travelers lends to a more casual dress code, even in restaurants. You should cover up your swimsuit when away from the pool or beach, but you will find many people walking along the Boulevard Kukulcán in beach-type attire. Unlike other destinations, Cancún's nighttime establishments welcome a more relaxed atmosphere and appearance. ", "The official language here is Spanish, but because Cancún is such a popular tourist spot for English speakers, you should have no trouble finding someone who speaks English, especially within the tourism and hospitality industries.", "Cancún's official currency is the Mexican peso. Since the Mexican peso to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. American dollars are, however, widely accepted in Cancún.", "Cancún has almost as many restaurants as hotels, so travelers should have no problem finding some tasty eats. If you booked an all-inclusive, your meals and drinks will most likely be bundled in the room rate, leaving you little motivation to eat off your resort grounds. But if you tire of the endless buffet, you'll find a bevy of restaurants worth sampling. ", "If it's seafood you're after, you can't go wrong with a lobster meal at Lorenzillo's or the surf and turf at Puerto Madero – both regarded as excellent spots for a special occasion meal. Diners and critics are equally impressed with the \"techno-emotional\" cuisine offered at Benazuza, an adults-only restaurant serving small, colorful plates in The Pyramid at Grand Oasis hotel. For a splurge-worthy meal the whole family will enjoy, locals rave about Bovino's Churrascaria, a Brazilian steakhouse in downtown Cancun. If it's just you and your sweetheart and you're in the mood for a romantic atmosphere, locals and visitors recommend the rustic La Fonda del Zancudo for traditional Mexican or La Habichuela Centro for a menu Mexican-Caribbean fusion plates. ", "Cancún has largely avoided the drug violence that has afflicted much of Mexico. But while crime against tourists is especially low, the U.S. State Department advises constant vigilance. Your most important safety concern in Cancún is likely to be in the water. Beware of rough surf and only swim when supervised by a lifeguard. Green beach flags signify safe waters while yellow and red flags advise increasing caution. If you see a black flag, swimming is prohibited. Drinking water can also present potential health concerns. Water in the Hotel Zone (especially at your resort) is generally safe to drink in all forms since it has been purified. Allay any concerns by calling your resort ahead of your trip to ensure the hotel uses a water purification system (most do). The farther you venture outside the Hotel Zone, the more cautious you should be about the drinking water. If you're apprehensive, stick to bottled water to avoid an upset stomach from contaminated water.", "The best way to get around Cancún is the bus, which stops frequently along Boulevard Kukulcán and within the downtown area. One-way fares are a steal at 12 Mexican pesos (or around 60 cents), making a ride in a Cancún taxi seem exorbitant. However, you should splurge for a cab to get to and from the Cancún International Airport (CUN), located less than 15 miles from the Hotel Zone and 10 miles from downtown. In fact, you can book your taxi online and save by making advance reservations. There are car rental kiosks in the airport, but driving yourself isn't recommended – the area's narrow roads and speedy traffic patterns can be intimidating.", "You'll need a passport to visit Mexico, plus a tourism card (or FMM) that can be issued at any Mexican consulate, border-crossing point, Mexican tourism office or directly from your airline. FMMs are usually issued free of charge upon arrival (and if not, the price is absorbed into the cost of your plane ticket). Be sure to hold onto this card for the duration of your trip, as you will need to present it upon departing the country. It's also a good idea to leave your passport and FMM in a secure location and carry a photocopy of both documents with you at all times. For additional information, visit the U.S. State Department's website."]}