{"name": "Aruba", "description": ["Believe it or not, the Spanish colonists who settled in Aruba and her sister islands of Bonaire and Curaçao in 1513 nicknamed them the \"Islas Inútiles\" or Useless Islands. They couldn't have been more wrong. Centuries later, this southern Caribbean cluster is using an arid climate and minimal rainfall in their favor. Aruba in particular lures tourists with its blindingly white beaches, modern infrastructure and welcoming, multilingual locals. With its extensive underwater visibility, this island is a preferred getaway for divers looking to explore shipwrecks, too. In fact, the S.S. Antilla is the largest wreck in the Caribbean. And better yet, it sits in very shallow waters so snorkelers can also view the surreal underwater scene. Year-round tropical weather is also a draw, and the food, arts and culture scene has evolved to meet the 21st century in a forward-thinking and cosmopolitan style.", "Aruba's accommodation choices have also grown to meet today's discerning traveler's needs. On offer is an eclectic array of modern hotels and resorts, boutique getaways and all-inclusives to suit every style and budget. There's even new off-radar stays like overwater bungalows and desert glamping in an Airstream. And though Aruba is the smallest of the ABC islands, it has historically been the most visited by North American tourists and has the highest repeat visitor rate in the Caribbean.", "The best time to visit Aruba is from April to August – a huge window of time when the island's high prices take a holiday. However, there's no bad time to visit Aruba; the temperature remains basically the same – balmy and sunny – year-round, with an average temperature of 82 degrees Farenheit. If you're looking for a bargain, summer and \"shoulder seasons\" – late spring and early fall – is when you'll get the best deals on hotels.", "Beware the high winds Aruba's trade winds blow at around 20 knots year-round. They're a refreshing respite from the tropical sun, but they can make it seem cooler than it really is, leaving visitors prone to sunburn. Apply sunscreen regularly and reapply after being in the water.", "Beware the new eco-regulations Within the last few years, the island has passed many important environmental laws, including outlawing plastic bags and single-use plastics, and requiring that all sunscreen be reef-safe, which means it does not contain the harsh chemical oxybenzone. ", "Travel in summer This island is one of the few in the Caribbean located outside the hurricane belt and the resort prices are much lower in summer months when other islands might be risky to visit due to the tropical storm season.", "Do drink the water Pass on expensive bottled water; the tap water in Aruba is desalinated seawater and is surprisingly delicious and very safe to drink. Bring or buy a refillable container.", "Opt for a room with a kitchen Aruba has many timeshare-style hotel rooms with fully equipped kitchens for self-catering and some major grocery stores with all you might need, often at the same prices you might find at home.", "Aruba's motto is \"One Happy Island,\" and by all accounts, the residents prove this is so. Arubans are unanimously described as friendly and helpful. Dutch and Papiamento (a patois of Dutch, Spanish, Portuguese, English, French and African languages) are the official languages, but most everyone also speaks Spanish and English.", "Like the residents of other tropical islands, Arubans dress casually around the beach, but they do like to dress up to go out and dress smartly for work as well. It’s considered disrespectful to enter dining establishments in beachwear or shorts, tanks and flip-flops. Dress as you would to go out for dinner at home depending on how casual or upscale the establishment is. Many restaurants include a 10 to 15% charge on the bill that's distributed among the entire staff. To specifically tip your server for great service, give it to them personally, or leave the money on the table; 15% is considered acceptable", "Aruba's official currency is the Aruban florin (AWG). However, the U.S. dollar is widely accepted and most items and services are priced in both currencies. One U.S. dollar is equal to about 1.80 Aruban florin. Since the exchange rate fluctuates, be sure to check what it is before your trip. Major credit cards are also widely accepted around the tourism areas, though taxis do not take them as yet.", "Aruba is renowned for both the quantity and the quality of its restaurants. There are more than 400 dining spots, casual and elegant, spanning every world cuisine you can think of, and a dozen chef's table experiences, too. What's more, there are many unique venues. You can dine in the outback, in a lighthouse and in a 200-year-old Dutch windmill, too. Restored colonial heritage buildings are all the rage for new dining spots as well. You'll find most of those in downtown Oranjestad.", "The excellence of Aruba's restaurants is largely due to competition; restaurant owners are always looking for ways to lure new clientele, whether it's putting a different spin on a traditional recipe, bringing in live entertainment or pushing the envelope on new foodie fare trends. But, of course, fresh fish and seafood are staples; look on the blackboards for catch-of-the-day specials. And don't leave the island without sampling some local favorites like keshi yena, a stuffed cheese casserole, and sopis and stobas, or soups and stews. Kesio, a rich caramel custard dessert, or homemade bolos (cakes) are the must-haves for dessert. Look out for local spirits, too. Artisanal rums, gins and wines are on offer, and the local Balashi beer is delicious and made from desalinated seawater!", "Aruba is considered one of the safest islands in the Caribbean, with very little petty or violent crime toward tourists. What's more, because Aruba lies outside the hurricane belt, you're less likely to have a natural disaster ruin your trip.", "The best way to get around Aruba is by public transportation. The bus system is an easy way to hop around the main tourism areas of Aruba (Palm Beach, Eagle Beach and downtown Oranjestad), though the routes do not service the airport. Fixed-rate Aruban cabs are another hassle-free way of getting around. They are not metered; they charge by zones and the rates are fixed by the government. Car rental agencies are located across the street from the airport and deliver and pick up at most hotels. If you want to explore the rest of the island off the tourist grid, you'll need a car. Aruba is also a popular port of call for cruise ships. Ships dock at the Port Authority right downtown in Oranjestad. You'll find free electric trolleys at the terminal to take you to the heart of downtown.", "To get from Aruba's Queen Beatrix International Airport (AUA) to your accommodations, it will be easiest to take a taxi. You can also book shared transfers like the De Palm Tours shuttle bus that stops at every major resort. Tickets for the shared bus cost a little more than $20 per person, but it is a return fare – the company does not accept one-way bookings.", "U.S. citizens will need a passport to travel to Aruba. The passport must be valid for the duration of your stay; a tourist visa is not required. You'll also have to complete an Embarkation-Disembarkation Card. You can fill it out online up to seven days ahead of your arrival. For more information, visit the U.S. Department of State's website."]}