{"name": "Vienna", "description": ["History is at the heart of Vienna both literally and figuratively. The narrow streets of the Innere Stadt (Inner City) snake through antiquated buildings, providing an atmosphere so authentic that you almost expect a Vienna native like composer Wolfgang Amadeus Mozart or psychologist Sigmund Freud to round a cobblestone corner and greet you with \"guten tag.\" Extravagant baroque palaces from the Habsburg Monarchy loom over the city, just as Mozart's classical arias pour from contemporary cafes. If it's culture you seek, you'll find it here. ", "But there's more to this city than just music and monarchs. Vienna is also a great place to spend some cash, with independent bookstores competing for business alongside haute couture. There are also a surprising number of attractions for young ones, including an amusement park and a top-notch zoo. And although many Viennese retire early in the night, that doesn't mean you have to; sneak out to one of the bars in the city's Bermuda Triangle neighborhood, or drop by one of the wine taverns skirting the Vienna Woods.", "The best time to visit Vienna is from April to May or September to October. The mild weather in spring and fall brings mild crowds. Most visitors aim to enjoy the warm, sunny weather that Vienna experiences in the summer months. Between June and August, you can expect the city to fill up and room rates to skyrocket. December also sees a spike in tourism since many Europeans flock to the city for a taste of Christmas spirit served Viennese-style, but chilly temperatures can be a deterrent.", "Don't forget your dictionary German is the official language of Austria, and while it is possible to find English speakers in touristy areas, a dictionary or phrasebook will help lower the language barrier.", "Forget the car Driving in Vienna can be a nightmare thanks to narrow streets, heavy traffic and limited parking. Unless you are planning to explore the Austrian countryside, you're better off forgoing the car in favor of public transit.", "Widen your hotel search Avoid properties within the Ringstrasse since they are the priciest. You'll find plenty of affordable digs scattered throughout the inner and outer suburbs.", "Spring for the Vienna City Card The Vienna City Card gets you discounted entry at more than 100 sites in Vienna, plus discounts at theaters, restaurants and accommodation. Discounts are available for seven days, and cards will get you free public transport for 24, 48 or 72 hours. The Vienna City Card costs 17 to 29 euros (about $18 to $31), depending on how long you want access to public transit. For an additional amount you can add on airport transfers and/or a hop-on hop-off sightseeing tour.", "Night of the Museums On the first Saturday in October, many of the city's museums open late into the night (until 1 a.m.), and one ticket (usually around 15 euros, or $16) gets you into as many of them as you can cram into your evening. Museums often put on one-off events and tours.", "You will find that most Viennese tend to dress conservatively. If you are traveling on business, make sure to wear proper business attire, such as a dark-colored suit or dress. If you are dining alongside Austrians, do not begin eating until the host says \"Gesegnete Mahlzeit\" (bless this meal, generally abbreviated to simply \"Mahlzeit\") or \"Guten Appetit\" (enjoy your meal). It's not polite to leave food on your plate; however, if you're full, make sure to leave your knife and fork side by side on your plate. If you are invited to dinner, don't fight for the bill. Your host expects to pay. If you are paying the bill, gratuity – normally 10% – is usually already included. However, it is polite to round the bill up or leave an extra 5% for good service.", "Dining on delectable Viennese cuisine is one of the city's major must-dos. But vegetarians beware: Much traditional Austrian cuisine centers on meat. However you can increasingly find plenty of vegetarian dishes, and there's a vegan food festival in August. Traditional Austrian taverns (known as beisls) serve up hearty portions of Tafelspitz (boiled beef), goulash (a rich stew made primarily from beef and potatoes) and Wiener schnitzel (deep-fried, breaded veal). If you're looking to save some coin, though, you may want to avoid the Innere Stadt neighborhood. Instead, check out the streets just beyond the city center. Over the past few years, Vienna has seen the rise of international cuisines, ranging from Asian to Italian fare. No matter where you decided to dine, carry cash: some restaurants do not accept credit cards.", "When it's time for dessert, cafes cater to customers with a sweet tooth, serving wide assortments of delicious cakes and pastries like Sachertorte (Austria's most celebrated variety of chocolate cake), gugelhupf (marbled bundt cake), Kaiserschwarrn (chunks of fluffy pancake, caramelized and served with fruit compote) and apple strudel. The Viennese are also big fans of wine – around 1,700 acres of vineyards exist within the city limits and the wine can be enjoyed in over 180 taverns as well as tasting rooms, bars and eateries – and strong beer.", "Vienna is considered one of the safest capitals in Europe and it often appears highly on many best quality of life rankings. Still, travelers should use common sense and keep an eye out for petty theft. The Prater amusement park and mass transit are popular hunting grounds for pickpockets.", "The best ways to get around Vienna are on foot and by public transportation. Many historic attractions can be found within the compact Innere Stadt and are easy to reach with just a sturdy pair of walking shoes. But if you are interested in exploring some of the more remote districts, the city's subway, bus and streetcar routes will get you where you need to go. Taxis are abundant as well. There are also several methods of public transportation connecting Vienna to the Vienna International Airport (VIE) – about 12 miles southeast of the city center – including the City Airport Train to Wien Mitte station (which takes 16 minutes and costs about 15 euros for a one-way ride) and the Railjet to Wien Hauptbahnhof (which takes just 15 minutes and costs less than 5 euros one-way). Both stations are central, though Wien Mitte is closer to the Innere Stadt.", "U.S. citizens can enter the country for up to 90 days without a visa. If you plan to stay longer, you must obtain the proper visa from the Austrian Embassy prior to departure. You will need a passport that is valid for at least three months after your return, though six months is recommended. For more information concerning entry and exit requirements for Austria, visit the U.S. State Department's website."]}