{"name": "Scottish Highlands", "description": ["Nothing is perfect, but the stunning scenery that makes up the Scottish Highlands comes pretty close. The more than 11,000-square-mile region north of Glasgow, Scotland, is a living exhibit of Mother Nature's greatest magic, featuring a diverse array of geographical offerings that leave travelers with unbridled awe. Sky-high peaks, miles-long lochs, rugged coastlines with wild tides and unspoiled, evergreen glens all call the Highlands home. In addition to its massive mainland, the Scottish Highlands encompass four clusters of equally engrossing islands located miles off the north and west coasts, taking off-the-grid travel to a whole new level. ", "While you'll no doubt spend most of your time getting wrapped up in the region's natural splendor, make room for cultural experiences quintessential to Scotland. Grab a pint at a pub, sample some haggis, tour a castle, try on some tartan or go to a tasting at one of the many hundreds-year-old whisky distilleries dotted around the region, including the famous Lagavulin. Many of the best Scottish Highlands tours combine all of these experiences into a daylong excursion. And if you're visiting from early summer to early autumn, find the nearest Highland Games to witness kilt-wearing Scots competing in regional games that have been around for centuries. With its unmatched beauty and deep commitment to its cultural roots, the Highlands will leave you completely smitten with Scotland.", "The best time to visit the Scottish Highlands is from June to August. Summer temperatures are best for exploring the Highlands, however, with Scotland's location so far up north on the globe, don't expect a traditionally hot summer. During the country's warmest month (August), highs rarely surpass the 70-degree mark. The good news is that you can hike the Highlands without ever having to worry about the heat. The bad news is that no matter what time of year you visit, you will always have to bring layers. If you don't mind the cold, visiting during the cooler fall and spring can be beneficial, especially to your wallet. Winters here are pretty brutal and are only made cooler with the rain, which reaches its peak during the colder months. As for crowds, you can expect a good amount of tourists during the summer in gateway towns (think Aviemore in Cairngorms National Park) and photo op spots (along the roads of Glencoe).", "Kilts, tartans, clans – all those quintessentially Scottish cultural relics you might associate with Scotland can be traced back to the Highlands. What differs from the Highlands and the Lowlands culturally (the official dividing line is unclear, but visitors can assume the two regions are separated by the big cities of Glasgow and Edinburgh) is the Highlands' Celtic roots. Back in the day, clans were the best system for governing in such a remote, rugged region. Clans were a family of sorts, with everyone bearing descent from one ancestor. Clans looked after their own region in the Highlands, had leaders and even their own way of dress (the different patterns you see on tartans represent different clans). Kilts, which bore these tartans, were worn by clansman out of convenience; the skirt made it easy to traverse the rocky terrain of the Highlands.", "The clan system and much of the Highlands population was eventually pushed out in the late 18th and early 19th century due to the Highland Clearances – an order brought on by the government. This was due to a number of agricultural and economic factors, but it was no secret that the government wanted the more independent Highlands to get on board with the new U.K. (at that point the Lowlands already mirrored English culture far more than the Highlands did). Because of this emigration, the Highlands became one of the most sparsely populated areas in Europe.", "Due to this tumultuous history, one of the biggest cultural mistakes you can make is calling a resident of Scotland \"English.\" \"English\" refers to someone from England; \"Scottish\" refers to someone from Scotland. The cultures and histories of each country, while they no doubt intersect, are perceived very differently, so it's best not to talk politics with locals. Scottish people are generally very friendly though, so don't be afraid to ask for directions or a recommendation. All Scots do speak English, though a growing number of residents are proficient in Gaelic. The currency here is the pound sterling. One British pound is equal to about $1.32, but since exchange rates fluctuate, you'll want to check before you visit. Tipping isn't strict here the way it is in the U.S. You can choose not to tip, especially in a pub, but if you're at a sit-down restaurant, 10 percent is considered standard.", "Considering its far-flung location, visitors may not immediately consider this outdoorsy wonderland a foodie destination. But if you can believe it, this remote region is home to four Michelin-starred restaurants, including the Boath House in Nairn, the Restaurant at Isle of Eriska near Oban, the Kinloch Lodge in Skye, and the Albannach in Sutherland. The Scottish Highlands is also a palpable force in the whisky world. Here, you can taste a bevy of single malts (what the region is known for) from the smoky to the fruity, the full-bodied to the delicate. What's more, many of the region's distilleries have been in operation for hundreds of years. Some of the most popular distilleries include Lagavulin and Laphroaig (both in the Isle of Islay, a mile apart from each another), Glenlivet and Dalwhinnie (both in Cairngorms National Park). ", "Like whisky – Scotland's designated national drink – you can't leave Scotland without trying some haggis, a savory pudding and Scotland's designated national dish. While you can find haggis anywhere in Scotland, there are certain delicacies that are unique to the Highlands. If you're heading to the Orkney Islands, consider sampling regional specialties, such as Orkney lamb, beef and its blend of Scottish Island Cheddar. These dishes have been granted European protected status, which acts as a designation for high-quality products or ingredients that are native to that region. Stornoway black pudding (Stornoway can be found in the northern Outer Hebrides islands) and Shetland lamb have also received that protected status. If these destinations aren't part of your itinerary, don't worry. Scotch beef, lamb and Scottish wild and farmed salmon are also a protected specialty that can be found all over. For dessert, try regional favorites like clootie dumplings or cranachan. Cranachan is akin to a parfait, while the former is an icing-free cake made with dried fruit and spices.", "The Scottish Highlands isn't the kind of destination where you'll have to worry about petty crimes like pick pocketing. There really isn't a whole lot of crime in the Highlands at all. Here, staying safe is all about understanding the remote nature of the Highlands and being prepared for its elements. Weather is very fickle in the Scottish Highlands. It's not uncommon for a sunny, summer day to be interrupted by a rain shower suddenly. And if that happens, you'll need to roll with the punches and alter your plans. The munros and mountains that make up the Highlands, even with the smallest bit of rain, can be dangerous to hike when wet. Bring proper hiking boots when traversing the area's trails. Even if it doesn't rain, a lot of the trails found on the munros and mountains have rocky terrain. Many of the summits are pure rock, including at Ben Nevis. Bring the right footwear to avoid injury and always have a jacket with you, as the wind significantly increases the higher you climb.", "If you are renting a car, it's also very important to note that gas stations are not as abundant as they are in the southern part of Scotland. They are also known to have reduced hours during the week and are often closed on Sundays. Always make sure your car is fueled up, especially if you are about to travel to more remote areas. If you find yourself in an emergency situation, dial 999.", "The best way to get around the Scottish Highlands is by car. Many of the region's top attractions and desirable destinations are spread far apart from one another and could take a long time to reach via public transportation. And with all the outdoor activities you'll no doubt be enjoying, you might want to take the Highlands at your own pace. However, if you aren't comfortable driving on the left side of the road, or willing to fork over the exorbitant fees for renting a car, stick to trains and buses. Another way to avoid having to navigate on your own is by signing up for a guided tour of the Scottish Highlands.", "Luckily, Scotland has a well-connected railway that services gateway Highlands cities, including Fort William, Aviemore and Inverness. Buses also service these cities and can be cheaper in comparison to traveling via train. While buses and trains will no doubt save you some pounds in the long run, it's important to know that routes start to become fewer and farther between in more remote areas, specifically the northwest tip of the country. The best way to reach the Scottish Highlands is to fly into either Glasgow (GLA) or Edinburgh (EDI) international airports and then rent a car or take the train or bus to get into the Highlands.", "The Scottish Highlands is home to some of Scotland's most spellbinding scenery. Neist Point is perfect for those who want to experience Skye's stunning scenery without enduring a hard hike. The trail to the lighthouse is paved and is 2 miles in length.   "]}