{"name": "Tokyo", "description": ["\"Animated\" is perhaps the best word to describe Tokyo. Crazy about its anime, Japan's mega city is constantly buzzing with movement – and yet, bright lights and loud signs beg you to pause, to break your motion for just one second to pray (oops, we mean pay) at the altar of consumerism. This is a city that feeds on motion and progress.", "But when you want to stop in Tokyo, the city will certainly make it worth your while. The tech-savvy locals may whizz past the monuments and urban parks daily (except during the cherry blossom season when everyone floods the green space), but, we assure you, the museums and historical sites are world-class. Here, there are photos to be taken, sushi to be eaten and a lot of shopping to be done. So what are you waiting for? You better get a move on.", "The best time to visit Tokyo is between March and April and September and November. Autumn ushers in colorful foliage and comfortable temperatures. Spring brings in much of the same, but instead of vibrant fall hues, the foliage you'll see here are cherry blossom trees in full bloom, making it peak tourist season. Summer, on the other hand, is oppressively hot, but less crowded than the spring. What's more, parts of June and July can usher in lots of rainy days. On the opposite extreme, winter weather is chilly (with highs in the 50s and 60s and lows in the mid-30s), but still manageable; however, you will not be able to experience the full potential of Tokyo's parks at this time of year.", "Bring some yen Some businesses in Tokyo, especially off-the-beaten path places, don't always accept credit cards for payment, so it's a good idea to carry some yen. When you're in need of an ATM, seek out a post office or a 7-Eleven, which accepts foreign cards. ", "Avoid rush hour on the subway With millions on their way to work, it's a guarantee that you will be stuffed like a sardine onto a train. Literally. There are subway workers whose sole job is to physically push people further into the crowded cars if they are blocking doors from being able to close.", "It's not the kind of sushi you'll find at home It should come as no surprise that you won't find California rolls here. Most of the rolls in the United States are American versions of sushi. Here, some of the most popular sushi is various cuts of fish placed on top of rice; this is known as nigiri.", "English isn't as prevalent as you might think Travelers report that popular museums and some restaurants they went to have no English translations. A good chunk of Tokyo residents do speak English, especially at hotels, transit stations and popular attractions, but be patient when approaching people on the street as some may not understand you. Download translation apps on your phone to help assist with easier communication.", "Visit the free attractions Here's a list to get you started: Tsukiji Outer Market, Meiji Shrine, Imperial Palace Grounds and East Garden, Senso-ji Temple and the Tokyo Metropolitan Government Building. And that's not including Tokyo's many must-visit neighborhoods and parks.", "Buy vintage And by \"vintage,\" we mean the apparel that arrived in stores a month ago and has already been recycled to thrift stores. Tokyo fashions last for a mere second, so don't try and keep up. Buying vintage will make you look \"classic\" in Japan and cutting-edge back in the States.", "Eat Japanese food Dining at Western-style restaurants will cut into your budget and prevent you from experiencing the often meticulously prepared Japanese dishes, so eat delectable sashimi, tempura, kare raisu (curry rice) and ramen at local spots.", "Japanese culture in Tokyo is all about the blend of the old and the new. Centuries-old temples rub elbows with modern skyscrapers, and while consumerism runs wild on the streets, citizens are expected to maintain a rigid code of conduct, even in private. Most travelers have probably heard of the Japanese tradition of bowing as a greeting. It's easy to get overwhelmed with the rules, but as a Westerner, you aren't expected to be well-versed. A low tilt of your head will suffice in a social situation. And if a Japanese person reaches out for a handshake, take it as a sign that you don't have to bow.", "Japanese is the spoken language in Japan. A fair amount of Tokyo residents speak English, especially at hotels, transit stations, and popular attractions, but be patient when approaching locals on the street as some may not understand you right away. Helpful phrases to learn include sumimasen, meaning \"excuse me\" or \"sorry,\" and arigato, which means, \"thank you.\" ", "Japan uses the yen, and major credit cards are accepted at most establishments in Tokyo. Since the yen to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Tipping is not a common practice here. Even if you tip the slightest amount, you'll confuse your server to the point where they'll try to give the money back to you. ", "When it comes to food, avoid eating or drinking on the go. Another thing to keep in mind: Make sure your chopsticks are never left upright in a bowl and avoid playing with them as it's seen as offensive. And if those piping hot noodles leave your nose a little runny, avoid blowing it in public. When the Japanese are sick, they are expected to wait to blow their nose in a private place.", "If you consider Tokyo's large amount of restaurants (more than 160,000) combined with the number of prestigious dining awards the city holds (it boasts the most Michelin-starred restaurants in the world), it's easy to see why Tokyo is considered by both chefs and culinary critics to be the foodie capital of the world. But numbers are hardly an accurate reflection of what makes Tokyo's dining scene so noteworthy. Experts say the country's quality of local ingredients, lax import laws (goods are brought in from Europe daily), immense dedication to culinary traditions (both to Japanese fare as well as to other global cuisines) and an aptitude for consistency are just some of the reasons Tokyo has garnered so many distinguished culinary titles.", "Another way in which the Tokyo food scene stands out is the abundance of chefs that specialize in just one dish and spend their lives perfecting it. This is also referred to as a shokunin, or an artisan who dedicates themselves to the pursuit of mastering their craft. There are restaurants all over Tokyo with chefs specializing in ramen, tempura, yakitori and numerous other local favorites. You'll also want to sample sakitori, or charcoal-grilled chicken skewers, as well as unagi, or eel that is broiled, steamed, seasoned and then grilled. If you're after something more formal, treat yourself to kaiseki, a multi-course dinner of seasonal small plates. No matter what you eat, make sure to pair it with a beer. Japan is the seventh biggest beer consumer in the world. The biggest domestic makers in the country are Asahi, Kirin and Sapporo. And when it comes to dessert, seek out matcha-flavored anything. To enjoy a quintessential Tokyo dining experience, seek out micro restaurants that only have about 10 seats or tables (or less).", "For a big city, Tokyo is pretty safe. Crime rates are low and there isn't much of a reputation for pickpocketing (compared to Europe). Japan as a whole is considered to be one of the safest countries in the world. However, if you do plan to enjoy the nightlife, be selective about where you choose to party. Shinjuku, especially the red-light district of Kabukicho, has seen its fair share of seedy activity and crime. The State Department reports that theft and assault have occurred here, as well as in the neighborhoods of Roppongi (an expat community) and Ikebukuro. Even if you steer clear of these areas, the State Department still recommends staying on your toes when partying anywhere in Tokyo. For more information, visit the State Department's website.", "The best way to get around Tokyo is the subway. This extensive, efficient network will take you anywhere in the city as quickly as possible. The subway also connects to Tokyo's two major airports – Narita International Airport (NRT) and Haneda Airport (HND). The bus system is even more pervasive than the subway; however, it's subject to traffic delays and usually confuses travelers who don't know Japanese. The city is too massive to be covered on foot, but you should stroll through the individual neighborhoods to enjoy Tokyo's hustle and bustle. Taking a taxi can get costly, but will be necessary when the subway is closed late at night and early in the morning. And if you don't want to find a cab in the middle of Tokyo's chaos, the city has several ride-hailing apps, such as Uber.", "Japan requires you to have a valid U.S. passport when you enter the country. You can stay visa-free for 90 days. For more information, check the U.S. Department of State’s website."]}