{"name": "Nice", "description": ["As the largest city on the French Riviera, Nice attracts beachgoers, history buffs and high culture seekers who come to vacation on its Mediterranean shores. There's definitely more to this attractive city than a pebbly waterfront, pastel-colored buildings and palm trees waving in the breeze. Baroque churches surprise you in the maze of the Old Town's twisted streets; modern sculptures dominate the gardens as you stroll in the Place Masséna; ancient Roman ruins provide the backdrop for grand art in Cimiez and the candy-colored onion-shaped domes of the St. Nicholas Russian Orthodox Cathedral are seen from angles across the city. But Nice's cultural charms are often interwoven (and sometimes overshadowed) by its reputation for partying in the summer months. Be sure to leave a little energy for the vibrant nightlife along the Riviera.", "The best time to visit Nice is in the shoulder season of September to October, or from mid-March to April when you can capitalize on sunny weather, fewer crowds and low room rates. In July and August, the city is extremely busy, especially on its beaches, public transport network and the main tourist streets of Place Masséna and Old Town. You can take advantage of the Mediterranean weather year-round, but average high temperatures range from the mid-50s in the winter to the low 80s in the summer, and the city sees sunny days roughly 300 days of the year.", "The Niçois are friendly France's stereotypically icy attitude regarding tourists seems to thaw in the ever-present sunshine. The Niçois are usually very accommodating to foreigners, especially if you make an attempt to speak French.", "The Niçois are fashionable The Niçois dress more formally than Americans, so wearing baseball caps, flip-flops and sneakers will immediately label you as a tourist. Walking around in a swimsuit off the beach is also considered a fashion faux pas.", "The Niçois keep 'em covered While topless beaches are common in France, it's a dying practice among the younger generations. Although you most likely won't get into trouble, you can expect to be the object of ogling.", "Be wary of private beaches Some sections of the beach are cordoned off as private beaches. These spots ban outside food and drink, expecting you to purchase refreshments from their nearby restaurants, as well as charge you upward of 20 euros (around $21.30) for a lounge chair. The public beaches might not come with chairs, but at least they're free.", "Book smart Hotel rates become more affordable from both mid-March to April and September to October. Smaller hotels in the Masséna neighborhood and towards the top end of avenue Jean Médecin tend to be more affordable as well.", "Skip the cab Taxis in Nice are expensive. Plus, drivers in Nice are infamous for swindling both tourists and locals alike. Save yourself the hassle and take an Uber, a bus or a tram. Or, rely on your own two feet.", "It is polite to greet everyone you encounter with a friendly bonjour (\"hello\") upon arrival, and an au revoir (goodbye) when leaving. Shaking hands is a common way to greet an acquaintance, while it is common amongst friends to double-kiss (faire la bise) when saying hello and goodbye. You will find that the French interact physically with close friends in the same way Americans do. If you are directly addressing someone you do not know well, do so formally by referring to them as monsieur or madame until told otherwise.", "If you're dining out in Nice, you should note the French eat with both hands on the table and always with utensils. The only time you should use your hands is when you are eating bread (which is generally used to push food onto your fork). Never bite directly from a whole piece of bread, rip off bite-sized pieces instead. You can also use your bread to mop up sauce and wipe your plate clean.", "Gratuity is generally included in the bill, but it is customary to round the total up or add an extra 5% for extraordinary service. A 5% tip is also acceptable for taxi drivers. For maid service, a few of euros per night is a sign of appreciation. The official currency in France is the euro, and one euro is equal to approximately $1.06. The euro to U.S. dollar rate often fluctuates, so check the latest exchange rate before you go. If you find yourself short on euros, almost all restaurants and hotels also accept major credit cards.", "The food you find in Nice is lighter than in other French cities. Niçois cuisine is a mixture of traditional French ingredients, particularly vegetables – such as peppers, eggplants and zucchinis – and fish and meat but with a twist of Mediterranean flavor. Its location on the coast means that seafood is a staple as seen in the renowned salade niçoise, which combines fresh tomatoes, mixed greens, tuna, anchovies and green beans in a light olive oil dressing. Other local favorites include Italian-inspired pissaladières, small pizzas covered in anchovies and caramelized onions, and socca, a savory pancake made from chickpea flour and olive oil.", "You can find the largest number of traditional Niçois restaurants clustered on the small streets of Vieux-Nice (Old Town). Some travelers recommend eating at one of the smaller, less expensive pubs or restaurants around the Cathédrale Sainte-Réparate near Place Rossetti in Vieux-Nice.", "When you're looking for a restaurant, be sure to explore. There are casual gems hidden in seemingly uninhabited alleyways, while fancier establishments sit along the Promenade des Anglais (Walk of the English).", "Similar to many European hot spots, Nice is generally safe but also deals with its fair share of pickpockets. Experts suggest that you not carry anything valuable or difficult to replace in your pockets. Keep an extra watchful eye on your valuables in commonly targeted areas like buses and restaurants.", "In recent years, terrorist attacks have become increasingly more common in Western Europe and Nice was the target of an attack in 2016 that took the lives of 86 people. According to the U.S. Department of State, terrorist groups continue to plot attacks, so increased vigilance is required in France. There is also increased risk due to civil unrest. Travelers should stay aware of their surroundings. Consider enrolling in the Smart Traveler Enrollment Program to receive security messages and following local media to stay informed.", "The best way to get around Nice is on foot, especially if you plan on sticking close to the city's center. Like many other French cities, Nice is equipped with a reliable and convenient public transportation system. Buses and trams serve all major tourist attractions as well as the Nice-Ville train station and the Nice Côte d'Azur International Airport (NCE). Ride-hailing services, such as Uber, are also a popular option now because they are much cheaper and more convenient than traditional taxis. If you decide to take a taxi from the airport to the center of Nice, expect to pay a flat rate of 32 euros (around $34). Driving is not recommended as traffic can be frustrating and parking is limited.", "A United States passport with at least three months remaining validity beyond your departure from France is required for you to leave the mainland and to re-enter the country. Travelers can enter France for up to 90 days without a visa. If you plan to stay longer, you must obtain the proper visa from one of the French consulates in America prior to departure. For more information concerning entry and exit requirements for France, visit the U.S. State Department's website.", "In 2025, the European Travel Information and Authorisation System, the European Commission's electronic vetting system, comes into operation. United States nationals will have to fill in a pre-arrival online form before traveling to France. Once approved, travelers will be able to stay up to 90 days in any of the 27 Schengen-zone countries. It costs 7 euros (about $7.50)."]}