{"name": "Santo Domingo", "description": ["Christopher Columbus tried to settle in the \"New World\" several times before getting it right. The first and second attempts, La Navidad (in Haiti) and La Isabela (near Puerto Plata), were plagued with fire and disease. It wasn't until the third time, on an opposite coast of Hispaniola, that he and his men perfected the recipe. To this day, Santo Domingo is still a lively, thriving metropolis and acts as both the capital city of the Dominican Republic and the largest city in the Caribbean by population. But it's also so much more: The sounds of merengue, bachata and salsa drifting from a Malecón nightclub or the smells of conch gratinée wafting from a romantic café in Zona Colonial. Due to its history, it's also a city of superlatives: where you'll find the first church (Catedral Primada de América), the first stronghold (Fortaleza Ozama) and the oldest street (Calle Las Damas) in the Americas. This is the real Santo Domingo.", "The best time to visit Santo Domingo is between November and March. That's when this city experiences its best beach weather, even if there aren't many great beaches to enjoy it on. April to July is also a pleasant time to visit, but you should avoid this area at all costs during the hurricane season, which runs from August to October. Whenever you visit, you'll find the hotel rates are agreeable; even the best properties have rooms available for less than $150 a night.", "Although many businesses do accept U.S. dollars in Santo Domingo, the national currency (which is also the one most commonly used) is the Dominican peso. The exchange rate fluctuates from time to time, but $1 USD typically equals roughly RD$45.41. To avoid high exchange rates at hotels and airport kiosks, consider exchanging some money through your bank before leaving the U.S.", "Also keep in mind that tipping in the Dominican Republic is a bit different than it is in the U.S. In Santo Domingo and other Dominican cities, a 10 percent tip is automatically included in restaurant bills. But if you feel you received exceptional service, it is customary to give an additional 10 percent tip. As for cab drivers, gratuities are not commonly given (but tips for great service will not be turned down).", "Those who plan on visiting Santo Domingo should also be aware of the Dominican Republic's entry requirements. American tourists visiting the country for 30 days or less are not required to apply for a visa. However, upon arrival, Americans are required to pay a $10 fee for a tourist card (in addition to bringing a valid passport). For the latest entry requirements and travel tips, check out the Embassy of the Dominican Republic in the United States' website.", "A visit to Santo Domingo wouldn't be complete without a stop at the Zona Colonial. This UNESCO World Heritage Site was founded in 1498 and boasts more than 300 historical sites within its parameters."]}