{"name": "San Sebastian", "description": ["With all of its remarkable offerings, it's hard to believe that San Sebastian isn't as popular as neighboring Madrid or Barcelona. But this oceanfront resort town deserves the same regard reserved for Spain's most popular metropolises. San Sebastian's timeless beauty has a tendency to put travelers into a trance, that is, if its world-class culinary offerings don't take hostage of their taste buds first. The Basque Country lends a kind of cultural experience that deviates from what some might see as the norm in Spain. Here, flamenco and bullfighting aren't sought-after cultural activities in the same way that pintxo bar hopping is. And while siestas are still practiced and Spanish is still spoken, much of the city's residents are bilingual (San Sebastian has the highest number of Basque speakers in the Basque province) and opt to surf in their spare time.", "It was the former Queen Maria Cristina who initially made this destination famous by vacationing here during the 19th and 20th centuries. Nowadays, when the heat of the south becomes too much to bear, Spaniards flock to San Sebastian's cooler shores for a reprieve. But the most interesting thing about San Sebastian, whether you've heard of it or not, or regardless of who has come before you, is its ability to maintain a small-town feel. Isolated spots along the ocean, between narrow calles and atop its famous hillsides, make San Sebastian feel like it's a place all your own.   ", "The best time to visit San Sebastian is from May to July. While the majority of this time period falls during peak tourist season, these months offer the best temperatures. San Sebastian is generally a cooler destination, with spring and fall temperatures seldom topping 65 degrees. Not only that, but summer sees the least amount of rain compared to the rest of the year. Night owls should plan their visit during August and September, when the city plays hosts to numerous cultural events, including Europe's longest running classical music festival. October is a sweet spot where visitors can experience the last of fall's lukewarm temperatures without sharing the street with too many tourists, however, October sees some of the heaviest rainfall of the entire year. If deals are what you're after, a winter visit may be worth the chilly temperatures. What's more, regional Txakoli wine and cider season start to rev up in February. ", "San Sebastian is a city the Basque Country, a region in Spain. While the Basque Country still adheres to Spanish cultural norms (think siestas, late night dinners), it does have its own distinct personality.", "For starters, the Basque Country has its own language, Euskara, or Basque. It is one of the oldest languages in Western Europe and quite unique. In the Basque language, all letters are pronounced, there is no gender and its alphabet doesn't use the letters c, q, v, w or y. Though both Basque and Spanish are the official languages, Spanish is the most widely spoken. You may see some signs in Basque and some culinary delicacies (for example, Txakoli wine) referred to in their Basque name. However, you can order items in Spanish and still be understood.", "Aside from its unique language, the most prevalent characteristic of Basque culture is its culinary arts. Pintxos are the Basque version of tapas and can't be found outside of the Basque region, so indulge accordingly. If you want to learn more about the Basque culinary culture, consider taking a cooking class at the Basque Culinary Center, one of only two culinary universities in Europe.", "Like the rest of Spain, San Sebastian uses the euro. Since the euro to U.S. dollar exchange rate fluctuates, check the current exchange rate before you go. Major credit cards are accepted at most restaurants and shops. It's not customary to tip, however, if you are pleased with your service, 5 percent is sufficient. If you are dining in one of the city's top restaurants, you may be charged a service fee, and you can tip as you normally would in the United States.", "San Sebastian is serious about its culinary scene. If you weren't aware of its glowing reputation in the foodie world, you're in for a treat. And luckily, you don't have to pay a fortune to sample it (though, if you're willing to splurge, San Sebastian certainly has its fair share of Michelin-starred restaurants, including Mugartiz, Arzak, Akelarre and Martin Berasategui).", "If you can't spring for one of these world-class dining experiences, take part in the time-honored pintxos tradition. Pintxos (pronounced \"peen-chos\") originated in San Sebastian and are essentially the Basque Country's take on Spanish tapas, infusing French nouvelle culinary traditions, which focus on presentation as an art. While most other places in Spain serve patrons a plate of tapas with the order of a drink, pintxos are laid out in bulk on the bar, allowing diners to pick what they want.", "Traditional pintxos typically consist of a slice of a baguette with any kind of food on top (or anything that can fit on a single skewer). It's not uncommon to see Spanish staples, such as Iberian ham, manchego cheese or even a helping of the greasy tortilla Española, atop a thick piece of pintxo bread. The most traditional pintxo you can have is gilda, where guindilla peppers, a green olive and anchovy meet on a very small skewer.", "You can find pintxos bars all over San Sebastian (there are more than 200, to be exact), but travelers say Parte Vieja is the best place to start your culinary tour, thanks to the neighborhood's large concentration of pintxos bars. Wherever you end up on your pintxos tour, adhere to the honor system. At pintxos bars in San Sebastian, you don't pay after every drink or pintxo you order. Rather you order whatever you want and tell the barman when you leave what you ordered. For more information on how to conduct your own pinxtos food tour, as well as great pinxtos bars to visit, read our guide to pinxtos food tours.", "You can't sample any pinxto without a glass of cider or Txakoli wine. Txakoli is a fruity white wine produced exclusively seaside in the Basque Country. Cider or txotx, is another staple. It is produced only in the Gipuzkoa area of the Basque Country and is made from fermented apple juice with no added sugar or carbonate. If you want to learn more about San Sebastian's world-famous foodie scene, visit the tourism board's website.", "The best way to get around San Sebastian is on foot. The city's size is manageable, and many of San Sebastian's top attractions are about a mile apart from one another (such as La Concha Beach, Monte Urgull and the Aquarium, to name a few). However, if your feet start to tire, you can rely on the city's bus system, which transports travelers to key neighborhoods and top points of interest, as well as some hotels. Taxis are also available 24 hours a day and there are bike rental stations situated throughout San Sebastian, including near Playa De Concha's seaside promenade. For more information about bike rentals in San Sebastian, check out the tourism board's website.)", "It's important to know that San Sebastian doesn't have an international airport. If you're already in Spain, you can fly into the San Sebastian Airport (EAS), located a little less than 13 miles northeast of the city center. Otherwise, your option is to fly into either Bilbao Airport (BIO), located 62 miles west, or Biarritz Airport (BIQ) in France (30 miles east), both of which welcome international carriers. Many international carriers also offer flights with layovers in Madrid–Barajas Airport (MAD) before continuing on to San Sebastian.", "A valid passport is required for United States citizens traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. Your passport must be valid for three months beyond your departure date. You won't need a visa unless you plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements.", "San Sebastian is a popular place for vacationing Spaniards. During the summer, the expansive La Concha Beach is filled to the brim with local tourists, so make sure to claim your stretch of sand early. "]}