{"name": "Sarasota", "description": ["If you think this quaint city along Florida's west coast is like any other found in the state, think again. Featuring an impressive list of art-centric attractions and activities like The John & Mable Ringling Museum of Art, the Art Center Sarasota and various craft shows and festivals, Sarasota regularly woos enthusiasts and collectors. But art here isn't limited to traditional works like paintings and sculptures. Performing arts like ballet, opera and circus acts are also a mainstay of this waterfront city. In fact, the circus is deeply imbedded in Sarasota. John and Charles Ringling, two of the Ringling Bros. Circus' founders, moved to Sarasota shortly before it became a city in 1913. What's more, John Ringling's former home, Ca' d'Zan, now serves as one of the city's top attractions.", "Sarasota's prime position by Sarasota Bay and the Gulf of Mexico also makes it a popular destination for nature lovers. When you're not admiring the view from one of the area's picturesque golf courses, catch a glimpse of local flora and fauna at the Marie Selby Botanical Gardens, Lido Beach or Myakka River State Park. Additionally, Sarasota boasts one of the largest Amish and Mennonite enclaves in the state.", "The best times to visit Sarasota are from March to May and between September and November when crowds, temperatures and prices are manageable. (But keep in mind that you may encounter a hurricane should you visit between June and November, Florida's hurricane season.) The city's most comfortable temperatures come in December, January and February, but its population swells with Northern residents (or \"snowbirds\") in the winter, meaning Sarasota's streets will be packed with cars and its attractions filled with people. Prices are also at their highest during these months. For partially thinned crowds and cheaper hotel and airfare rates, travelers can visit between June and August. However, visitors should expect lots of rain and humidity, as well as average summertime highs in the low 90s.", "It's situated near several barrier islands Although the city of Sarasota only has two barrier islands (Lido Key and Bird Key), four others (Longboat, Siesta, Casey and Manasota keys) sit within Sarasota County limits. Each offers various beaches and activities.", "It has a growing beer scene Craft breweries are popping up throughout Sarasota. Unique beer venues found here include a circus-themed brewery and southwest Florida's oldest microbrewery.", "Avoid visiting in winter Airfare and room rates are at their highest between the holidays and February. For more affordable options, plan your trip between late spring and early fall.", "Take advantage of free admission days Several Sarasota sights, such as Lido Beach and Sarasota National Cemetery, are free to visit any day of the year, while others like The John & Mable Ringling Museum of Art offer waived entrance fees on select days.", "Ride the SCAT Save on parking expenses by using Sarasota County's bus service (SCAT). Though most bus routes have restricted hours and do not operate on Sundays, one-way rides between downtown Sarasota and locales like Lido Beach and Sarasota-Bradenton International Airport start at $1.25 per adult.", "Like other Florida destinations, Sarasota's dining scene focuses primarily on American fare with regional seafood specialties like shrimp, lobster and octopus. Local seafood restaurant favorites include Dry Dock Waterfront Grill (just east of downtown on Longboat Key), Owen's Fish Camp (a few blocks south of Sarasota's central Main Street thoroughfare) and KaCey's Seafood and More (by Interstate 75).", "Italian, Latin American and Amish and Mennonite eateries are also popular here, thanks in part to many residents' ties to these communities. For Italian cuisine, travelers recommend Dolce Italia, Cafe Baci and Mozzarella Fella. Eateries like the Peruvian-inspired Selva Grill and the Puerto Rican-influenced Sofrito Mama's are considered must-visit spots for Latin American dishes. And at Yoder's Restaurant and Der Dutchman Restaurant, which reside in the city's Pinecraft neighborhood, diners can sample traditional Amish and Mennonite items, including pecan sticky buns, potato cakes and shoofly pie (a dessert with a coffee cake topping and a molasses bottom).", "And for tasty libations, travelers can choose from one of the area's craft breweries. Standout establishments include Sarasota Brewing Company (a microbrewery that opened in 1989), the Big Top Brewing Company (where circus-inspired brews are served) and Calusa Brewing (which was named after the indigenous Calusa Native American tribe).", "Sarasota's attractions are spread throughout the city, so the best way to get around is to hire a car or ride the SCAT, Sarasota County's bus service. Though SCAT buses offer many convenient routes – including to and from Sarasota–Brandenton International Airport (SRQ) – most do not operate on Sundays, and service is typically limited at night. Rental cars, while more convenient, average around $20 per day. Taxi and ride-sharing services can also be arranged but cost significantly more than bus rides and car hires. Bike rentals are available as well, but are not ideal for traveling long distances."]}