{"name": "Hamburg", "description": ["For travelers interested in a German vacation, Hamburg might not be an obvious choice – after all, the country also contains capital city Berlin and Munich – host of the annual Oktoberfest celebration. But as many visitors have already discovered, this thriving harbor city is almost sure to surprise and please you. What's more, Hamburg is also Germany's largest cruise port and the fact that passengers can walk to the city center from their ships is a big bonus.", "Hamburg's bubbly energy is displayed in everything from HafenCity – a reinvigorated riverfront district – to its cutting-edge fashion design industry to its humming nightlife to its evolving dining scene. This northern city is also a watery one, crisscrossed by canals, sidling the River Elbe and wrapping around a lake. In fact, it has more bridges than Amsterdam and Venice, Italy, combined. You'll undoubtedly enjoy its beauty, but this cosmopolitan city also prizes its musicals, nightclubs, shopping and unparalleled Fish Market.", "The best time to visit Hamburg is the months between May and September when 70-degree temps sweep through the city. Room rates might be a bit higher and you may have more tourists to contend with, but the pleasant weather makes up for the elevated prices. For fewer crowds and potentially lower hotel prices (room rates remain pretty steady year-round), visit in the fall. The weather will be brisk with temperatures in the 50s and 60s, but the benefits might be worth the chill.", "Although German is the official language, many Hamburg residents speak English as well. But brushing up on a few German phrases is a good idea. Saying guten tag or hallo for \"hello,\" bitte for \"please\" and danke for \"thank you\" is a good way to show respect to locals.", "Punctuality and order are two characteristics highly prized by German culture, so be on time to any business meeting or formal engagement. When in a restaurant, do not leave your money on the table after receiving the check. Hand the money to the waiter and ask for your change. Tips are already included in your bill, but if the service was exceptional, it's customary to tip an extra 10 to 15%. For taxi rides, rounding up to the nearest euro is a sufficient tip.", "Germany's official currency is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "Although Hamburg is probably not among the top culinary destinations of the world, the city's proximity to the sea gives its chefs lots of fresh fish to cook with (Fischereihafen Restaurant is one of the city's most popular seafood eateries). And as Hamburg's a very green city, restaurants serve up a lot of seasonal and organic dishes, such as asparagus soup in the spring and cauliflower dishes in the summer.", "Still, Hamburg holds to its roots, too, and traditional restaurants offer grilled or pickled herring, bratwurst, hamburger steak and eel soup. Hamburg's most traditional dish is the labskaus, which is described as sailors' food made of mashed cabbage, potatoes and beets, covered with a fried egg, pickled herring and pickled cucumbers on the side. Don't miss the delicious franzbroetchen, which is like a cross between a cinnamon roll and a croissant, and only found in Hamburg.", "Beer is a big part of German culture; the legal drinking age for fermented beverages is 16 (or 18 for distilled alcohol). Germany also takes the quality of its suds seriously. There are a number of regulations, known as Reinheitsgebot (literally translated to \"purity order\"), that limit the number of ingredients used in the brewing process to only malt, hops, yeast and water. You'll find plenty of craft brews to sample around town; Braugasthaus Altes Mädchen is a particularly popular spot.", "Be leery of pickpockets, especially in and around the Reeperbahn area. Women traveling alone should also take particular care when touring this area after dark. If you're planning to swim in the Elbe River, travelers warn of strong undercurrents and large waves (from passing ships) that can pull you under. You can also take a dip in the Outer Alster Lake, but keep in mind its relatively shallow depth (six feet in some areas to 16 feet in others). The U.S. Department of State urges travelers to exercise an increased level of caution when visiting Germany due to threats of terrorism. To receive alerts regarding security threats, sign up for the free Smart Traveler Enrollment Program.", "The best way to get around in Hamburg is by foot and the city's extensive and competent public transportation system. A suburban train (S-Bahn), a subway (U-Bahn) or a bus can take you everywhere your own two feet cannot. In fact, the system can take you from Hamburg Airport (HAM) into the city center with relative ease and for only a few euro. Taxis and MOIA, a ride-share service that operates similar to Uber, are available. Rental cars, though an option, are not recommended. ", "United States citizens who are visiting Germany will need a passport to enter and exit the country; it should be valid for up to three months from the date of departure from Germany. As party to the Schengen Agreement, U.S. citizens are able to visit Germany for up to 90 days without a visa. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}