{"name": "Grand Canyon National Park", "description": ["\"Grand\" doesn't begin to do this canyon justice. Measuring approximately 277 river miles in length, up to 18 miles in width and a mile deep, this massive chasm in northern Arizona is truly a natural wonder. For 6 million years, the Grand Canyon has expanded with the help of the mighty Colorado River, and for centuries, people from all over the globe have traveled to gaze out over its red and orange grandeur. Managed by the National Park Service and officially designated as a UNESCO World Heritage Site, the Grand Canyon leaves its approximately 4 million visitors per year awestruck.", "But if you're seeking a secluded escape to Mother Nature, you should be prepared: The Grand Canyon can be very crowded. The South Rim – home to the Grand Canyon Village and the well-worn Bright Angel Trail – is particularly popular for sightseers and hikers. It is on this side that you'll find the most amenities. For a break from the crowds, head to the North Rim. This is the place for backwoods camping and hardcore hiking. For an unforgettable view of the canyon, consider signing up for a helicopter tour.", "The best times to visit the Grand Canyon are March through May and September through November, when daytime temperatures are cool and crowds are thin. If you decide to visit during the summer (the park's peak season), be prepared for hordes of tourists and very limited lodging availability. You can find deals on hotels during the winter, but much of the park (including the entire North Rim) closes after the first snowfall. The South Rim is open throughout the year.", "Bring layers Even if you're visiting in the midst of summer, you can bank on chilly winds once the sun goes down. Make sure to bring a jacket to keep warm.", "Don't forget your permits If you are planning on setting up camp away from the designated campgrounds, you will need a backcountry permit. You can find information about necessary forms and fees on the NPS website.", "Consider a day trip to Antelope Canyon The majestic Antelope Canyon is located about 130 miles northeast of the Grand Canyon Village. Find must-know tips, as well as some of the best Antelope Canyon tours here.", "Keep an eye on the time With the exception of land that is part of the Navajo Nation, Arizona (including the Grand Canyon) does not observe daylight saving time. ", "BYOB Bring your own bed. Hotel rooms inside the park can be pretty pricey. Instead, reserve a spot in one of the campgrounds for a fraction of the cost.", "Arrive fashionably late If you're set on a summer trip, you'll have better luck finding deals on a place to hang your hat if you visit at the end of August.", "Forget the car You can save money on car rentals and gas and avoid parking headaches by relying on the Grand Canyon's free shuttle bus service. It's the easiest way to explore the South Rim. If you just want to visit for the day, consider signing up for an organized tour. Many of the best Arizona tours offer daytrips from cities like Flagstaff to the national park. With a tour, you can ditch the car and enjoy the guidance of an experienced local.", "Unlike many other national parks, the Grand Canyon is home to several restaurants and grocery stores, meaning you won't necessarily have to stock up on supplies before you enter the park. There is an abundance of establishments at the South Rim (especially Grand Canyon Village), and fewer resources on the North Rim.", "Many of the Grand Canyon's restaurants are housed within the park's lodges, including the El Tovar Hotel and Bright Angel Lodge. Travelers often prefer a quick meal at one of the on-site cafeterias in the South Rim instead of an extended (and expensive) meal at one of the park's restaurants. Notably, some recent vacationers were disappointed with some of the restaurants in nearby Tusayan, Arizona.", "The greatest safety concern in the Grand Canyon is the outdoors. It is not advisable to hike or camp alone in the park, even if you know the canyon very well. Even experienced hikers have become lost in the park because they were not well-acquainted with certain trails, which can prove to be dangerous. Be sure to bring an adequate amount of water for your trip and wear sunscreen. Also check the weather before hiking, since lightning during summertime thunderstorms can be deadly.", "Encountering wildlife can present another danger. The park service advises travelers keep a distance of at least 100 feet (or about two bus lengths) away from the park's larger animals, such as elk, deer, bighorn sheep, California condors and mountain lions. As for smaller animals, such as squirrels, birds and reptiles, visitors should stay at least 50 feet (about one bus length) away.", "The Grand Canyon is a relatively safe park in terms of crime. If you park your car within the canyon, be sure to lock your vehicle and safeguard any belongings just in case. For more information, see the National Park Service's website.  ", "The best way to get around the Grand Canyon is by shuttle bus. Operated by the National Park Service, these free shuttles will take you all around the South Rim. If you're visiting the North Rim, a car will be the most convenient option, but make sure to check the park's website for updates on road conditions and closures.", "Getting to the area can be trickier; of the numerous airports, many travelers choose to fly into Phoenix's Sky Harbor International Airport (PHX) or Harry Reid International Airport (LAS) in Las Vegas. Tour buses (such as those featured in the best Arizona tours) and car rentals are all available from both Phoenix and Las Vegas. To land closer to the canyon, consider flying into Flagstaff Pulliam Airport (FLG) in Flagstaff, Arizona, about 80 miles south of the South Rim. Amtrak trains, buses (such as those provided by Groome Transportation) and car rentals are available here as well."]}