{"name": "Sicily", "description": ["Picture a tropical island – gentle waves spilling onto sandy shores, sunshine gleaming off a sparkling sea and volcanoes spurting steam in the distance. Add to that image: lush, rolling hills, topped by ruins from antiquity like those at the Valley of the Kings near Luxor, Egypt. And then you need to imagine the rich tastes of fresh seafood, decadent pastas and desserts. This is Sicily – a balmy, laid-back refuge with an Italian mentality, especially seen in its cuisine and zeal for life. You'll find this large, triangular island, which happens to be the largest island in the Mediterranean, at the toe of Italy's boot, surrounded by the Tyrrhenian, Mediterranean and Ionian seas.", "The best time to visit Sicily is from May to June or September to October. These late spring and early fall months offer hospitable temperatures in the 70s and low 80s, which are ideal for temple gazing, beach lazing or hiking. These are both considered shoulder seasons, and you may be able to score some discounts. If you plan a July or August vacation, you'll contend with lots of crowds, high prices and the hottest temperatures of the year. Winter sees temperatures in the 50s and low 60s; you can find greatly reduced hotel rates, but swimming in the ocean isn't an option.", "Avoid a summer trip While a summer visit is ideal for sunbathing, it can be less than ideal if you're hoping to explore ancient archaeological sites that offer little to no shade.", "Eat your heart out Sicily is full of local specialties like arancini (stuffed rice balls) and fresh seafood. If you'd like a little guidance navigating Sicily's dining scene, consider signing up for a food tour. Sicily's top food tours are featured in our list of the best Italy tours.", "Bring walking shoes Some of Sicily's top attractions, including the Valley of the Temples and Mount Etna, will require a lot of walking, and thus, a quality pair of shoes.", "Visit during the low season Although you may face rain and cooler temperatures, you're also likely to score deals on hotels, restaurants and attractions from November to April.", "Sicilians tend to be friendly and welcoming, though they may not speak English. In fact, many speak in a Sicilian dialect, which is a bit of a mix of words from various cultures that once conquered the island, including Spanish, French, Greek and Arabic. They are also known to be aggressive drivers, so watch out when crossing streets or driving.", "Most Sicilians consider themselves to be Roman Catholic, so much of the island's culture centers around the holidays and festivities of the Catholic church. Holy days like the Feasts of the Assumption and the Immaculate Conception of Mary are national holidays, Sicily celebrates the feasts of St. Agatha, its patron saint, and Santa Rosalia.", "Sicily's official currency is the euro, and you may want to check the exchange rate before you travel there. Plan to carry cash and coins with you, as many establishments may not take credit cards, especially in some of the island's smaller towns. When dining, tipping is common in Sicily and locals recommend leaving 3 or 4 euros for your server, or around 5% of your bill.", "Sicily has been influenced by many cultures, including Greek, Roman, Norman, Arab and more, so its cuisine is a unique mixture of many traditions. Some classic dishes include arancini (a fried rice ball), cazzilli (pan-fried, potato croquettes), crispeddi (fried potato fritters) and the island's famous pastries like pignolata (a dessert of fried dough) typically enjoyed during Christmas. Sicily is known for the production of many foods and food products like extra virgin olive oil, capers, prickly pears, blood oranges and olives. Be sure to give their pecorino and Ragusano cheeses a taste and sample their sumptuous sausages.", "The Principe Cerami at the San Domenico Palace Hotel, overlooking the Ionian Sea in Taormina, is a fine dining restaurant serving haute cuisine with a Sicilian touch. The menu features pastas with black truffle, smoked anchovies and stuffed guinea fowl, as well as a variety of Mediterranean fish entrees.", "For a bistro setting, check out Antica Focacceria San Francesco in downtown Palermo, which dates back to 1834. Sample their brand of arancini, focaccia sandwiches and Sardinian meatballs. Palermo is also known for its street food with items like boiled octopus, fritters and rice croquettes cooked up roadside.", "Seafood lovers won't want to miss L'Oste e Il Sacristano in Licata where visitors recommend the pasta in fish broth with red prawns. Other options include barbecue octopus and pasta with clams.", "Travel to Italy is generally safe, even though it's rife with rumors of a mafia presence. As with many European countries, simply be aware and on the lookout for pickpockets and petty thieves. In some cases, people on motorcycles may snatch a bag or purse as they drive by. Leave valuables and extra cash in a safe place at home or in the hotel room safe, and never leave your bags unattended.", "The U.S. Department of State issued an advisory in December 2018 warning Americans to exercise increased caution in Italy overall due to terrorism. The Department of State also warns that some thieves may impersonate police officers and that you should always ask to see a uniformed officer or the officer's identification card.", "Additionally, because Sicily is home to an active volcano, Mount Etna, there is the potential for it to erupt, which could cause airports to close and other disruptions.", "The best way to get around Sicily is by train, as it allows you to quickly and affordably get from the island's various cities while still enjoying the scenery. Be sure to validate your ticket before boarding to avoid fines. Buses are another affordable transportation method and may be your next best option. They're less expensive than trains; however, they don't get you there as quickly. You can purchase bus tickets in many places, including newsstands, bars and tabacchi shops, but be sure to bring cash to pay for your ticket.", "Cars can give you more freedom when traveling throughout Sicily, but you'll have to contend with traffic, confusing tolls, limited traffic zones (where you can be heavily fined if you're driving where you shouldn't be), parking and more. Since Sicily is surrounded by water, you can travel by ferry, as well, though service may be limited in the winter months.", "You can fly into Sicily via three airports, including Palermo Falcone-Borsellino Airport (PMO), Trapani Vincenzo Florio Airport (TPS) and Catania Vincenzo Bellini Airport (CTA). There are shuttle services and taxis that will take you to town or you can ride the local bus from Catania airport. Additionally, you can reach Sicily by water from mainland Italy and France, as well as islands like Sardinia and Corsica using ferry services like Corsica Ferries-Sardinia Ferries. You can even reach Sicily by train from the Italian mainland with the entire train boarding a ferry for the water crossing.", "U.S. citizens may enter Italy with a valid passport that does not expire for at least six months from the time you plan to leave the country and that has at least two blank pages for stamps. What's more, you can stay for up to 90 days without a visa. For more information, visit the U.S. Department of State website."]}