{"name": "Olympic National Park", "description": ["Washington State's Olympic National Park, located on the Olympic Peninsula, offers something for every kind of nature lover, from hikers to stargazers to boaters to photographers. Among its nearly 1 million acres, visitors can explore glacier-capped mountains, trek through old-growth temperate rainforests and marvel at more than 70 miles of wild coastline.", "The park's beginnings date back to 1897, when growing concerns about the area's disappearing forests led President Grover Cleveland to designate it as the Olympic Forest Reserve. Further protections were enacted in 1909, when President Theodore Roosevelt designated part of the reserve as the Mount Olympus National Monument in response to a declining Roosevelt Elk population. It didn't officially receive its national park title until 1938, thanks to President Franklin Roosevelt. Today, the park is both a World Heritage Site and an International Biosphere Reserve.", "The best time to visit Olympic National Park is July through August, when temperatures are usually warm, most roads and facilities are open, and a full range of programs are available. You can find an updated list of seasonal activities in the Olympic Bugler, the park's digital newsletter. Olympic National Park is open 24 hours a day year-round, but from October through May some roads, campgrounds and other visitor facilities are closed or offer reduced hours.", "Always keep in mind that the weather in Olympic can be unpredictable, no matter what the calendar says. It can vary wildly from one section of the park to another. It's a good idea to check the current conditions on the National Park Service website before your visit, and it's also advisable to purchase cancel for any reason travel insurance in the event bad weather threatens to ruin your trip.", "Pay to play A vehicle pass to the park costs $25; an individual pass – for a pedestrian on a bicycle or on foot – costs $10. Each pass is valid for seven consecutive days.", "Watch the weather Flooding and severe storms can close roads and limit access to park areas from November through April. If you're visiting during winter, check the park's website for weather-related closures, as well as avalanche conditions.", "Plan ahead Olympic is enormous and there are no roads that cross the park. Take time to plan your park activities with time and distance in mind to maximize your experience.", "Visit on an entrance-free day All national parks offer free admission four days of the year, including Martin Luther King Jr. Day, the first day of National Park Week (in April) and Veterans Day, among others.", "Pack a picnic There are plenty of scenic places to enjoy a picnic, so plan ahead and bring your own meal. You'll find picnic tables throughout the park, including Rialto Beach, with views of the Pacific Ocean; inside the Hoh Rain Forest; at Hurricane Ridge, with views of the Olympic Mountains; and several others. If you're starting a visit at the Olympic National Park Visitor Center, you'll find tables just outside.", "Inside the park, there are several lodges that offer accommodations and restaurants, cafes and delis. At Kalaloch Lodge, the only one open year-round, the Creekside Restaurant serves local fare alongside stunning ocean views. Admirably, the restaurant boasts that many of their food and beverage items are either sourced within 150 miles, are certified organic, or both. Even the wine selection is local; only wines from Washington state are served. The Kalaloch Mercantile, next to the lodge, has ready-to-eat foods, snacks, groceries, bottled water, beer and wine, and other sundries.", "The dining room at Lake Crescent Resort is equally scenic, overlooking Lake Crescent and offering breakfast, lunch and dinner from late April to the beginning of January. The menu touts dishes like grilled local artichokes, Dungeness crab and locally smoked salmon.", "Meanwhile, the Sol Duc Hot Springs Resort (open late March through October) is home to the Springs Restaurant, which also uses locally sourced ingredients. Other options include the Log Cabin Resort (open mid-May through September), which houses the casual Sunnyside Café. Overlooking Lake Crescent, it offers a hot buffet breakfast, lunch and dinner. The menu includes sandwiches, salads, pasta dishes, homemade pizzas, pulled pork, and fish and chips. There's also a deli, which has \"grab-and-go\" items – perfect if you're planning a mid-hike picnic.", "Considering the park is almost 1 million acres in size, it's no surprise there are many safety considerations for travelers to keep in mind, from weather-related issues to wildlife. As in any natural setting, never approach, startle or feed any wild animal you encounter. Observe wildlife from a distance and at Olympic, that means at least 50 yards away, according to park regulations. Make sure you also have food contained properly.", "Animals in Olympic National Park include mountain goats, some of which have become accustomed to people and can get aggressive. If a goat approaches you, the park advises you slowly move away. If it's not deterred by your retreat, chase it off by yelling, waving your arms or clothing, or throwing rocks. Bears are another species you could encounter. The park reports that there have been instances of aggressive bears, but only property was damaged, no people were injured. If you do encounter a bear on the trail, the park says to give it a wide berth and if it comes into your camp, make noise to scare it away. Never get between a female bear and her cub. Cougars, or mountain lions, also live in the park, but it's extremely rare to encounter one. More mundane nuisances include black flies, deer flies, horse flies, mosquitoes and yellow jackets, so wearing insect repellent, long-sleeved shirts and long pants are a good idea.", "Many popular points along the coast are only accessible at low tide, so it's important to always carry a tide chart, available at visitor centers and coastal ranger stations. You don't want to get trapped by a rising tide since it can cause hazardous hiking conditions. The National Park Service suggests carrying a tide table, topographic map and a watch whenever you're hiking along the coast. Visit the NPS website for links to tide predictions and topographic maps.", "Avalanches are another threat from Mother Nature. The terrain and the weather in the Olympic Mountains can create perfect conditions for avalanches. Since the risk of avalanche can vary daily or even hourly, the park suggests checking in at the Olympic National Park Visitor Center or Hurricane Ridge Visitor Center for current conditions if you are planning to go to Hurricane Ridge or elsewhere in the high-country of the Olympics.", "The best way to get around Olympic National Park is by car. Since the park spans nearly 1 million acres, it's impossible to cover much ground on foot, though you can take a bus to some spots.", "To reach Olympic National Park, many visitors fly into the Seattle–Tacoma International Airport (SEA), which sits about 130 miles east. Car rentals are abundant at the airport and surrounding area. Alternatively, Dungeness Bus Line, operated by Olympic Bus Lines, serves the Puget Sound area and provides service from the airport to Sequim and Port Angeles (among other towns). From there, you can use the Clallam Transit System to get to popular park destinations along the northern section of Highway 101."]}