{"name": "Johannesburg", "description": ["Urban, diverse and full of energy, Johannesburg is the quintessential city. With 11 national languages – all of which are spoken in Jo'burg – as well as a thriving economy based off the area's gold deposits, it's no wonder why South Africa's largest city also holds the distinction of being the world's largest city not located beside a river, lake or coastline. But Jozi hasn't always had such a praiseworthy reputation. A political and often violent hotbed during the country's notorious apartheid era (from the late 1940s through the mid-1990s), Johannesburg suffered from racial segregation until apartheid's end in 1994. However, out of this period of inequality rose important political figures, including Robert Sobukwe (the founder of one of South Africa's opposition political parties, the Pan Africanist Congress), Walter Sisulu (a prominent African National Congress politician held for more than two decades at Robben Island) and Nelson \"Madiba\" Mandela (South Africa's most recognized anti-apartheid leader who eventually became the country's first black president). Another revolutionary leader, Mohandas Gandhi, also got his start as an activist in Johannesburg while working in the city as a lawyer.", "Today, Jozi's apartheid past and gold mining-based economy continue to be felt throughout the city. Attractions such as the Apartheid Museum, Gold Reef City and Constitution Hill offer snapshots into these important Jo'burg attributes, while other sites like Nelson Mandela Square and the Mandela House remind locals and visitors about the monumental impact Mandela had on the city. However, Johannesburg doesn't just focus on the past. Since apartheid, the city has evolved into a vibrant urban center, thanks in part to its trendy fashion boutiques, hip music, bohemian art and array of international cuisine. To experience some of the best new Jo'burg has to offer, trips to the city's Maboneng Precinct and Melville neighborhood are a must.", "The best times to visit Johannesburg are from March to May and September to November. During these low season months, crowds lessen, prices drop and the weather is relatively warm and dry. Keep in mind, though, that Jo'burg's Southern Hemisphere location means its winter starts in June and lasts through August, while summer runs from December to February. As a result, the region's high season, which is defined by large crowds and high prices, occurs during the summer months (America's winter). But once temperatures start to fall in March, the city clears out and hotel and flight rates drop, making winter an ideal time to explore Jozi on a budget.", "With a diverse population that consists of nearly all of South Africa's ethnic groups – Zulu, Xhosa, Basotho, Tswana and Tsonga to name a few – and residents that speak a variety of languages, it's clear that Johannesburg exudes culture. Although English is spoken by many Jozi residents, other languages, including Zulu, Sotho, Xhosa and Afrikaans, are widely spoken as well. In fact, many locals switch between multiple languages within a conversation, so you may struggle with a language barrier at times. To minimize any confusion, consider remembering a few key phrases in multiple languages, such as \"sawubona\" (Zulu), \"hallo\" (Afrikaans) and \"molo\" (Xhosa) for hello, and \"ngiyabonga\" (Zulu), \"dankie\" (Afrikaans) and \"ndiyabulela\" (Xhosa) for thank you. Another useful phrase used throughout the region's languages is \"howzit,\" which is slang for how are you. However, if you find yourself having a difficult time with the languages, don't worry: Translators and employees at tourist attractions and accommodations are more than happy to assist with translations.", "In addition to its diverse population, Jozi acts as South Africa's cultural hub, offering an array of theater performances, concerts, art galleries and museums. Quintessential South African music, such as kwaito (a post-apartheid music genre that incorporates African sounds and rhythms into house music), got its start in Jo'burg. Another favorite: Ladysmith Black Mambazo (a Grammy Award-winning choral group best known for its collaborations with Paul Simon and soundtrack contributions for \"The Lion King II: Simba's Pride.\") And for art enthusiasts, there's the FNB Joburg Art Fair, the continent's first and most prominent art fair that takes place every September.", "Alongside the city's thriving culture, there are several practical tips to keep in mind when visiting Jozi. Like Cape Town, Jo'burg uses the South African rand (1 ZAR = $0.06). Since the rand to U.S. dollar exchange rate regularly fluctuates, be sure to see what the latest exchange rate is before you visit. And much like the U.S., tipping tour guides, restaurant staff, hotel porters and taxi drivers is expected. For restaurant wait staff, plan on tipping 10 percent of your total bill unless a service charge is already included. All other industries typically receive 5 to 50 rand (or roughly 30 cents to $3) depending on the service.", "Also important to note is the region's notoriously high crime rate. Although Johannesburg's popular tourist attractions are relatively safe, the city is plagued by countless violent incidents like murders, sexual offenses, assaults and robberies, especially in poorer neighborhoods and on public transportation. To avoid dangerous situations, stick to popular tourist areas and travel by car or Gautrain. Additionally, the region has recently experienced several xenophobic attacks against African immigrants, as well as occasional violent workers strikes, so be sure to abide by U.S. Department of State travel warnings when visiting the region.", "Thanks to Jozi's diverse population, which consists of multiple ethnicities and sizable Zimbabwean, Mozambican, Nigerian, Somali, Chinese and Indian communities, Jo'burg cuisine features an array of influences and flavor profiles. Notable local delicacies include umleqwa (a Xhosa-style chicken stew), pap (boiled corn meal that has the consistency of mashed potatoes), samoosa (a savory, triangular pastry commonly found in Indian and Malay cuisine) and boerewors (or \"farmer sausage\" that resembles a Dutch sausage called verse worst).", "For the ultimate bush-like atmosphere, Jozi diners recommend a visit to Wombles. Known for its exceptional steaks – enjoyed within a hunting lodge-inspired space – and top-notch service, Wombles receives tons of praise from former visitors. And for those with a smaller food budget, consider grabbing a bite at Lucky Bean, which is located in Johannesburg's trendy Melville neighborhood and features local bistro-style fare like an ostrich burger (a traditional burger with an ostrich patty), springbok pie (a meat pie made with antelope instead of beef) and casamance chicken (a chicken casserole dish originally from Senegal).", "Although the city offers multiple public transit and taxi options, the best way to get around Jozi is by car. Jo'burg's public transit and shuttles – especially those that carry tourists, excluding sightseeing tour buses – are notoriously prone to robberies, while taxis and minibus taxis are known for their confusing hand signals and unlicensed, irresponsible drivers. Also, due to the spread out nature of many of Johannesburg's attractions and safety concerns in lower income neighborhoods, walking is discouraged. However, walking near attractions is relatively safe. And for longer distances or a quicker ride to and from Jo'burg's O. R. Tambo International Airport (JNB), which is about 13 miles northeast of the city center, Gautrain is an ideal choice.", "To visit South Africa, Americans must bring a passport that's valid at least 30 days after the date of departure, with at least two blank visa pages. If visiting for less than 90 days, a tourist visa is not required. However, if you are traveling to South Africa from a country where yellow fever is present (including a layover scenario), you must present a valid World Health Organization approved International Certificate of Vaccination (or \"yellow card\"). For more information regarding entry and exit details, visit the U.S. State Department's website."]}