{"description": ["Take a typical Jersey Shore beach vacation – complete with a boardwalk and souvenir shops – throw in a little Las Vegas, and you have Atlantic City, New Jersey. Since the legalization of gambling in the city in the late 1970s, Atlantic City (or just AC) has attracted visitors who mostly want to try their luck at the tables and occasionally want to lounge on the beach. Now, luxury hotels, hopping nightclubs and upscale shops are spiffing up AC's street cred as a beach vacation. No, you won't find Vegas' class and panache in Atlantic City nor will you find the pristine sands of a Florida beach, but if you're looking for a destination that provides a fairly good mix of the two, AC might just be the place for you.", "The best time to visit Atlantic City is either from March to May or from June to August. Although a nice breeze blows through the seaside town in the summer, the days are defined by humidity with average highs in the low 80s. Temperatures drop in the evenings, so bring a sweater or jacket, especially if you're going to enjoy AC's nightlife. Spring and fall see milder weather, while temperatures can dip below freezing during the winter. If you're more interested in the casinos, you'll find that any point in the year is worth the trip. Most offer discounts and other perks year-round to attract new guests and repeat visitors.", "Stay on the boardwalk Though the city is generally safe during the day, you shouldn't wander too far off the beaten path, especially after dark. Avoid walking behind the casinos and on the beach at night.", "Winter in Atlantic City The cheapest time to visit AC is during the winter months, especially in the middle of the week. You'll miss out on the beaches, but the casinos and most restaurants are open year-round.", "Don't stay in the casinos Unless you're taking advantage of a promotion, the casino hotels are expensive. The farther you move from the beach and the boardwalk, the more affordable hotel prices you'll find. But don't go too far from the main drag; AC's outskirts can be seedy, particularly at night.", "Take advantage of casino promos Check with individual casinos for promotions and packages. Many offer club cards, discounted prices and other perks year-round.", "Atlantic City is primarily a resort town and because of its powerhouse casinos and hotels, many visitors typically eat there. Travelers will find plenty of buffets in addition to restaurants established by celebrity chefs like Gordon Ramsay, Wolfgang Puck and Geoffrey Zakarian in the various resorts in town. The Atlantic City Boardwalk also has some tasty casual eats like fresh funnel cakes, creamy fudge, salty french fries and an AC staple, saltwater taffy.", "There are some dining spots located outside the casinos and boardwalk, though. And thanks to AC's coastal location, there's plenty of seafood on the menu at those joints. Diners cite Dock's Oyster House as an eatery where you can get fresh seafood from the raw bar, classic chowders and entrees like stuffed flounder. Recent visitors also suggested a visit to Chef Vola's for authentic and exceptionally tasty Italian fare at reasonable prices.", "The best way to get around in Atlantic City is on your own two feet – most attractions are within walking distance of one another. If you're worn out from walking, you can hop on the AC's Jitney minibuses or be pushed along the boardwalk in a shaded rolling chair. Cars are convenient in Atlantic City as well, especially if you'll be traveling beyond the city limits. Rental agencies have offices in both of the nearby airports; the Atlantic City International Airport (ACY) is about 15 miles northwest of downtown AC while the Philadelphia International Airport (PHL) is around 65 miles northwest.", "New Jersey Transit services Atlantic City from Philadelphia only: The Atlantic City Rail Line takes about an hour one-way. The Atlantic City Express Train Service runs from New York City, making one stop in Newark, New Jersey. Fares for the double-decker train depend on availability and class. A free shuttle operates between the train terminal and major casinos in the city.", "The boardwalk is one of the best ways to get to know Atlantic City. Stroll along to take in the sea views and check out the shops, hotels and casinos along the way."]}