{"name": "Outer Banks", "description": ["History drips from the Outer Banks: Here, aviators Orville and Wilbur Wright took their famous first flight (at Kill Devil Hills), the pirate Blackbeard fought his last battle (at Ocracoke) and the mysterious Lost Colony disappeared (exactly where is anyone's guess, but it was last seen on Roanoke Island near Manteo). Yet this chain of barrier islands located off the coast of North Carolina – affectionately dubbed OBX – isn't just for history buffs. Fishing, windsurfing and wildlife watching attract adventurous types as well. The Outer Banks' roughly 3,000 shipwrecks, explorable by snorkeling or scuba diving, earned it a reputation as \"the graveyard of the Atlantic.\" Families gravitate toward the beaches, the mini-golf courses and the North Carolina Aquarium at Roanoke Island.", "Each neighborhood has its own charm: Old lighthouses, rugged dunes and secluded beaches in the south coupled with vacation rentals, water sports and kitschy beach shops in the north all form a unique seaside destination. OBX is ideal for those looking to skip overly developed touristy towns and head straight for the unspoiled beaches. You won't find big nightlife, but you will find an abundance of natural beauty. Beaches are more populated during the summer months, but with so many destinations spread out along the barrier islands, you likely won't experience unmanageable crowds at any time of year. ", "The best time to visit the Outer Banks is between March and May or September and November, when lodging rates drop and crowds dissipate. Most mainland North Carolina residents and out-of-towners arrive during the summer months, when humidity is high and average temperatures consistently hit the upper 80s. In the winter, the weather dips into the 40s and 50s. Just keep in mind that during the offseason, some attractions, restaurants and shops may close or operate under more limited hours. ", "You can go off-roading Four-wheel-drive vehicles are allowed on some beaches at select times of the year, just remember to obtain a permit and drive at a slow and steady pace (the speed limit is 15 mph).", "There's a swim code If the red flag is flying, the tides are too strong for swimming. Also, steer clear of specified surfing areas to avoid endangering surfers (and yourself).", "Prepare for Saturdays Traffic is at its peak on Saturdays, as most OBX travelers choose to start or end their vacations on this day. Consider driving on a different day of the week or using less popular routes to avoid getting stuck on small two-lane roads. The OBX tourism board offers helpful driving tips on its website.", "Go on a Sunday Book a vacation rental from Sunday to Sunday to enjoy less traffic getting there and back. Plus, you'll encounter fewer beachgoers the Saturday of your trip since everyone will be traveling.", "Skip the summer Lodging prices jump sky-high to take advantage of the summer crowds, so plan an offseason visit instead. A good chunk of attractions will still be open in the cooler months (even the outdoor spots), but some may operate under limited hours.", "Pass up some luxuries Cape Hatteras National Seashore offers camping spots by reservation for around $20 to $35 per night, which is much cheaper than staying in a vacation rental or at a hotel. Also, cooking most meals yourself (instead of going out) will save you ample cash.", "Skim the site The Outer Banks Visitors Bureau posts local deals on lodging, travel packages and business specials, so check out the website as you plan.", "Many families who rent homes for their vacation make a trip to local grocery stores (like Food Lion and Harris Teeter) and seafood markets to cook most meals at home. Cooking on vacation doesn't sound appealing, but your wallet will thank you for not eating out every meal. If you are arriving on Saturday or Sunday, make sure to bring enough provisions to last you the first few days or make just a quick stop at the market. Grocery stores are at their busiest on the weekends, so you'll save yourself the hassle of crowded aisles and long checkout lines if you wait until Monday or Tuesday morning to do a big shop. And if you need to stock up on your favorite beer, wine, seltzers and ciders midweek, don't miss Brew Thru, a drive-thru libations store. Employees will hand you a menu, take your order and load the bottles and cans into the car for you. It's a must-do OBX experience.", "When you do venture out, you'll find that fresh seafood with a Southern twist is an Outer Banks specialty. But if you're not into seafood, don't fret. Delicious burger, taco, pizza, sandwich and dessert spots are spread across the islands. You'll find a bigger selection of restaurants in more tourist-oriented communities like Nags Head and Kitty Hawk, just be mindful that some establishments close or operate under more limited hours outside of the peak summer season. ", "A local favorite for sweet treats is Duck Donuts, which has multiple locations in the Outer Banks (including one in Duck, its namesake). Originally established in OBX, the chain has since expanded across the country. Plus, donuts are created to order, so you can try a variety of glaze and topping combos.", "Crime is low at the beach and in town, but travelers should still practice common sense. Keep valuables close to you or locked away. Only swim in the ocean when a lifeguard is present (be sure to check a chart of lifeguard station locations), and pay close attention to any warnings about water conditions. If a red flag is flying, you're prohibited from entering the water; you can even be fined for trying to do so. If there are surfers nearby, don't swim too close to them, as this could be dangerous for both you and the surfer. Jellyfish are sometimes a problem in OBX waters. If you are stung, you might want to try a couple of home remedies, such as sprinkling vinegar or meat tenderizer on the affected area.", "The best way to get around Outer Banks is by car. The islands stretch about 130 miles, which means attractions are relatively spread out. Having your own wheels will give you the freedom to check them out at your leisure. The North Carolina Department of Transportation runs a ferry service, but its routes are limited and the ferries can get crowded (especially during the peak season). The closest major airports are Norfolk International Airport (ORF) in Norfolk, Virginia (about 120 miles north), and Raleigh-Durham International Airport (RDU) in Morrisville, North Carolina (about 230 miles west). Both airports offer car rental agencies on-site. "]}