{"name": "Richmond", "description": ["Richmond is definitely a paradox. American history buffs celebrate it as a pivotal city in our nation's 18th-century fight for independence and our 19th-century fight to remain unified. But 21st-century Richmond is populated with college students (both Virginia Commonwealth University and the University of Richmond call the city home), hipsters and young families. You can step back in time at St. John's Church, where re-enactors perform Patrick Henry's infamous, \"Give me liberty, or give me death!\" speech. Or take a tour of the Virginia State Capitol to see how the city's past continues to shape its future.", "And when you're ready to return to the present, you'll find that Richmond is also home to boutique-y shopping areas (check out Carytown), quirky coffee shops and bars, and sophisticated martini lounges, and art galleries. So please, embrace both sides of this capital city's coin; spend a few days exploring the history and a few nights uncovering its burgeoning social scene.", "The best time to visit Richmond is from April through June. Not only will you experience pleasant temperatures, but you'll also encounter few crowds as area colleges wind down for the summer. Fall is another great time to visit as the city is brimming with fall colors, and sampling local fall-themed beverages (both beers and coffees) is a great way to pass an afternoon. Winter can be a nice time to visit, particularly during the holidays when the city is aglow in Christmas lights. Visiting in the summer means battling other tourists and Virginia's muggy weather. ", "There's a lot more than history Richmond is considered one of America's most historic destinations, but it also boasts plenty of outdoor adventure. Hike, bike, climb or fish on Belle Isle or head to the James River for some kayaking, paddleboarding or guided rafting trips from Riverside Outfitters. ", "There's lots of good food The River City is often overshadowed by other Southeastern favorites like Charleston or Washington, D.C., but Richmond is a foodie destination in its own right. Read up on local and traveler favorites in our dining guide.", "Rent two wheels instead of four Many of downtown Richmond's top attractions, including the Virginia State Capitol, the Virginia Museum of Fine Arts and the American Civil War Museum, can be reached via bike. ", "Find a discount Richmond Region Tourism, the city's tourism board, lists discounts and packages for attractions, hotels and dining. Check its website to see up-to-date deals.", "Foodies in the know already have Richmond on their radar. But with neighboring culinary meccas like Washington, D.C., and Charleston, South Carolina, often overshadowing Virginia's capital, it's easy to see why many travelers arrive in Richmond with low expectations. What they find on arrival, however, is a city bursting with American favorites and international cuisine.", "Richmond's Black community has made an indelible mark on the city's culinary scene. Croaker's Spot, named for beloved Richmond local and food connoisseur Mr. Croaker, is a local institution serving up hearty seafood helpings enjoyed by locals and visitors alike. Shrimps and Jackie's Restaurant are two other favorites for Southern cooking and soul food. Addis, an Ethiopian restaurant, is another favorite. It wins rave reviews for both authentic cuisine and a variety of vegetarian options. On a gluten-free diet? Stop by 521 Biscuits & Waffles. The eatery supplies patrons with decadent waffles and biscuits that are all made without gluten. For a full list of Black-owned restaurants, check out BLK RVA's dining page. If you plan a visit for March, be sure to check out Richmond's Black Restaurant Experience during which you can taste food crafted by some of the area's best Black chefs and watch cooking demonstrations or attend other food-themed events.", "Other must-try spots include Rappahannock (try the Chesapeake Bay oysters), Heritage (indulge in the pork fries) and The Roosevelt (be prepared to share the pork rind nachos). To save on meals at some of the city's best restaurants, consider visiting during its biannual restaurant week, which usually takes place in April and October.", "Eating isn't all you'll do here. Richmond is home to a burgeoning brewery scene. You'll want to start your beer journey in Scott's Addition, a neighborhood northwest of the city's center. In this area, you'll find several breweries within walking distance of one another, including The Veil Brewing Co. and Väsen Brewing. Luckily for those on a gluten-free diet, Scott's Addition also boasts a few different cideries.", "The best ways to get around Richmond are by bike, on foot and via the GRTC Pulse. RVA's bike-share program makes it easy to borrow a bike and cruise around the city. The city is also highly walkable and will let you see Richmond's architecture up close. The Pulse line of the local bus system runs straight through the city to hit all the major sights. A car will come in handy to visit some attractions – namely Kings Dominion – or if you want to give your feet a break. Alternatively, you can get around via rideshare or taxi.", "Richmond International Airport (RIC) is located about 10 miles southeast of downtown. You can take a taxi, the bus or rent a car to get you from the airport to downtown. Amtrak also has two stations in the city. The Main Street Station is located downtown, while the Staples Mill Road Station is 8 miles northwest of downtown."]}