{"name": "The Azores", "description": ["The Azores (pronounced \"ah-SORSH\" by locals) is the kind of place you'd imagine to be the backdrop of a fantasy novel. That kind of end-of-the-earth setting where the characters encounter mystical creatures, bewitching lands and elixirs that give you magical powers. In a way, the Azores is that fantastical place. The Azores, a group of nine islands located about 1,000 miles off the coast of mainland Portugal, were formed by a series of earthquakes and eruptions that took place thousands of years ago. Its Atlantic climate has given way to evergreen vegetation to take hold of its remaining debris, resulting in landscapes that are otherworldly and ripe for exploration.", "In the Azores, you'll find its islands dotted with miles-long calderas enshrouded in tropical foliage, filled with multi-colored lakes, centuries-old Portuguese villages, or all of the above. In the water, you'll find one-third of the world's cetacean species at any given time. And if you take a trip to Furnas Valley on São Miguel island, you can take a dip in thermal pools that contain minerals produced from a dormant volcano, which are believed to help with issues ranging from allergies to anemia. Whichever way you decide to take in the magic of the Azores, know you'll be hard-pressed to find a place like this anywhere else in the world. ", "The best time to visit the Azores is June through August. During this time, temperatures are at their highest, cloudy days are fewer and farther between and the likelihood of rain is low. If you're looking for that island getaway that's full of sunshine and warm weather year-round, know that the Azores is not that kind of destination. The Azores' placement in the middle of the Atlantic (1,000 miles from the coast of western Portugal), means you'll be greeted with mild temperatures and rain throughout the year. No matter which month you choose to visit, understand that the weather is known to be unpredictable, even during the summer. Pack layers, sturdy, waterproof shoes and always bring an umbrella.", "Weather is unpredictable The Azores is a rainy destination. Even during the dry season, you could be subject to unexpected showers, as well as clouds and fog. Plan to pack a light jacket, umbrella and rain boots and use the Spotazores app to track conditions.", "This isn't a beach destination Because of its volcanic history, the beaches here are largely small and rocky, with some considered unsafe for swimming. Plan to visit a few but don't make it the focus of your stay.", "Sustainability is important The government and locals are keen on preventing the Azores from falling prey to overtourism. As such, be mindful of your impact as a tourist by picking up after yourself and respecting posted signs and rules while visiting natural attractions.", "Stick to one island While each island has its own set of beautiful natural wonders, hopping from island to the next will add up in both travel and accommodation costs.", "Visit during the offseason While some activities may be limited between November and February, you'll likely snag travel deals simply because everyone visits during the summer.", "The Azores are an autonomous region of Portugal. The islands largely adhere to the same cultural norms as mainland Portugal: Portuguese is the primary language and the currency is the euro. Americans don't need a visa to reach the Azores, only a passport that is valid for six months past their departure date. Plus, much like the rest of Europe, most locals speak English as a second language and tipping in restaurants isn't required. ", "Key differences between the Azores and mainland Portugal surface when it comes to sustainability. Tourism is more regulated by both the locals and the government compared to other European vacation destinations. Here, there are rules regulating the number of hotel rooms available on each island and certain attractions, including Pico Mountain, limit the number of visitors it admits. So, if you're headed to the Azores, do as the locals do and respect the lands you are about to explore.", "For such a remote archipelago, the Azores are surprisingly self-sustaining. The region boasts a wide-ranging bounty that's not only able to provide its residents with plenty of local goods, but also give visitors a taste of something they won't find anywhere else. This is especially true with one of the island's most famous dishes, cozido de Furnas. Found in the volcanic neighborhood of Furnas on São Miguel Island, cozido de Furnas is a hearty stew made of vegetables and various meats, including beef, chicken and sausage. While this may sound just like any other stovetop meal, this version is unique in that it's cooked in the ground among the fumaroles of Furnas. In other words, the naturally emitting heat from the earth is cooking the stew.", "The Azores has many local delicacies that will please any palate. Local tea, coffee, wine, cheese, seafood, fruit and beef are all must-tries here. The Azores houses both the only tea plantation in Europe as well as the continent's largest coffee plantation. Plus, the region's wine country on Pico Island holds a UNESCO World Heritage Site designation. While here, seek out the popular Frei Gigante white wine and the Terras de Lava red wine. And if you happen to be on Pico Island during your trip, visit the Azores Wine Company for tastings.", "You can't have wine here without cheese. In addition to scenic landscapes, the Azores is filled with dairy cows. In fact, it's the island's landscape that makes the flavor of the dairy produced here distinct and delicious. In the Azores, cows are free-range their whole lives. And when it's time to procure milk, the extraction machines are brought directly to the cows, wherever they are. This, in combination with the animal's grass-fed diet, produces remarkable dairy products. If you're on Terceira Island, go to Angra do Heroísmo's Vaquinha factory, where you can watch the cheese-making process and sample some of the island's best. You can also find local cheese all around the island, just make sure to ask for local cheese when out at restaurants.", "Last but not least, the seafood. You'll find plenty of fish, including unique pink-hued tuna, but also many unique creatures, including barnacles (cracas) and sea snails (lapas). Locust lobsters are also a specialty here that is not to be missed thanks to their tender meat. After you've indulged in the region's savory offerings, don't forget to try its sweet treats, specifically fruit. The island's famously small, yet sweet pineapples are a great way to cleanse the palate after an amazing meal. ", "The best way to get around the Azores is by car. A rental car allows you travel with complete freedom, as buses around the islands can be unpredictable and cater more to locals than visitors. Plus, taxi fares will add up fast. As for the best interisland transportation, that depends entirely on the island you want to travel to and from. Ferries can be fun and cost-effective if you are traveling to a neighboring island, but some of the outer islands are best reached by plane.", "To get to the Azores, it's best to fly into João Paulo II Airport (PDL) at Ponta Delgada, the capital of São Miguel, the Azores' biggest island. Because of its remote location, direct flights to the Azores from destinations outside Portugal are limited, so you should expect to take at least one connecting flight.", "U.S. Citizens will need a valid passport to travel to, from and within Portugal. Your passport must be valid for six months beyond your stay; you won't need a visa unless your trip extends beyond 90 days.  For up-to-date information about foreign exit and entry requirements, visit the U.S. State Department's website."]}