{"name": "Salt Lake City", "description": ["Salt Lake City has long been a little mystical. Back in the early 19th century, pioneers believed the area's Great Salt Lake was inhabited by monsters and giants. This spooky legend faded until Brigham Young decided to make Salt Lake the home of the new Church of Jesus Christ of Latter-day Saints in 1847. Today, those who have spent time in Salt Lake will tell you that it's more than just a place of great faith, it's also a thriving cultural hub and an excellent home base for hikers and skiers.", "Many visitors embrace the chance to learn about the Church of Jesus Christ of Latter-day Saints, spending time touring the beautiful religious sites in Temple Square. And even if you aren't interested in Salt Lake's heritage, the city is worth a visit for the views alone. The Wasatch and Oquirrh mountain ranges provide a stunning backdrop to the city skyline while the magnificence of the Great Salt Lake is nothing short of awe-inspiring.", "The best time to visit Salt Lake City is September to October. The kids are in school and the skiers have yet to arrive, so you'll have the city – and all of its discounted hotel rooms – to yourself. Springtime is another sweet spot for bargains, but snowmelt coupled with higher precipitation levels can lead to soggy conditions. Winter marks the peak season with skiers flooding the region's slopes, while summer draws outdoorsy travelers looking to take advantage of the hiking trails and lake activities.", "Everyone's welcome here The Church of Jesus Christ of Latter-day Saints fully supports the city's anti-discrimination laws that were passed in 2010. As a result, LGBT communities are beginning to thrive.", "Ask about package deals Many Salt Lake City hotels cater to skiers during the winter, offering stay-and-ski packages with discounts on room rates and lift tickets.", "Enjoy the show Temple Square hosts a variety of free events, including organ recitals in the Tabernacle and performances by the Mormon Tabernacle Choir.", "Salt Lake City has a more diverse food scene than many first-time visitors might expect, with a variety of cuisines for every taste. Whether you're craving Mexican or Italian, you'll find Salt Lake City delivers. Red Iguana, a traditional Mexican restaurant, has long been a highly-regarded spot, earning rave reviews for its food and service since opening in 1985. Meanwhile, burger lovers will want to stop by Crown Burgers, a local chain established in 1978 famous for its charbroiled quarter-pound patty topped with Thousand Island dressing, lettuce, tomato, onions, cheese and cured pastrami. And for a more upscale experience, Valter's Osteria receives high marks for its modern Italian cuisine, tableside service and its warm and welcoming staff. HSL, an American restaurant with a focus on seasonal ingredients, also earns praise from both critics and amateur foodies for its locally sourced menu and inventive cocktails.", "When you're out and about, consider sampling some of the state's signature dishes. Local favorites include Navajo tacos, which are made with fry bread instead of tortillas, and fry sauce. The perfect complement to french fries, this Utah condiment – which has a similar taste to Thousand Island dressing – is made with ketchup, lemon juice, eggs and some secret ingredients. You'll find every establishment has its own twist on these local classics.  ", "The best way to get around Salt Lake City is by public transportation and with a car. The Utah Transit Authority offers several affordable transit options for exploring the city. However, if you're looking to get out of town to the nearby ski and wilderness areas, you will need your own set of wheels. You can rent a car in town or at the Salt Lake City International Airport (SLC), which is located about 6 miles west of downtown. Taxis from the airport to downtown cost between $25 and $30.", "The Salt Lake Temple is one of the city's most recognizable landmarks and the towering six-spire structure is the universal icon of the Church of Jesus Christ of Latter-day Saints."]}