{"name": "Louisville", "description": ["Sports lovers might experience a bit of overload in Louisville. This north-central Kentucky town claims a lot of legends. It's the hometown of the greatest baseball bat (the Louisville Slugger), the greatest horse race (the Kentucky Derby) and the Greatest, period (boxer Muhammad Ali). But there's more than just a competitive spirit, as this Ohio riverfront city also has a lot of Southern charm and history. Here you'll find America's largest Victorian neighborhood, the world's only underground zip line course and the world's largest baseball bat, among other quirky superlatives.", "It's the place to slowly sip a fine bourbon – or maybe a mint julep if that's more your speed. It's where you wear a wide brim hat and seersucker, enjoy a few bluegrass tunes and just be. Welcome to \"Louavull.\"", "This is the home of the Urban Bourbon Trail Since Evan Williams marketed his first whiskey in the city in 1780, Louisville has been a hot spot for distilleries. Set out on the Urban Bourbon Trail to learn about the history of Louisville's bourbon heritage and to sample some of the city's best.", "Skip the Derby Hotel prices skyrocket the first weekend in May for the annual race. Avoid the crowds and inflated rates by booking your Louisville trip before or after the big event.", "Get the Main Ticket Pay one price for this ticket and enjoy access to six attractions, including the Louisville Slugger Museum, the Muhammad Ali Center and the Frazier History Museum.", "Enjoy free art Some of Louisville's most prized cultural institutions, including the 21c Museum (located in the hotel of the same name) and the annual Kentucky Shakespeare festival are both free to the public.", "Louisville's dining scene is perhaps best known for three things: barbecue, bourbon and mint juleps. Locals and visitors alike recommend Mark's Feed Store and Feast BBQ. If it's bourbon you're after, head to the Evan Williams Bourbon Experience, situated on downtown Louisville's historic \"Whiskey Row.\" It features an artisanal distillery, guided tours and educational bourbon tastings. Or, to get a comprehensive sampling of the city's bourbon cache, set out on the Urban Bourbon Trail, a guided set of stops through Louisville's bourbon heritage and its best bourbon bars. And, of course, no trip to Derby City would be complete without having at least one mint julep. Visitors love the version concocted by The Brown Hotel.", "After you've sampled the city's signature libations and barbecue, branch out and explore the rest of the Louisville culinary scene. Jack Fry's earns praise for its long history (it was established in 1933), its live music and its inventive Southern fare. Visitors say this is a great date night spot. For even more Southern-style comfort food, make a reservation at Harvest, praised for its farm-to-table menu. When you've had your fill of Southern cuisine, head to Havana Rumba for authentic and affordable Cuban dishes."]}