{"name": "Victoria & Vancouver Island", "description": ["Although it's only a 90-minute ferry ride from bustling Vancouver, British Columbia's capital city may as well be a world away. Taking the opposite approach from its youthful neighbor, Victoria exudes a quainter atmosphere. Resting on the southern tip of Vancouver Island, This relatively small city remains deeply rooted in its Colonial past, relishing distinctively British traditions like afternoon tea at the Fairmont Empress and a pint at the pub. But that doesn't mean this destination is strictly reserved for Anglophiles. Despite its nostalgic tendencies, this city attracts a variety of travelers with excellent museums that celebrate its aboriginal heritage, charming architecture and fantastic harbor views (often interrupted by the surfacing of a whale).", "But don't limit yourself to the (admittedly kitschy) Inner Harbour – there's much more to this region than manicured gardens and afternoon tea. Vancouver Island is also known for its stretching beaches and verdant wineries. From downtown Victoria, drive to Sooke – a vibrant boating and fishing town – or make your way out to the Cowichan Valley, where you'll find rows of vines laden with grapes. Just make sure to bring your camera, as the scenery is sure to delight even the most jaded traveler.", "The best times to visit Victoria and Vancouver Island are March to May and September to November. The region sees some of the country's mildest weather and the driest summers, so while you might experience a light drizzle here and there, plan on comfortable temperatures in the spring and fall. Summer is by far the most popular time to visit thanks to the numerous festivals that take place in Victoria and across Vancouver Island. This area also welcomes a respectable number of winter travelers due to its proximity to Canada's prominent ski destination, Whistler. You'll enjoy the most whale sightings if you time your visit between April and October.", "Victoria's culture is defined by its early settlers, specifically the First Nations people and the Brits. Before Capt. James Cook arrived on Vancouver Island in 1778, the First Nations people (aboriginal Canadians who are neither Inuit nor Métis) settled in Southern Vancouver Island. Centuries later, Victoria is still influenced by aboriginal culture, with many First Nations groups calling Victoria and Vancouver Island home. To learn more about aboriginal culture and heritage (and to view an impressive collection of totem poles), head to the Royal British Columbia Museum.", "To sample a bit of English tradition, indulge in afternoon tea. You'll find a variety of tea houses around Victoria, but the afternoon service at the Fairmont Empress is perhaps the most famous (and most expensive) the city has to offer. Wherever you go, you'll enjoy pastries, scones and delicate sandwiches to nibble on as you sip from your floral printed tea cup. ", "Cultural traditions aside, American travelers will find little difficulty navigating British Columbia's capital city. English and French are the country's two official languages, but most Victoria residents speak English, and you won't need to know any French to effectively get around. Victoria's official currency is the Canadian dollar, which is currently about 75 cents to the U.S. dollar. Since the exchange rate fluctuates, plan to check what the current exchange rate is before you go. Avoid exchange fees by withdrawing Canadian money directly from an ATM in Victoria. When purchasing goods or services in Victoria (and throughout the province), expect to pay a 12 percent tax on top of the displayed price. Weight is measured in metric units; distance is measured in kilometers – pay close attention to this if you've decided to rent a car.", "Thanks to Victoria's coastal location and access to the farming regions of the Saanich Peninsula and Cowichan Valley, Victoria and Vancouver Island are a foodie's paradise. Let's start with afternoon tea, which is a must-do, according to visitors and locals. This tradition, which the city inherited from the region's European settlers, can be as grand or as simple as you want. It all depends on the teahouse you choose. On the extravagant end of the spectrum, there's the Fairmont Empress. It'll cost a pretty penny, but the formal, elegant atmosphere of this turn-of-the-century hotel will transport you back to a time when afternoon tea was a daily event for those in Victoria high society. Other favorites include the Teahouse at Abkhazi Garden, Adrienne's Tea Garden and White Heather Tea Room.", "When you've had your fill of tea and finger sandwiches, expand your gastronomic tour of Victoria by sampling the city's fresh seafood. Red Fish Blue Fish, which sits on the waterfront on the Inner Harbour in an upcycled cargo container, is a favorite among visitors for its variety of fish and chips (choose from salmon, cod, halibut and oysters). Other seafood favorites include Fishhook, Blue Crab Seafood House and Ferris' Upstairs Oyster Bar.", "Along with its fresh seafood, Victoria excels at offering a bevy of international cuisine. For Italian, locals and travelers recommend Il Terrazzo, which is beloved for its classic Italian menu and cozy interior (it boasts six brick fireplaces). Recent visitors highly recommend Saveur for its French-inspired contemporary cuisine using local ingredients. And if you're after Mediterranean flavors, head to the family-owned Ithaka Greek Restaurant (diners especially loved the lamb).", "The best way to get around Victoria & Vancouver Island is by bike or car. Central Victoria – especially the Inner Harbour – can easily be explored on foot, while bike paths will lead you to less touristy neighborhoods. Victoria also features a comprehensive transportation system, and ferries connect the city to other towns on Vancouver Island. If you're not looking for a heavy workout, a car is the best way to get from Victoria to other points of interest like Butchart Gardens or the Cowichan Valley. You can rent a car at the Victoria International Airport (YYJ), located about 16 miles north of the city center. If you've rented a car in Vancouver and are planning to use it in Victoria, you can load it onto the ferry. Keep in mind: Parking fees at area hotels can be high.", "A passport is required for citizens of the United States to travel to Canada, and to re-enter the country. If you are planning to drive, you must produce a passport, passport card or NEXUS card that allows expedited border crossings for both private and commercial travelers through Canadian and U.S. border controls. For more information, visit the U.S. State Department website."]}