{"name": "Myrtle Beach", "description": ["The clean beaches are the main draw in Myrtle Beach, South Carolina, but there's more to this vacation hot spot than its 60 miles of brown sand. One of the most popular East Coast family vacation destinations, Myrtle Beach boasts amusement parks that offer everything from water slides to roller coasters to race tracks. While the shopaholics of the family spend time at the outlet malls, golfers of all skill levels can flock to one of the area's more than 100 courses, and then the whole family can enjoy pirate or medieval-inspired revues during dinner. When you're not on the beach, attractions like Ripley's Aquarium and the Broadway Grand Prix can entertain family members of all ages. Plus, there's a minor league baseball team for sports lovers. In short, Myrtle Beach is the ideal destination for budget-minded families looking for a multitude of entertainment options on a budget. ", "The best time to visit Myrtle Beach is from June to August when the weather is just right for enjoying the beach. You can expect some afternoon rain showers during this time of year (especially July), and keep in mind that the region's hurricane season will last from June through November. You'll also experience some warm temperatures and slightly cheaper rates if you visit March through May, but you may have to contend with spring breakers from area colleges crowding the beach and nearby hotels. Autumn ushers in room bargains and cooler temperatures that range from the high 70s to the mid-40s. During winter, chilly temperatures introduce the lowest rates (and zero crowds), but be aware that some area attractions and restaurants will be closed or offer reduced hours. ", "Look out for jellyfish The marine pest is common in these waters. If you're stung, wash the afflicted area with saltwater and either see a lifeguard or head to the hospital immediately.", "Southern hospitality is alive and well The people here are laid-back and friendly, peppering their conversation with polite niceties like \"sir\" or \"ma'am.\"", "Rent a home If hotel rates are too pricey, consider reserving a vacation rental. Not only is it a cost-effective option for large groups, but with your own kitchen, you have an affordable dining-in option too.", "Visit the tourism board Myrtle Beach's Tourism Board has coupons for all sorts of attractions, restaurants, shopping and more. There are visitors' centers in the bus terminal, in the airport and on North Oak Street. Visit its website for more information.", "Visit in the offseason Hotel rates jump sky-high in summer. Consider visiting in the fall or even the winter. You'll be able to find more cheap hotel rates this time of year, and a bevy of holiday events will keep you entertained if the beach is too cold.", "Chain restaurants – including Hard Rock Café, Senor Frog's and Jimmy Buffett's Margaritaville – are all over Myrtle Beach. If you are looking for a diverse and innovative foodie scene, this is not where you want to go. But one thing the city doesn't lack is variety. A large selection of restaurants is located along Kings Highway (U.S. Highway 17), so much so that it's often referred to as \"Restaurant Row.\" A decent number of locally owned eateries can also be found, with the predominant cuisine theme being seafood. Mr. Fish, Captain George's Seafood Restaurant and Sea Captain's House are all well-reviewed spots.", "The best way to get around Myrtle Beach is by car. If you're going to spend most of your time around the beachfront hotels, you can easily manage on foot. However, a car is handy for traveling farther distances since the bus is your only public transportation option. Car rental agencies are located just beyond the baggage claim area in Myrtle Beach International Airport (MYR), and plenty of taxis and hotel shuttle services are lined up outside the terminal."]}