{"name": "Melbourne", "description": ["More than four million people call this big small town home. Yes, Melbourne is a big small town, and no, it's not an oxymoron. See, it contains all the trappings of a major metropolis – vibrant neighborhoods, award-winning cuisine, notable things to do – but Melburnians manage to do their urban hustle at a leisurely pace. Burrowed in wine country beside Port Phillip Bay, Melbourne's natural landscape anchors its laid-back personality. When you're sampling wine in the nearby Yarra Valley or sipping a flat white at one of Melbourne's charming sidewalk cafes, there's no way you can't relax.", "That said, don't be mistaken: There are some high-octane activities awaiting you. The nightlife is epic, with diverse venues ranging from bumping clubs to hole-in-the-wall concert stages. It's also a powerhouse for sports; one visit to the Melbourne Cricket Ground will cement that in your mind. For travelers who want a seemingly paradoxical vacation – a stress-free vibe in an exciting metropolis – Melbourne is the place for you.", "The best times to visit Melbourne are between March and May and September and November. These shoulder seasons feature moderate temperatures and tourist crowds, plus lower airfare rates. In the summer months (North America's winter months) of December to February, Melbourne bursts at the seams with hot, sweaty tourists, while June through August (Melbourne's winter season) affords cold weather and fewer travelers.", "Melbourne is much smaller than Sydney, but this southern Australia city exudes the same joie de vivre. The events capital of Down Under attracts families and casual travelers with its laid-back vibe.", "Americans find it easy to adapt to the Melburnian way of life for several reasons. Firstly, the official language here is English, meaning there's no language barrier to overcome. Secondly, the official currency – the Australian dollar – is worth a little less than the U.S. dollar, so you'll be able to afford the city's food, accommodations and attractions.", "One stressful factor here is getting behind the wheel of a car. Driving can feel quite erratic. First, the Aussies drive on the left side of the road. Melbourne also permits hook turns (or turning from the farthest lane across all traffic lanes), which is opposite of what you'll find in the U.S. For more information about driving, check out Melbourne's Getting Around section.", "Sports are a way of life in Melbourne. We highly recommend a visit to the Melbourne Cricket Ground to watch a footy (or rugby) match or a cricket game. Keep in mind that Melburnian footy follows Australian Football League (AFL) rules, while Sydney and Brisbane's most popular form of footy abides by National Rugby League (NRL) rules.", "Melbourne is a city of cafes. You'll find them tucked within central Melbourne's alleyways and clustered together throughout trendy neighborhoods like South Yarra-Prahran, St Kilda and Fitzroy. Try a flat white, an Australian coffee specialty that's similar to a latte but with more espresso and less milk. Popular coffee shops include Brother Baba Budan and Café Andiamo in the central business district and Two Birds One Stone Cafe in South Yarra-Prahran.", "Though most of the city's residents were born in Australia, Melbourne's sizable British, Indian, Chinese, Italian and Greek communities have greatly influenced the area's culinary offerings. (In fact, Melbourne is home to the largest Greek-speaking population outside of Europe.) Three neighborhoods – Chinatown, Lygon Street (also known as Little Italy) and the Greek Precinct – specialize in Chinese, Italian or Greek shops and restaurants. As a result, you'll find an array of top-notch ethnic fare throughout the city.", "For some of Melbourne's best Asian bites, head to Chinatown to eat at Rice Paper Scissors or Longrain. If you're craving Italian, consider dining at Scopri or Da Guido Melbourne la Pasta, both of which sit on or near Lygon Street. Some of the Greek Precinct's best Greek specialties are offered at Stalactites, while modern Greek fare like crab souvlaki (a kabab-style dish traditionally made with lamb) and pork-stuffed spanakopita (a savory pastry with layers of spinach, feta cheese and phyllo) can be found at Gazi Restaurant and The Press Club in the CBD. Other ethnic favorites include the Armenian-focused Sezar, the Middle Eastern- and Mediterranean-influenced Maha and the British-inspired Dinner by Heston Blumenthal.", "But if you're looking for an Australian-style meal made with local ingredients like Wagyu beef, barramundi (a type of fish found throughout the country) and blue mussels, you're in luck: Melbourne offers a variety of Australian eateries. Most of the city's favorite Australian restaurants, including ezard and Eau De Vie, reside in the CBD.", "Melbourne also makes some of Australia's best wine (for travelers who are 18 and older). Five wine regions – the Yarra Valley, Mornington Peninsula, Geelong, Sunbury and the Macedon Ranges – are located within 50 miles of the city. Hundreds of wineries can be found throughout these wine regions, all of which specialize in chardonnay, shiraz and pinot noir. Other wine varieties like pinot grigio and cabernet sauvignon are produced at select wineries as well.", "The best way to get around Melbourne is by tram. Trams operate throughout the day and offer multiple routes that criss-cross the city. There's even a free tram designed just for tourists. You can also board Melbourne's buses and trains with the same myki ticket that you'll use for trams. While taxis and rental cars are available, they'll both cost more than public transportation. To avoid the hassle of adjusting to Melbourne's quirky road rules, it's best to avoid driving here.", "The Melbourne Airport (MEL) is about 16 miles northwest of downtown Melbourne. You can take a SkyBus from the airport into the city for AU$19 ($15). You can also hire a taxi or rent a car.", "A valid U.S. passport is required to enter Australia. You can stay in the country for up to 90 days as long as you acquire an Electronic Travel Authority (ETA), an electronic visa that costs AU$20 ($15) and can be obtained here. Airlines and travel agents may also apply for ETAs on your behalf. For more information, visit the U.S. State Department's website."]}