{"name": "São Paulo", "description": ["This massive megalopolis of more than 20 million people makes São Paulo one of the largest cities by population in the world. São Paulo (also known as Sampa by its residents) is characterized by its trademark wide avenues and uniquely designed skyscrapers, which showcase its modern appearance. Whether you're interested in exploring museums and parks or discovering the culinary scene, this cosmopolitan city has something for everyone.", "So what's the first thing to do? Take in São Paulo's stunning cityscape from the top of the Edifício Itália, which provides a breathtaking panoramic view of this bustling city. Nearby, you can browse the gourmet foods and grab a bite to eat at Mercado Municipal de São Paulo. Also in this neighborhood, the neo-Gothic Catedral da Sé de São Paulo may catch your eye with its enormous spires or the gorgeous Theatro Municipal de São Paulo might pique your interest with is detailed facade.", "Next, make your way to Avenida Paulista for a stroll – it's one of the city's premier streets, filled with shops, hotels and the Museu de Arte de São Paulo, home to collections from artists like Vincent van Gogh, Rembrandt, Picasso and Degas. When you tire of the concrete jungle, head to the Parque do Ibirapuera, which offers a relaxing escape from São Paulo's hectic streets and sky-high buildings.", "The best time to visit São Paulo is from March to May or October to November (the fall and spring shoulder seasons) when the temperatures are comfortable, the city sees less precipitation (and less haze) and premier events are in full swing. Because it's located in the Southern Hemisphere, the city sees opposite seasons from those in the Northern Hemisphere (like the United States). Summer in São Paulo (December to February) is hot and wet, with highs hovering around the 80s, while winter (from June to September) sees comfortable temperatures and little precipitation, making it the high season. Overall, the weather year-round in São Paulo is pleasant, with temperatures rarely dipping below 50 degrees Fahrenheit.", "Sports reign supreme Soccer or futebol is quite popular in São Paulo and the city has several clubs. Consider seeing a game or exploring the Museu do Futebol.", "Watch where you go Avoid cortiços, the inner-city slums, and favelas, shantytowns on the outskirts of the city. These are dangerous areas where drug use, violence and crime are widespread.", "Stay alert Be aware of your surroundings. São Paulo has a reputation for crime, including armed robberies, pickpocketing and muggings. Leave valuables like laptops and jewelry at home, and keep your cellphone concealed. Carry a copy of your passport with you and leave your passport in your hotel room's safe.", "Stick to two feet Walk or use the metro to maneuver around the city during the day. It's easy to navigate and tickets are inexpensive. However, at night it's safest to take a taxi or an Uber.", "Paulistanos, or residents of São Paulo, are known as a work-hard, play-hard bunch. Because Sampa (the city's nickname) is the financial and industrial hub of Brazil, it is filled with people of many different backgrounds. Portuguese is the official language, though Paulistanos know some English and many understand Spanish. You should probably learn some essential phrases in Portuguese to help you while you're visiting: olá (hello), bom dia (good morning), ó desculpe (excuse me), não compreendo (I don't understand), por favor (please), obrigado/a (thank you), Você fala inglês? (Do you speak English?) and Onde está o banheiro? (Where is the bathroom?) are a few to memorize. Also, write down the addresses of destinations in case you need to ask for help finding locations.", "People in São Paulo typically don casual and comfortable clothing, but seeing as the city is a hotbed for fashion, you'll also notice many Paulistanos dressed to the nines in colorful attire. Since the city is a commercial hub, too, you'll encounter businessmen and women wearing suits to work.", "When it comes to money, São Paulo's official currency is the real (BRL); since the real to U.S. dollar exchange range fluctuates, check what the current exchange rate is before you go. Major credit cards are also accepted at most restaurants, hotels and shops, though in smaller eateries and stores you may have more difficulty using a credit card. (Also, keep in mind some ATMs may not accept international debit cards.) Tipping in Brazil isn't required (a tip of around 10 percent is usually included as a service charge on the bill in restaurants), but it is appreciated. If the service charge isn't included on your bill, a tip of 10 to 15 percent should suffice.", "As with many of the world's large metropolitan areas, Sao Paulo does have a dangerous side that can plague the unsuspecting tourist. Kidnappings, murders, rapes, muggings and robberies are not uncommon. Travelers should take several precautions to protect themselves while in the city, especially around the tourist areas and at night. Some tips: Do not wear expensive jewelry or watches. Travel with only as much cash as you'll need each day and leave the rest (and your passport) at your hotel or apartment. Keep wallets, purses, cellphones and cameras concealed and stay alert when you need to pull money out. If you're traveling with a laptop, be especially careful to conceal it in a backpack or your luggage. (Laptops are the No. 1 target of criminals in the city.)", "Because the city is a melting pot, you can find cuisines from around the world in São Paulo. However, chances are you'll be looking for a traditional taste of Brazil. Try Mani or D.O.M., both of which consistently earn spots on the World's 50 Best Restaurants list (as voted on by world-renowned chefs, restaurateurs and restaurant critics). Earning its second Michelin star in 2018, Tuju is a standout for its innovative and exquisite seasonal cuisine. These venues spotlight Brazilian cuisine through robust flavors and authentic foods but are typically expensive and booked weeks – if not months – in advance.", "Steakhouses (aka churrascarias) are another staple in Brazil and some of Sampa's best include Varanda Grill (travelers say steaks here are seasoned well and cooked \"to perfection\") and Barbacoa (visitors praise the salad bar in addition to the meat). Other eateries that win favor with critics, residents and travelers range from Italian classics at Bráz Pizzaria to Japanese fare at Kinoshita. Another excellent option is A Casa do Porco, one more restaurant on the world's best, which serves up pork, in creative and inventive ways to huge success.  ", "If you're looking for more casual or affordable eats, check out one of São Paulo's lanchonetes, which offer savory, light meals for cheap, or swing by a sandwich bar for a mortadella sandwich (a heaping mound of thinly sliced Italian mortadella sausage and provolone cheese on a sourdough roll) and an ice cold chop (beer). Travelers say the best sandwiches can be found in the Mercado Municipal. Whatever your budget, a great way to start any meal is with a refreshing caipirinha, Brazil's national cocktail made with sugar cane liquor, sugar and lime.", "The best way to get around São Paulo is on foot or via metro. If you plan out your itinerary in advance and group visiting popular attractions, you should be able to traverse between them on your own two feet. The metro is also a fast, clean, relatively safe and efficient option, and connects travelers to many of the city's beloved sights. At night, taxis or Ubers are the best way to get around and likely the best way to get from São Paulo–Guarulhos International Airport (GRU) into the city center, which is about 15 miles southwest (but always factor extra time for the city's notorious traffic). Congonhas Airport (CGH) also services the city with domestic flights; it's located around 5 miles south of the downtown area and will likely be the airport you use to travel to and from Rio de Janeiro (the majority of its flights are to Rio).", "U.S. citizens must present a valid passport and a tourist visa upon entering Brazil. You can apply online or through a Brazilian consulate in the U.S. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}