{"name": "Capri", "description": ["The rugged cliffs and crystal clear waters of the small island of Capri seem to be created straight from dreams and mythology. It's rumored to be where the seductive sirens sang to Odysseus and his sailors in Homer's \"The Odyssey,\" and we can see why their offer was so tantalizing. From bright green trees and gardens to colorful marinas and squares, Capri is a paradisiacal destination every bit as beautiful as artistic renderings make it out to be. The small getaway in the Bay of Naples has been a hot spot for royalty and celebrities since the Roman times. Thus, it is flush with world-class restaurants, breathtaking hikes, five-star hotels and chic shops. Whether you're visiting for a daytrip or for a month-long vacation, you'll be smitten with the laid-back charm of Capri and yearn to return as soon as possible.", "A popular way to see the natural wonders of this Southern Italian island is by boat. Popular attractions such as the Blue Grotto, Green Grotto and Faraglioni can be seen during a short trip circumnavigating the island. But you can easily stay on land to have a good time as well. Two walkable and attractive towns, Capri and Anacapri, have shops, historical attractions and restaurants littered within their winding streets. And two picturesque beaches sit on either side of the island at either Marina Grande or Marina Piccola. If you're a history buff, you can visit multiple museum complexes showcasing Capri's storied past. And if you enjoy getting outside and finding the perfect view, you can either take the chairlift up Mount Solaro or take a hike to the Natural Arch. Just remember to bring your camera, because you're going to want to keep memories of your trip to Capri for a lifetime.", "The best times to visit Capri are May, September and October. During these months, crowds are much thinner than in the summer and temperatures still hover above 60 degrees. Summer yields fantastic sunbathing and beach opportunities, but ferries packed with daytrippers swarm the island and cause prices to inflate in July and August. You can also find fantastic deals during the winter. But many cafes and restaurants close for the season during that time, though temperatures still remain above 40 degrees. Plus, the funicular doesn't operate in January and February and several ferry routes, including trips from Positano and Amalfi, do not service the island.", "Capri is influenced by the food and laid-back nature of Southern Italy and is similar to destinations like the Amalfi Coast, though it has its own history as a storied refuge for artists, intellectuals and writers. As the island is small, it was once heavily influenced by the Mediterranean Sea and maritime culture. However, it has recently turned into an island that almost exclusively caters to international tourists, particularly during the summer high season.", "Residents here speak Italian, but most locals speak English quite well, especially considering the main industry on the island is tourism. If you walk around the shops, restaurants and attractions in popular spots on the island, you'll have no trouble communicating with people you encounter. Still, it can be helpful to know a couple of common phrases, such as \"si\" (yes), \"grazie\" (thank you), \"mi scusi\" (pardon me), \"Parla inglese?\" (Do you speak English?) and \"Dov'e la toilette?\" (Where is the bathroom?). When greeting other Italians in a social situation, just shake hands and be friendly.", "On Capri, restaurants are normally open from 12:30 to 3 p.m. for lunch and 7:30 to 11:30 p.m. for dinner. Meals are pushed later in the day on Capri than they typically are in the U.S., with many locals not starting dinner until 9 p.m. Restaurant service also moves a little slower here, and you may have to specifically ask servers for the check when you are ready to pay and leave. Tipping is not common in Italy, but an extra 10 percent will suffice if you really enjoyed your meal. ", "Capri specializes in, you guessed it, Italian cuisine. Italian coffee, pizza and pasta are all menu staples here, but you're also going to find food from the Campania region. Seafood is very popular and common on the island, especially in dishes like risotto and ravioli. And of course you can't leave the island without trying the signature caprese salad with buffalo mozzarella, fresh basil and hand-grown tomatoes. What's more, lemons are a signature flavor of Capri and Southern Italy in general, so be sure to try some lemon candies or limoncello (a lemon liquor) during your visit. The majority of restaurants are in the main towns of Capri and Anacapri or at Marina Grande, but there are hidden gems all over this small isle.", "One such off-the-beaten-path restaurant is the Lido del Faro, which sits near the picturesque Punta Carena Lighthouse on the west side of the island. This seafood restaurant specializes in traditional dishes like ravioli stuffed with pumpkin and clams. If you want to dine near the Piazza Umberto in Capri, try the Pulalli Wine Bar for fantastic Italian wine, delectable pastas and a bird's-eye views over the square. And if you want a meal shortly after you get off the boat in Marina Grande, try Lo Zodiaco for a great selection of both Neapolitan and regional cuisine. Make sure you try some gelato from any street stand if you're looking to cool down.", "Restaurants on Capri are typically expensive, with some of them being five-star or Michelin-starred restaurants like Mammà or L'Olivo. For higher quality food, avoid the tourist traps right off the boat in Marina Grande and right off the funicular in the town of Capri.", "The best way to get around Capri is on foot or via public transportation. Cars are difficult to obtain and are prohibited for non-residents from mid-March to the beginning of November and taxis are typically quite expensive. There is only one road on the island, and bus tickets only cost a couple of euros. When traveling between Capri and Marina Grande, the funicular is a cheap and fun way to get around.", "Getting to the island itself can be a bit tricky. Helicopter flights to the island are limited and expensive, so the best way to get to Capri is by ferry. Ferries depart from Naples and Sorrento all year, and there are routes from Positano, Amalfi, Salerno and Ischia from April through October. Fast ferries from Naples or Sorrento typically cost about 20 euros (about $22), and they take approximately 30 minutes to one hour. Keep in mind prices go up in the summer. There are multiple ferry lines, and visitors can check out this website to see routes, times and prices. All ferries in Capri arrive at and depart from Marina Grande.", "A passport with at least six months of remaining validity is required for United States citizens traveling to Italy, as well as for U.S. citizens trying to re-enter the country. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements."]}