{"name": "St. Kitts & Nevis", "description": ["These lesser-known but luxurious twin islands in the southern Caribbean are breathtaking. St. Kitts and Nevis beckon to travelers looking for a mix of resort relaxation and picturesque landscapes with a touch of adventure and a dash of history. St. Kitts is the more outgoing sister, with the widest selection of restaurants, bars and hotels. Shy and lush Nevis showcases the opulence that has become this region's calling card.", "Seclusion might be the No. 1 draw (Nevis doesn't have a single streetlight), but there are many other lures. Take, for example, the sloping greens of Royal St. Kitts Golf Club. You want culture? These islands have it – just check out the wintertime St. Kitts Carnival or the music festival held every June. And those with a penchant for history will certainly find it – Nevis is the birth island of founding father Alexander Hamilton; St. Kitts' imposing Brimstone Hill Fortress was once known as the \"Gibraltar of the West Indies\" and the St. Kitts Scenic Railway educates travelers on the area's sugar cane roots. Meanwhile, those who come strictly for the beach can relax with a good book on a number of white-sand oases, such as Oualie Beach and Frigate Bay.", "The best time to visit St. Kitts and Nevis is in May and June, when hotels lower their rates to lure in travelers and the winter crowds thin out. But the peak season – December to April – does host Carnival, a party that might be worth weaving through the droves of tourists. The crowds disperse again in the summer months when the islands experience the Atlantic hurricane season. And keep in mind St. Kitts and Nevis' average highs hover around 80 degrees Fahrenheit year-round.", "Take note of the competition St. Kitts and Nevis enjoy a bit of a sibling rivalry. The smaller island, Nevis, takes pleasure in its somewhat unfettered Caribbean ambiance, while St. Kitts seems to revel in its music-loving, Carnival-throwing, party-loving status.", "Take note of your bill If gratuity isn't included on restaurant bills, a 15 percent tip is generally appropriate. Hotels can tack up to a 12 percent service charge on the bill.", "Take note of your outfit Beach attire is appropriate on the beach, but nowhere else. Wearing even a covered-up swimsuit around town will mark you as a tourist.", "Pack your clubs If you plan on golfing, you should not only ship your clubs to your hotel, but also make sure to stay at a resort with its own course. Usually, the resort's green fees are waived for guests, and club rentals can cost upward of $50.", "Pick the offseason Those looking to save on hotel accommodations should avoid visiting from December to April. Rates are sky-high during this peak season.", "Pass on the sights Historical sightseeing isn't really worth the price of admission on the islands. Save yourself the change and spend it on some beachside drinks instead.", "Traditional St. Kitts and Nevis restaurants offer a blend of Caribbean favorites. On both islands you'll find plenty of meat and seafood, including the much-beloved conch. Spicy dishes, including Jamaican-style jerk chicken, are also very popular. St. Kitts and Nevis have some of the finest fruits and vegetables in the Western Hemisphere, including pumpkins, peas and soursop, a sour, citrusy-like fruit. The islands also feature establishments serving Moroccan, Italian, Asian and Spanish fare.", "The majority of eateries here are casual joints, dishing out flavorful food and cold drinks along the beach. Of the two islands, St. Kitts offers the better selection and experts suggest the restaurants in Basseterre. Recent visitors strongly recommend sampling the catch of the day at Mr. X's Shiggidy Shack Beach Bar and trying the fish tacos at Shipwreck Beach Bar and Grill. However, Nevis also offers its fair share of beloved eateries, including Turtle Time Beach Bar & Grill and Coconut Grove. Those looking for more upscale dining may want to visit the restaurants within some of the islands' best hotels.", "The best way to get around St. Kitts and Nevis is by taxi, which can be easily found in front of the islands' airports – Robert L. Bradshaw International Airport (SKB) on St. Kitts and Vance W. Armory International Airport (NEV) on Nevis – as well as lined up at the cruise ship docks in Basseterre, and in front of most hotels and major attractions. Other options include the brightly painted minibuses or rental cars, although both can be limiting depending on your needs. When you're ready to island hop, private boat companies are available at Basseterre in St. Kitts and Charlestown in Nevis.", "You'll need a passport (by air) that's valid for six or more months past your visit, or passport card (by sea), to enter and exit St. Kitts and Nevis. Customs officials might also ask you to provide proof of sufficient funds, as well as proof of a return or onward trip. Visits to St. Kitts and Nevis may not exceed three months without a visa. For more information on entry and exit requirements, please visit the U.S. State Department's website."]}