{"name": "Calgary", "description": ["From rags to riches, Calgary has experienced its very own Cinderella story. First founded as a Rocky Mountain outpost for the mounted police, this Canadian cow town went from honky-tonk to high-end with the discovery of oil in the early 1900s. Over the next century, shimmering office buildings replaced mom-and-pop businesses. By 1988, the city's reputation as a commercial powerhouse (along with its ideal location near the snowy Rocky peaks) earned it the honor of hosting the Winter Olympics. Since then, Calgary has been riding high.", "Despite this transition, Calgarians continue to see their city from the eyes of the conventional cowboy: Here, leather boots and wide-brimmed hats still reign supreme and you'll see them on people all over Calgary. If your inner buckaroo still isn't satisfied, visit during the summer's annual Calgary Stampede, which summons bronco-busters from all walks of life to try their hands at wrangling. As any cattleman (or woman) will tell you, it's the most fun you can have with your boots on.", "The best times to visit Calgary are June through August, when most of the city's special events take place; and November through March when skiing conditions are in their prime. The winter months mark the city's low season with freezing temperatures that deter sightseers and force room rates down. You can expect to find hotel prices at their highest come summertime. You will find some good deals; however, if you book a few weeks in advance. If you're looking to save money without facing arctic temperatures, plan a visit for April or October when the city is free of tourists and winter's icy grip.", "Calgary is a true melting pot, with more than 120 languages spoken in the city. Though you'll hear many languages, English and French are Canada's two official languages, and as such signs are posted in both. Perhaps the biggest difference American travelers will encounter is the use of the Canadian dollar and the international metric system.", "One U.S. dollar is equal to about CA$1.30, but since the exchange rate fluctuates, be sure to check it before your trip. You can avoid confusion by familiarizing yourself with Canadian currency. Coins are in denominations of $2, $1, $0.50, $0.25, $0.10 and $0.05. Canadian dollar coins are called \"loonies;\" two-dollar coins are called \"toonies.\" Paper bills are in denominations of $100, $50, $20, $10 and $5. You can dodge high exchange fees by withdrawing Canadian money directly from an ATM.", "Along with differences in currency, you'll also encounter some disparities in how temperatures, distance and weights are measured (in metric units); distance is measured in kilometers – pay close attention to this if you've decided to rent a car.", "Local favorites include cheese buns from Glamorgan Bakery, a tasty snack famous in Calgary that is known to sell out fast. The minidoughnuts at the Calgary Stampede are world-renowned and when the event isn't happening, the Calgary Mini Donuts food truck found around town can still fill your cravings.", "Deep-fried shredded ginger beef is said to have been invented in Calgary at the Silver Inn Restaurant in the 1970s, where diners can order it to this day. The Caesar cocktail is another Calgary invention. According to local lore, the concoction is made with Clamato juice, hot sauce, Worcestershire sauce, vodka and spices. Order it at the Westin Calgary (which was formerly the Calgary Inn – where the drink was invented) and at bars throughout town.", "The best way to get around Calgary is by using public transportation. The Calgary Transit system provides efficient and affordable light-rail and bus service throughout the city. As such, you'll find you don't need a car; though one might be handy if you're looking to head westward into the mountains to Banff. When the weather is nice, many residents opt for bicycles instead. The region boasts hundreds of pathways and bike lanes. If you're arriving in town by way of the Calgary International Airport (YYC), you can take the Route No. 300 bus to downtown for CA$11 (about $8). From there, ride the light-rail to your lodgings (the pass includes all-day access to all CTrains and buses), or fork over extra money for a cab. Fares from the airport to downtown Calgary cost between CA$40 and CA$45 (about $30 to $33).", "A valid travel document (preferably a passport) is required for citizens of the United States traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. If you are planning to drive, you can also use a NEXUS card, which allows for expedited border crossings for both private and commercial travelers through Canadian and U.S. border controls. For more information, visit the U.S. State Department website."]}