{"name": "Nashville", "description": ["Nashville has evolved over the years and has become a city of a lot of things for a lot of different people. It's a popular weekend getaway for those based on the East Coast and in the Midwest. It's a foodie retreat for those who love affordable Southern cooking and international fusion cuisine. And it's a fun bachelor and bachelorette spot for friends looking to bond before taking the big leap into marriage. But Nashville at its core is a haven for country music fans. The bars lining Broadway (plus the famous Bluebird Cafe, which is about 5 miles south) host some of the most talented undiscovered artists in the country. In fact, Nashville is where many musicians – including Faith Hill, Tim McGraw, Reba McEntire, Taylor Swift, Florida Georgia Line and Sam Hunt – were discovered or launched their careers. The best way to soak up Nashville's country scene is to enjoy the free live tunes at establishments throughout the city.", "You should also visit the Grand Ole Opry and the Country Music Hall of Fame, tour Belle Meade Historic Site and ogle The Parthenon. And plan to spend some time just hanging out in the growing number of boutiques, coffee shops and restaurants downtown. Or, let a local show you around with a guided tour.", "The best time to visit Nashville is from April through October, when the warm weather brings this music city to life. Although December is quite charming with Christmas decorations at the Opryland Hotel and the Belle Meade Historic Site, winter is low season. From November to March, you could score slightly lower fares on flights and hotel rates.", "Try the hot chicken Every city has its specialty dish, and in Nashville, it’s hot chicken. Claiming to be the birthplace of this spicy fried chicken, you can find it on menus everywhere in town.", "See rising stars at Tootsie's Orchid Lounge You could visit Grand Ole Opry and the Ryman Auditorium, but to see tomorrow's next big stars sing and strum, head to Tootsie's, located downtown on Broadway.", "Plan a winter trip Given Nashville's popularity, hotel rates can get pricey year-round. However, you'll save some coin by visiting in winter, when prices are as low as they get.", "Buy the Total Access Pass You can use the Music City Total Access Pass for admission to four attractions or tours of your choosing. It also includes two free tickets to the Parthenon and the Tennessee Sports Hall of Fame, plus shopping discounts, for $99.", "Only a few years ago, Nashville's dining scene was dominated by deep-fried, saucy entrees that were enough to make even the healthiest heart palpitate. Diners flocked to this southern city for chicken-fried steaks or juicy barbecue pork with hearty portions of macaroni and cheese and spicy baked beans. Over the past decade or so, though, Nashville has welcomed less cholesterol and more international cuisine to its dining scene; you can find restaurants serving Indian, Mediterranean, Mexican, Italian and Cajun favorites scattered throughout Nashville. Food tours are a great way to get a better understanding of Nashville's mesh of the traditional and modern.", "For a casual dining experience, head over to the West End for its ribs and barbecued pork; and you can't miss sampling the famous Nashville hot chicken at Prince's Hot Chicken Shack, Bolton's Spicy Chicken & Fish or Hattie B's. If you're on the go, grab a bite at Coneheads, which serves up tasty chicken in waffle cones for a trendy take on the classic dish.", "Check out The District for more upscale dining establishments; you can eat at the tapas-focused Black Rabbit or enjoy Cajun flavors with a side of live music at the Bourbon Street Blues and Boogie Bar. Don't forget to swing by East Nashville to dine at Butcher & Bee or make your way to the Southern V to sample vegan comfort food, even a version of hot chicken! And, when your sweet tooth strikes, indulge in a treat from Morning Glory Donuts or Mike's Ice Cream. ", "You can't forget about the city's bar scene either. Locals say Dino's and Mickey's Tavern are some of the top spots to grab a drink in town. If you're interested in Nashville's brewery and distillery scene, check out these top-notch establishments. Or, if you're just looking to kick back and relax with a drink and enjoy some live music, bar hop along Broadway. ", "Nashville's crime rate is significantly lower than Memphis'; however, visitors should still use common sense when exploring. Keep car doors locked and make sure valuables are stored in a safe place. When walking around after dark, avoid dimly lit streets, especially in inner city areas.", "Nashville's steamy climate can be a little overwhelming to those who aren't used to it. Travelers should keep this in mind when preparing to visit – especially if you are planning a summer trip. Make sure to pack plenty of sunscreen to avoid getting burned. Visitors to Nashville should also take precautions against heat stroke, the most common symptoms of which include headache, dizziness, fatigue and nausea. Avoid eating overly heavy meals and drink plenty of water.", "The best way to get around Nashville is by car. The city has a public transportation system, but neighborhoods and attractions are a bit too spread out to walk between, which can make visiting multiple sites in one day more complicated. If you like to cycle, you can also take advantage of BCycle, an electric bike fleet with stations around the city. Several of the city's top guided tours get around via bus, which is another efficient way to sightsee.", "To get from Nashville International Airport (BNA) to your hotel, it's best to get a rental car. You can also take an airport shuttle, a public bus (route 18) or a taxi. Ride-hailing apps, such as Uber and Lyft, also operate in Nashville."]}