{"name": "Tulsa", "description": ["To understand modern-day Tulsa and its allure for culture hounds and history buffs, you'll need to know a bit about its past. In the early 20th century, Tulsa experienced a rapid influx of wealth thanks to the discovery of oil. In fact, the city was once known as the \"oil capital of the world.\" Oil magnates like Waite Phillips and Thomas Gilcrease used their immense fortunes to create some of the city's top cultural institutions, including the Gilcrease Museum and the Philbrook Museum of Art. Along with these popular attractions, visitors will also see the reverberations of this remarkable affluence in the art deco architecture that's still present throughout downtown Tulsa today. However, alongside this age of prosperity, the city also witnessed one of the worst racial terror attacks in U.S. history: the 1921 Tulsa Race Massacre. Tulsa, and the nation, are still grappling with the aftermath of this horrific event, as seen in the memorials, monuments and museums located within the historic Greenwood district – the site of the massacre.", "Today, Tulsa is experiencing a renaissance in everything from its dining scene to its cultural institutions. In the last five years, the city welcomed a trendy food hall (Mother Road Market), an innovative museum dedicated to telling the story of the Tulsa Race Massacre (Greenwood Rising), and a waterfront park (Gathering Place) that will eventually sprawl across 100 acres and features the new Tulsa Children's Museum.", "Tulsa loves its sports Many local haunts offer game-day deals and draw big crowds ready to cheer on the home teams, which include the Tulsa Drillers baseball team, the Tulsa Oilers hockey team and the Tulsa Athletic soccer team, as well as the University of Tulsa and Oral Roberts University.", "Visit in the spring or fall Temperatures settle around 60 degrees, plus several annual events, including Tulsa International Mayfest and Oktoberfest, fill up the calendar.", "Family fun If you’re visiting in the fall, try to time your visit to line up with the annual Tulsa State Fair, a family-friendly excursion with dozens of rides, games and authentic carnival food.", "Take public transportation Tulsa is a relatively affordable destination year-round, but taking public transportation is a good way to save even more money, instead of taking taxis or paying for parking.", "Spend your days outside If you’re visiting when the weather is warmer, head outside to explore Tulsa’s free gardens and parks. For a top-notch picnic spot, check out Woodward Park.", "To enjoy a diverse sampling of local eateries and retailers, pay a visit to Mother Road Market. This food hall, which opened in 2018, occupies the 1939 Scrivner-Stevens Co. Grocery building. The first of its kind in Oklahoma, the food hall features more than 20 restaurants and shops, in addition to mini golf, live music, cooking classes and more. Diners can find everything from pizza and ice cream to tacos and sushi.", "Tulsa takes its coffee very seriously. In fact, locals consider it one of the best coffee scenes in the Midwest. There are a variety of coffee shops and roasters scattered throughout the city's various neighborhoods, so finding a quality cup of joe won't be difficult. If you want to sample the best of the best, heed the advice of locals and stop by Cirque Coffee (home of the Cinnamon Toast Crunch latte and lattes on draught), Black Wall Street Liquid Lounge or Hodges Bend.", "Soul food and barbecue also play an important role in the Tulsa dining scene. Sweet Lisa's Café and Evelyn's Soul Food Cuisine are both loved by locals for their fried catfish, while Leon's Smoke Shack BBQ, Rubicon and Albert G's Bar-B-Q are some of the top spots for brisket, ribs, pulled pork and all the fixings."]}