{"name": "Cape Cod", "description": ["With its colorful clam shacks, shingle-style cottages and serene beaches, it's easy to see why Cape Cod – or simply \"the Cape\" to locals – is a top summer retreat for New England mainlanders. Quaint bed-and-breakfast accommodations sit beside rugged sand dunes, scenic bike trails snake along forests and the seemingly endless seashore is punctuated by bright kayaks and fishing boats. Life moves at a slower pace here – but that's part of the charm. And while the Cape is a sought-after spot for celebrities and athletes, it's actually an unassuming place, with a laid-back personality.", "Spend a day getting acquainted with the Cape's artsy side with a trip to Provincetown, a bohemian (and particularly LGBTQ-friendly) seaport that boasts quirky art galleries and excellent whale-watching spots. Then, continue south to Sandwich, the Cape's oldest town, where glass-blowing demonstrations and storied New England homes await. Spread across four diverse regions – the Upper Cape, Mid Cape, Lower Cape and Outer Cape – the area offers much to explore. And though you'll only need a few days to sample the Cape's pristine beaches, striking views and superlative seafood, to truly soak in the Cape's quiet calm, try to carve out a few weeks to experience the low-key vibes that captivate visitors each summer.  ", "The best time to visit Cape Cod is May, June, September or October. These shoulder months usher in pleasant temperatures for outdoor pursuits, fewer crowds than the busy summer season and reasonable room rates. Visiting between July and August is best if hitting the beach is a top priority for you, but you'll shell out a pretty penny for a seaside cottage during the peak tourist season. In contrast, the Cape is near abandoned from December through March and hotel prices are much less expensive than the warmer months, though many shops and restaurants close in the offseason. If you're looking for some time to curl up with a good book in quiet solitude, winter is the time for you. ", "Dress neat-casual Cape-wide, dress codes rarely go beyond casual; still, beachwear isn't appropriate away from the shore. It's best if you leave your rattiest sweatshirts at home.", "Eat very local Noshing on fried scallops and clams at a dinky seafood shack is a must – the closer to the ocean, the fresher the fish. If you're feeling adventurous, you can always charter a boat to fish for your supper or dig for your own oysters in Wellfleet.", "Traffic is a problem With only two bridges, getting on and off the Cape can be a production, especially in the high season. Avoid commuting on Friday and Sunday afternoons at all costs. Stay up-to-date on traffic conditions by dialing 511, the automated MassDOT Traffic service or visiting its website.", "Visit during the offseason Prices soar in the summer, but if you visit in April, May, September or October, you'll find mild temperatures, thin crowds and affordable hotel rates. And though it may be a little chilly along the beach, many top sites and restaurants remain open during the shoulder months.", "Plan your own clambake Thanks to the Cape's bounty of seafood, you can easily slash meal costs by netting your own clams, mussels, oysters and scallops. But before you start clamming, keep in mind each town requires a shellfish license. Consult each town's official site for specific requirements. You can always pick up supplies at a local market, too.", "Skip the weekend In the summertime, especially on Saturdays and Sundays, crossing over the Cape Cod Canal can be a challenge. But if you plan a trip during the middle of the week, you'll find fewer crowds and reduced nightly rates and many hotels and bed-and-breakfasts.", "A beacon for seafood lovers, the Cape serves everything from oysters and scallops to fried clams and lobster rolls. Casual clam shacks, bustling fish markets and fine-dining establishments abound. Wander along the streets of Wellfleet and you'll find local haunts shelling out succulent oysters, from Pearl, which plates everything from Wellfleet oysters to pan-steamed mussels, to the Wicked Oyster, which offers inventive twists like fried and buttermilk oysters. The nearby Moby Dick's – a relaxed eatery known for its fried clams, littlenecks and lobster – is also a top spot for sampling a traditional taste of the Cape. For fresh chowder and lobster bisque, head to Chatham, where tried-and-true institutions like the Chatham Pier Fish Market and upscale dining spots like the Impudent Oyster lure local and visiting seafood fanatics, alike. You'll also find a variety of international eateries around the Cape, ranging from buffet-style Brazilian establishments in Hyannis to Asian, Middle Eastern and European-inspired venues.", "For an upscale meal filled with imaginative takes on Cape classics, head to the Naked Oyster Bistro & Raw Bar, which plates French-inspired creations, such as house country pate and oysters prepared in all sorts of inventive ways, like gimlet oysters with a gin sauce and oyster Moscow, with caviar and sour cream. Another crowd-pleaser is Twenty-Eight Atlantic, a Four Diamond Award-winning restaurant located at the Wequassett Resort that features menu items like butter braised lobster and beef tenderloin from local farms.", "For more cost-effective, family-friendly options, try The Lobster Pot in Provincetown, Seafood Sam's in Sandwich or Pie in the Sky in Woods Hole. The Lobster Pot offers scenic Provincetown harbor views paired with specialties like lobster avocado cocktail and scallops au gratin, along with kid-approved meals like hamburgers and fish tacos. Meanwhile, Seafood Sam's dishes up entrees like fried clam strip platters and lobster salad rolls, along with menu items designated for kids ages 12 and younger, such as grilled cheese and popcorn shrimp. And Pie in the Sky is ideal for dessert-lovers, thanks to its flavorful blueberry, apple and key lime pie varieties and popular crumbly popover layered in jam.", "The best way to get around Cape Cod is by car, particularly if you're hoping to explore a variety of areas across the Cape. Route 28 and Route 6A run far and wide across the Cape – making navigating to top attractions and towns a cinch. The Cape Cod Regional Transit Authority bus system also offers a handful of lines that service the island, transporting passengers to popular areas like Sandwich and Barnstable. Experiencing Cape Cod by bike is also popular, thanks to the 25-mile long Cape Cod Rail Trail; however, a bike is less desirable for extensive exploration.", "If you're planning on taking a car with you, you can easily cross over the Cape Cod Canal from Boston off of Route 3 or from Providence from Interstate 195. If you'd rather fly to the Cape, there is a small airport in Barnstable (HYA) and in Provincetown (PVC). And if you're commuting to the Cape from Boston in the summertime, you can also climb aboard the CapeFLYER, a train that takes riders from Boston to Hyannis from Memorial Day through Labor Day on Fridays, Saturdays and Sundays; one-way tickets cost $22 per person, round-trip tickets cost $40. Finally, if you're headed to Provincetown, you can also hop on the 90-minute fast ferry from Boston for $62 to $65 (one way) or $92 to $98 (roundtrip) from mid-May through mid-October daily. Visit the Bay State Cruise Company website for schedules."]}