{"name": "Guadalajara", "description": ["For a more authentic Mexican experience than what you might receive on the coasts and a slightly less frenetic vacation than what you might experience in Mexico City, head to Guadalajara. The capital and largest city in Jalisco is known for its mariachi bands, its nearby tequila distilleries, its jaw-dropping architecture and its thrumming nightlife. Guadalajara also effortlessly blends tradition and modernity. For instance, some Tapatíos (Guadalajara natives) don sombreros, while others are more comfortable in skinny jeans. Some prefer watching rodeos or Mexican wrestlers, called luchadores, while others prefer sampling Mexican craft beers at El Grillo, a local pub. You can get a taste of it all on a trip to Guadalajara.", "The best time to visit Guadalajara is between the months of October and December when the weather is dry, temperatures skim the lower 80s and festivals fill the calendar. The five months that span January and May are another great time to visit the city, thanks to decreased hotel prices. June through September is considered Guadalajara's low season since the city experiences heavy rainfall and high temperatures during this period.", "Tequila is nearby The agave fields and distilleries of tequila heavyweights like Jose Cuervo and Sauza sit less than 50 miles northwest of Guadalajara.", "Guadalajara, founded in 1542 by King Carlos V of Spain, is the capital and largest city in Jalisco, a state that is credited with inventing sombreros, rodeos and mariachi music. The city is also packed with universities, ranging from the University of Guadalajara to the Monterrey Institute of Technology and Higher Education, Guadalajara. Lately, tech manufacturing is drawing more and more of the country's best and brightest, but farming blue agave (for tequila production) continues to bolster most of its economy.", "Locals in Guadalajara speak Spanish, and travelers can endear themselves to residents by looking them in the eye, smiling and saying \"buenos dias\" (good morning), \"buenas tardes\" (good afternoon) or \"buenas noches\" (good night).", "The Mexican peso is the currency used in Guadalajara and throughout Jalisco. Since the Mexican peso to U.S. dollar exchange rate fluctuates, plan to check the conversion before you go.", "In response to crime in Jalisco, the U.S. State Department has issued warnings about intercity driving at night. It's best to confine your driving to the day – or better yet, rely on other modes of transportation.", "For such a laid-back place, Guadalajara takes its food seriously. The city's signature dish is the torta ahogada, literally \"drowned sandwich.\" This pork sandwich is drenched in broth and served with diced onions and spritzed with lime juice; you use a spoon rather than your hands. You'd also be remiss if you didn't sample some of the region's tequila. Try it straight-up or in a cocktail, or head about 40 miles northwest to tour the Jose Cuervo and Sauza distilleries. ", "Try the cafes, called loncherías, ice cream shops and fresh fruit drink stores, called neverías, and don't miss San Juan de Dios Market's multitude of taco vendors. Also, save some time to dig into birria, a stewed goat meat dish made with tomatoes and savory spices. For a more formal meal, try Sagrantino or Asador La Vaca Argentina.", "The best way to get around Guadalajara is by foot. The streets are best viewed at a leisurely pace, and many of the city-center attractions, such as the Guadalajara Cathedral, are located within walking distance. For places further afield, you can take a bus, but you'll likely face tight quarters as buses are popular among locals. There's also a metro system, but its two routes are more convenient for commuters than tourists. Taxis and rental cars are options, too.", "Flights from a variety of U.S., Canadian and, of course, Mexican, destinations arrive and depart Guadalajara International Airport (GDL), which is located about 12 miles southeast of the city.", "To travel to Mexico, Americans must present a valid United States passport. A tourist visa is not required for visits less than 180 days, but before arriving, travelers will be asked to fill out a tourist card. Tourist cards – and the accompanying fee – are usually covered by your airline. For more information on entry and exit requirements, visit the U.S. State Department's website"]}