{"name": "Santiago", "description": ["You might associate Santiago with towering skyscrapers, rolling vineyards and soaring mountains – and you wouldn't be wrong. Set in the Maipo Valley (framed by the snowy Andes to the east and the rolling coastal range to the west), the Chilean capital captivates visitors with its jaw-dropping views, neoclassical architecture and world-class museums. Santiago hasn't always been so alluring: In its nearly 500-year history, the city has withstood invasions, dictatorships and countless earthquakes. Yet, in recent decades, the growing economy has led to rapid changes, helping the city to reinvent itself and earn a place on the map alongside other popular South American destinations like Buenos Aires and Rio de Janeiro. Today, Santiago continues to evolve, with its Latin American character and European flair shaping a collection of wholly distinct barrios (neighborhoods). You'll find centuries-old mansions and grand cathedrals next to cutting-edge shops and trendy galleries, markers of Santiago's textured past and promising future.", "To discover the city's flourishing enclaves, shop alongside fashion-savvy Santiaguinos in Providencia, soak up the scenery from Santa Lucía Hill or sit down for a meal in burgeoning Barrio Italia. Then, wander through the Plaza de Armas to see the Metropolitan Cathedral or admire Pre-Columbian artifacts on display at the Chilean Museum of Pre-Columbian Art. As the sun goes down, sip pisco sours at a cocktail bar or stay up late to join in the revelry at one of the many nightclubs strewn across Bellavista. You may not see all of Santiago's creativity and culture in one trip, but it won't take much effort to experience what's important: artsy boutiques, regionally inspired cuisine and delectable wine – local passions that are bringing a new luster to the Chilean capital.", "The best time to visit Santiago is from September to November or from March to May; these months mark the spring and fall shoulder seasons in Chile. Although the city experiences a moderate climate with mild temperatures year-round, spring and fall are especially alluring with plenty of sunshine, thinner crowds and affordable flight options from popular U.S. destinations. Fall (March through May) is a particularly pleasant time to visit if you enjoy vino: Vineyards showcase beautiful fall foliage, and grape harvest festivals abound. Spring (September through November) is another excellent time to visit thanks to blooming flowers, comfortable temps and nationwide independence day festivities. From December to February (summertime in the Southern Hemisphere), temperatures, crowds and hotel prices swell across Chile (though Santiago itself thins out). Meanwhile, June, July and August (Chile's winter months) bring showers, cooler temps and increased smog levels, but the powder blanketing the nearby Andes lures skiers.", "Watch out for pickpockets Stay alert when visiting bus stations or tourist areas like Plaza de Armas and the Central Market, where petty crime is prevalent.", "The tap water is safe to drink Although Santiago's mineral-rich water has a distinct taste and can take some getting used to, it is perfectly safe to drink.", "Shop the local markets For affordable Chilean souvenirs, head to one of the city's local craft markets, such as Centro Artesanal Pueblito Los Dominicos, where you'll find everything from lapis lazuli jewelry to Andean textiles and ceramics.", "Sightsee for free Most state-supported museums are completely free to enter, as are parks, plazas and markets. There are also popular tip-based city tours, including Tours 4 Tips.", "In 1541, Spanish conquistador Pedro de Valdivia founded Santiago, selecting its central valley location for its moderate climate and advantageous position for fending off intruders. He outlined the city streets on a grid, fanning out from the Plaza de Armas, a main square filled with political institutions and religious sights. Surrounding the Plaza de Armas, you'll stumble upon city highlights, including the Governor's Palace (now the Central Post Office), the Royal Court of Justice (now the National Museum of Natural History) and the Metropolitan Cathedral. It wasn't until the 19th century that Santiago began to grow, with World War II creating a high demand for industrialization and urban jobs. However, the city was rocked in 1973 when Chilean general Augusto Pinochet launched a coup and assumed power. Pinochet's 17-year dictatorship included the loss and exile of thousands of Chilean civilians. As the epicenter of Chilean politics, Santiago was especially prone to the repercussions of Pinochet's actions. Chile restored democracy in 1990, electing a leader who paved the way to economic growth and increased globalization.", "Today, Chile's capital is undergoing a renaissance, with flourishing neighborhoods showcasing a mix of old and new, and a blend of the city's Indigenous and European influences. Although the majority of Santiaguinos (those born in Santiago) are Catholic as a result of the city's Spanish heritage, a variety of other religions, including Evangelicalism and Judaism, are widely practiced in Chile.", "Spanish is the official language here; however, a booming international travel market has ushered in English-speakers at many major hotels. Outside the hotels, English speakers can be hard to come by. With that in mind, it would be a good idea to master some key Spanish words and phrases, such as \"hola\" (hello), \"buenos días\" (good morning), \"adios\" (goodbye), \"por favor\" (please) and \"gracias\" (thank you). You should also consider writing down the name and address of your destination if you are planning to travel by taxi; this will help you avoid any miscommunication.", "The official currency of Chile is the Chilean peso. One Chilean peso equals approximately $0.001, or less than one American penny, but you'll want to check the latest exchange rate before your visit. As far as payment is concerned, dollars are sometimes accepted at tour agencies and credit cards are widely accepted at most places, though there is often a small transaction fee and exchange rates may not be as favorable. Make sure to carry Chilean pesos in small denominations to ensure you pay the lowest rate and do not have trouble breaking large bills. When dining, keep in mind that it is considered polite to add a 10% tip. Taxi drivers do not expect gratuity; however, giving your driver any remaining change from your fare is commonly practiced.", "You'll find most people here dressed casually, but be sure to pack appropriate attire depending on when you plan to visit. While Santiago maintains a moderate climate, bringing plenty of layers during the winter months and comfortable shoes for walking around is a must. If you're traveling solo, stay alert at all times, especially after dark in popular areas like Bellavista and the Plaza de Armas, where pickpockets prey on unsuspecting visitors.", "Santiago's burgeoning culinary scene is a big selling point for foodies. The city's cuisine is as eclectic as its neighborhoods, with restaurants serving dishes packed with Peruvian flavors in bohemian Bellavista and empanadas (meat-, seafood- or cheese-filled pastries) and traditional fish-focused entrees at the Central Market.", "Like its South American peers, Santiago's popular restaurants source fresh, local ingredients. Here, you can savor Chilean specialties like machas a la parmesana (razor clams layered with cheese, white wine and lemon juice) and seafood stews prepared with freshly caught fish from the Pacific. Or, you can indulge in meat-centric meals, such as a pastel de choclo (a pie with ground chicken or beef, boiled eggs and olives topped in mashed corn). For upmarket meals, venture to the Providencia and Vitacura areas, where restaurants serve authentic dishes with a little extra zest like caldillo de congrio (a fish stew filled with tomatoes and potatoes) and ceviche made with fresh sea bass or scallops.", "Keep in mind, Chileans eat later than Americans. Plan to sit down for lunch between 1 and 3 p.m. and head out for dinner between 8 and 10 p.m. If you need a snack between 3 and 8 p.m. (when many restaurants are closed), visit a salón de té for onces (small bites like those you'd enjoy during an afternoon tea service). Although formal attire is not typically required, dressing up for dinner – particularly in cosmopolitan areas – is a good way to blend in.", "Santiago is a relatively safe city with few instances of violent crime. However, petty crimes like muggings and carjackings are becoming more common. You should be especially wary of pickpockets, who often target public transportation and well-trafficked tourist spots like the Central Market, Santa Lucía Hill, the Plaza de Armas and San Cristóbal Hill. Also be sure to stay alert if you plan on exploring Bellavista or the Yungay and Brasil neighborhoods after dark, since petty thieves tend to frequent these areas.", "Political protests are common in large Chilean cities like Santiago. These demonstrations typically occur with little advance notice and may become unsafe at times. They also tend to cause metro service disruptions, road blocks and even early closures at shops, restaurants and banks. To minimize the impact this may have on your vacation, sign up for the U.S. Department of State's Smart Traveler Enrollment Program, monitor local media before and during your trip, avoid demonstrations and contact your airline for updates about potential flight delays, especially if you're also traveling to remote Chilean destinations like Easter Island and Chilean Patagonia. Learn more about how to stay safe in Chile by visiting the State Department's website.", "The best ways to get around Santiago are on foot and by metro or taxi. Since the city's streets are laid out on a grid in the historic center, exploring on foot is an easy way to take in the sights. The metro also serves as an efficient, inexpensive and reliable way to travel between barrios, plus its lines service the city's top attractions. That said, taking the metro means combating heavy crowds at rush hour, which can lead to an uncomfortable commute. At all other times, it is typically much less crowded. Taxis are another convenient and affordable way to get around the city; however, you'll want to only flag those with yellow tops to avoid getting scammed. Global ride-sharing apps like Uber are often a cheaper and safer bet. Buses are another suitable option thanks to reasonable rates and an extensive network of routes.", "Santiago's international airport, Arturo Merino Benítez International Airport (SCL), also known as Nuevo Pudahuel, sits about 10 miles northwest of the city center. The airport serves many international carriers that offer direct flights daily between major American cities, such as Atlanta, Miami, Dallas, Los Angeles and New York City. You can opt to hop on a shared minivan transfer to downtown Santiago outside the arrivals area, or wait for a TurBus or Centropuerto bus, which travel between the airport and the city center. However, taxis are the most hassle-free means of transportation into the city. You can also easily pick up your own set of wheels outside the airport, but with plentiful public transportation options to choose from, there's no need to rent a car unless you're planning to venture beyond city limits.", "A valid passport is required for entry to Chile. U.S. citizens can stay in the country for up to 90 days without obtaining a visa. Travelers who fly into Santiago's international airport will be issued a Tourist Card, which they must return when they leave the country. Families with children 17 and younger must show proof of each minor's relationship to their parents when leaving Chile by presenting an original birth certificate. For more information on entry and exit requirements, visit the U.S. Department of State's website.", "Wander through the artsy Bellavista neighborhood and you'll discover modern shops and restaurants rubbing shoulders with colorful homes and centuries-old mansions. "]}