{"name": "Cincinnati", "description": ["\"Cincinnati is a beautiful city; cheerful, thriving, and animated,\" said celebrated novelist Charles Dickens. And we quite agree. Although some of Cincy's neighborhoods are a little run-down, the winds of revitalization are blowing through the city with force. Only look to the historic Over-the-Rhine (OTR) district for proof: This neighborhood features vibrant Findlay Market, which gathers hordes of foodies on the weekends, and Cincinnati Music Hall, home to the prestigious Cincinnati Symphony Orchestra. Downtown is another example of this renaissance — the fairly recent renovations of the riverfront Great American Ball Park and the pedestrian-friendly Fountain Square are case in points. ", "But there's more to Cincy than just urban development. Some of the more pastoral areas have remained just as pastoral. A walk through the Spring Grove Cemetery & Arboretum will convince you of that point, as will Eden Park, which spreads out beside the Cincinnati Art Museum. So it should be no surprise that Dickens also said, \"The inhabitants of Cincinnati are proud of their city as one of the most interesting in America: and with good reason.\"", "The best times to visit Cincinnati are September or May when the weather is pristine and the city's events calendar is packed. Summertime is hot, but pastimes on the river — as well as frequent concerts in the city's Fountain Square — redeem the humid season. Cincinnati is pretty cold between October and April, and snowfall is common. Still, if you're looking for a slight break on hotel rates, winter is the time to visit.", "Current-day Cincinnati was settled largely by German immigrants. If you run into a local and ask a question, they might respond back with \"please.\" But rest assured they are not correcting your manners; they are simply asking you to repeat yourself. In Germany, they would've said \"bitte,\" and that's most closely translated in English to \"please.\" To get a taste for the city's German heritage, plan to visit during the city's annual Oktoberfest celebration. Or you can hop across the river to Northern Kentucky's German enclave, the MainStrasse Village.", "Although Cincinnati was settled by German immigrants, the city's culinary scene has been influenced by countries the world over. Abigail Street, a Mediterranean restaurant, is one of the most popular places to dine in Over-the-Rhine. Additionally, the Italian cuisine at Nicola's Ristorante, also in the Over-the-Rhine district, is highly praised. If you're vegan, you'll want to tempt your taste buds over at the Asian-style Loving Hut, situated in northeast Cincinnati. For a diverse array of ethnic eats, a visit to Findlay Market on the weekends should be on your itinerary. By the way, for ice cream, head to the local shops — downtown's Graeter's Ice Cream or northeast Cincinnati's Aglamesis Brothers.", "But if you want some German fare, head to Mecklenburg Gardens, located north of downtown near the University of Cincinnati.  Cincinnati also has some signature dishes — don't miss \"goetta,\" a mixture of pork, beef and steel-cut or pinhead oats eaten at breakfast. Head to Glier's Goetta (across the river in Covington, Ky.) for a taste. You might also want to try Cincinnati's take on chili, a compilation of spaghetti, chili and cheese, to which you might also add beans and onions.", "The best way to get around Cincinnati is by car. Pedestrian-friendly neighborhoods and popular things to do are spread too far apart to see solely on foot. If you'd prefer not to drive, you can opt to take the tourist line on the city's Metro bus, which makes stops at many of the city's most popular attractions. There are also several taxi companies to call, in case you're in need of one.", "The closest major airport — Cincinnati/Northern Kentucky International Airport (CVG) — is located across the Ohio River from Cincinnati in Kentucky. But it's only about 15 miles west of downtown Cincy. To get to the city, you can rent a car or hire a shuttle, van or taxi."]}