{"name": "Houston", "description": ["Give this Texas city a chance. Yes, Houston's history is sticky with oil, and its contemporary landscape climbs with skyscrapers belonging to Citgo, Shell and many, many more. But what you might not know is that Houston has grassy parks, eclectic galleries, a burgeoning art scene and Tex-Mex restaurants that all vie for attention downtown. And outside of Dallas-Fort Worth, Houston is one of the greatest places in Texas to shop: Ever heard of the Galleria? There are also plenty of nice hotels to lay your head and a variety of fun things for the kiddies to see, such as the zoo and the children's museum. Those with a keen interest in space can learn all about NASA's program at Space Center Houston and science nerds can check out the comprehensive Museum of Natural Science. So, yes, it's a huge sprawling city of more than 2.3 million, but with pleasant weather pretty much year-round, an abundance of entertaining festivals and plenty of things to do, you should give it a chance.", "The best time to visit Houston is from February to April or from September to November. Thanks to its proximity to the Gulf of Mexico, Houston experiences warm weather (as well as affordable hotel prices) pretty much year-round, but come spring and fall the temperatures are pleasant and there are a variety of festivals to enjoy. You may be able to score a deal in the summer since Houston residents head elsewhere as temperatures climb, but you'll have to contend with the heat and oppressing humidity. Houston also experiences mild winters and snowfall is rare, but temperatures drop when the sun goes down so make sure to pack layers if you're traveling in December or January. ", "Embrace the arts Houston has plenty of museums, but it's one of just a few U.S. cities with professional companies in the four performing arts disciplines: ballet, opera, symphony and theater.", "Rent a car The Houston metro area encompasses 665 square miles, and while you won't have to travel too far to see the top attractions, you'll want your own set of wheels to get around.", "Buy a CityPASS This booklet of admission tickets offers major discounts on Houston's most popular sights like the Children's Museum Houston, the Downtown Aquarium, the Houston Zoo and Space Center Houston.", "Find a food truck Houston is home to hundreds of food trucks dishing out affordable eats all around town. Check Street Food Finder's food truck locator to see what trucks will be near you.", "Considered one of the Best Foodie Cities in the USA, Houston has always produced excellent eats. But in recent years, the rest of the country (and the world) has finally started to take notice. ", "Ask any local and you'll find strong opinions of where to find the best Tex-Mex fare, a staple in the Houston diet. But most agree The Original Ninfa's on Navigation is a great place to start. If you're exploring the Museum District and the Houston Zoo, you can try the upscale Hugo's or the M & M Grill that offers fajitas and burritos with halal meats. You could also check out a Pappasito's Cantina location, where Beyoncé has been spotted. ", "Another popular food found in Houston? Barbecue, baby. From baby back ribs smothered in sauce to slow-roasted tender brisket, this city has no shortage of BBQ joints. Locals and experts say some of the best spots to visit are Ray's Real Pit BBQ Shack, Killen's Texas Barbecue, helmed by renowned chef Ronnie Killen (who also opened a restaurant combining a steakhouse with a barbeque joint, Killen's STQ), Gatlin's BBQ and The Pit Room. ", "While any first-timer to Houston has to sample Tex-Mex and barbecue, travelers would be remiss to ignore the city's other culinary offerings. Houston's diverse population contributes a wide variety of flavors to its restaurant scene. Sample the lamb kabobs and grape leaves at Aladdin Mediterranean Cuisine; find Creole cuisine at Brennan's of Houston; try sushi and sake at one of the two Izakaya Wa locations; or pick Aria Suya Kitchen to dine on Nigerian fare. If you're in the mood for a fine dining experience, visit Caracol, helmed by James Beard Foundation Award winner Hugo Ortega, or dine on classic French dishes at Etoile Cuisine et Bar. Those in search of elevated southern comfort food can't skip Lucille's. For Vietnamese fare, visit The Blind Goat or Roostar Vietnamese Grill. No matter what you're in the mood for, you won't go hungry in Houston. ", "Soul food is another one of Houston's specialties. Located in midtown, the breakfast klub is an award-winning restaurant founded by radio host and motivational speaker Marcus Davis. Opened in 2001, this Houston institution is famous for two dishes: its signature catfish and grits, and its first-rate wings and waffles. Other soul food spots that come highly recommended by travelers include Mikki's Soul Food Café, Houston This is It Soul Food (a family-owned restaurant serving up specialties like oxtails, mac and cheese and gumbo) and Esther's Cajun Café & Soul Food.", "Aside from its foodie roots, Houston is also known for its excellent nightlife. From classic honky-tonks with live music to hip-hop dance clubs with well-known DJs, the city supplies an almost endless stream of options for night owls. If you're looking to two-step, head to Stampede Houston. Hoping to dance along to hits from the 80s and 90s? Try Numbers Nightclub (it's been around since 1978). Meanwhile, travelers who are still kids at heart shouldn't skip a visit to Cidercade Houston. In addition to more than 275 classic arcade games such as Mario Bros. and Ms. Pac Man, Cidercade also serves a wide variety of hard ciders, hard kombuchas, hard seltzers and hard smoothies.", "The best way to get around Houston is by car. Having your own set of wheels will make it easier to explore all of the city's top attractions, especially those that are located beyond the downtown core, such as the George H.W. Bush Presidential Library and Museum. Driving may be the easiest way to get around Houston, but the city, like most major metropolitan areas, has numerous other transportation options, including buses, a light rail system and a bike-share service. In contrast to its inexpensive public transportation, the city's taxis can be pricey beyond the downtown area.", "To get to and from the George Bush Intercontinental Airport (IAH), you'll probably want to take a cab or a rental car to make the approximately 30-minute drive south to downtown Houston. To save some coin, consider taking the METRO bus No. 102, which costs just $1.25 and takes travelers from the airport to the downtown METRO station in about 50 to 90 minutes."]}