{"name": "Halifax", "description": ["The capital of Nova Scotia is any historian's dream: This harbor town has been a British stronghold and a pirate haven. The city was also the starting point for more than a million immigrants' new lives and the final resting place for hundreds who died at sea after the \"unsinkable\" Titanic went down in the icy Atlantic. And with so many of Halifax's top attractions devoted to the preservation of its rich history, you might think that this city is stuck in the past. But you'd be wrong.", "Halifax has emerged as the commercial capital of Canada's Maritime Provinces thanks to its natural harbor. This status has helped Halifax come into its own as a cultural hub as well. For visitors, that means an abundance of festivals, art galleries and live performances. This is also a great place to kick off an outdoorsy getaway – Halifax is home to several notable public parks and is an easy drive from some small ski areas. And did we mention the seafood? Salmon and lobster are staple ingredients in Nova Scotian cuisine and can be savored alongside stunning views of the harbor at many downtown restaurants. So, whether you're looking to sample the past or the present, Halifax provides an ideal backdrop.", "The best time to visit Halifax is May through October. Summer and fall experience pleasant weather and usher in numerous festivals. However, these months also attract lots of tourists, so be prepared for steep hotel rates. If you're looking to avoid the crowds and the high prices, visit between November and February. Sure, you'll encounter icy winds (easily braved with warm layers), but you'll be granted access to Nova Scotia's ski slopes. March and April also see fewer visitors and lower prices, but the springtime rain can make sightseeing a muddy pursuit.", "Prepare for winter closures Although many of Halifax's businesses stay open year-round, some of the smaller hotels and restaurants in the area close for the slow season. It's a good idea to call ahead.", "Seafood is a staple Because of its seaside location, Halifax is prime seafood territory. No trip is complete without some lobster tail or Atlantic salmon.", "Brave the winter Chilly sea breezes drive away tourists, so you can expect to see room rates dip from November to February. Plus, you can spend your savings on lift tickets at one of Nova Scotia's ski areas.", "Rent your wheels downtown If you're planning to rent a car, wait until you get into town. Rental fees at the airport are significantly higher than those found in Halifax proper. Hop on the Maritime bus to get downtown instead.", "Take a free tour Halifax Free Tours offers tip-what-you-want tours in the summer (and by arrangement other seasons). Head to the Citadel at 10 a.m. or 3 p.m. for the 1 1/2-hour tour.", "Though many aspects of Canadian culture may seem familiar to Americans, two key differences are the country's use of the Canadian dollar and the international metric system. One U.S. dollar equals about CA$1.40, but the exchange rate often fluctuates, so be sure to check it before your trip. For temperatures and weights, remember that metric units (Celsius and grams) are used. You'll also want to familiarize yourself with kilometers and liters if you plan on renting a car, since distance is measured in kilometers (1 kilometer equals around 0.6 miles) and gas is sold by the liter (1 liter equals about 0.3 gallons).", "Seafood, seafood, seafood. If you love the bounty of the sea, Halifax is heaven. Lobster, salmon, scallops and other fish can be found on menus everywhere, prepared in every way imaginable, from traditional seafood chowder to lobster tacos. The donair, a pita stuffed with shaved-and-spiced beef, topped with a sweet sauce made from condensed milk, is a local favorite. A popular spot to sample local fare is at the Seaport Farmers Market, one of the oldest farmers markets in North America. And if you want your meal with a side of great views, head to the waterfront for tons of cafe, bar and restaurant options. ", "The best ways to get around Halifax are on foot or by bus. Despite its hilly terrain, central Halifax is extremely compact and walkable, but you'll need stamina and sturdy walking shoes. You can also rely on Metro Transit, which operates buses throughout the city and ferries to nearby Dartmouth. However, if you're planning on venturing outside Halifax, you will need a car. You'll find major rental agencies both in town and at the Halifax Stanfield International Airport (YHZ), located about 20 miles north of downtown.", "A passport is required for citizens of the United States to travel to Canada and enter the country. You must produce a passport, passport card or NEXUS card (which allows expedited border crossings for travelers through Canadian and U.S. border controls). For more information, visit the U.S. State Department website."]}