{"name": "Playa del Carmen", "description": ["Playa del Carmen has carved its own Euro-chic niche along the Yucatán Peninsula, making it a unique and fashionable place to plan your Mexican getaway. Sophisticated expats and vacationing Europeans relax at the beachside lounges, upholding this small enclave's budding reputation as the place in Quintana Roo to see and be seen. The area's nerve center is El Zócalo, which is well-known for its bronze statue arch that serves as a tribute to Mayan ancestors that lived in the Yucatán Peninsula before the 16th century. Similar to Mediterranean beachfront towns like Nice, the funky little public square is within walking distance of the beach.", "Just off the square and running parallel with the shore, La Quinta Avenida features 22 city blocks worth of eateries, bars and quirky shops. And with proximity to the ancient ruins of Tulum and ample natural landscapes to explore (like Río Secreto, Xel-Há and the underwater depths of the Caribbean Sea), Playa del Carmen caters to history buffs and outdoor enthusiasts alike. And of course, Playa's swaths of white sand and brilliantly turquoise water impress even the most selective beach bums. Cancún is Mexico's vacation of the past – today's savvy beachgoers choose the cosmopolitan \"Playa.\"", "The best time to visit Playa del Carmen is between April and May, when there are fewer people along the shore. Day temperatures hover between 70 and 90 degrees Fahrenheit, dropping slightly in the evenings. From October to March, the climate is generally dry and slightly warm. Summer days and nights tend to offer high temperatures and humidity. The Atlantic hurricane season lasts from June to November, so check local weather forecasts and hurricane warnings before booking your trip.", "Watch where you step Native animals, including iguanas, coatis (raccoon-like creatures), and spider monkeys run wild throughout the tourist areas looking for food.", "Do as the locals do Playa residents take pride in the cleanliness of their city. Be sure to take care of the beach and surrounding areas. You should especially remember to dispose of trash properly when on the beach.", "Keep your guard up Shop owners on La Quinta Avenida and elsewhere will beg you to come into their stores, then pressure you to buy. Their sales tactics are harmless, but also high pressure.", "Budget for the photo package Many of the adventure activities and parks around Playa del Carmen, such as Xel-Há and Río Secreto, won’t allow you to take your own photos. Instead, the parks give visitors the option to buy photos taken by on-site staff. If you know you’ll be opting for the photo package, expect to pay an additional $80 to $100.", "Go it on your own Most organized excursions to Tulum and Xcaret tend to be rip-offs designed to get you into the souvenir shops. To save yourself the trouble, catch a shared van (colectivo) for a more reasonable price.", "Playa del Carmen is largely a beachy tourist destination as opposed to an authentic Mexican town, but there are certain sensibilities and customs that could make your stay there more pleasant. Many tourist industry workers speak English, but you should try to learn a few Spanish words. Saying \"hello\" (hola), \"goodbye\" (adios), \"please\" (por favor) and \"thank you\" (gracias) could go a long way in quality service at hotels and restaurants.", "The dress code in Playa del Carmen is more lax than other parts of Mexico. Resort wear is common on the beach and around town, and \"dressy casual\" attire is typical for nightlife.", "Playa del Carmen's official currency is the Mexican peso. Since the Mexican peso to U.S. dollar exchange rate fluctuates, plan to check the conversion before you go. American dollars are, however, widely accepted in Playa del Carmen, though you may get change back in pesos.", "Chances are, you'll eat most of your meals at your hotel, especially if you're staying in an all-inclusive resort. But you should plan to venture off the property for a few meals to sample a few of Playa del Carmen's offerings around town. Playa offers a wide range of eateries, from simple local fare to sophisticated fine dining establishments. You'll likely encounter menus full of seafood, Mexican fare and even some American eats.", "Quality traditional Mexican fare is not as easy to find as one might think, but there are a few popular spots experts and travelers recommend. La Coronela is known for its tasty staples (think: tacos, enchiladas, guacamole, margaritas and more) at affordable prices. For succulent and fresh tacos al pastor, head to El Fogón; for shrimp tacos and ceviche, check out La Laguna in the Fairmont Mayakoba. The town is also known for having a significant expatriate European population, evidenced by many European-style restaurants serving everything from tapas to Italian cuisine.", "The best way to get around Playa del Carmen is on foot, as most of the best things to do are located right off the beach. You can also utilize the local bus service, and you'll find the main bus service located at 5th Avenue and Juarez Street If necessary, you can also hail a taxi to escape the main resort area. Ferries to Cozumel are also available and easy to use since the ferry terminal is located in downtown Playa del Carmen in the thick of the hotel zone.", "To get to Playa del Carmen, most travelers fly into Cancún International Airport (CUN), which is about 35 miles north of Playa del Carmen. To reach Playa, you can rent a car, take a bus or hop in a taxi. Your hotel or resort may even offer airport transportation within its all-inclusive package – check to see what's available before reserving airport transportation. If your hotel does not provide shuttle service, consider hiring a driver – several travelers recommend Cancun Airport Transportation – which can be reserved and booked in advance. One-way rides start at $85 for between one and three people. If you'd rather save some cash, you can also opt for the ADO bus that transports travelers from the airport to the bus station in downtown Playa del Carmen (fares cost less than $10 per person). Keep in mind: From the Playa bus station, you'll need to find different transportation to reach your hotel.", "A passport is required for entry into Mexico. Travelers must also carry a Mexican Tourist Permit, which is issued free of charge upon arrival. You can fill out the information for the tourist permit online ahead of time and bring it with you, and doing so can save you considerable time upon arrival at the airport.  Be sure to hold on to the tourist card, as you will need to present the card upon departing the country. For more information on entry and exit requirements, visit the U.S. State Department's website"]}