{"name": "Abu Dhabi", "description": ["Compared to Dubai, Abu Dhabi may seem a bit, well, boring. The capital of the United Arab Emirates has a long way to go to compete with all the hype, glitz and glam of its northeast neighbor. But that doesn't seem to faze the folks in Abu Dhabi; the UAE's largest emirate is already sitting on piles of oil money, so there's no rush for it to compete in the tourism market. However, this doesn't mean that there's nothing here for visitors. Before you write off Abu Dhabi as a humdrum, conservative place, consider this: The city's slower growth has allowed it to preserve more of its history and culture, which you can experience on a visit to Heritage Village or the impressive Sheikh Zayed Grand Mosque. And where Dubai is lacking in natural beauty, Abu Dhabi excels with a mix of rolling sand dunes, verdant oases, expansive beaches and towering mountains.", "The city of Abu Dhabi bustles with activity, boasting a mélange of shopping centers, gourmet restaurants, luxury hotels and cutting-edge real estate developments — in all, an excellent portrait of the modern-day UAE. But there's much more to Abu Dhabi than the city. In fact, the emirate (also named Abu Dhabi) comprises most of the country's land area. If you can, leave Abu Dhabi city behind and sample a more authentic UAE with a visit to the ancient Al Jahili Fort in the eastern city of Al Ain, a camel trek across the Empty Quarter desert in the southern part of the emirate, or a lesson in the ancient art of falconry in the Abu Dhabi city suburbs. You can see skyscrapers and go shopping anywhere — it's the inclusion of the more traditional experiences that will make your visit to the UAE memorable.", "The best time to visit Abu Dhabi is between April and May or from September to October. The spring and fall shoulder seasons yield pleasant weather, manageable crowds and reasonable hotel rates. For the best weather — not too hot and not to humid — you'll want to visit in the wintertime (December through March). However, this is Abu Dhabi's peak season, with business travelers snagging all the city's cabs and tourists flocking to the beach. If you're looking for the best prices, summer is your season: The city is practically free of tourists, but triple-digit temperatures and smothering humidity will make any time spent outdoors feel gruesome.", "Occupying more than 80 percent of the United Arab Emirates' total area, Abu Dhabi is the largest of the country's seven emirates and the capital of the UAE. Abu Dhabi is the name of both the emirate and its primary city, which is located on a T-shaped island along the emirate's western coast. Abu Dhabi rocketed to its standing as one of the wealthiest cities on the planet in 1958 while under British command. Today, each emirate is governed by its own sheikh (chief) who is entirely sovereign in his respective territory. However, similarly to the United States, the UAE is overseen by a federal government with the sheikh of Abu Dhabi (currently Khalifa bin Zayed bin Sultan Al Nahyan) acting as president.", "The UAE is an Islamic nation, so visitors can expect to encounter common religious practices, including prayer sessions (five times a day) and the observance of the Muslim holy day (every Friday). Many shops, restaurants and attractions close on Fridays, though businesses continue to operate during Ramadan, the Islamic holy month during which Muslims fast during the day. If your visit coincides with Ramadan, avoid eating, drinking and smoking in public.", "Modest dress is paramount to Emirati culture. You can expect to see men and women dressed in traditional kanduras (long, shirt-like robes worn by men) and abayas (loose black robes worn by women). Most locals also keep their heads covered — men wear white or red-checkered headdresses known as ghutra, while women wear headscarves called sheylas or long veils known as burkas. Although female tourists are not expected to keep their heads covered in public, headscarves are required when visiting the Sheikh Zayed Grand Mosque. Also, visitors should avoid wearing tight or revealing clothing (though modern swimsuits are acceptable on the beach) and avoid engaging in public displays of affection, such as hand-holding or kissing.", "The official language of Abu Dhabi and the UAE is Arabic, but English is widely spoken here. As far as money goes, Emiratis conduct business in UAE dirhams (AED): 1 AED is roughly equal to $0.27 USD. Although credit cards are widely accepted, you'll want to have cash on hand when visiting Abu Dhabi's traditional souks (markets); ATM machines are not hard to find in Abu Dhabi city. Also, don't be afraid to try your hand at polite haggling in souks — try proposing half the desired amount and seeing if you and the vendor can meet you in the middle.", "You'll find all types of cuisine in Abu Dhabi — the city's rise in popularity among tourists has prompted the arrival of everything from Korean fare to Russian specialties. But you would be remiss if you left the UAE without sampling some local staples.", "Emirati cuisine is influenced by the country's location: The UAE's seat on the Persian Gulf prompts a heavy reliance on fish, and Middle Eastern spices like saffron, cinnamon, cardamom and turmeric are featured prominently. Other popular ingredients include chick peas, rice, yogurt and meats like chicken and goat. Also, don't be surprised to see camel on the menu, though \"ships of the desert\" are valued more for their milk than their meat. Some dishes worth sampling include Al Majboos (spiced meat boiled with dried limes and saffron rice) and Al Madrooba (salted fish blended with spices and nuts in a thick sauce and served over white rice).", "Although it can be difficult to find traditional Emirati fare in more touristy areas, you'll find several restaurants in Abu Dhabi city's Al Mina district dishing out local cuisine — try Al Arish near the fish market. Or for a more upscale UAE dining experience, head to Mezlai in the Emirates Palace; this restaurant was the first high-end restaurant in Abu Dhabi to specialize in local cuisine. Of course, no dinner would be complete without dessert. Many Emirati sweets shine the spotlight on the country's favorite fruit: dates. Alongside your Gah-wa (strong Arabic coffee), order a plate of ligamat (deep fried batter — similar to doughnut holes — drizzled with date syrup) or bethitha (semolina combined with crushed dates, butter and cardamom).", "When planning for dinner on the town, keep in mind that Emiratis eat later than Americans; generally, locals will sit down to dinner around 10 p.m. or later. Also, you should feel free to leave behind a 10 to 15 percent tip, though gratuity is typically factored into the bill.", "Despite its location, Abu Dhabi is a very safe place to visit; the UAE  does not get involved with conflicts taking place in other parts of the  Middle East. But that doesn't mean you should completely let your guard  down — make sure to keep a close eye on your valuables, especially in  crowded areas. Meanwhile, women traveling to Abu Dhabi should feel safe  exploring on their own, but note that Emirati men have been known to  stare (most likely out of curiosity than disrespect).", "Like in any big city, you should keep an eye on your valuables when exploring Abu Dhabi. This is also true for the souks, as heavy crowds offer a convenient veil for petty crime.", "Also, make sure that you're drinking plenty of water and applying sunscreen regularly. Even if you don't plan on staying outside for long, the sun's rays are powerful here; failing to hydrate and take care of your skin can lead to a nasty case of heat stroke or sunburn.", "The best way to get around Abu Dhabi is by car, especially if you plan on spending a lot of time outside of Abu Dhabi city. The emirate's major highways are easy to navigate, although maintenance efforts can cause construction-related traffic. However, if you intend to spend the majority of your vacation in and around Abu Dhabi city, you'll fare just fine with taxis and the public bus system. Cabs are a relatively affordable means of transit, and you can easily flag them from the street. Meanwhile, the Abu Dhabi Department of Transport operates a fairly extensive bus network within Abu Dhabi city and to and around other parts of the emirate, including Al Ain and parts of Al Gharbia. To help you find your way around, you can rely on interactive map services provided by DARB.ae, which can help you plot your car and bus routes. Walking is also an option, but you'll need to take precautions to ward off heat stroke (especially during the summer months).", "More than 50 airlines service Abu Dhabi International Airport (AUH), which sits about 20 miles east of Abu Dhabi city on the mainland near the bridge to Yas Island. You can rent a car at the airport, or you can take a taxi — you should expect to pay around 70 to 80 AED (roughly $19 to $22 USD) to get from the airport to Abu Dhabi city.", "Abu Dhabi also features several smaller airports servicing destinations within the emirate and the UAE. Located in Abu Dhabi city is the Al Bateen Executive Airport (AZI), which services private jets. Travelers can also fly into Al Ain International Airport (AAN), though this much smaller airport doesn't have nearly the capacity of Abu Dhabi International. Meanwhile, both Sir Bani Yas and Dalma islands feature their own airports to accommodate flights from within the UAE.", "Americans visiting the United Arab Emirates must have an official U.S. passport that is valid for at least six months following their arrival date. Those staying for fewer than 30 days must obtain tourist visas, which are available for free at the Abu Dhabi International Airport and all other ports of entry. For visits exceeding 30 days, travelers must obtain a visa prior to departure. Americans who intend to leave the UAE by land will have to pay a 20 AED (roughly $5.50 USD) exit fee, payable only in local currency. For more information, visit the U.S. State Department website."]}