{"name": "Salem, MA", "description": ["You can't visit Salem, Massachusetts, without delving headfirst into this New England town's eerie past. Best known as the location of the 1692 Salem witch trials, a period of mass hysteria that resulted in the deaths of 25 people, Salem has developed a reputation as one of the most haunted destinations in the United States (and one of the most historic). Today, tourists flock to the Witch City for its fascinating history, elaborate Halloween festivals and, of course, to relive their favorite scenes from classic films and TV shows like \"Hocus Pocus\" and \"Bewitched.\"", "Despite Salem's strong roots in all things spooky – just check out the Witch House or Old Burying Point Cemetery to see for yourself – this small coastal town has more to it than just witches. Located roughly 20 miles northeast of Boston, Salem is home to a thriving arts scene, beautiful parks, eclectic eateries and stunning Colonial architecture. Set aside some time for exploring sites like the Peabody Essex Museum and the House of the Seven Gables, and don't forget to hit up the shops in Essex Street Pedestrian Mall before you leave. If you're short on time, consider signing up for one of the best Salem tours. Led by knowledgeable locals, these tours offer an in-depth history lesson and hit up many of the city's top sights.", "The best time to visit Salem is September through November. Although you'll have to contend with hordes of tourists looking to explore the Witch City come October, Salem's jam-packed calendar of events, breathtaking fall foliage and spooky Halloween decorations make it worth the trip. A summer visit won't disappoint either, as warm weather in the 70s and 80s makes exploring Salem's outdoor attractions like Winter Island and Salem Willows Park a treat. Come winter, the chilly weather calls for added layers, but this is also the best time of year to catch a deal on airfare and hotels. If you can't handle the cold, but don't want to deal with the summer and fall crowds, visit between March and May when many of Salem's tours and attractions reopen for the season.", "Follow the red line If you're wondering what that red line is painted on the sidewalk, that's Salem's Heritage Trail. This red line connects all of Salem's most famous attractions, including the Peabody Essex Museum, the Witch House, House of the Seven Gables and Old Burying Point Cemetery. Spend the afternoon following it and see where you end up.", "Bring your costume If you're visiting Salem in October, you can expect to see hordes of visitors decked out in their favorite Halloween attire – don't get left out of the fun by leaving yours at home.", "Parking is scarce Salem is a small town and parking spots are limited, especially if you visit in summer or fall. Combat this by using public transportation when you can – the Salem Ferry offers convenient service to and from Boston, and the Salem Trolley and Salem Skipper, a ride-sharing service, make getting around town a breeze. Visitors can also take advantage of Salem's affordable public bike share system, Bluebikes. When in doubt, lace up your walking shoes for a stroll around town.", "Be respectful Salem's reputation as a haven for Halloween lovers precedes it. But visitors looking for a fun weekend in Salem shouldn't forget the serious history behind the costumes. In 1692, 25 people lost their lives after being accused of practicing witchcraft: 19 were executed by hanging, one was pressed to death and five more died in jail. Please be respectful when visiting historic sites and landmarks.", "Visit during the offseason Although visiting Salem during October is a rite of passage for Halloween enthusiasts, this is also one of the most expensive times of the year for a trip to Salem. Save some coin by visiting in the winter and spring offseasons, or by timing your visit for September ahead of the October crowds.", "Opt for public transportation Ditch the car for a ride on the Salem Skipper. This on-demand ride-sharing service picks passengers up from any location within Salem and matches them with other passengers heading in the same direction. Not only does this reduce the traffic within Salem, it is more convenient and cost-effective than driving. Rides before 7 p.m. cost a mere $2 each, while rides after 7 p.m. cost $3 each.", "Purchase a combo ticket Salem is full of must-see attractions. Luckily, many of these attractions offer specials throughout the year, along with discounted combo passes on tours, performances and events. Do your research ahead of time to ensure you get the best deal.", "Try roughing it Scoring an affordable hotel room can be tough during Salem's busy summer and fall seasons. Luckily, this is also when temperatures are at their most comfortable, which makes camping an excellent option for travelers on a budget. Pack a tent or load your family into an RV for a stay in Winter Island Park. Located only 2 miles from downtown Salem, campsites here range from $35 to $50 per night."]}