{"name": "Hong Kong", "description": ["To outsiders, Hong Kong can raise a lot of questions: \"Is it part of China or not?\" \"Is it one island or two?\" \"Do they speak English or Mandarin? Or both?\" And foreigners have a good reason to ask them. This territory, made of multiple islands, returned to China's possession in 1997 after more than a hundred years of British occupation. Upon its reunification with China, Hong Kong added certain stipulations that provide a unique degree of autonomy. For instance, the official currency remains the Hong Kong dollar (HKD); English and Chinese are the official languages; and the tiny nation has an independent judiciary system. In short, China and Hong Kong observe a \"one country, two systems\" policy that can have many foreigners scratching their heads. But don't question it. Just accept it and enjoy everything this territory has to offer.", "Hong Kong distinguishes itself from its Chinese brethren like Shanghai and Beijing with its vibrant, multifaceted culture and stunning cityscape. This British-Chinese hybrid astounds visitors with its striking juxtaposition of dense skyscrapers and lush landscapes. From sandy beaches to rugby pitches, there's more fresh air than most travelers suspect. And, of course, as a world-class metropolis, Hong Kong boasts numerous urban diversions, such as culinary hot spots and museums. After visiting Hong Kong, the only question you might be asking is: \"Why didn't I get here sooner?\"", "The best time to visit Hong Kong is between October and December. This period boasts comfortable temperatures and reasonable room rates. After New Years, tourism picks up significantly, despite the lower temps, and leads to higher hotel prices and more crowds. Another sweet spot for affordable travel is the short spring. And while summer remains a popular time for tourists, the weather can be stiflingly hot and humid. To protect your wallet, avoid Chinese national holidays and large conventions, when hotel prices soar. Check out the Hong Kong Tourism Board's city calendar for updated information.", "Not just a city Hong Kong is, in fact, a territory made of numerous islands and a peninsula. You'll spend most of your time on Hong Kong Island, the Kowloon Peninsula and Lantau Island.", "Get out of town While most people only picture Hong Kong as an urban destination, there are gorgeous seaside parks to explore. And with Hong Kong's sophisticated public transit system, you can get out of the city in no time.", "HKTB is your new BFF HKTB stands for the Hong Kong Tourism Board, an invaluable resource for before and after you've arrived. Stop by the HKTB centers in the airport or in the Tsim Sha Tsui Star Ferry concourse for free information and helpful tips.", "Take the tram Public transportation is cheap, only costing HK$2.30  (less than $0.30 USD). Keep in mind, though, the trams only accept exact change and are only on Hong Kong Island.", "Book your room early While Hong Kong's attractions and transportation are affordable, the hotel room rates can be exorbitant. Book early and don't be afraid to stay a little farther from downtown, as long as you're near an MRT station.", "Head to the food court Sit-down meals can cost you a pretty penny in tourist areas, but you can usually find inexpensive options in nearby food courts.", "Since its reunification in 1997, Hong Kong maintains a complex relationship with mother China. The former British colony continues to operate under a capitalist economy (despite China's communist ways), has its own currency (the Hong Kong Dollar), and creates its own laws. And due to Hong Kong's multicultural population and heritage, the official languages here are Chinese and English, not Mandarin. American travelers who have visited other Chinese cities like Beijing will notice a much stronger Western influence in the urban landscape, array of food choices, social practices (like greeting with a handshake) and more English speakers. These familiar aspects and the ease of getting around greatly reduce the culture shock that visitors usually experience upon entering China.", "If there's one word to summarize Hong Kong's dining scene it's this: vast. Hong Kong boasts more than 12,000 restaurants throughout the city, making it easy to find a place to eat (and a really good one at that). Alongside foodie hubs like Paris, Tokyo and New York, Hong Kong has the most Michelin-starred restaurants in the world. But if your pockets aren't deep enough to treat yourself to a fine dining experience or two, you'll find the city's foodie scene caters to all kinds of budgets without skimping on quality.", "If you're unsure where to begin, start with the basics. Unsurprisingly, Hong Kong's cuisine is heavily influenced by China, with popular dishes including dim sum and Chinese barbeque. However, what has made Hong Kong's dining scene stray from the mainland, and partly why it has become so unique, is its western influences. After World War II, western cuisine quickly became popular in Hong Kong, but was considered too pricey for the average citizen. Adjusting to fit the needs of the times, Hong Kong-style teahouses were born. A modern-day staple in the fabric of Hong Kong's culinary identity, the cha chaan teng's serve a variety of must-try dishes, including Chinese barbeque, stir-fries, congee and what's called \"soy-sauce Western\" – western dishes infused with soy sauce or other Chinese flavors. What's more, they're more likely to offer English menus than other dining establishments in the city.", "Along with stir-fry, trying congee is essential if you want to have an authentic foodie experience in Hong Kong. Considered a favorite late night bite among locals, congee is rice porridge mixed with noodles and oftentimes vegetables and meat. Different regions around China have their own versions of congee, many of which have made their way to Hong Kong. Chinese barbeque is also a big must-try dish, with the heavily seasoned meats rumored to be nothing short of succulent. But fair warning to the faint of heart: full-bodied barbequed meats are hung on display in shop windows. Then there's the seafood, which is prepared in almost every fashion, from stir-fried to baked to deep-fried. But if you're looking for the quintessential Hong Kong taste, go with the steamed fish. It's a preferred method in Hong Kong for its simplicity: flavor of the fish comes first, seasoning is always second.", "Street stalls are also a way to sample good, traditional Hong Kong delicacies without having to fork over too much coin. Dai pai dong, or open-air street stalls, typically serve stir-fries and provide the enthralling experience of dining in the middle of Hong Kong's contagious hustle and bustle. Travelers can also pick up a variety of tasty treats on the streets, including pineapple buns (which are named after the dough's resemblance to pineapple skin), egg tarts (rumored to originate from English custard cakes), put chai ko (sticky rice pudding) and so much more. While dai pai dong are easy to find, Temple Street is said to have some pretty knockout stalls. It's important to note, however, the distinction between food stalls and food carts. While food stalls are completely safe to eat at, food carts are unlicensed and have a reputation for serving unsanitary food. If you're not one for street eating, hopping into a food court will yield a similarly satisfying culinary experience. Food courts in Hong Kong don't carry the same negative stigma as they do in the states, so it's common for these fast food-like establishments to be packed with locals slurping their noodles. The biggest food court chains are Maxim's MX, Café de Coral and Fairwood.", "The best way to get around Hong Kong is the Mass Transit Railway (MTR). Ideally, you'll use a combination of the MTR and your own two feet to get places quickly and cheaply. If you take a bus or minibus, you run the risk of missing your intended destination as these two options are difficult for visitors who do not speak Cantonese, especially if you take a minibus. The ferries and the trams offer scenic routes, which you should take when you have time to absorb Hong Kong's bustling environment.", "Most visitors arrive through Hong Kong International Airport (HKG), located just off Lantau Island. While many visitors simply hop in a taxi and zoom off to downtown, you can avoid the cab fare by using the MTR's high-speed Airport Express. This train takes only 24 minutes to reach the city, and a complimentary shuttle bus will pick up passengers at the Hong Kong and Kowloon stations and transport them to popular hotels nearby. ", "Unlike other areas of China, Hong Kong does not require visitors to obtain a tourist visa. You will, however, need a passport that is valid for at least one month beyond your intended return date, sufficient proof of a later departure (a return airline ticket will do) and adequate funds to support your visit. These requirements are noticeably less strict than those at other Chinese points of entry. If you venture into one of China's more restricted areas without the proper visa or the prescribed passport expiration date, you will be in violation of Chinese immigration laws. Check the U.S. Department of State's website before leaving for Hong Kong. ", "The Hong Kong skyline, whether viewed from the Star Ferry or Victoria Peak, is the main attraction in the city. It's so majestic, travelers strongly recommend visiting it during both the day and night."]}