{"name": "Brussels", "description": ["The capital of Belgium, but also the de facto capital of the European Union, Brussels is one of Europe's most underrated destinations. The city's Gothic- and Baroque-style squares, set between medieval streets, are the playgrounds of international politicians and adventurous tourists alike. Authentic brasseries offer hearty Belgian comfort food, and daily doses of chocolate and beer are worth every euro. Brussels is cosmopolitan in ways other cities are not – it's truly multilingual (French, German and Dutch). The multicultural influences have led to an explosion of museums, marketplaces, restaurants and boutiques that make it far more than just a sleepy alternative to some of its busier neighbors like Paris or Amsterdam.", "The best time to visit Brussels is between March and May and September and October, the shoulder seasons; this is when room rates are cheaper, there are fewer tourists and the weather is mild. This city experiences all four seasons and rain is a possibility year-round. Average lows range from the mid-30s in winter to the low 70s in summer.", "No matter when you're in town, you can count on something going on at the Grand-Place, from street performances and floral displays to nightly light shows during the holiday season, when the square is illuminated by a massive Christmas tree. Another great time to visit is around the Ommegang festivities (the first week in July). This Renaissance-style festival recreates the celebration held when Emperor Charles V first entered the city in the 16th century.", "Plan a weekend day trip Day trips to Belgian locales like Bruges, Antwerp and Ghent are fast and easy thanks to the country's extensive train system. Plus, since Brussels is a business hub, it's half as expensive to travel to nearby hot spots on the weekends than it is during the work week.", "Buy a Brussels Card Available in 24-, 48- and 72-hour versions, this card gets you free entry to more than 40 museums, as well as discounts at shops, bars, restaurants, select tourist attractions and tours.", "Rent a bike Belgians are mad about cycling: Instead of paying taxi fares or the cost of public transport, rent a bike and make your way around the city on the cheap.", "Get the prix-fixe or \"plat du jour\" Belgian dining can get expensive, so stick to the fixed price menus or the “dish of the day” instead. Your wallet and stomach will thank you.", "The official currency in Brussels is the euro. Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Major credit cards may not be accepted at all restaurants, hotels and shops, so it's useful to carry some cash.", "Belgium is also largely Catholic and celebrates many Catholic holidays. In Brussels, three languages are commonly spoken: French, Dutch and German. You'll also want to be sure to shake everyone's hand when you greet them and before leaving.", "When dining in Brussels, it's considered polite to keep both hands (not elbows) above the table while eating. It is also polite to finish all the food on your plate; if you find yourself too full to finish, indicate that you have finished eating by placing both your knife and fork on your plate with the handles facing outward. Gratuity is normally included in the bill, but you should feel free to round up the total or leave a few extra euros for exceptional service.", "Brussels brims with Michelin-starred restaurants: for a decadent meal, try century-old Comme chez Soi, a classy Art Nouveau-style venue less than a mile south of the Grand-Place. Just as fun is a trip to one of the city's many atmospheric brasseries, where meat and fish take center stage: Classics include moules-frites (mussels and French fries), waterzooi (a broth of fish or chicken and vegetables) and hearty stoofvlees (beef stew cooked in brown beer). To keep food costs down, avoid the area by the Grand-Place, and venture to foodie neighborhoods Sainte-Catherine, home to famous seafood spot Noordzee Mer du Nord, or the communes of Ixelles and neighbouring Saint-Gilles. Many restaurants offer prix fixe two- or three-course menus, but another wallet-friendly option is a cornet of fries. Given that some believe Belgium actually invented French fries, frietkots (fries stands) aren't hard to find. A good choice is the iconic Maison Antoine, where you should ask for the samourai sauce, a spicy mayo and chili combination that's popular locally.", "Probably the three things for which Belgium is most famous are beer, chocolate and waffles. The latter come in two versions: Brussels and Liège, with the Brussels version a little less indulgent. For chocolate fans, a pilgrimage to the Galeries Royales Saint-Hubert is a must. Here, you'll find the first ever outpost of Neuhaus, who are credited with inventing the praline back in 1912. If you're on the hunt for chocolate you wouldn't be able to source easily at home, try Laurent Gerbaud, who also offers chocolate-making workshops. Finally, you'll want to set aside time for a glass or two of Belgian beer; the country boasts more than 1,500 varieties, and its whole beer scene has UNESCO World Heritage status. Time-worn “brown bars” (traditional pubs) cluster near the Grand-Place, but if you venture about a half-mile east, you'll hit a major pilgrimage spot: Delirium Café, which offers more than 2,000 beers. For a trendier craft beer option, Brussels Beer Project has several outposts across town.", "The U.S. Department of State warns visitors to Belgium of possible terrorist activities, especially in crowded areas or at high-profile events. You should also watch out for purse-snatchers and pickpockets. Oftentimes, these criminals work in groups in crowded tourist areas, as well as at train and metro stations. The Department of State advises drivers to park in garages and not on the street. Keep your bags with you when traveling by train, and don't wear expensive jewelry or watches. Only use bank ATMs and ask restaurants to swipe your card in front of you.", "The best way to get around Brussels is on its extensive public transit system, the Brussels Intercommunal Transport Company (usually referred to by its double acronym, STIB/MIVB, or simply as STIB). Trains run up to six times an hour from Brussels Airport (BRU) to central Brussels. There are three major train stations: Brussels-Central Station, located in the heart of the city; Brussels-South, which sits southwest of the city center; and Brussels-North, just north of the city center.", "Biking is also popular in Belgium, with bike rentals available across the city through companies like Villo! and Pro Velo. There are even water buses that operate from May through October, which will take you along the canal between Brussels, Sainctelette (handy for the KANAL-Centre Pompidou art musuem, due to launch in 2025) and Vilvoorde.", "A valid passport is required for United States citizens to travel to Belgium. U.S. citizens can stay for up to 90 days without obtaining a visa. At customs, you'll have to present a return airline ticket, as well as a passport that is valid for at least three months after the date of return. If you're planning to stay in Belgium for more than 90 days, you'll have to obtain the proper visa before leaving the U.S. For more information, visit the U.S. Department of State's website."]}