{"name": "Santa Fe", "description": ["Santa Fe is a colorful, artistic city, bursting with a rich history and plenty of festivals that celebrate it all. With a culture based on a variety of unusual ingredients, including Gothic cathedrals, a love for the great outdoors, chile-infused cuisine and a profound emphasis on the arts, this truly is the \"City Different.\" Santa Fe also preserves a historic feel – with Spanish-influenced architecture and buildings that date back to the 16th century – but one of the main reasons people visit is for its art. The works of artists like Georgia O'Keeffe, Peter Hurd, Miro Kenarov and Gustave Baumann fill the galleries, pieces that were largely inspired by the city's dramatic, vibrant and evolving landscape. Anytime you visit Santa Fe, you can find many of these renowned works along gallery-lined Canyon Road. For a taste of up-and-coming talent, swing by one of the artisan markets, check out The Railyard Arts District or stop in to see glass-blowing demonstrations at Liquid Light Glass. Santa Fe is home to several museums that celebrate its diverse art scene as well, including the Museum of International Folk Art and the Georgia O'Keeffe Museum. Another part of Santa Fe's artistic side? Its music. The Santa Fe Opera welcomes talented acts to its venue amid the mountains.", "The same landscapes that spoke to O'Keeffe also call to adventurous types year-round. Active travelers hike the Sangre de Cristo Mountains, test the powder skiing at one of the nearby mountains and explore the 1.6 million acres of the Santa Fe National Forest. Need a way to round out your day? Santa Fe is also a great place to taste something different: Take your pick of one of the gourmet dining establishments scattered throughout the city.", "The best time to visit Santa Fe is between September and November. During this time, temperatures range from the high 20s to high 70s. One can argue that springtime has a similar climate with similar hotel rates, but the festivals make fall the clear winner. Summer temps rest between the 50s and upper 80s; however, this is the peak season, making hotel rates high and availability low. Winter can be chilly with highs reaching the upper 40s during the daytime and lows in the teens come nighttime. The sun's rays are constantly intense, even during the winter, so don't forget the sunscreen.", "It's the oldest capital in America The self-proclaimed \"Oldest Capital in the U.S.\" celebrated its 400th anniversary in 2010. The history here is impressive and frequently overlooked.", "It's the highest capital in America At 7,000 feet above sea level, Santa Fe is elevated well above other state capitals. Note: Altitude sickness can be an issue. Take time to adjust.", "It's arid Because of Santa Fe's dry climate, water is considered precious. Many restaurants may only serve water by request and hotels may ask you to aid in water conservation efforts.", "Avoid a Monday visit Many of the city's museums are closed on Mondays. If you're hoping to visit some of the city's top cultural attractions, make sure your trip doesn't fall on a Monday.", "Look for collector's items Prices for artwork typically range from somewhat affordable to extremely expensive along Canyon Road or in the Railyard Arts District. For a truly memorable (and reasonably priced) keepsake, try the artisan markets.", "Avoid seasonal traffic Surprisingly, the biggest force in Santa Fe's tourism industry is not just the weather. The full roster of festivals also helps determine peak seasons and, therefore, affects the hotel rates. Steer clear of them if you want a cheaper deal.", "Invest in the New Mexico CulturePass If you're planning to visit several Santa Fe museums, including the Museum of International Folk Art or the New Mexico Museum of Art, consider this pass. For $30, you'll have access to more than a dozen historical sites and attractions and the pass is valid for a year.", "Home to pueblo-style architecture, 17th-century churches and plenty of art galleries, Santa Fe is a feast for the eyes. If you're looking for party central, this isn't it. Santa Fe and its residents are sophisticated, taking pleasure in gallery window shopping and evenings out. Santa Feans are also often recognized as being among the nation's friendliest people.", "Because of the city's size, Santa Fe exudes a small-town charm, complete with welcoming residents. Don't be afraid to ask for directions – the crooked streets can be confusing – or engage in conversation. Dress is casual too, but make sure to bring light layers for sudden temperature changes, which are prone to occur.", "Santa Fe's restaurant scene is incredibly competitive and you're guaranteed a great meal no matter where you eat. The city offers a wide variety of international cuisine, but traditional Santa Fe fare is not to be missed. Gourmands flock to New Mexico to try the state's flavorful red and green chiles, which are a staple feature on Santa Fe menus. (Red and green chiles are the same type of pepper, the coloring and flavor just depends on when they're harvested.) Chiles can be used and consumed in numerous ways, from sauces smothered atop enchiladas and tamales to hearty stews filled with meat and other vegetables. If you're wondering where you can sample this signature treat, travelers suggest The Shed for green chile stew and the \"Shed Red\" sauce, and Horseman's Haven Cafe for green chile sauce (ask for it on the side, as this one is notoriously spicy). Those wanting to try a taste of both worlds should ask for the sauce \"Christmas-style,\" and you'll get both red and green chile sauce combined.", "If you're looking for a fine dining experience, travelers suggest you make reservations at Geronimo, lauded for its infusion of New Mexican flavors in its contemporary American menu, as well as its top-notch service (diners say this is a great place to celebrate a special occasion). Other popular fine dining eateries include The Compound Restaurant and Sazon. Casual eateries that win favor with locals and visitors include The Pantry Restaurant (for comfort food), Palacio Café (for traditional Southwestern fare and great service), Jambo Cafe (for Caribbean-African fusion) and TerraCotta Wine Bistro (for an extensive wine list, live music and tasty small plates). What's more, the Santa Fe Farmers Market is regarded as one of the best in the country, featuring stalls of fresh produce, cheeses, chile sauce and more. ", "When it's time for something sweet, travelers say you should head to Kakawa Chocolate House to sample the historic drinking chocolate elixirs, homemade ice cream, agave caramels, truffles and more. The shop's chocolatiers play with flavors and create confections with hints of chili, hibiscus and pomegranate, among other flavors.", "Santa Fe also boasts a margarita trail, where travelers and locals can sample margaritas at more than 45 different establishments in the region and collect stamps in a Santa Fe Margarita Trail smartphone app for each drink consumed (passports can only receive two stamps per day). Not only will visitors have the opportunity to taste the variety of spicy, sweet and tangy margaritas available, they'll also be able to turn in their stamped passport to redeem a prize (like a T-shirt or other gift).", "When it comes to safety, Santa Fe visitors should be more concerned about the elements and altitude than the crime rate, which is relatively low. The area's elevation and dry climate may pose health risks – particularly altitude sickness – to those who are not used to it. Common symptoms include dizziness, nausea, shortness of breath and fatigue. Drink plenty of water, avoid alcohol, heavy meals and strenuous exercise for at least a day and get plenty of rest. (The majority of people who need to adjust should be able to do so in 12 to 24 hours.)", "It's also best to be prepared for all types of driving conditions. Snow is generally not a problem during the winter but drive slowly in case of ice. Dust storms are can occur during the summer and fall. If you're driving during a dust storm and there is some visibility, drive slowly with your headlights on. If visibility is extremely limited, turn your headlights off and pull over until conditions are clear. Flash floods can also be a problem in the summer monsoon season: Signs will be posted on streets that will most likely be affected.", "The best way to get around Santa Fe is on foot. You can get your bearings and take advantage of the free, self-guided walking tours provided by the Santa Fe Convention and Visitors Bureau. Driving can be a hassle, but a car will be necessary to explore the surrounding areas; you should park it when you get into town. Reaching town, however, can be a challenge, since Santa Fe doesn't have a large airport. Most out-of-state travelers use Albuquerque International Sunport Airport (ABQ), which is about 65 miles south.", "For a higher ticket price, you can fly into Santa Fe Municipal Airport (SAF), which is located just outside Santa Fe's city limits. However, American Airlines and United Airlines are the only commercial carriers to serve that airport.", "Chile peppers are a staple ingredient of Santa Fean cuisine. Red and green chiles can be prepared and consumed in many different ways. See the dining section for more information."]}