{"name": "Amalfi Coast", "description": ["One look at the Amalfi Coast and you may believe that you've found heaven on earth. That's the kind of spellbinding effect this stretch of Italian coastline tends to have on the 5 million annual visitors who cross its mesmerizing paths. Located in the Campania region of Italy, this UNESCO World Heritage Site covers 34 miles of majestic terrain; sky-high costal cliffs display vibrant vegetation and multicolored towns live side by side with the disarming turquoise waters of the Mediterranean, creating a scene that has the power to stop even the most seasoned of travelers dead in their tracks. ", "The coast and the 13 seaside towns that call it home are all connected via the SS163 highway, considered one of the most scenic drives in the world. Each town comes equipped with signature Amalfi topography, as well as standout attributes of its own. The pastel-colored Positano draws in the rich and famous for its luxurious cliffside resorts and fine Italian dining, while the town of Amalfi is Italy's oldest maritime republic, once serving as a big commercial and technical hub in the Mediterranean. The alpine town of Ravello may not be for the faint of heart, but its ancient villas and stunning ocean views will be etched in your memory for years to come. Praiano's secluded shorelines will appease beach lovers and Minori, home to one of the oldest pastas in the world, is a mecca for foodies. And if you plan on passing through Cetara, you can stop at an ancient Norman tower, which according to legend, was founded by Hercules himself. However you decide to explore the Amalfi Coast, its glory is guaranteed to leave you completely gaga long after you've gone.", "The best time to visit the Amalfi Coast is in the spring and fall, specifically May and September. During these months, crowds are largely gone and temperatures are the most comfortable, with highs in the 70s and 80s. Though summer may sound like the ideal option, both domestic and international travelers flock to the tiny towns that line the Amalfi Coast, subsequently taking up tons of space. Winter travel is a great for scoring a deal, but it's also when cafes and restaurants close up shop for the season. The autumn months following September are another recommended time to visit, as day temperatures are still relatively warm. ", "Summer is exceptionally crowded Domestic and international travelers travel to the Amalfi Coast in droves during July and August, so expect traffic delays, clogged beaches and seriously crowded streets.", "Prepare to hike The towns in the Amalfi Coast are built into cliffs and feature streets unable to accommodate cars. Not only that, but many of the region's beaches don't offer parking and are only accessible by stairs or trails.", "Take the bus Though the best way to get around the Amalfi Coast is by car, the cost of rentals, taxis and private cars adds up fast. The Sita bus services the whole of the Amalfi Coast and offers rates as low as 2.20 euros (about $2.40).", "Hop on the ferry Boat tours in the Amalfi Coast are a splurge for most people, but if you take the ferry, which is at most 20 euros (about $22) for a one-way journey, you could save loads.", "Being one big UNESCO World Heritage site, the Amalfi Coast is brimming with culture. Each town offers its own special story. Amalfi is the country's oldest maritime republic and the center of the coast's once thriving paper business. Positano served as the choice destination for the rich and famous, including Picasso, Steinbeck and Elizabeth Taylor. Meanwhile, Minori is the birthplace of one of the oldest pastas in the world, Ndunderi. ", "Residents here speak Italian, but depending where you are, there may be regional dialect differences. When greeting other Italians in a social situation, shake hands. Greeting with a kiss or two on the cheek is common between Italians, but only if they know one another. Those not proficient in Italian needn't worry about getting too lost in translation. The Amalfi Coast sees about 5 million total visitors per year. While that pales in comparison to other Italian hotspots (Florence sees 16 million per year, Venice sees 70,000 per day), that doesn't mean English-speakers are few and far between. You can expect to encounter English-speaking Italians around popular attractions, restaurants in tourist areas, as well as hotels. Positano and Amalfi in particular have the most hotels and restaurants of any other town in the Amalfi Coast, so if you intend to go just there, you're not likely to encounter many barriers. However, the smaller towns that line the coast may pose issues. When in doubt, seek out younger Italians, as they are required to start learning English in school at age six. Key phrases to know are \"si\" (yes), \"grazie\" (thank you), \"mi scusi\" (pardon me), \"Parla inglese?\" (Do you speak English?) and \"Dov'e la toilette?\" (Where is the bathroom?).  ", "In Amalfi, restaurants are normally open from 12:30 to 3 p.m. for lunch and 7:30 to 11:30 p.m. for dinner. Locals, however, tend to eat lunch later in the afternoon at 1:30 and dinner at 9 p.m. Keep in mind: Service moves a little slower here. If you find yourself in more traditional establishments, don't expect servers to bring you the check unless specifically requested. Tipping is not common in Italy; instead, restaurants usually add a service charge upward of 12 percent. However, if you really enjoyed your meal or service, an extra 10 percent will suffice. ", "The Amalfi Coast yields much of the same delectable fare you'll find in other Italian cities. Allow yourself to indulge in as much pasta, pizza and cappuccinos as your heart desires, but make sure to save some room for regional flavors and dishes, some of which you'd be hard-pressed to find outside of the Campania region of Italy. As you may have guessed, seafood is a staple in the Amalfi Coast, and should be consumed at any given chance simply for its freshness. Of all the seafood dishes to try, you cannot leave without sampling scialatielli ai frutti di mare. This pasta dish is packed with all kinds of fish, including shrimp, redfish, blue fish, sea urchins, octopus, mussels, bream, mollusks and pezzogna. The best fish in the Amalfi Coast is said to be found in the town of Cetara, which touts itself as the world tuna capital. In fact, the tuna here is so revered, it's regularly exported to Japan for sushi. ", "If you plan to hop between towns during your trip, make sure to stop in Minori and Cetara. Cetara is famous for producing Colatura di Alici, a fish sauce made from anchovies, while Minori is known as the birthplace of Ndunderi. This ricotta gnocchi has been declared one of the oldest pastas in the world by UNESCO and can be found at any traditional trattoria in the town. ", "But of all the flavors you should seek out in Amalfi it should be lemons. You will probably soon notice that lemon trees are abundant in the Amalfi Coast. Seek out as many lemon-flavored dishes and products you can find, including Amalfi cookies, which are spread with lemon icing, and a roadside granita di limone, or lemon slushy. And, of course, you can't leave Italy without enjoying some limoncello, a lemon liqueur. ", "As far as the dining scene goes, Amalfi can be pretty upscale. Michelin-rated restaurants dot the region and most are concentrated in Amalfi and Positano. Amalfi is home to one of only two-starred restaurants in the region. Don Alfonso 1890 serves traditional Italian fare with a modern twist and boasts a 25,000-bottle wine cellar. The second is Torre Del Saracino, located about a 30-minute drive north of Sorrento. ", "The best way to get around the towns within the Amalfi Coast is on foot, though the best way to get around the region is by car. The Amalfi Coast region stretches 34 miles down the west coast of central Italy and there are multiple towns for travelers to explore. What all of the towns do share is the SS163 highway, otherwise known as the Amalfi Drive. Much like Highway 1 in Big Sur, California, this is the only road that can take travelers directly to the various towns that call the Amalfi Coast home. It is often referred to as one of the most scenic drives in the world, so much so that travelers consider it a can't-miss attraction within its own right. ", "The closest airport to the Amalfi Coast is Naples International Airport (NAP). To get from Naples to the Amalfi Coast, the Positano Tourism Board highly recommends arranging a private car transfer, especially if you're taking a long flight to get to the coast. There is no direct public transportation between Naples and Positano. Renting a car and driving down the scenic coastal highway is also an option, but driving for long distances along sky-high, cliffside roads, especially in the heat, may prove uncomfortable for some drivers. Travelers can also reach the Amalfi Coast by train. From Naples, you take can the Circumvesuviana train to Sorrento, Salerno or Vietri sul Mare, and then take a Sita bus to the nearest Amalfi town.", "The Amalfi Coast is a 34-mile-long region in Campania, Italy. The area is dotted with 500-foot-tall cliffs and 100 beaches, as well as 13 adorable seaside towns, including the colorful Positano."]}