{"name": "Wilmington, NC", "description": ["Wilmington, North Carolina, is one of the South's best kept secrets. Founded in the 1730s, Wilmington's past tells a story of ascension and decline: It was a major shipping port and the state's largest city by the mid-19th century. And as such, its historic center brims with gorgeous old homes and gardens. After a period of decline, Wilmington has risen again, thanks in part to the University of North Carolina Wilmington's youthful energy and the burgeoning film and TV industry: In fact, the city is known as \"Hollywood East\" for its large production studio and the number of movies and shows that have been filmed here, including \"Dawson's Creek,\" \"One Tree Hill\" and \"Iron Man 3.\" But along with its historic attractions and Hollywood appeal, Wilmington is beloved by visitors for its relaxed beachy vibe, its slow Southern gait and its swelling foodie scene. ", "The best times to visit Wilmington, North Carolina, are from March to May and September to November when room rates and temperatures drop from their summertime highs. The months between June and August are considered high season, when vacationers descend on the city and nearby beaches. The winter months of December, January and February are characterized by cold weather and a deserted city.  ", "It's Hollywood East Wilmington hosted the productions of some popular TV shows and films, including \"Dawson's Creek\" and \"One Tree Hill.\" You can view a full list of filming locations here.", "It's water sports-central Stand-up paddleboarding, kayaking and surfing are all popular pastimes here, and visitors can take lessons and rent equipment through operators like Hook, Line & Paddle and WB Surf Camp.", "It's the South Near the border of South Carolina, Wilmington is situated squarely in the South, where Southern hospitality and a slower way of life reign.", "Hit the beach Stunning shorelines like Carolina Beach, Wrightsville Beach and Kure Beach are easily accessible from Wilmington. Plus, they're free to visit.", "Consider a rental If you're traveling with a group, taking advantage of the many vacation rentals in the area may help you save some money on accommodations. What's more, many rentals are on located right on the beach.", "The Wilmington area's dining scene is currently undergoing a transformation, with establishments like Catch, Rx Restaurant and Bar, Manna Ave, Surf House, PinPoint and 40Eats trailblazing the local and seasonal approach to food (and picking up awards along the way). And as you might imagine, fresh fish and seafood – prepared with a Southern flair – feature heavily on many menus. Pick up a meal at Nippy's Soul Food Restaurant for a hearty combination of fresh seafood and delicious soul food made from family recipes passed down through generations. Other popular and scenic spots are found along Wilmington's Riverwalk, including Pilot House Restaurant and Caprice Bistro. For beer and spirits, visitors should head to Front Street Brewery. ", "A few must-try places (according to locals and visitors) include the Noni Bacca Winery, which earns rave reviews from recent travelers for its award-winning vino and its thoughtfully curated tastings. Motts Channel Seafood, a fish and seafood market centered in Wrightsville Beach, is another place to try, especially if you plan to cook while on vacation. One recent visitor recommends picking up a homemade key lime pie, along with the freshest fish and seafood you'll find in the area.", "If you're itching to try some North Carolina barbecue, head to Casey's Buffet & Barbecue, which serves southern staples like catfish, fried chicken, pan-fried okra and banana pudding, among other specialties.", "The best way to get around Wilmington is by car. Although the city is very pedestrian-friendly in certain places – including its Riverwalk, its Historic District and nearby beaches like Wrightsville – the city is far too big to manage on foot alone. If you're downtown, you can also hop aboard a public bus or the free trolley; both are operated by Wave Transit. Hailing a taxi or using your smartphone to order an Uber or Lyft is an option too.", "To reach Wilmington, you can fly into Wilmington International Airport (ILM), which is located just 5 miles north of downtown Wilmington. You can rent cars at the airport, or you can take the Wave bus service No. 207 to get from the airport to downtown Wilmington. Keep in mind:", "The Wilmington airport only operates flights arriving from and departing to northeast destinations, such as Atlanta, Charlotte and New York City. So if you're coming from anywhere else in the country, you'll likely have to make a layover in one of these cities. Alternatively, you can fly into Charlotte Douglas International Airport (CLT) and drive a little more than three hours to the coast. "]}