{"name": "Budapest", "description": ["Welcome to Budapest. To put it simply, if you haven't been here, it's time you make plans to do so. The city appeals to many: You can step out of a thermal bath and right into a nightclub (and then back into the bath). In a city that dates back to the Old Stone Age, visiting history buffs can take their pick between Roman, neo-Gothic, Renaissance and Ottoman architecture at sites like Buda Castle and Fisherman's Bastion.", "Budapest is more than just the political capital of Hungary – it's also the commercial and cultural nexus. From its multifaceted restaurant scene to its rich Jewish heritage, culture extends from nearly every inch of the Pearl of Danube. Split by the Danube River and composed of three main regions – Pest, Buda and Óbuda – Budapest meshes modern conveniences with ancient architecture and grassy parks. Whether you're searching for cuisine, shopping or museums, a multitude of all await you in Budapest. And prices are fair enough that you won't have to choose – you can indulge in them all. ", "The best times to visit Budapest are from March to May and September through November. These shoulder seasons are when the weather is idyllic and the city isn't overcrowded with tourists. However, the climate is always relatively mild, with temperatures rarely exceeding bearable levels. July and August experience average highs in the upper 70s, while average lows in January rest in the mid-20s. Tourists flood the city in summer, despite it being the hottest and wettest of time of year.", "Footwear is crucial Walking is a great way to experience Budapest. Bring your most comfortable shoes but also pack some fashionable kicks if you plan on tackling the nightclubs.", "Buy a Budapest Card Found online here or at most hotels, this card will save you a bundle on public transportation and top attractions around the city.", "Budapest has a rich heritage and tons of culture to go along with it. From sophisticated events, such as operas and symphonies, to a trendy nightlife scene to the historic Castle Hill region, the city offers something for everyone. District VII's Elizabeth Town neighborhood is a must-visit for culture hounds, as it's where the majority of Budapest's Jewish residents reside. Elizabeth Town also hosts the city's annual Jewish Cultural Festival.", "Many Budapest residents speak English (especially the younger generation), so you shouldn't have trouble communicating during your visit. Hungarian has a reputation for being an extremely difficult language for English speakers to master, but a little effort can go a long way – throw in a \"köszönöm\" (or thank you, pronounced \"kur-sur-nurm\") when you can.", "The forint is the currency of Hungary. One forint equals approximately $0.004, or less than one American penny. Exchange rates tend to be advantageous for Americans, though the rate may fluctuate, so it's best to check the current exchange rate before you go. ATMs are readily available, especially in the city center, and credit cards are also widely used in the central areas of Budapest.", "Although tipping isn't expected here like it is in the U.S., it is more common to leave tips for waiters, taxi drivers and other service workers in Hungary than in other countries in Europe. Tipping 100 to 400 forints (or $0.50 to $1.50) is the norm at thermal baths, while it is customary to give each hotel employee 200 to 500 forints ($1 to $2). Ten percent of your fare or bill is fine to leave for taxi drivers and restaurant waitstaff, though 15 percent for fine dining establishments will be well-received. Make sure a service charge hasn't already been added to your dining bill.", "Dining in Budapest is all about diversity. Have a traditional Hungarian dish for breakfast, American for lunch and authentic Italian for dinner. Experience upscale European fare at traveler favorites like Caviar & Bull and Arany Kaviar Restaurant. For cheaper but just as tasty eats, visitors recommend sitting for a meal at Italian-focused Comme Chez Soi or Greek-inspired Mazi. Fast casual options like Hoppacska and Bors GasztroBar also earn rave reviews from diners.", "Two staples of the Hungarian dining experience are gulyás (or goulash, a paprika-flavored soup loaded with meat and potatoes) and paprikás csirke (chicken in a creamy paprika sauce). And you can't really go wrong with either. Street food is also popular here. You'll find items like lángos (a large piece of fried dough topped with sour cream and cheese), rántott sajt (fried cheese) and kürtoskalács (or chimney cake, a hollow bread often rolled in cinnamon, nuts or cocoa) sold at markets and food courts throughout the city. And wine lovers, rejoice: Hungary has a proud wine tradition dating centuries back. Try the Egri Bikavér (Bull's Blood) if you're looking for a full red.", "While Budapest is a relatively safe big city, you should still exercise general safety precautions, especially in light of recent terrorist activity throughout Europe. Make sure to take extra care on public transportation and at major tourist attractions, where pickpockets are more prevalent. Also, do not walk alone at night and avoid political rallies and demonstrations. For additional safety tips, visit the U.S. State Department's website.", "The best ways to get around Budapest are on foot and by public transit. The city's neighborhoods are walkable, and you'll be able to admire the historic architecture as you stroll. But when it comes to getting across town, rely on Budapest's extensive public transportation system. However, if you're making your way home after a night out, avoid getting lost by simply taking a taxi or an Uber.", "The city is serviced by the Budapest Ferenc Liszt International Airport (BUD), which is located roughly 15 miles southeast of downtown. Taxis are the quickest way to get from the airport to your hotel, but they are also the most expensive – expect to pay about 6,500 forints (about $25) for a ride. Airport miniBUD shuttle service is cheaper but isn't as efficient. The most affordable (and most time-consuming mode of transportation) from the airport to the city is the 200E bus, which drops passengers off at the Kobánya-Kispest metro station and costs 350 forints (less than $1.50) per person. There's also the direct (but pricier) 100E bus. Another popular option is the train. Many of them make the three-hour connection through Vienna.  ", "Americans are required to have passports valid for at least three months beyond their planned date of departure, though six months validity is recommended. One blank passport page is needed for each stamp. Visas aren't necessary for stays lasting less than 90 days. Visit the U.S. State Department's website for the latest information about Hungarian entry and exit requirements."]}