{"name": "Fort Worth", "description": ["Fort Worth is often overshadowed by Dallas, or grouped together with its eastern neighbor under the broad \"Metroplex\" label. But this city in North Texas has an identity all its own – one that's not necessarily interchangeable with Dallas. You'll get a taste of Fort Worth's Western heritage at the Fort Worth Stockyards, once a pivotal stop for 19th-century cattle drives along the historic Chisolm Trail that now holds a year-round rodeo and twice-daily cattle drives for visiting tourists. You'll also experience this heritage at the National Cowgirl Museum and Hall of Fame, which celebrates the women who shaped the West, including Annie Oakley and Sacagawea, with interactive exhibits and historic artifacts.", "When you're ready to sport your own pair of cowboy boots, head to Sundance Square. It's named after the Sundance Kid, the famous partner of the outlaw Butch Cassidy, who often gathered in the square at its saloons and gambling halls. Today, the square is a shopping and dining hub.", "While exploring the area's cowboy roots is undoubtedly a top draw, it's not the only thing the city has to offer. The city's Cultural District is home to five acclaimed museums, including the Kimbell Art Museum, where you'll find the only Michelangelo in the Americas and the artist's first painting, \"The Torment of Saint Anthony.\" Plus, you'll want to wander the acres of gorgeous plants at the Fort Worth Botanic Garden or relax around the Fort Worth Water Gardens. So, kick back and stay a while. Fort Worth's just getting warmed up.", "The best times to visit Fort Worth are March to May and September to November. Both comfortable seasons bookend the city's scorching summer, when high temperatures rest in the 90s and families capitalizing on the school break crowd top attractions. The cheapest time to visit is in the winter, from December to February. Though the city's winter temperatures aren't as frigid as other parts of the U.S., lows can still dip into the mid-30s. You'll likely score affordable rates at area hotels during a winter trip, except if you visit during the annual Fort Worth Stock Show and Rodeo, a weekslong event that features everything from tractor parades to Western music and roping classes.", "Plan a winter visit The city hosts its annual Fort Worth Stock Show & Rodeo over the span of several weeks in mid- to late January and early February. In addition to horse and livestock shows, the event features music and comedy performances, competitions, contests and kid-friendly games, rides and exhibits, not to mention plenty of cowboy hats.", "Consider a daytrip to Dallas Dallas sits about 35 miles east of Fort Worth and makes for a great daytrip thanks to top attractions like the Sixth Floor Museum and Dealey Plaza, the Perot Museum of Nature and Science and the Dallas Arboretum and Botanical Garden.", "Swimming is prohibited at the Fort Worth Water Gardens Though the water gardens feature several reflecting pools (that look tantalizingly refreshing during the city's sweltering summer months), swimming or wading is not allowed.", "Take advantage of free attractions Many of Fort Worth top things to do don't charge an admission fee, including the Kimbell Art Museum, the Fort Worth Water Gardens and the Amon Carter Museum of American Art.", "Pay a visit to the Fort Worth Stockyards For a dose of quintessential Texan culture, head to the Fort Worth Stockyards for its twice-daily cattle drives. Cattle drives take place at 11:30 a.m. and 4 p.m., and no fees or reservations are required.", "Ditch the car and hop on The Dash The Dash is an electric bus that offers convenient service between downtown Fort Worth and the Cultural District, the home of top sights like the National Cowgirl Museum and Hall of Fame and the Fort Worth Museum of Science and History. Tickets cost $2 for a one-way ride, or $5 for a day pass."]}