{"name": "Charlotte", "description": ["Tucked in the Piedmont region's sleepy rolling hills, this bustling metropolis is anything but a quiet Southern belle. Charlotte, North Carolina, explodes with growing businesses, burgeoning sports franchises and an evolving culinary scene. Though the Queen City is known for the Charlotte Motor Speedway and the NASCAR Hall of Fame, it's much more than a haven for those with a need for speed. Uptown Charlotte – be sure not to call it downtown – is crawling with suits and tourists, while art aficionados and culture hounds flood the Plaza Midwood and NoDa (or North Davidson) neighborhoods. Meanwhile, those in search of a pint of local beer won't want to miss South End, home to a handful of the city's top breweries. ", "This ever-expanding city has a knack for keeping an East Coast pace without stomping on its Southern roots; locals are dedicated to keeping classic Southern charm alive. The blending of these two personalities is engagingly energetic and romantic.", "The best time to visit Charlotte is March through May or September through November, the shoulder seasons when the city is less crowded and hotels are less expensive. Though it's tempting to visit in summer thanks to the extended hours offered by some of the city's top attractions, June through August is also the busiest (not to mention the hottest) time to be in the Queen City. Plan an early autumn visit and you'll be rewarded with mild temps and agreeable hotel prices. Winters are fairly pleasant – snow is rare and the evening lows hover between 30 and 50 degrees Fahrenheit. You'll also find that tourists abandon the city this time of year, and hotel rates take a nosedive.", "Stay like a local Uptown is where you'll find the largest concentration of Charlotte's best hotels, but if you want to feel like a local during your visit, look for vacation rentals in neighborhoods like NoDa, South End or Plaza Midwood.", "There's no such thing as happy hour here North Carolina law prohibits happy hour discounts or specials, so don't expect to find these offered at area bars or restaurants. State law also prohibits the purchase of alcohol before 10 a.m. on Sundays (keep this in mind if you're planning to indulge in mimosas at Sunday brunch). ", "Feel free to bring Fido Charlotte is a dog-friendly city, and you'll see locals taking their pets everywhere. In addition to dog-friendly patios (most breweries allow dogs on the patio), there are a variety of leash-free dog parks and fun events, including Bark in the Ballpark at Truist Field, where dogs are welcome to attend ballgames with their owners.", "Consider purchasing the Explore CLT Pass This digital pass, which is sold by the Charlotte visitor's bureau, covers admission to a variety of top attractions, including the NASCAR Hall of Fame and the Daniel Stowe Botanical Garden. You can purchase one- or two-day passes.", "Make the most of free attractions Some of the city's top attractions don't cost a thing to explore, including Freedom Park and the Billy Graham Library. What's more, hiking and biking trails at the Whitewater Center are free to explore.", "Dine at local food halls Foodies on a budget who want to experience Charlotte's dining scene without breaking the bank should forgo the city's pricey restaurants in favor of more casual meals at local food halls like Optimist Hall, Camp North End and the Market at 7th Street, which feature North Carolina-born businesses and regional favorites hailing from the Southeast. ", "Charlotte's restaurant scene is a fair representation of its cultural identity: modern, with a bit of Southern tradition. Though it boasts its fair share of Southern comfort food, the city also shows off its flair for fine dining with a variety of sophisticated international and farm-to-fork menus. ", "If Carolina-style barbecue is what you're after, head to Sweet Lew's, Midwood Smokehouse, Mac's Speed Shop or Noble Smoke. Though there are plenty of traditional Southern eateries in the Queen City, more and more restaurants are offering contemporary takes on classics like grits and blackened catfish. Leah & Louise, which opened in the city's new Camp North End development, is one example that's earned positive reviews for its tasty dishes inspired by the Lower Mississippi River Valley.", "If you're in the mood for fine dining, Charlotte's got you covered there, too. Business travelers looking to treat clients to a classic steak dinner will find plenty of chain chophouses in the Uptown and South Park areas. If you're willing to travel outside the Uptown area, you'll find a bevy of award-winning restaurants, including Fig Tree, an eatery that occupies a Registered Historic Landmark home, Stagioni, an intimate Italian restaurant, and Good Food on Montford, a tapas-style eatery.  ", "If you're on a budget, you'll want to try some of the city's favorite food trucks, such as What The Fries, the Dumpling Lady and Ace of Spuds, all of which can usually be found stationed at a local brewery.  ", "And then there's the beer. Charlotte is often overlooked by craft beer aficionados in favor of Asheville's suds, but the Queen City can hold its own. New breweries are opening all of the time — in fact, North Carolina touts more craft breweries than any other state in the South. Luckily, many of them are grouped by neighborhood, making it easy to visit a few in one trip. Standouts include The Olde Mecklenburg Brewery (home to one of the largest beer gardens in the city), Sycamore Brewing, Birdsong Brewing Company (don't leave without trying its Jalapeño Pale) and NoDa Brewing Company. If you don't want to venture too far outside the Uptown area, Wooden Robot Brewery and the Catawba Brewing Co. are some of the closest options.", "The best way to get around Charlotte is by car if you're planning to explore beyond Uptown. You can rent a car at Charlotte Douglas International Airport (CLT) – located about 7 miles west of the city center – or you can take a taxi and rent a car once you're in town. Taxi fares from the airport to Charlotte's downtown area cost a flat fee of $25; ride-hailing services such as Uber and Lyft also service the city. You can also take a shuttle – the CATS Sprinter bus – from the airport to Charlotte's Uptown area for $2.20. But the low cost comes with a longer ride due to the multiple stops the bus makes in between the airport and city center.", "If you're planning to stick to Uptown or the neighborhoods surrounding the city center, you can rely on the city's LYNX light rail, which spans nearly 20 miles and 26 stations. Charlotte also has a bike-sharing system, Charlotte Joy Rides, that is convenient for exploring Uptown and surrounding neighborhoods. "]}