{"name": "Denver", "description": ["Many travelers see Denver as a jumping-off point for a Rocky Mountain getaway, using the Colorado capital for its airport and nothing else. But those folks are missing out: The Mile High City offers a mix of urban excitement and natural surroundings that other American cities can only dream of. We're not saying you should pass on the opportunity to hike the Rockies' trails or ski their slopes – just that you shouldn't do so without making reservations at some of Denver's eclectic eateries, exploring its museums or sampling a few of its famous brews. Working some of these more metropolitan enticements into your vacation will allow you to experience the Denver that locals know and love. For a local's perspective, you may want to sign up for one of the best Denver tours.", "Denverites are much more laid-back than residents of other major American cities, promoting an active, outdoorsy culture that thrives on good food and craft beer. Take a cue from the city's residents and spend your days in the Mile High City getting to know its hiking paths, shopping streets and brewery trails. In addition to loving nature, Denver's population also exhibits a passion for art, culture and cuisine. If Mother Nature isn't your companion of choice, spend your time wandering around the Denver Art Museum or Larimer Square before grabbing a basket of Rocky Mountain oysters along the Capitol Hill district's Restaurant Row. And if you happen to have kids in tow, you'll find plenty of ways to keep them entertained here, from a world-class zoo to the fascinating branch of the U.S. Mint.", "The best times to visit Denver are April through May and September through October. The city's shoulder seasons are characterized by comfortable temperatures, fewer tourists and lower accommodation prices than the summer high season. Denver welcomes the majority of its visitors between June and August when the weather is warm and arid; however, the rise in temps also leads to a rise in hotel rates. And despite its proximity to the Rocky Mountain ski areas, the Mile High City sees a drop-off in tourism during the winter months, which means you can score some great deals on rooms here.", "Before you lock down your dates, be sure to take a look at Denver's events calendar. The Mile High City is a popular convention location, and ongoing events can affect room rates in the downtown area.", "When you are a mile high You might experience symptoms such as a headache, nausea and difficulty sleeping when you first arrive. Although the chance of getting altitude sickness is low (only 8 to 10% of visitors experience altitude sickness in Denver), take it easy on your first day and save a jaunt to the mountain till the end of your trip.", "When you see smoke Colorado has legalized the sale of recreational marijuana. You are allowed to smoke pot on private property as long as you are 21, but don't try to bring it home if you live outside the state.", "VISIT DENVER before you visit Denver The city's convention and visitor's bureau website features a whole section devoted to deals and discounts. Check it out before your trip.", "Get a Culture Pass for around $30 The Mile High Culture Pass grants you unlimited access to seven of the city's most popular attractions – including the Denver Zoo and the Denver Art Museum – for three straight days. The Culture Pass will also get you discounts on the city's bike-share program and several smaller specialty museums.", "Rent skis here If you do plan on tackling the Rocky Mountain slopes, you'll find better deals on ski rentals in central Denver than you will at the resorts.", "Since gold was first discovered here in 1858, the Mile High City has been attracting people from all walks of life. The former frontier town's population comprises Latin Americans, Asians and African-Americans, as well as a burgeoning LGBT community. Denver was also home to one of America's largest African-American communities during the 17th and 18th centuries (Five Points). Denver reflects this cornucopia of cultures in its diverse cuisine and numerous festivals – the two-day-long Cinco de Mayo festival, a stellar jazz festival and PrideFest are just some of the ways Denver celebrates its diverse residents.", "They may come from different backgrounds, but Denverites have one thing in common: their love for the outdoors. Residents take full advantage of their proximity to the Rocky Mountains (as well as the abundance of green space found within the city limits), spending their spare time hiking, biking, skiing and kayaking. You should follow their example and do the same. However, while the Mile High population is used to the city's altitude, you probably aren't. Use the first day or so to acclimate yourself, and take precautions throughout your stay to avoid altitude sickness – drink plenty of water, eat foods with lots of potassium (like bananas, avocados, granola and even chocolate) and go easy on the booze. Speaking of drinking, you would be remiss if you visited Denver and didn't try its local brew. Yes, the city is home to Coors, but you'll also find plenty of microbreweries serving a variety of craft beers. You can sample them in local restaurants or learn more about the ales on a guided tour like the Denver Microbew Tour or the Culinary Connectors' Craft Beer Tour.", "On the subject of imbibing, Colorado legalized the commercialization of recreational marijuana on Jan. 1, 2014 – that means that anyone who's 21 or older with a Colorado ID can purchase up to an ounce of pot in one of the state's licensed retailers. (Those who purchase pot legally can share it with friends as long as no money is exchanged.) But don't expect to see people lighting up just anywhere: Smoking is not allowed in public places. To learn more about Colorado's marijuana regulations, visit the State of Colorado's marijuana use page.", "Back in the day, you'd be hard-pressed to find much outside the realm of steak and Mexican cuisine. But now, Denver's culinary scene has grown to include a wide variety dishes from around the world, from Japanese to the Mediterranean. The Mile High City also has its own local specialties too: For example, a visit here wouldn't be complete without sampling some of Denver's famous green chili, which is often made with tomato, onion, pork and, of course, green chiles. The stew can be somewhat spicy to mouth-numbing, depending on the chef. Another infamous dish worth tasting is Rocky Mountain oysters, but seafood-lovers be warned: This popular appetizer isn't made from oysters, but rather deep-fried testicles that typically come from bulls, pigs or sheep, to name a few.", "Denver's restaurant scene ranges from hole-in-the-wall taco joints to upscale farm-to-table establishments to rowdy brewpubs with a dinner menu, so you should have no trouble finding something to suit your taste and budget. You'll find plenty of options lining the streets of LoDo, Larimer Square, Uptown and the Highlands, but there are a few restaurants that stand out. For high-end Colorado cuisine (think prime steak and spicy chili), head to LoDo and grab a table at ELWAY'S, the Ritz-Carlton's signature restaurant named for former Denver Bronco quarterback, John Elway. And for some Mexican favorites, head to El Taco De Mexico. This little restaurant on Santa Fe Drive, less than 2 miles south of downtown Denver, is not only known for its tacos – many travelers and dining experts claim that El Taco De Mexico serves some of the best green chili in the city. Denver is known to have quite a few good brunch spots, too.", "Denver is also a prime destination for beer lovers. Home to the Coors Brewery, the Mile High City is famous for its homey pubs and sports bars. Although the dining scene has become more upscale, beer is still a staple at almost every restaurant. Still, you should plan on having at least one pint (and perhaps a meal) at one of the city's many brewpubs. To see where it all began, head to the Wynkoop Brewing Company; located in LoDo (a few blocks southwest of Coors Field), Wynkoop was the city's first craft brewery. Today, it produces more than 4,000 of barrels of beer each year, which it serves alongside eats like avocado egg rolls and bison chili nachos. If you want to eat and drink like a local, make your way to My Brother's Bar in the Riverfront district; this down-to-earth brewpub was once a hangout spot for Beat Generation leaders Jack Kerouac, Neal Cassady and Allen Ginsberg. If you'd like a crash course in the best local cuisine, sign up for one of the best Denver tours, a few of which were created with foodies in mind.", "True to its name, the Mile High City sits 5,280 feet above sea level, and visitors should take precautions against altitude sickness, the symptoms of which include headaches, dizziness and fatigue. Drink plenty of water and avoid strenuous activities (and too much alcohol) for a day or so upon arrival. Only about 8 to 10% of visitors suffer from altitude sickness in the Mile High City. However, once you head to the mountains, your chances increase; an average of 25 to 30% of visitors get altitude sickness once they head up to the mountains. If you plan on visiting the Rockies, save it toward the end of the trip when you're body has already adjusted to the thinner air.", "You also shouldn't underestimate the sun; even during the winter, the city's thin atmosphere makes it easier to get sunburned, so apply sunscreen regularly, even when the weather's cold.", "Speaking of the cold, winter travelers may encounter \"black ice\" while walking or driving around the Denver area; black ice occurs when water on the road freezes and becomes practically invisible, especially after sundown. Be mindful of the weather by tracking storms and drive slowly on highways when there is one.", "The best ways to get around Denver are on foot or by light rail. Many of Denver's most popular things to do can be found within walking distance of one another in the downtown area. And for attractions not easily accessible on foot, the Regional Transportation District's light rail routes can often get you close enough to walk. RTD also operates an extensive bus system, but routes can be difficult to navigate if you're not familiar with the area, but the system's Trip Planner services can help you get where you need to go. Relying on these forms of public transportation will allow you to dodge parking and car rental costs, and you'll get a better feel for the historic neighborhoods if you're not busy trying to navigate unfamiliar streets.", "Renting a car will come in handy if you're planning on traveling into the Rocky Mountains. Should you decide to pick up your own set of wheels, you can do so at the Denver International Airport (DEN), which sits about 25 miles northeast of the downtown area. From the airport, you can also rely on RTD's SkyRide bus or the light rail University of Colorado A line to get you into town; both one-way trips will cost $9. Meanwhile, if you opt for a cab ride, expect to pay between $55 and $75 each way."]}