{"name": "Grand Rapids", "description": ["Situated on the banks of the Grand River, this city in western Michigan is often overlooked for the more well-known metropolises that sit across Lake Michigan, including Chicago and Milwaukee. But Michigan's second-largest city offers a worthy getaway thanks to its variety of cultural attractions, breweries and proximity to the beach communities of Lake Michigan. Borrowing its name from the Grand River that snakes through downtown, Grand Rapids was originally occupied 2,000 years ago by Hopewell Indians. More than a century later, it became known as \"America's Furniture Capital\" thanks to a lumber boom that ushered in craftsmen, carpenters and woodworkers to the local economy.", "Though Grand Rapids has evolved into a modern metropolis with nationally recognized attractions, it doesn't ignore its past. Visitors here can brush up on local history at the Grand Rapids Public Museum – one of the nation's oldest museums – or national history at the Gerald R. Ford Presidential Museum (Ford is perhaps the city's most well-known native). In between sightseeing, indulge in a pint or two to see why Grand Rapids earned its nickname, \"Beer City, USA,\" or peruse local markets to learn why the area is frequently touted as being among the world's best growing regions.", "The best time to visit Grand Rapids is June through August and September through mid-November. The heat of summer and the mild temperatures of fall are ideal for enjoying the city's outdoor pursuits. Similar to other Midwestern destinations, winter in Grand Rapids can be extremely cold with lows in the teens. Spring can be slow to warm up, with highs not nearing the 70s until May. However, if you're on the hunt for a deal, a winter or spring visit could help you save on accommodation prices.  ", "Hit the beach There are nearly 20 Lake Michigan beaches located 30 to 60 minutes from Grand Rapids. If you've got a car, consider planning a daytrip to the lakeshore communities of Holland, Grand Haven, Muskegon and Saugatuck/Douglas.", "Hit the market For a taste of local eats, stop by Downtown Market Grand Rapids, which shelters more than 20 local vendors selling everything from pastries to seafood.", "Hit the Heritage Hill Historic District The star attraction of this neighborhood is undoubtedly the Meyer May House, but this area is also home to nearly every style of American architecture, from Greek Revival to Prairie. In fact, it boasts Michigan's largest collection of 19th- and 20th-century homes and is worth a stroll, especially for architecture buffs.", "Purchase a Culture Pass GR For $24 (and occasionally even cheaper), you'll receive a pass that grants you entry into many of the city's top attractions, including the Grand Rapids Art Museum, the John Ball Zoo and the Gerald R. Ford Presidential Museum, among other exclusive discounts. The digital pass is sent directly to your mobile device and is valid for three days. You can buy the pass on the Experience Grand Rapids website.", "Ride the DASH DASH, or the Downtown Area Shuttle, is a free bus that services many of the city's top attractions. It runs Monday through Saturday and is complemented by Route 19 and the Silver Line, which also provide transportation in the downtown core.", "Plan a winter visit You'll miss out on a few attractions that shutter in the chilly months, and you'll have to pack some extra layers, but you'll be rewarded with some of the lowest accommodation rates of the year."]}