{"name": "Monaco", "description": ["Maybe you're enchanted by real life fairy tales? American sweetheart Grace Kelly married Monaco's prince in 1956. Perhaps you have a need for speed? The Monaco Grand Prix zooms through this principality each year. Or maybe you're interested in the see-and-be-seen scene? Monaco is home to the jet-set or, should we say, the yacht-set crowd, where you need a net worth of $12.4 million to be considered the richest 1% (comparatively, that number is just $5.1 million in the U.S.). Multimillion-dollar megayachts line the ports of Fontvieille and La Condamine, supercars like Bugattis and McLarens are parked outside of the Monte Carlo Casino and luxury hotels lure travelers with promises of decadence and one-of-a-kind experiences. The Mediterranean climate and 300 days of sun a year are outshined by Monaco's over-the-top opulence and glamour, and the possibility of spotting a prince. This is what seduces visitors to this part of the French Riviera.", "The best time to visit Monaco is in the spring or fall, with tennis in April, the Grand Prix in May, and the Yacht Show in September. This lavish getaway loses some of its luster between November and March, but you will save money on accommodations if you visit in this cooler offseason months. Visit in the summer, and yes, the beaches will be packed, the weather will be hot, and the restaurants will have long waits – but you'll rarely spot locals as they tend to flee from peak-season crowds.", "It's très cher Monaco is the stomping ground of the couture-wearing Influencers. As such, expect hotels, restaurants, cafés and beaches to charge outlandish prices. Best to wear sunglasses when looking at the bill to hide your look of surprise.", "It uses the euro This little principality pays with the euro. You can avoid converting dollars by paying with your credit card, even for small purchases (except at markets). Just be sure to notify your bank stateside of your visit before you leave. If you are planning to shop or eat, download the CarloApp and get an immediate 5% cashback in your CarloWallet to use toward purchases at other locations in Monaco.", "Its official language is French The official language is French, but you'll also hear English, Italian and Monégasque (Monaco's own dialect which stems from Genoese).", "Walk it out You can enjoy much of Monaco by walking throughout the small municipality (it spans just 0.75 square miles) but take advantage of the 78 elevators and 35 escalators so you can concentrate on soaking up the sunshine and enjoying the views and architecture.", "Stay in Nice Other than the Novotel, there are not many affordable hotels or vacation rentals in Monaco, but you'll have more options if you choose to stay in nearby Nice. From there, it's about a 45-minute bus ride (Zou! No. 607) up the coast to Monaco – and it costs just 2.50 euros one-way.", "Find free things to do Many of this principality's most impressive attractions are free to enjoy, including Larvotto Beach, Les Jardins Saint Martin, Parc Princesse Antoinette, Opera Gallery Monaco and the New National Museum of Monaco.  ", "As the country is idyllically situated along the Mediterranean Sea, seafood is a staple on the menus around town, along with traditional ingredients found in the Mediterranean diet, such as olive oil and fresh vegetables. The national dish, a deep-fried, spinach- and ricotta- filled pastry called Barbajuan, is a crowd pleaser. Thanks to a population made up of nearly 140 nationalities, Monaco's food scene has exploded in recent years. From tacos to Thai food, and from Lebanese to Japanese, but you'll need deep pockets to curb your hunger. Wine is also a staple and because of Monaco's proximity to Italy and France, you'll likely notice a plethora of Italian and French wines plus Champagne – all with organic options readily available.", "Monaco falls under the territory of France. A valid passport is required for U.S. citizens entering France. No tourist visas are required for visits less than 90 days but your passport must be valid for three months beyond date of departure from the Schengen area. There is no passport control when entering or exiting Monaco, unless stopped by authorities, who are posted at the border to France in Cap d'Ail and Roquebrune-Cap-Martin, and often patrolling the train station. For more information, visit the U.S. State Department's website."]}