{"name": "Amsterdam", "description": ["Don't believe everything you hear about Amsterdam. Yes, this Netherlands city takes a lax look at women beckoning business in the red-light district and \"coffee shops\" selling an unorthodox type of herb to a toking clientele, but these descriptions only scratch the surface. At some point, during an excellent Indonesian meal, a twilight canal-side rambling or a shopping excursion through the boutiques of Nine Little Streets, you'll realize – as many travelers have before you – that there's much more to Amsterdam than you might've thought.", "And although the city's loose laws on vice seem to attract a college-age, male-dominant crowd, Amsterdam is also ideal as a romantic getaway for two or an educational excursion with the kids. With attractions that range from biking along a maze of canals to remembering the Holocaust through the eyes of Anne Frank; from exploring the swirling Expressionism of Vincent van Gogh to lazing in the expansive Vondelpark, Amsterdam suits a variety of traveler tastes.", "The best time to visit Amsterdam is between April and May or September and November – right before or directly after the summertime high tourist season. You'll contend with fewer tourists, you'll enjoy somewhat mild temperatures (the city's weather is notoriously finicky), and you'll also experience Amsterdam as the locals do – at its laid-back best. But if it's a deal you're after – and you don't mind temperatures in the 30 to 40-degree range – you should plan a winter vacation; you'll find lower hotel rates and depleted crowds at the city's top sites. No matter what time of year you plan to visit, you'll find the city offers a jampacked social calendar (it hosts more than 300 festivals a year).", "Amsterdam has great pancakes Not only are they delicious, they're varied – savory or sweet, cheese or meat-stuffed, jam or fruit-topped, and on and on and on.", "Amsterdam is kid-friendly Despite its penchant for adult entertainment, the city has numerous kid-centric attractions like the NEMO Science Museum, the Artis Royal Zoo, the Zandvoort beach and the Anne Frank House.", "Purchase an \"I amsterdam City Card\" This little piece of plastic grants you free, unlimited use of GVB public transportation, free access to dozens of museums and a complimentary canal cruise, among other perks, for a set price. The catch? You buy your card for 24, 48, 72, 96 or 120 hours and can only access the deals within those time periods.", "Do the heel-toe step Walking rather than taking taxis or public transportation will cut down on costs. And this small city is immensely walkable; just leave a wide berth between you and the serious cyclists using the bike lanes.", "Visit in winter Invest in a cozy coat and come to Amsterdam in the winter, where the discounted hotel rates will keep you feeling warm and fuzzy. An added bonus: crowds are at an all-time low, as are lines for top attractions.", "Amsterdammers officially speak Dutch, but most residents also speak English – and it's insulting to think otherwise. If you're versed, try to speak a little Dutch: hallo for \"hello\" and dank u for \"thank you.\" But don't patronize Amsterdammers by asking, \"Do you speak English?\"", "\"Going Dutch\" is more a way of life than an expression. The Dutch are notorious for their frugality yet they also have a large appetite for consumerism, so you can enjoy \"going Dutch\" by shopping. Amsterdam's official currency is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "Marijuana use in Amsterdam is tolerated though not legal. As of 2016, Amsterdam has implemented the following rules for its coffee shops: no one younger than 18 can be admitted, no alcohol can be served, shops cannot be located within 350 meters of a school and consumption is limited to .5 grams a day.", "From raw herring to pancakes – and rice tables too – Amsterdam, like many other international cities, is filled with a multiplicity of national and international cuisines. Take its Dutch pancakes, which come smothered or stuffed with every topping imaginable, from bacon to blueberries. (Recent travelers rave about The Pancake Bakery). Raw herring is another Netherlands specialty and is consumed whole. Jenever, or Dutch gin, is another must-try, and one of the loveliest places to enjoy it might be the idyllic Distillery 't Nieuwe Diep.", "Indonesian rijsttafel (or rice tables) – rice topped with spiced meats, vegetables and fish – are hugely popular. For some of the best, try Restaurant Blauw, Sampurna or Restaurant Jun. Indonesian establishments are scattered throughout the city. Cheap ethnic eats are mainly gathered in the De Pijp neighborhood.", "For an upscale dining experience, try the Negen Straatjes (The Nine Streets) or the Reguliersdwarsstraat areas. Travelers also praise the food finds on Elandsgracht Street in the Canal Ring. Beware tourist traps in the party-hearty areas of Rembrandtplein, Leidseplein and the Red Light District. Guided food tours are another great way to familiarize yourself with the local dining scene while enjoying authentic Dutch specialities.", "Although the Netherlands government allows prostitution in the red-light district and marijuana use at the coffeehouses throughout the city, travelers should be careful. Visitors, especially women, should be wary of wandering around the red-light district in the evening alone, as the area tends to attract unruly groups of men. Possession of marijuana and definitely the possession/use of other hard drugs, such as heroin and cocaine, can get you into a lot of trouble with the authorities. And before you visit, you'll want to read the local news for the latest updates on developing rules and regulations.", "The best way to get around Amsterdam is by bike. Once you've flown into the nearby Amsterdam Airport Schiphol (AMS) and settled into your hotel, we suggest you inquire about getting your own two wheels. Numerous canals, impatient drivers and narrow roads (ringing the Canal Belt) make maneuvering the city via car interesting, to say the least. Plus, Amsterdam is known for its biking, and you'll find that rental shops canvas the city. What's more, there are several guided bike tours to help you navigate traffic. Pedaling through an unfamiliar place might not be for everyone, though; for those travelers, there's also a perfectly respectable public transport system – the GVB – which offers metro, bus and tram service. And if you purchased an I amsterdam City Card, all your rides on public transportation are covered.", "From the airport, you can reach the city center via bus, train or taxi. Taxi fares from the airport to the city center typically cost 40 to 60 euros (about $50 to $75). Travelers are advised not to take rides from drivers soliciting within the airport; instead, find the taxi rank at the airport's exit. This is where officially approved taxi drivers congregate.", "A valid travel document is required for United States citizens entering the Netherlands by air or sea, as well as for U.S. citizens trying to re-enter the country. A passport is the preferred form of documentation, and children must have them, too. Passports must be valid for at least three months beyond planned date of departure, though six months of validity is recommended. They must also have at least two blank pages available for stamps. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements."]}