{"name": "Cape Town", "description": ["Sporty, stylish, stunning, sociable… If Cape Town was a person, it would be that Hollywood starlet we all secretly envy. The Mother City is unlike any other destination in Africa: Separated from the rest of the continent by a ring of mountains, Cape Town stands as a glittering, metropolis juxtaposed with one of the world's most breathtaking natural landscapes. But good looks aren't the only thing Cape Town has going for it. You'll fall in love with this city's khaki-colored beaches, rolling vineyards, sizzling cuisine, thriving nightlife, and, of course, the spectacular Table Mountain. It may have taken an international soccer tournament to catch the world's attention, but since Cape Town took the global stage, no amount of buzzing vuvuzelas can drown out its magnificence.    ", "Cape Town is by far the most cosmopolitan city in South Africa, as it hosts a hodgepodge of cultures that contributes to the city's eclectic music, food, and festival scenes. But to better appreciate Cape Town as it is now, it's important to understand what the city has experienced. Decades of racial and economic oppression invoked by apartheid has left a festering wound. Although many tourists only experience Cape Town's gorgeous beaches and vibrant restaurant scene, those who visit Nelson Mandela's jail cell on Robben Island or peruse the exhibits in The District Six Museum will see that there's a somber undertone to this otherwise vibrant city.", "The best times to visit Cape Town are from March to May and from September to November. These shoulder seasons boast enviable weather, fewer crowds, and lower prices. When planning your trip, it's important to note that the seasons here are reversed: South Africa's summer corresponds with America's winter, and vice versa. That said, Cape Town's summer is the most popular (and most expensive) time to visit. Hotels and attractions are usually overflowing with travelers. Meanwhile, the Mother City clears out between June and August when chilly weather and frequent rainfall puts a damper on tourist activities.", "Prepare for rain and shine Cape Town is often said to experience four seasons in one day. The city's shape and location results in microclimates, meaning you can enjoy warm sunshine in one area and chilly rain in another.", "A good map goes a long way Driving is the best way to get around, but that doesn't mean the city is painless to navigate. Street signs can be confusing, so having a detailed map will make things easier.", "Spare food, not change Poverty is still a noticeable problem in Cape Town, but offering money doesn't do much good. If you want to be charitable, offer food instead.", "Stay within limits Many car-rental agencies offer unlimited mileage for an additional cost, but unless you're planning to trek across all of South Africa and back, you can save big by keeping your daily limit small.", "Save your receipts A 14-percent value-added tax (VAT) accompanies most purchases in Cape Town, but you can often get a refund at airport customs. Just make sure you have proof of all your purchases.", "BYOB for a smaller fee Tasting the local wine is a must while in Cape Town, but you should expect to pay more for a bottle in a restaurant than at a wine shop. Although you will encounter a corkage fee, your bill will be smaller if you bring your own booze.", "Many historians agree that Cape Town owes its existence to Table Mountain; after all, it was the mountain's fresh-water streams that lured European explorers to settle here in the first place. Back in 1652, when Dutch colonial administrator Jan van Riebeeck established a seaport here for the Dutch East India Company, Table Mountain's streams were able to sustain a growing population. As a result, Cape Town became the first European settlement in South Africa (which is why Cape Town is often referred to as the \"Mother City\"). Over the years, Cape Town grew to encompass a population of 20,000 European settlers and 25,000 slaves from areas like Java, Madagascar, and Guinea. When the British took over the city at the end of the 18th century, they brought additional forced laborers from Ceylon, India, and the Philippines and wiped out the indigenous populations that had previously herded cattle along the coast.", "This mélange of cultures is still represented in Cape Town, but cohabitation hasn't been easy. Although apartheid (government enforced racial segregation and discrimination) ended in the 1990s, the scars remain. Venture outside of central Cape Town and you'll discover neighborhoods comprised of makeshift shacks and struggling populations (referred to as \"the coloureds\" by many Capetonians). Poverty, crime, illness, and drug addiction also remain common societal problems. Although many tourists don't see these afflictions in Cape Town's more developed areas, a trip to one of these fringe neighborhoods is a harsh reminder that the Mother City still has a long way to go on the road to recovery.", "In central Cape Town, you have little to worry about in terms of safety (although pick-pocketing is common, so keep an eye on your belongings). In fact, visitors have benefited from the presence of many different nationalities. Many different languages are spoken here; including Afrikaans (an evolved Dutch dialect) and numerous African languages, but a large portion of the population speaks English. The convergence of lifestyles has enriched Cape Town's music and culinary scenes: Jazz thrives here, and you'll find restaurants serving everything from Italian food to sushi.", "The official currency here is the South African Rand (ZAR), which is equal to about $0.13 USD. U.S. dollars are not accepted in Cape Town establishments; however, most credit cards are.", "The best way to get around Cape Town is by car. Although signage can be a bit confusing, the city is relatively automobile-friendly, with ample parking and fewer congestion issues (when compared to cities of similar size). You can rent a car at the Cape Town International Airport (CPT), which is located about 12 miles southwest of the city center. Renting wheels will also spare you from Cape Town's unreliable public transportation system and pricey taxis. However, if you don't want to worry about dealing with a car, the city's rikkis (shared cabs) provide an affordable (albeit slow) alternative to metered taxis.", "Americans traveling to South Africa will need a valid passport with at least one blank visa page. However, South African immigrations officers have been known to require two unstamped pages: one for the South African temporary residence permit sticker and the other for entry and exit stamps. Without these blank pages, you may be refused entry to the country. Travelers planning to spend fewer than 90 days in South Africa do not need a visa. If you are traveling to South Africa via a country where yellow fever is present (even if you are not even leaving the plane), you will be required to present a valid International Certificate of Vaccination (known as a \"yellow card\") that has been approved by the World Health Organization. To learn more, visit the U.S. State Department website."]}