{"name": "Naples, Italy", "description": ["The third-largest city in Italy is chock full of history, art, architecture and delicious food, yet it gets a bad rap for its crime and grime. While these blemishes are certainly a reality for residents, they're far from ubiquitous, especially where tourism is concerned. Choose to literally find higher ground at places like Certosa e Museo di San Martino and you'll be rewarded with truly spectacular views. Stroll the Via Caracciolo e Lungomare di Napoli or chat with the friendly locals and you'll start to experience some of the magic that this port city holds. And, of course, you can't forget the transcendence that comes from that first bite of Neapolitan pizza (in the city credited with inventing the pizza pie), nor that perfect sip of espresso. ", "You can't judge a book by its cover, and you most certainly can't judge a city for its rough edges – doing so would make it easy to miss out on its real treasures, including underground frescos, royal palaces, Tuscan architecture and so much more.", "The best time to visit Naples is between March and April when the weather is mild and the tourist crowds aren't quite so thick. Summertime is characterized by hot and humid weather and makes touring everything but the beach sticky and sweaty. In the fall, you'll experience a drop in temperatures, but this is accompanied by ample rain showers. Between December and February, you'll find mild winters (highs hover in the mid-50s) with sunny days alternating with gray, gloomy ones – but the lineup of Christmas-related events and low season lodging rates may be worth the relatively chilly temps.", "Naples has a far-reaching religious history. The first cathedral was raised over the site of one of Apollo's temples back in the fourth century. Throughout the centuries, Naples has also developed and maintained some unique rites, such as bringing pillows and gifts to skeletons in tombs. Although rituals like these aren't widely practiced anymore, there are nonetheless a plethora of religious-themed festivals that take place annually, including the Festa di San Gennaro. ", "Unfortunately, Naples has a notorious history of crime, as the city is home to the Camorra, an Italian mafia syndicate. Although it's unlikely that you will encounter any kind of activity related to the Camorra, it's still wise to be aware of your surroundings, especially at night in off-the-beaten-track areas and places prone to crime, such as Piazza Garibaldi (which sits near the city's largest train station – a magnet for petty crime) and the Spanish Quarter. ", "Naples moves at a slower pace, which is probably the result of its laid-back populace and the heat and humidity that settles in the city come summertime. This means that public transportation tends to be inefficient at times, and restaurants and other businesses may take the day off. ", "As with other cities in Italy, Italian is the official language in Naples and the euro is the official currency. The euro is equal to about one U.S. dollar, but since the rate fluctuates, plan to check it before you go. Tipping at dining establishments isn't obligatory like it is in the States. Many professionals employed in the tourist industry – hoteliers, restaurateurs and travel guides – will likely know some English, but many locals will not, so it's best to memorize some common Italian phrases. Say \"hello\" with buon giorno or buona sera, depending on the time of day. You can say \"excuse me\" with mi scusi and \"thank you\" with grazie.", "The Naples dining scene in one word? Pizza. Made with San Marzano tomatoes and mozzarella Campana, Margherita pizza was invented in Naples – according to lore, at Pizzeria Brandi – but it's a staple throughout the city. For another great taste of the Neapolitan original, visit L'Antica Pizzeria da Michele. ", "Other delectable foods can be found at Spaccanapoli, a street located adjacent to Christmas Alley. Spaccanapoli is home to Neapolitan specialties like frittatina (fried pasta served with tomato sauce and cheese) and cakes, such as ricotta-stuffed sfogliatella, orange-infused pastiera and rum-flavored baba. And for a cool treat on a warm night, try any one of the gelato cafes that ring Naples' Mergellina Bay. ", "Along with pizza and gelato, coffee is another Italian specialty you won't want to miss while in Naples. Caffè Mexico and Gran Caffè Gambrinus are among the city's most beloved coffee bars. (Down an espresso at the bar to experience coffee like a true Italian.) While you're at it, check out granita – a refreshing drink usually made with fruit, syrups and ice, which is also said to have originated in Naples. You can find it at nearly every cafe in the city, especially those that border the water.", "The best way to get around Naples is on foot. Most of the city's attractions are located within walking distance of one another, plus you'll get the full Naples experience by strolling its cobbled streets. When you need to reach places farther afield, such as the Museo di Capodimonte and Certosa e Museo di San Martino, you can jump on one of Naples' funiculars. Of course, hopping in a taxi is always an option, too. You can also traverse the city via bus, but because of road traffic, you're often better off walking. The metro is another option, though it's better suited to commuters who travel from the suburbs into the city during the work week. ", "The closest airport is Naples International Airport (NAP), which also goes by the name Capodichino Airport. It's located a short 2.5 miles from the heart of Naples. A taxi ride from the airport to the historic city center will cost a flat rate of 16 euros (about $18).", "According to recent travelers, the sweeping views of Naples and Mount Vesuvius are reason enough to plan a visit to the Certosa e Museo di San Martino."]}