{"name": "Cannes", "description": ["This sun-speckled resort town on the French Riviera is all about relaxing in style: taking leisurely walks on La Croisette promenade, sunning on the beaches, sipping French wines on the patios of en plein air (open-air) cafes, shopping the side streets, hitting the casinos and clubs – or the pillows at your luxury hotel – at night. Most pay dearly to experience Cannes' warm, sunny climate and picturesque position along the southern coast of France. The Cannes Film Festival, which arrives every May, has only increased its allure. But you shouldn't let all this exclusivity scare you from visiting: Cannes is also a truly international destination that accommodates a range of travelers looking for everything from fine restaurants and high-end shopping to fantastic films and gorgeous beaches.", "The best time to visit Cannes is from March to May, before the annual film festival and the arrival of summer vacation crowds and hot weather. If you want to save as much money as possible, winter is a great time to visit the city as chilly temperatures in the mid-50s and high 30s yield significantly lower pricing for accommodations. However, you'll want to check that your chosen hotel hasn't closed up for the offseason. Fall is another quiet season in which hotel prices are lower than the spring and summer and the weather is mild, though rainfall is frequent.", "Long known as a getaway for celebrities and the wealthy, many things in Cannes are upscale. The city also has a love for film and pays tribute to it around every corner. Because tens of thousands of people visit every May for the international film festival, it maintains an international feel. The town is also a fashion trendsetter and a place to see and be seen. What's more, Cannes boasts a bustling convention center and hosts business events all throughout the year.", "It is polite to greet everyone you encounter with a friendly bonjour (\"hello\") upon arrival, and an au revoir (goodbye) when leaving. Gratuity is generally included in the bill, but it is customary to round the total up or add an extra 5% for extraordinary service. The official currency in France is the euro, and one euro is equal to approximately $1.10 but the euro to U.S. dollar rate often fluctuates, so check the latest exchange rate before you go. If you find yourself short on euros, almost all restaurants and hotels also accept major credit cards.", "As a coastal town, Cannes boasts fantastic seafood. A classic Cannes dish combines the freshest seafood with vegetables from the south, all bathed in olive oil. The city counts more than 380 restaurants, ranging from hot spots for the rich and famous to brasseries and restaurants serving simpler Provençal cuisine. You'll find them in the city center, along Rue d'Antibes, La Croisette and the old town.", "Located in Hôtel Martinez on the Bay of Cannes, La Palme d'Or is a great spot for a special occasion or simply a delicious meal thanks to its location overlooking La Croisette. The restaurant's Michelin-starred chef is known for serving dinner to the jury of the Cannes Film Festival, so you're likely in for a treat. Chef Christian Sinicropi is known for his innovative cuisine with options on the menu like a lamb shoulder tart and local purple asparagus. It also caters to the needs of its Hollywood clientele with vegetarian and vegan menus.", "With cuisine inspired by the Mediterranean and Provence, La Môme, located in the Golden Square of Cannes, is best known for dishes like artichoke salad, braised octopus, Vitello Tonnato and ravioli stuffed with egg yolk.", "For a slightly more relaxed outing, consider L'Affable Restaurant, a brasserie from Jean-Paul Battaglia just off of the Rue d'Antibes. For about 50 euros (approximately $55), choose from a menu of one appetizer, one main dish (like duck breast or candied lamb), and a dessert. The traveler-approved Bistrot Gourmand offers a similar three-course lunch for less than 30 euros (around $33). If your budget doesn't allow for Michelin-starred meals, consider dining around the Rue Commandant André, which is home to more affordable eateries like Bobo Bistro.", "According to the U.S. Department of State, there continues to be credible information about the planning of terrorist attacks in Europe. As a result, you are likely to see police and military presence in public spaces. Like many destinations in Europe, most crime against tourists in Cannes is centered around theft. Pick-pocketing is common, and criminals may also break into rental cars if you leave valuables behind or within view.", "The best way to get around Cannes is on foot and by bus. Cannes boasts a robust public transportation network. A shuttle connects City Hall with the train station and La Croisette. For quicker, but more expensive service, you can hire a taxi, or if you prefer to drive yourself, rent a car from major companies like Sixt, Hertz and Avis France. But keep in mind, you won't be able to drive a car through historic areas where getting around by foot is best. You can also use boats to reach the Lérins Islands or areas like Monaco or Saint-Tropez. Some choose to get around town by bike or Vespa, and there are numerous options to rent bikes while visiting.", "There are several ways to reach Cannes, including by car, boat, train or plane. Two airports serve the area: Nice-Côte d'Azur Airport (NCE) and Cannes-Mandelieu (CEQ), both of which you can reach to and from town by shuttle, taxi or car. Cannes is also part of France's train network, and you can reach the city on TGV from Paris or on Trenitalia from Milan, Rome and Venice, Italy.", "To visit France, U.S. residents must have a passport that does not expire for at least three months after your planned departure from the country; visas are not required for stays less than 90 days. You must also have at least one blank page in your passport. For more information, visit the U.S. Department of State website."]}