{"name": "St. Augustine", "description": ["No matter where you go in St. Augustine, odds are you'll stand face to face with American history. Founded by the Spaniards in 1565, this town in northeastern Florida is the oldest continuously occupied European settlement in the U.S. Alongside narrow cobblestone streets and colonial architecture, you'll find Romanesque Revival-style buildings, many of which were designed by railroad and oil tycoon Henry Flagler, who played a key role in developing St. Augustine and the rest of Florida's east coast. With so much history, it should come as no surprise that St. Augustine also has a penchant for the paranormal: Many of the town's top attractions, which are believed to be haunted by Spanish settlers and original inhabitants, tout nighttime ghost tours.", "Though the main draw here is the abundance of landmarks that date back to the Spanish occupation, the Ancient City also offers various boutiques, eateries, bed-and-breakfasts, live music venues and art galleries. Travelers with children should check out the St. Augustine Pirate & Treasure Museum and the St. Augustine Wild Reserve. Art enthusiasts will appreciate the Lightner Museum's eclectic collection, while shopaholics cannot pass up a chance to peruse the boutiques on St. George Street. And once you're ready to relax, grab your gear and head to the beach. As with many coastal Florida towns, St. Augustine offers prime access to the Atlantic Ocean and year-round sunshine.", "The best time to visit St. Augustine is between March and May. During this time, you'll find fewer people, comfortable temperatures and low hotel and airfare rates. Crowds are typically at their largest from June to August, while temperatures can drop into the 40s between December and February. You'll also enjoy favorable temperatures and score accommodation deals from September to November, though these months fall within the Atlantic hurricane season, which starts in June and lasts until the end of November.", "Pack accordingly Like other historic American destinations, St. Augustine is filled with cobblestone streets, so plan to pack comfortable walking shoes. You'll also want to bring a light jacket if you visit during winter or sunscreen and an umbrella if your trip falls between June and November – the Atlantic hurricane season.", "Bring an extra bag Whether you plan on buying a few items at the St. Augustine Premium Outlets or antiques and homemade souvenirs on St. George Street, you'll want space to store your goods.", "Bed down in central St. Augustine If you want to stay near the bulk of St. Augustine's attractions, book a hotel or bed-and-breakfast in Old Town or the Spanish Quarter. Depending on where you hang your hat, you'll be within steps of St. George Street's shops and sights like the St. Augustine Pirate & Treasure Museum and the Castillo de San Marcos National Monument.", "Book a trolley tour package For three days of trolley rides and access to popular attractions like the Old Jail, Ponce de Leon's Fountain of Youth Archaeological Park and the Lightner Museum, purchase one of Old Town Trolley Tours' sightseeing packages. You can save as much as around $10 per person, depending on the package you book.", "Visit in the spring St. Augustine's peak season is from June to August. To avoid the summer season's high prices and crowds without sacrificing on weather, plan your visit between March and May.", "Consider driving to and from the airport Though you'll find it easy to get around St. Augustine on foot, via a trolley tour or by bus, the closest major airport – Jacksonville International Airport – sits more than 50 miles away. Since public transportation between St. Augustine and the airport is not available, renting a car on arrival and departure days will help you avoid high transportation costs.", "St. Augustine sits by three rivers, a lagoon and the Atlantic Ocean, so you'll find plenty of top-notch seafood served at the town's restaurants. Florida seafood specialties found on St. Augustine restaurant menus include grouper, shrimp and mahi-mahi. To sample some of the region's fresh seafood, pay a visit to popular eateries like Sunset Grille and O'Steen's Restaurant.", "Though you'll find casual American fare at most St. Augustine restaurants, several internationally influenced cafes, bakeries and eateries are available as well. Some of the town's most popular restaurants include Casa Benedetto's Ristorante – an Italian dining establishment – and Mango Mango's Caribbean Grill & Bar. And on St. George Street, diners can enjoy Cuban classics like pan con bistec (steak and grilled onion sandwiches) and papa rellenas (stuffed fried potatoes) at The Cuban Cafe & Bakery, Spanish tapas at Columbia Restaurant and British-inspired pub fare at the Bull & Crown Publick House.", "The best way to get around St. Augustine is on foot and by trolley. Most of St. Augustine's top attractions are located within the town's historic downtown, while other sights like the Old Jail and Ponce de Leon's Fountain of Youth Archaeological Park can be reached by the local sightseeing trolley. To get to and from Jacksonville International Airport (JAX), the area's closest major airport, visitors can drive or take a taxi. The Northeast Florida Regional Airport (UST) is a closer option, about 5 miles north of the city, but offers very limited flight options through just a few lesser-known carriers. The city's Sunshine Bus Company can be used for half of the journey, but travelers will need to use two or more Jacksonville Transportation Authority buses for the other part of their trip. The Sunshine Bus Co. can also be used to get around central St. Augustine. Driving within St. Augustine is not recommended due to limited street parking."]}