{"name": "Sun Valley", "description": ["Bearing the motto, \"Small Town, Big Life,\" Ketchum is an outdoor enthusiast's paradise in central Idaho. The popular tourist destination is home to world-class skiing in the winter, and biking, hiking and fishing in the summer. One of America's first ski hot spots and Hollywood celebrity escapes, this town has benefited from its isolated location away from other major population centers for nearly its entire existence (Boise is more than 150 miles west). Visitors here will enjoy thinner crowds and cheaper hotel rates than in competing ski towns in Colorado and Utah, and they'll also get a unique taste of culture and history during their trip.", "No matter the season, the crown jewel of Ketchum is the Sun Valley Resort and village. Featuring 100 ski runs in the winter and dozens of mountain biking trails in the summer, this classic outdoor getaway provides endless opportunity for all levels of sporting expertise. Off the mountain, visitors can indulge in Ketchum's unique mining and tourism history at the Sun Valley Museum of History. Or, they can just wander around the town center and discover numerous breweries, galleries, restaurants and shops. Ketchum is also the gateway to the expansive Sawtooth National Recreation Area, and numerous awe-inspiring hiking trails, such as the Fox Creek Trail and the Adams Gulch Loop, can be easily accessed from popular hotels and lodges.", "The best times to visit Ketchum and Sun Valley are December through February and June through September. Peak skiing conditions occur during the winter months, with December in particular averaging 32 inches of snowfall per year. Meanwhile, biking and hiking enthusiasts flock to the small town during the summer. Between June and September, you can attend multiple concerts and festivals while enjoying temperatures that average more than 70 degrees during the day. The popular Trailing of the Sheep Festival happens in October, which is also an ideal time to witness peak fall foliage and spend time outside in a moderate climate. In shoulder months, such as March and April, you can usually still enjoy quality snow conditions without paying premium prices.", "While Ketchum does have a handful of chic and expensive eateries, the area specializes in restaurants with casual menus and laid-back atmospheres. If you want a delicious beer and a hot meal in town after a long day on the slopes, the Town Square Tavern in the center of town is an easy and popular option. Other well-liked apres-ski spots for pub food and drinks are the Pioneer Saloon and the Warfield Distillery. Recent travelers also lauded the wood-fired pizza at Enoteca, and The Kneadery is a major spot for a hearty breakfast before an adventure in the outdoors. If you do want to get fancy, try the rustic American cuisine at the Vintage Restaurant or the Italian fare at IL Naso.", "Many restaurants include vegetarian and gluten-free options, and there are a few Mexican, Asian and Mediterranean eateries around town. During the summer months, head toward the center of Ketchum and indulge in local products from the Wood River Farmers' Market. And if you want an impressive year-round beer selection, check out The Cellar Pub.", "The best way to get around Ketchum is on foot or by bus. Though bringing your own car can be helpful if you want to visit Boise or other hiking trails and attractions outside town, the area is small enough and the bus is reliable enough that it may be unnecessary.", "The closest airport, Friedman Memorial Airport (SUN), is 13 miles south of Sun Valley. Three airlines – Delta, Alaska and United – operate out of this airport, and they offer flights to and from a handful of West Coast cities, such as Seattle, Los Angeles, Denver and Salt Lake City. Once you arrive, you can take a Mountain Rides bus to the center of Ketchum (Monday through Friday only). But if you prefer to use your own car, there are ample taxis and shuttles that will take you to your accommodation quickly for about $48 for two people. If you decide to fly into Boise, the Sun Valley Express shuttle service will drive you from the Boise airport to the center of Ketchum for less than $100 per person."]}