{"name": "Chicago", "description": ["\"It is hopeless for the occasional visitor to try to keep up with Chicago – she outgrows his prophecies faster than he can make them,\" wrote Mark Twain in \"Life on the Mississippi.\" Although Twain made up his mind about the Windy City before it even reached its 50th year, his impression of Chicago has proven long-lasting. America's third-largest city has been described in a myriad of ways throughout its lifetime. When Thomas Edison and Nikola Tesla were competing for the right to use their forms of electricity to illuminate the 1893 World's Columbian Exposition (also known as the Chicago World's Fair), Chicago was known as a city of industry. When Prohibition set in, notorious mobsters like Al Capone transformed Chicagoland into their own dangerous playground. And intense immigration surges throughout the 20th century brought a host of new identities to the Windy City, including Greek, Polish, Italian, Irish and Jewish.", "Today, Chicago remains just as diverse, boasting a thriving arts scene, various shopping districts and a cornucopia of eateries. First-time Chi-Town visitors are sure to have their eyes to the sky for at least a day or two. Chicago's skyscrapers and public art are absolutely worth admiring: Tag along on a Chicago Architecture River Cruise or pass a few hours in Millennium Park and you'll find yourself spending lots of time looking upward. For a bird's-eye perspective, head to Willis Tower's Skydeck Chicago or the John Hancock Center's 360 CHICAGO Observation Deck. After, dive headfirst into all the city has to offer – from exceptional museums to a thriving sports culture and deep-dish pizza that takes delicious to whole new depths. If you need a little help navigating Chi-Town, consider signing up for one of the best Chicago tours.", "The best times to visit Chicago are April through May and between September and October, when the temperatures are warm, a variety of festivals take place and crowds are manageable. Summer marks Chicago's peak tourist and festival season, with travelers from around the country hoping to take advantage of the warm weather and abundant activities. You'll find higher lodging rates during these seasons, but you'll also escape Chicago's notoriously bitter winters. Chicago experiences frigid temperatures from November to March, but if you can hack it, hotel and airfare deals are easy to find.", "Winter is no walk in the park Winter temperatures in the teens and 20s are made worse by biting wind chills. Come prepared with a warm hat, a reliable pair of gloves, a thick coat and sturdy boots if you're visiting during this season.", "You don't need wheels Forget the car: Chicago's extensive public transportation system is a much better (and easier) way to get around. A Segway tour is another fun way to sightsee without having to rely on your own two feet. The city also has a bike-share program called Divvy.", "Consider a tour For a local's perspective of the city, book a tour. Whether you're looking for a food tour, a boat tour or a walking tour, you'll find a variety of experiences to choose from.", "Bundle up The weather outside may be frightful, but there are plenty of deals to be found during the winter months. Many hotels slash their rates, and cheap flights are easy to come by.", "Head north Hotels in the Loop cater to business travelers staying on the company dime. For a more down-to-earth (and affordable) place to hang your hat, check out the bed-and-breakfasts in North Side neighborhoods like Lincoln Park and Lakeview.", "Invest in an all-access pass The Chicago CityPASS and the Go Chicago Card grant access to Chi-Town's most popular attractions for one set price. This will help you shave big bucks off your entertainment expenses.", "Chicago boasts its fair share of fine restaurants, but don't miss your chance to sample the regional fare. Chicagoans strongly believe that their pizza and hot dogs are better than those in New York City – you may simply want to agree rather than spark a debate. And when you're ordering a beverage, remember that in Chicago soda is called \"pop.\"", "Residents of Chicago are also dedicated to their sports teams. You should have no trouble finding a fellow fan of \"da Bears\" or \"da Cubs\" (phrases made famous by \"Saturday Night Live\") at one of the many sports bars scattered throughout Wrigleyville.", "If you prefer performing arts to sports, The Reader and Time Out Chicago can point you to musical and theatrical performances taking place around the city. And don't forget to check out one of the city's famous comedy shows, which are offered regularly through local comedy groups like The Second City and UP Comedy Club.", "Most people associate Chicago cuisine with three things: pizza, hot dogs and steak. They wouldn't be wrong. The Windy City has an ongoing rivalry with New York City over who can serve up the better slice – while New Yorkers prefer wide and flat, Chicagoans like their pizza with a deep crust that can carry loads of toppings. For hot dogs, New Yorkers like their hot dogs simple with potato buns and ketchup, mustard or relish, while Chicagoans enjoy their beef franks on a poppy seed bun with yellow mustard, chopped white onion, tomatoes, dill pickles, pickled peppers and a dash of celery salt.", "Chicago is also known for its steakhouses – the Loop and the North Side are littered with fine dining establishments that serve prime cuts of beef. Some of the most reputed steakhouses include Joe's Seafood, Prime Steak & Stone Crab just off The Magnificent Mile and Bavette's Bar & Boeuf in the River North area. Just be warned: A good steak doesn't come cheap in this town.", "Another Chicago dish that's popular with locals, but not as well-known to tourists is the Italian beef sandwich. Created by Chicago's Italian immigrant community in the early 1900s, this seasoned roast beef sandwich soaked in meat drippings and topped with spicy giardiniera or sweet Italian peppers is found on many hot dog stand and restaurant menus. But, if you want to enjoy an authentic Italian beef sandwich, locals recommend visiting Portillo's. Two locations – one on West Ontario Street in River North and another on West Taylor Street near the South Loop – are available in the downtown area.", "If you're looking to save on dining (but don't want to survive on pizza, hot dogs and Italian beef sandwiches alone), move away from the downtown area into Chicago's more immigrant-dominated neighborhoods. Travel west for the hummus and tzatziki in Greektown, pasta in Little Italy or tacos in the Lower West Side. Or, head south of downtown to Chinatown for Asian specialties. If you're not sure what you're in the mood for, North Side neighborhoods like Streeterville, Lakeview and Lincoln Park boast eclectic restaurant scenes. Authentic Indian and Pakistani fare are also available west of the North Side's Rogers Park neighborhood along West Devon Avenue. Another great way to explore Chicago's wealth of culinary options is on a food tour or one of the best Chicago walking tours.", "When you've got a hankering for a cold, crisp beer, consider touring one of the city's top breweries. Or, head out for a night on the town to one of the bars locals love, such as Cindy's rooftop bar or Jake Melnick's Corner Tap. And if you have time, locals say you should make reservations for brunch. Chicago is home to an array of brunch spots, including Lincoln Park's Batter & Berries, home of the French toast flight, or West Town's Beatnik, with its globally inspired menu and popular boozy slushies.", "As you would in any big city, exercise caution when you're out and about. Keep your valuables with you at all times. Make sure to have a clear sense of your surroundings when traveling after dark, and avoid walking alone as much as possible. Neighborhoods in the South and West sides are prone to gun violence and are best avoided, especially after dark. Keep in mind that the White Sox stadium is located in the South Side, but visitors coming to games should consider using the L, which makes a stop right outside the stadium. Neighborhoods like South Loop, Kenwood and Hyde Park are not as affected as areas west of Lake Michigan (where poverty is more prevalent), but it's still best to stay alert at all times.", "The best way to get around Chicago is via public transportation – specifically the L train. Operated by the Chicago Transit Authority, the L (short for \"elevated train\") is cheap and easy to use. The CTA also operates an extensive bus system with routes servicing nearly every attraction, but the bus may be difficult for newcomers to navigate. There's also the Metra regional train system that makes stops throughout downtown Chicago and in neighboring cities and suburbs. You can use public transit to reach the city from both nearby airports. O'Hare International Airport (ORD) sits 18 miles northwest of downtown and can be accessed via the L's Blue Line, and Chicago Midway International Airport (MDW) is located about 11 miles southwest of downtown and can be reached using the L's Orange Line. Cabs and ride-hailing services are also available, although high starting rates and extra charges make this option a bit expensive. Parking garage and street parking fees are pricey as well, but if you decide you need a set of wheels, rental agencies can be found at both airports."]}