{"name": "St. Louis", "description": ["With a slice of Midwestern Americana and a hint of cosmopolitan flair, St. Louis' charms are best viewed in the reddened stands of Busch Stadium, in the nostalgia of the iconic Judy Garland film \"Meet Me in St. Louis,\" or at the bottom of a pint of Budweiser. And yes, there's the Gateway Arch – that gleaming curve of stainless steel looking westward. But beyond its star attractions, you'll find a vibrant city that has plenty to offer for beer, food, sports and music enthusiasts. ", "To start, it's the birthplace of iced tea and ice cream cones, both mainstays for a summer visit. What's more, it’s home to the National Blues Museum. And with 79 distinct neighborhoods to tour, including tranquil Forest Park and historic Soulard, there's plenty to see, eat and do in this Midwestern metropolis. Plus, sightseeing here won't put a major dent in your wallet: St. Louis boasts tons free attractions, from the zoo to the art museum to the grounds of the Gateway Arch. So, take a cue from Lewis and Clark, who \"discovered\" the area in the early 19th century, and start your exploration of the West – and St. Louis – here.", "The best times to visit St. Louis are in April and May and September through October. St. Louis experiences hot and sticky summers and long, cold winters. The spring and fall offer pleasant temperatures and set the stage for a full event calendar.", "It's multicultural Although the Gateway to the West offers its fair share of classic Americana (think: Cardinals baseball and barbecue), St. Louis also boasts a sizable immigrant population. In fact, this Midwestern city is home to the world's largest Bosnian population outside of Bosnia and Herzegovina.", "It's hopping For a night out, head to The Loop in the West End. This area features a vibrant set of watering holes, plus dance lounges and several live music venues.", "It's a barbecue town St. Louis' version of barbecue is tangy and sweet. To sample some of the city's finest barbecue, visit traveler-approved barbecue joints like Bogart's Smokehouse in Soulard and Pappy's Smokehouse in Midtown.", "Be mindful of the Cardinals' home schedule Although hotel rates stay fairly consistent throughout the year, prices can rise when the Cardinals play at home. To avoid these higher prices, plan your visit in the offseason or when the Cardinals are away.", "Take advantage of the city's free attractions One of the draws of this Missouri city is its abundance of free activities. Save some money by sticking to St. Louis' free attractions, such as the Saint Louis Zoo and the Cathedral Basilica of Saint Louis.", "Use public transportation If you're hoping to avoid the added expense of renting a car or paying for parking, consider using Metro, the city's light rail and bus system. One-day Adventure passes, which cover unlimited rides on all buses and light rail, cost $5.", "Like Chicago and New York City, St. Louis is home to a plethora of immigrant communities. In addition to the world's largest Bosnian population outside of Bosnia and Herzegovina, the city boasts large German, Indian, Libyan and Mexican enclaves. Neighborhoods like The Hill are prime spots to try authentic cuisines from all around the world. Other neighborhoods, such as The Ville, are essential for understanding St Louis history. The Ville was the home of many prominent Black figures during the 1920s, including Annie Malone, one of the country’s first Black millionaires. It's also where Sumner High School still stands. The high school was the first school west of the Mississippi to provide secondary education for Black students. If you'd like to learn more about Black history in St. Louis, pay a visit to the Missouri History Museum, which features exhibits on the civil rights movement, as well as seasonal guided walks through The Ville.", "Music is also an integral part of St. Louis. The birthplace of ragtime – a precursor to jazz music that was popular in the late 19th century – St. Louis offers multiple kinds of music (think: rock, jazz, reggae and swing) at its performance venues. Traveler's favorites include Broadway Oyster Bar, The Ready Room and Off Broadway. For a complete list of clubs, check out Explore St. Louis' website. And to learn more about blues music specifically, pay a visit to the National Blues Museum.", "Another vital aspect of this Midwestern city is its baseball culture. The hometown team, the St. Louis Cardinals, regularly play at downtown's Busch Stadium. Some seats even feature views of the Gateway Arch.", "From St. Louis-style barbecue to classic pub grub to authentic Bosnian and Italian fare, odds are you'll find plenty to sink your teeth into in this vibrant multicultural city. Many of the city's neighborhoods are home to a particular ethnic background and style of cuisine, so if you know what kind of food you're after, consult Explore St. Louis' Neighborhoods page before venturing out for grub. Or if you'd rather heed the advice of past diners, try eating at one of the following traveler-approved eateries.", "Should you crave a classic deli sandwich, previous visitors suggest checking out Blues City Deli in Benton Park or Adriana's on the Hill in – you guessed it – The Hill district. For American comfort food like burgers, wings and nachos, dine at Hendel's Restaurant & Market, Gourmet Soul or Stacked STL. And if you're looking for a quintessential rack of St. Louis-style ribs (which are slathered in sweet barbecue sauce before cooking on a grill), head to local barbecue hot spots, such as Bogart's Smokehouse, Pappy's Smokehouse or Sugarfire Smoke House.", "For fine dining, consider making reservations at Bait (for seafood), Olive + Oak (for elevated American fare), Brasserie by Niche (for a French menu), Vicia (perfect for vegetarians) or Juniper (for Southern eats).", "No visit to St. Louis would be complete without sampling the city's twist on authentic Italian and Bosnian cuisines. The Hill's Charlie Gitto's and Zia's on the Hill are two places known for traditional Italian fare and toasted ravioli, a local Italian-inspired dish that features filled pasta covered in breadcrumbs and pan-fried. If you'd rather try Bosnian cuisine, head 5 miles outside the city center to Grbic Restaurant & Events, a family-owned and operated restaurant that serves classic European dishes like goulash and Serbian stuffed cabbage, among other items. For authentic Mexican fare, locals suggest El Toluco Taqueria & Grocery (order a torta), and Mai Lee for Vietnamese and Chinese classics like pho, rice porridge, noodle bowls and more.", "St. Louis is relatively safe to visit, but like other metropolitan areas, it's best to exercise caution while visiting, especially in areas north of Delmar Boulevard and across the Mississippi River in Illinois’ East St. Louis. Explore St. Louis recommends several tips for staying safe during your trip, including hiding your valuables in parked cars hidden and walking with others at night. For more safety suggestions, consult Explore St. Louis' website.", "The best way to get around St. Louis is by car or MetroLink. Metro's efficient light rail system offers stops throughout the city, though locales removed from the main tourist areas, such as Grant's Farm, are generally harder to reach (if at all). Having your own set of wheels – which you can rent from St. Louis Lambert International Airport (STL) – will ensure you can get to all of St. Louis' must-visit sights, but this convenience comes at a cost: You'll have to pay between $3 and $25 to park in the downtown area on top of daily car rental fees. Metro's network also includes MetroBus routes, but its longer travel times make them less convenient. Hailing a taxi or renting a bike are other options, but cabs are pricey and biking is not recommended during the cooler months."]}