{"name": "Barcelona", "description": ["Barcelona contains both the authentically historic and the wildly bizarre. From the scenic trails of the colorful Park Güell to the romantic narrow alleys of the Barri Gòtic, this city by the sea seems to attract all types – the adventurer, the romantic, the partier, the culture lover – with an almost overwhelming variety of things to do. You could stay for a few days exploring its architectural marvels, but chances are you'll need a whole week to explore.", "And while the beach lures locals and visitors in droves, it’s the cosmopolitan city that really dazzles. Much of the activity revolves around the Ciutat Vella (or Old City), a series of narrow streets and alleys packed with restaurants, cafes and nightclubs, and the home of Las Ramblas – the wide, tree-lined thoroughfare that’s long been the hub of the city.", "Just as unmissable are Antoni Gaudí's masterpieces; the architect, famous for his distinctive Catalan art nouveau style was the brains behind the city’s wavy, whimsical creations, from Casa Milà and Casa Batlló to La Sagrada Família. Beyond Gaudí’s influential mark, you’ll find an eclectic shopping scene, a slew of museums, plenty of parks and exquisite food and wine. You see why we suggest a week vacation? To get a lay of the land, consider signing up for one of the city's best guided tours.", "The best time to visit Barcelona is from May to June, when balmy temperatures in the low to mid-70s mesh with a flurry of festivals that trumpet the advent of summer. The actual summertime is sticky with humidity – locals leave their beloved city in droves to catch a breeze somewhere else. They come back for the fall when the average highs drop back in to the 70s. Winter is mild compared to other Spanish destinations, with highs in the high 50s. And while coming during the spring may seem like smart idea for avoiding crowds, April sees frequent showers, which may put a literal damper on sightseeing plans (most of Barcelona's top attractions are experienced outside). Keep in mind that no matter what time of the year you'll visit, there will be other tourists: Barcelona is the most-visited city in Spain.", "Don't visit in August Swarms of locals leave the city in August to catch some relief from the sweltering humidity, which means some of the smaller restaurants and shops are closed until September.", "Spanish vs. Catalan Most residents who grew up in the region consider themselves Catalan and speak the Catalan language to each other, instead of Spanish. But don't worry – Barcelona is an incredibly international city and most residents are bilingual. Many are also trilingual, especially in the tourist areas.", "Cover up at church Religious sites, such as Barcelona Cathedral and La Sagrada Família, ask that visitors cover up knees and shoulders when entering. If you don't have the proper attire on hand, you won't be admitted (although shawls are for sale at the cathedral).", "Go big on lunch Eat a big meal at lunch and you can cash in on the menú del día (menu of the day), which is usually an affordable and tasty three-course meal (they’re normally served on weekdays, although some restaurants offer them on weekends too). A similar meal in the evening costs much more.", "Don't eat in touristy areas The more-visited parts of the city like Las Ramblas are known to serve mediocre food at exorbitant prices. Instead, venture away from the crowded areas and you’ll find something better for much less.", "Stay in an apartment Cut down on food costs by renting an apartment (rather than staying in a hotel), where you can buy groceries and cook your own Catalan feasts.", "Barcelona is part of the Spanish province of Catalonia, making its culture a little different from what you'd experience in Madrid, Seville or Granada. The most noticeable difference is the language. In Barcelona, both Spanish and Catalan are official languages; Catalan is not a dialect of Spanish. The language was derived from Latin during the occupation of the Romans several thousands of years ago. While in Barcelona, you'll see street and roadway signs in both Catalan and Spanish as well as some restaurant menus. However, considering Barcelona is one of the most visited cities in Europe, you will likely find English speaking residents in hotels and tourist areas.", "Barcelona's official currency is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops. Like the rest of Spain, tipping is not common in Barcelona. Depending on where you dine, a service charge may be added to your bill. However, if you do want to tip, 10% is more than sufficient. Also similar to the rest of Spain, Catalans eat late and party even later. Restaurants are typically open for lunch between 1 and 4 p.m. and for dinner from 8 to 11 p.m. For locals, dinner usually starts at 9 p.m. at the earliest, going out starts at 12 a.m. and clubs stay open until 5 or 6 a.m. ", "In Barcelona, expect to find a mix of traditional Spanish dishes along with Mediterranean-infused Catalonian classics. While here, make sure to sample Spanish staples including jamón ibérico, manchego cheese, tortilla española (potato omelet), gazpacho (cold soup), and patatas bravas (sautéed potatoes typically served with a spicy aioli). And considering the city borders the Mediterranean Sea, you should indulge in paella accordingly. But when in Catalonia, try the Catalan versions of paella. There's arròs a la catalana, which features much of the same ingredients of paella except the dish doesn't use saffron, a key ingredient in Spanish paella. Fideuà is another paella-like dish with a Catalan spin, only instead of rice you get noodles.", "Catalonian cuisine is big on meat and fish. And while that may not sound too far off from the rustic, meat-heavy fare found throughout the rest of Spain, the difference here is that the Catalans like to mix both of them together in one dish. Mar i muntanya is the name of the phenomenon, so don't be alarmed if while in a restaurant, you notice a dish coming out with chicken and shrimp together on a plate. If that sounds too heavy for your liking, there are plenty of lighter options that are quintessentially Catalan. Grilled vegetables are surprisingly big for a place that loves pork. (Sausage is another staple here. Instead of focusing on chorizo, go for the regional botifarras sausage). One of the most traditional Catalan dishes available is escalivada, which is grilled eggplant and red peppers mixed with olive oil and garlic (sometimes with anchovies) served on top of bread. There's also the vegetarian-friendly, and favored pa amb tomàquet snack, or bread spread with a mix of olive oil, garlic and crushed tomatoes. And if you're visiting from December to early May, seek out a calçot cookout. Calçots are a type of spring onions native to the province, and it's a Catalan pastime to char them on a grill and dip them in romesco sauce. Also part of the pastime? Wearing bibs (often emblazoned with calçots) and eating outside, where the grilled calçots are spread among newspaper. (If that sounds familiar, it's the same way crab and lobster is consumed in the USA.)", "Whatever you decide to eat while in Barcelona, make sure to leave room for dessert. Crema catalana is the Catalan version of creme brulee. Cheese is also dessert here. Mel i mató is a goat cheese drizzled with warm honey and accompanied by walnuts. Cava, or Catalan sparkling wine, goes great with these too.", "Barcelona is a major tourism hotspot and pickpockets know it. Be mindful of your surroundings especially while touring Barcelona's major attractions. The city sees a moderate rate of conventional crime and principal tourist areas and metros are often the most targeted spots. Men should keep their wallets in their front pockets and carry backpacks in front when traveling on the metro and women should make sure their purses are zipped or secured as best as possible.", "The best way to get around Barcelona is by metro. A handful of numbered and color-coded lines weave throughout the city, making stops near many of the city's most popular attractions as well as the Barcelona-El Prat Airport (BCN). City buses are also an option for getting around the city, but be aware that ever-present traffic jams make commuting this way rather time-consuming. You could hail taxis on the street, but if you want to burn a few calories, conduct your tour on foot or by bike. Driving is not recommended.", "A passport is required for entry into Spain. The passport must be valid for three months beyond your departure date. Tourists from the United States can stay for up to 90 days without a tourist visa. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}