{"name": "Anguilla", "description": ["Compared to some Caribbean islands masquerading as tourist traps, you'll find something a little more authentic on Anguilla. There's an embargo on large cruise ships, casinos and high-rise hotels, but a surplus of clear, coral-filled waters, unmarked and unpaved roads and low-key beachfront villas. Pampering is also at a premium, from the grandiose resorts to the sophisticated alfresco dining. With little to do but relax, the days here are long. But after the sun does go down, you'll be treated to one of the best live music scenes in the Western Hemisphere. Everyone from Quincy Jones to Bankie Banx to Jimmy Buffett has stopped by Anguilla's shores to perform.", "The best time to visit Anguilla is between May and August, when you stand the best chance of getting a good package deal and also avoiding the worst of the hurricane season (which runs from June 1 to November 30). Hotel prices are low from September to October, but selection is sparse – many properties close down during these months. The most expensive time to visit is from the early winter until spring when the weather is ideal.", "There's Bankie Banx Anguillan reggae artist Bankie Banx is a local celebrity down here, and his funky-mellow bar, Dune Preserve, is one of the island's most famous landmarks. Stop by on a Sunday evening, when Banx likes to serenade his customers.", "There's plenty of good food From haute cuisine to food carts, it might seem like there are more eateries than accommodations. Enjoy a relaxed beachside meal of chicken, ribs, or seafood for lunch, and splurge on grilled lobster for dinner.", "Embrace connection flights The only direct flights from the United States to Anguilla depart from Miami. You could also fly to St. Martin-St. Maarten or Puerto Rico and then take a regional carrier or ferry.", "Stay in for dinner Shop at local markets for groceries and make your own dinners where you're staying, instead (if possible). You'll save money by not eating out at a restaurant every night, while also learning how to cook new dishes that you could recreate back home.", "Anguillans are known to be some of the friendliest people in the Caribbean, and the island itself is one of the more relaxed Caribbean locales you can visit. But residents are also conservative and polite; wearing beachwear anywhere besides the beach is frowned upon. The local newspaper even reminds vacationers: \"Please shop with your clothes on.\" Casual attire is generally accepted everywhere, but call ahead to the fancier dining establishments to determine whether there's a dress code.", "Culturally, you will find a mix of British and Caribbean traditions throughout the island. This is due in part to Anguilla's history of British and French occupation in the 1600s. During that time, Europeans brought enslaved West Africans onto the island to work on plantations, though only certain crops (cotton, rum, sugar, mahogany and more) were successfully harvested due to the soil conditions. Slavery in Anguilla was abolished in the 1830s, and many former slaves went on to become successful fishermen, farmers and sailors. Today, Anguilla remains under British rule as a dependent territory; as such, travelers should expect to drive on the left side of the road during their vacation.  ", "As far as tipping goes, most restaurants have a 15% gratuity already added on to the bill, so there is no need to give more unless you found the service to be exceptional. The standard tip for a taxi fare is 10%, though some drivers will go above and beyond and serve as your tour guide, which warrants a larger tip. Keep in mind, Anguilla uses the East Caribbean dollar: $1 USD is about to EC$2.70. Since currency exchange rates change, you'll want to check the exact rate before you go. Still, many businesses and hotels across the island accept U.S. dollars as well.  ", "Seafood is supreme when it comes to Anguillan cuisine. And like several other Caribbean nations, you'll find rice, plantains and a selection of fresh vegetables alongside your fish. Considering its small size, Anguilla has a good number of restaurants scattered throughout the island, though most are pricey. For a special occasion, make a reservation at Veya, an acclaimed restaurant that serves international cuisine within a treehouse-style setting.", "Budget-minded travelers should visit The Valley's smaller roadside establishments, which serve authentic Caribbean fare, or try shopping at a local grocery store. And for a fun night out, head to local legend Bankie Banx's Dune Preserve, a beachside hot-spot known for its live music.", "Anguilla is one of the safest islands in the Eastern Caribbean. The same general tips that apply to any beach vacation – such as using the hotel safe to guard your valuables instead of bringing them with you to the shore – apply to enjoying your time here as well.", "Many resorts have a physician on call should you feel ill. Otherwise, Anguilla's main hospital is centrally located in The Valley. Serious medical emergencies generally require emergency evacuation to another island.", "The best way to get around Anguilla is in a taxi, as the island is too spread out to explore on foot. You'll find the drivers make excellent tour guides, and driving yourself around town could be problematic, given the unpaved roads leading to the beaches and virtually nonexistent street signs. Both taxis and rental agencies are easy to find at the Clayton J. Lloyd International Airport (AXA), although you may to fly into the Princess Juliana International Airport (SXM) on St. Martin-St. Maarten and then ferry over.    ", "Keep in mind there are few flights into Anguilla from the United States. If you arrive at the Anguilla airport, it will most likely be on a connection from Miami or Puerto Rico's Luis Muñoz Marín International Airport (SJU).", "A valid passport is required to visit Anguilla. Visas are not required for visits shorter than 90 days. You'll also need to present proof of return flights or continuing travel when you arrive. You should expect a roughly $30 departure tax if leaving by charter flight or ferry. Occasionally, officials will also ask to see proof of sufficient funds to cover your visiting expenses. Anguilla is a British territory, so for the latest information on foreign entry and exit requirements, visit the British Embassy's website."]}