{"name": "Boca Raton", "description": ["Located nearly 50 miles north of Miami, Boca Raton is part of the region known as the Palm Beaches – a 47-mile stretch of the Atlantic coastline. It was designed to be one of Florida's premier resort towns in the early 20th century, when Henry Flagler's East Coast railroad opened the state to tourists. Along with the signature town hall and the tropical Mizner Park, architect Addison Mizner created the original Boca Raton Resort & Club, a Mediterranean-style pink \"castle\" that is still one of the city's most iconic buildings.", "Boca – as the locals call it – is the second-largest and southernmost city in the Palm Beaches. It's known for its beautiful parks and beaches, as well as for its wildlife conservation and education centers, including the 20-acre Gumbo Limbo Marine Center, part of the larger Red Reef Park. The affluent city is also home to a renowned art museum and theater, a bevy of high-end designer boutiques and tony department stores and a vibrant restaurant scene.", "The best time to visit Boca Raton is in the fall or winter when temperatures are at their most comfortable. Fall (September to November) constitutes the city's offseason, offering the lowest prices on accommodations – a side effect of Atlantic hurricane season, which runs from June to November. The winter months (January to March) are usually crowded with snowbirds from the northeastern U.S. and Canada, and as such are the most expensive time to visit. Shoulder season runs from mid-April to mid-August. Summers are rainy, hot and humid thanks to the unpredictable hurricane season.", "Book early for high season January through March is peak vacation season in Florida. To secure a favorable hotel rate, consider booking as far as a year in advance.", "Stay hydrated The Florida sun and humidity can be deceiving: drink plenty of water and avoid the sun in the afternoon – often the hottest part of the day.", "Watch the weather Atlantic hurricane season runs from June through November. If you're visiting during this time, keep an eye on the weather forecast and consider booking a refundable hotel rate in case Mother Nature thwarts your vacation plans.", "Take advantage of freebies Many parks do not charge an entrance fee to nonmotorists, and the Boca Raton Museum of Art waives admission fees on the first Sunday of the month. The city also offers a free concert series in Mizner Park in the summer.", "Avoid parking fees Vehicle entry fees at state parks are hefty, costing as much as $18 a day. Save by parking in nearby public lots and walking into the park. ", "Boca Raton's diverse dining scene offers everything from sushi and Asian eateries to traditional fine dining restaurants and American farm-to-table fare. Mizner Park, a central gathering place in Boca, is home to several popular local restaurants.", "Try longtime local favorite Max's Grille – a pioneer in the South Florida food scene – known for simple, California-style cuisine like crab-crusted local snapper and maple-bourbon glazed baby back ribs. Or grab some Sriracha mojito mussels at Kapow Noodle Bar, also in Mizner Park.", "Locals and critics alike love the new American cuisine, including lamb, salmon, duck and grouper, served at TwentyTwenty Grille, but bemoan the lack of parking for this intimate eatery. And for traditional chophouse steaks and seafood in a swanky setting, head to Abe & Louie's, a fine dining favorite.", "Don't be surprised to find popular dining options in unusual locations, such as the Farmer's Table in the Wyndham Hotel Boca Raton, which offers grass-fed beef, free-range chicken and sustainable seafood, or the casual Bogart's Bar & Grille in the Cinemark Palace 20 movie theater. It's a hit with diners thanks to its diverse menu, which offers pizza, sliders, tacos and foot long hot dogs alongside steak and miso-glazed salmon.", "The best way to get around Boca Raton is on foot or by using the Downtowner, a free ride service. The oversized golf carts that comprise the Downtowner's fleet offer complimentary transit to many of the city's top sites, including Mizner Park, Red Reef Park and the Gumbo Limbo Nature Center. For trips to attractions outside the downtown area (such as the Town Center and Wick Theatre), a car will come in handy. If you don't drive to Boca, you'll find the nearest major airports are in Fort Lauderdale and Miami (car rentals are available at both airports). Tri-Rail commuter trains have stations at both Fort Lauderdale-Hollywood International Airport (FLL) and Miami International Airport (MIA). Palm Beach International Airport (PBI) is another option to fly into, about 25 miles north of Boca Raton."]}