{"name": "Granada", "description": ["Granada's allure is perhaps its most palpable force, enticing visitors long before their scheduled arrival. Tucked away among the Sierra Nevada Mountains in southern Spain, this Andalusian gem is awash with an infectious European charm as well as a strong sense of mystery brought on by its storied history. In Granada, churches were once the sites of mosques, bakeries formerly bath houses and shops primarily served tea instead of tapas. Though the days of dynasties changing and cultures clashing are long gone, what's left is a tangible sense of tradition begging to be understood.\n\nBut that doesn't mean it's not appreciated. Granada's history as a former Moorish empire fascinates, its age-old architecture enchants and its rich culture enthralls the scores of travelers who make the trek to this small Spanish city every year. And visitors may quickly discover that in Granada, anything is possible. You can catch a flamenco show in caves once inhabited by African gypsies, shop goods that can be found on the streets of Morocco, hike the foothills of Spain's largest national park and – with Granada's thriving tapas scene – never pay a dime for dinner. So when in Granada, embrace the city in all its unique forms and if anything, allow yourself to get completely lost in its splendor, you won't regret it.", "The best time to visit Granada is in May and June as well as September and October. From May to June, temperatures are cool, flowers are fully bloomed and some of the city's biggest cultural events fill up the calendar. Though summer in Spain may sound like a romantic idea, Granada's position in the southern tip of Europe yields daily temps in the 80s and 90s during July and August, making for a potentially uncomfortable getaway. Winter is an option for those seeking off-peak deals, but with the nearby skiing available at the Sierra Nevada Mountains, prices may vary depending on where you're staying. In addition to May and June, September and October are also ideal times to visit. These months boast temperatures similar to those seen in spring, but come nightfall, temperatures from October onward get cooler and cooler. ", "Expect to hike Granada's location near the mountains makes it a very hilly city. Wear sturdy shoes and bring water when walking around town, especially when exploring the Albaicín neighborhood.", "Expect more than just Spanish culture Granada was once the capital of the Moorish empire and though the city has undergone centuries of change, there is still a Northern African culture that is very much present in the city.", "Siesta Though more antiquated in bigger cities, siestas are still very common in Granada. In the afternoon, grocery stores and pharmacies may be closed.", "Walk Granada is as charming as they come, and the best way to experience it is to simply walk. Thanks to its small size, many of the city's top attractions are within walking distance of one another.", "Consider the menu del dia If you don't want to rely on tapas for meals, check out restaurants' menu del dia, a discounted three-course meal served in the afternoon.", "If you've been to Spain before, you may notice that Granada's culture appears to be a little bit different from the rest of the country. Though each town in Spain has its own unique identity, Granada differs due to its storied history with the Moors, or the group of Northern Africans who conquered Spain and Portugal in the eighth century. Though the Spanish eventually retook the country, there is plenty still left over from the Moors reign, such as tea houses, Moroccan-style spas and markets, in addition to architecture spread throughout the city. But don't worry, it's still Spain. Citizens of Granada practice siestas, flamenco is abundant and the culture's overall laid-back way of life remains largely intact.", "Granada's official currency is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Spanish is the official language, however, those with some knowledge of Spanish will find that the dialect varies slightly. The most notable difference is that those in the south leave off the 's' at the end of words. For example, instead of gracias, or \"thank you,\" it's gracia. Tipping, much like the rest of Europe, is not common in Spain and may garner strange looks from locals, especially in dining establishments. When it comes to dining etiquette, however, if you receive tapas (even if you didn't expect or ask to receive any), it's frowned upon to give them back as they are considered a gift. If you do not want your tapas, simply leave them on the table untouched. Another cultural norm in Spain is dos besos, or \"two kisses.\" Unlike the U.S., when Spanish people meet or greet they exchange two kisses, one on each cheek instead of a handshake or hug (though men meeting or greeting other men stick to a handshake or hug). You're more likely to encounter this cultural exchange in a social setting with multiple Spaniards. ", "Tapas can be found anywhere in Spain but one of the best places to experience this culinary tradition is in Granada. Unlike the country's other top destinations like Madrid or Barcelona, Granada retains the tradition of tapas in its purest form: order a drink and receive a free plate of tapas. For those unfamiliar, tapas can best be described as an appetizer or snack, and in the Spanish tradition, you receive an appetizer, or plate of tapas, with every drink you order at a bar. The more drinks you order, the larger portions the tapas tend to be. Though the majority of restaurants in Spain charge for tapas, Granada and much of southern Spain still see tapas as a gift to patrons.", "You can find tapas bars all over, but most are concentrated in or near Centro, Granada's city center, Realejo, the old Jewish quarter and along Paseo de los Tristes near the Albaicín. Bodegas Espadafor, one of the city's most popular tapas bars, is located on the border of Centro and the Albaicín on Calle Elvira, a known tapas hub. Espadafor serves hearty plates, including potatoes topped with a quail's egg and roast ham, a crowd favorite. If you're craving seafood, stop by Los Diamantes on Calle Navas in Realejo. Here, you can gorge on sherry-soaked clams, fried bacalao (cod) or delectable calamari. And travelers on a budget will appreciate the tapas at Bodega la Antigualla where drinks are served with sandwiches with fries and a host of sauces. Bar Poe is unique in that the fare served goes beyond the borders of Spain – you may get Portuguese, Brazilian and Thai tapas alongside your drinks. Those with an adventurous palate should seek out Bar Aliatar, otherwise known as the snails bar, located in Plaza Aliatar in Sacromonte.", "If you're looking to eat traditional Spanish dishes, such as patatas bravas, paella or croquetas, take advantage of a restaurant's menu del dia (typically offered at lunch), or menu of the day, which tends to serve traditional Spanish dishes. And as far as etiquette goes, since tapas are considered a gift, it's often seen as rude to resist or to send back tapas dishes. If you receive tapas dishes you don't want, simply leave them on the table and continue with your drink. For more information about the tapas scene in Granada, check out the Granada Tourism Board's Tapas routes here.", "The best way to get around Granada is by foot. Granada is pretty small, measuring only 33 square miles (in comparison, Madrid spans 233 square miles). And its location in the middle of the Sierra Nevada Mountains means the city primarily lives on hills, offering few sizeable roadways for cars to easily navigate. Buses are an option should you get tired of traversing the steeper hills. Taxis are also abundant, and you're likely to see them cruising around popular attractions, main thoroughfares and busy squares around the city. The best way to get from Granada's airport, the Federico Garcia Lorca Granada-Jaen Airport (GRX), to the city center (about 11 miles east) is by taxi, which costs about 25 euros ($27) one way. If you're looking for a cheaper option, you can take the Autocares Jose Gonzalez bus that picks up at the airport and goes to various destinations throughout the city. Single journey tickets cost 3 euros ($3.35), however, availability depends on the day's flight schedules. ", "A passport is required for entry into Spain. The passport must be valid for three months beyond your departure date. Tourists from the United States can stay for up to 90 days without a tourist visa. For more information on entry and exit requirements, visit the U.S. Department of State's website.", "The Alhambra is the crown jewel of Granada, drawing more than 2 million visitors per year. The UNESCO World Heritage site is famous for housing royals from different Spanish dynasties and is continually lauded for both its beauty and quality of preservation."]}