{"name": "Bonaire", "description": ["On the pristine island of Bonaire, the main attraction lies beneath the water's surface. To travel to this paradise without exploring its underwater treasures would be a regrettable misstep. Though any Caribbean getaway promises a welcome retreat from the daily grind, Bonaire is less about relaxing on a beach and more about adventure and exploration. Despite the island only measuring 112 square miles, it offers a wealth of activities. If you're not an avid diver, hike around Washington Slagbaai National Park and admire the rugged scenery, or venture off the beaten path to discover hidden caves. Explore Rincon, the island's oldest town, or learn to windsurf with world champions. Or shop, dine, and dance in Kralendijk – Bonaire’s compact and colorful little capital is enchanting and easily explored from end to end on foot.", "The past few years have seen many new luxe resorts and fine dining emporiums pop up. Foodies will adore the range of gourmet experiences available, from chef’s tables to trendy fusion fare to cultural cooking classes taught by locals featuring locally sourced ingredients. There's even a swank Miami-style beach club and upscale downtown supper club. Bonaire has been very busy blossoming of late to entice many different types of travelers to come to its shores. And with year-round temps in the 80s and very little rain, there's no bad time to visit.", "The best time to visit Bonaire is from May to October when there are fewer crowds and bargain hotel rates compared to the popular winter season. If you're planning a winter getaway, keep in mind that November through April comprises the island's peak season, however, the island is also popular with families from the Netherlands for summer holidays, too. Luckily, Bonaire's temperate climate and unique location, just north of the equator and safely outside the hurricane belt, pose little threat of tropical storms, no matter the season. The \"rainy season\" generally lasts from December through March, but showers are usually brief and should not deter you from visiting. ", "Budget for the Visitor Entry Tax As of July 2022, all nonresident visitors ages 13 years and older must pay a $75 Visitor Entry Tax to support the island’s infrastructure, tourism products, environmental efforts and education. The fee for children 12 years and younger is $10. You can pay the tax online in advance of your trip here. You can also pay it at the airport upon arrival (but keep in mind that cash is not accepted at the airport; debit or credit cards only).", "You’ll have no trouble communicating Though the official languages are Dutch and Papiamentu – a Creole dialect with Dutch, Spanish and Portuguese elements – English is widely spoken by locals, as is Spanish. ", "The beaches are different here Apart from No Name Beach, Sorobon and a few private resort beaches, Bonaire does not boast the long strands of soft, white silky sand you might encounter on other Caribbean islands. Most of Bonaire’s “beaches” are coral-strewn coves with rocky entrances to the water. But where there are rocks, there are usually lots of fish! To protect your feet, it’s wise to have water shoes handy for impromptu dips. One unique beach called Boka Kokolishi even has black sand made from the crushed shells of tiny snails.", "Visit in the offseason Take advantage of discounted hotel prices and lower airfares by timing your trip for the offseason, which runs from May to October.", "Consider a bed-and-breakfast or a small boutique hotel One of Bonaire’s best-kept secrets is the number of glamorous, multibedroom villas and deluxe short-term apartment and house rentals it has to offer at reasonable prices. Many of these accommodations are right on the water or have their own pools. For a vast selection of options, consider Sun Rentals Bonaire.", "Rent a golf cart If you’d like to explore the island on your own, but don’t have the budget for a rental car, consider renting a golf cart instead. You’ll feel the ocean breeze in your hair and pay significantly less than you would for a car.", "Defined by its unique colonial heritage, Bonaire possesses a separate identity from the neighboring alphabet islands of Aruba and Curaçao. Today, the economy relies on tourism, especially dive tourism, but salt production has always been an important part of the island's economic identity, too. To this day, Bonaire exports a million pounds of sea salt per year, mostly to North America as a foil for icy roads and other industrial uses.", "When discussing the island’s history of salt production, it’s important to acknowledge the role of slavery. The enslaved peoples who were relegated to work the salt pans from the 1600s until slavery was abolished in 1863 were brought from Africa by the Dutch West India Company. Like many Caribbean islands, the early colonial rule had a brutal history. There are stone slave huts still on prominent display at the different colored obelisks where the salt was to be picked up by Dutch ships. They were purposely restored and are maintained to remind new generations and visitors of the resilience of today’s residents. Many Bonaireans are direct descendants of these enslaved people, who through necessity formed a strong community. They developed their own creative ways of survival while forming a unique culture with many celebrations, customs, traditions and cuisine that are unique to this island. You’ll see many of these traditions on display during the island’s important annual festivals like Simadan, which marks the traditional celebration of harvest time.", "The U.S. dollar is Bonaire's official currency, so there's no need to worry about conversion rates. Most credit cards can be used on the island, though American Express is not as widely accepted as MasterCard and Visa. There are a few ATMs in high traffic areas and in the casinos, and in some resorts, too. Bonaire's standard tipping practices are similar to the U.S.; it's typical to leave an additional 10 to 15% in gratuity for waiters and taxi drivers.", "The best way to get around Bonaire is by car. Because Bonaire is so small, it's easy to drive the island's entire coastline in just one day. Renting your own set of wheels is also the easiest way to reach most diving spots, and you'll need rugged vehicles with trunks to transport your tanks and gear, and four-wheel-drive to reach off-rader shore dives. You'll find most of the island's rental companies at the Bonaire International Airport (BON), but many large resorts now have their own “drive and stay” or “dive and drive” packages on site as well that include vehicle rentals. ", "The Bonaire International Airport welcomes direct flights from New York, Houston, Atlanta and Miami. The airport is located near Kralendijk on the west coast of the island. If you’re not renting a car, you can reach your accommodations via taxi; there’s a taxi stand at the airport.", "American citizens must present a passport prior to entry, as well as proof of a return flight or continued travel. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}