{"name": "Oslo", "description": ["From the refurbished waterfront of Aker Brygge to the snowy hilltops of Holmenkollen, Oslo seems to offer the traveler everything they could ever want: hip cafes and nightlife, a verdant landscape (Oslo is one of the most forested cities in the world) and a culture steeped in arts and history. Where could this town go wrong?", "It's expensive. The city consistently ranks among the world's most overpriced. So how do you get around the cost barrier? Consider making a weekend stopover from elsewhere in Europe (hotel rates are cheaper on Fridays) and enjoy Norway's capital while it's still a city on the rise.", "The best time to visit Oslo is from May to August when the temperatures rise and there are surprisingly affordable room rates available, though these options often fill up fast. Daytime temps generally hover in the 60s and 70s, but evenings can get chilly at times, so remember to bring a coat. Like Stockholm and Reykjavik, Oslo can experience nearly 24 hours of daylight in the summer, with the famous midnight sun usually appearing in June or July. On the flip side, there are winter days of near total darkness. This is matched with frigid weather and temperatures diving into the 20s.", "Norwegians are courteous Manners are everything in this refined city. You should particularly remember to be on time no matter where you're going; punctuality is highly expected in Norwegian culture.", "Aquavit is the local spirit of choice Unlike other varieties, Norwegian aquavit is made from potatoes and aged in sherry oak casks. You'll find it served at restaurants and bars year-round, but it's especially popular to drink with traditional fare during Christmas.", "It's a city of neighborhoods Though you'll be tempted to stick to the city center, save time for visits to surrounding neighborhoods like Grünerløkka and Majorstuen if you want to enjoy some of Oslo's best shops, eateries and nightlife venues.", "Don't plan a summer visit For more affordable airfare and room rates, arrive between October and April, Oslo's coldest months. If you're set on enjoying some warmer weather, try visiting in May or September, the beginning or end of the city's peak season.", "Don't forget your Oslo Pass This timed card, which costs 210 to 745 kroner ($25 to $89) per person, covers travel on all public transit (excluding airport routes), admission to 30 attractions and discounts at multiple restaurants. You can buy your pass at select hotels and museums or online here. Preordered passes can be picked up at the Oslo Visitor Centre after presenting a valid voucher.", "Don't take the taxi from the airport Taxis in Oslo are notoriously expensive, so hop on the Flytoget train instead. A one-way adult ticket costs 190 kroner (less than $23), while round-trip fares for adults cost 380 kroner (about $45.50) each.", "Oslo's Viking roots, iconic structures, rich art scene and abundant music festivals make this Norwegian city a haven for history buffs, architecture enthusiasts, art aficionados and music lovers. To learn more about Oslo's history, head to the Viking Ship Museum, the Norwegian Museum of Cultural History and the Royal Palace. For a glimpse at some of the area's most iconic buildings, stop by the medieval Akershus Fortress or the contemporary Oslo Opera House (opera fans should also plan to take in a performance here). Other genres are celebrated at events like Granittrock and the Ultima Oslo Contemporary Music Festival, both of which take place every September. If art is your passion, check out the National Museum of Art, Architecture and Design, where one of two painted versions of Edvard Munch's \"The Scream\" is on display. The other (plus a pastel version) can be found at the Munch Museum.", "The official language in Norway is Norwegian, but many Norwegians – especially those living in Oslo – also speak English. Still, locals appreciate when tourists attempt to speak Norwegian. Key words and phrases to use include \"hallo\" (hello), \"tusen takk\" (thank you), \"Snakker du engelsk?\" (Do you speak English?) and \"ha det bra\" (goodbye).", "As is the case in other Scandinavian countries such as Denmark and Sweden, the euro is not the official currency in Norway like it is in the majority of European Union countries. Instead, Norwegians use the Norwegian krone. One Norwegian krone equals about $0.12, but you'll want to check the latest exchange rate before you visit. International currencies are rarely accepted in Norway, and some shops and markets don't take foreign credit cards as a form of payment, so plan accordingly.", "Tipping is uncommon in most European cities, including Oslo. However, locals occasionally tip bartenders and restaurant waitstaff when they've received exceptional service. There is no expected rate, but generally, patrons who want to tip will leave five to 15 percent of their bill.", "Although Norway's dining scene isn't as highly regarded as those found in other European countries like France and Italy, its abundance of fresh ingredients – including lamb, reindeer and other meats, plus seafood, such as cod and salmon – make for tasty dishes. Norway's breads and pastries are also worth trying. One of the country's most popular dishes is smørrebrød (buttered rye bread topped with either local cold cuts or fish). Other popular items include fårikål (a stew made with lamb and cabbage), røkt laks (smoked salmon) and kjøttkaker (beef meatballs served with cranberry sauce and mushy peas or creamed cabbage). Those with a sweet tooth should try lefse (a rolled flatbread covered in butter, sugar and cinnamon that's commonly enjoyed with coffee), and for adventurous foodies, Norway offers smalahove (sheep's head) and lutefisk (lye-cured cod).", "Sentrum's bayside area of Aker Brygge is Oslo's go-to spot for excellent drinking and dining venues, which include an assortment of upscale restaurants and cafes serving local fare. However, everything from food trucks and markets to Michelin-starred restaurants are available throughout the city. To taste some of Oslo's best Norwegian dishes, locals and visitors alike recommend visiting Maaemo and Statholdergaarden, which have both earned Michelin stars.", "For more affordable fare, consider sitting down for a meal at one of Oslo's ethnic restaurants. American, Japanese, Indian and Italian are just some of the cuisines available here. Traveler-approved ethnic eateries include San Francisco Bread Bowl, Campo de' Fiori and TUNCO.", "No visit to Oslo would be complete without trying aquavit (or akevitt in Norwegian). Generally consumed during holidays, Norway's national drink is a potato-based liquor aged in sherry oak casks and flavored with herbs and spices like caraway and dill. Most restaurants and bars sell the beverage, which anyone age 18 or older can drink.", "Oslo is considered one of the safest capital cities in Europe. Although some European countries are dealing with growing terrorist threats, Norway rarely suffers from terrorist attacks. However, as the country's status as a tourist destination has grown, so have the incidents of petty theft, especially in Oslo. Keep an eye out for pickpockets in areas around top attractions, hotel lobbies and transportation hubs. To learn more about how to stay safe while visiting Norway, check out the U.S. State Department's website.", "The best way to get around Oslo is on the trams or buses, as they're widely available and conveniently connect passengers to points throughout the city. When you arrive at Oslo Airport (OSL), you can take a train, bus, taxi or rental car into the city center. The T-bane metro system is also available downtown, though its network is limited compared to the trams and buses. Meanwhile, walking and biking are viable (and affordable) options for shorter treks on warmer days.", "To visit Norway, you'll need a passport that's valid for at least six months beyond your departure date. Proof of sufficient funds and a return airline ticket must also be presented upon arrival. A visa is not required for Americans who stay less than 90 days. For more information on entry and exit requirements, visit the U.S. State Department's website.  "]}