{"name": "Indianapolis", "description": ["With four major interstates passing through its city limits, all roads seem to lead to Indianapolis. It's connected to the Midwest mainstays of Chicago and St. Louis, after all. When compared to its neighbors, Indiana's capital doesn't initially stand out as a hotbed of culture. But if you look closer, you'll find that Kurt Vonnegut's hometown is just as vibrant as its Midwestern siblings. For starters, the Indianapolis Motor Speedway is home to the Indianapolis 500, which, along with the Monaco Grand Prix and the 24 Hours of Le Mans, comprise the prestigious Triple Crown of Motorsport. Not much of a speed demon? That's fine – Indy has plenty of other sports to capture your attention, including the NFL Indianapolis Colts, not to mention the Indianapolis Indians, the city's Triple-A baseball team, play in one of the country's best minor league parks.", "And then there's the city's family appeal: Indianapolis is home to the world's largest children's museum and an impressive zoo. Meanwhile, culture hounds will be pleased to know Indy boasts one of only two museums east of the Mississippi that showcase both Native America and the American West, The Eiteljorg. Plus, the city touts the Indianapolis Cultural Trail, an 8-mile urban bike and pedestrian path that weaves visitors through neighborhoods, cultural districts and past some of Indy's top attractions. Still not convinced? Maybe the Hoosier hospitality and comforting Midwestern fare will help change your mind.", "The best time to visit Indianapolis is between May and August for the pleasant weather (averages in mid-80s) and a plethora of outdoor events, like the iconic Indianapolis 500. December is another festive time when downtown Indy twinkles for the holidays (if you like winter weather). Pull out the sweaters and explore Indy in September and October for fall colors, Oktoberfest celebrations and everything orange, from the pumpkins to the trees. Indianapolis gets bitter cold and quiet as soon as the New Year's celebrations end.", "Avoid Memorial Day Unless you're in town for the Indianapolis 500, which always takes place over Memorial Day, you'll want to plan your Indy visit for another weekend. Flights and hotel rates will be pricey thanks to all the race traffic; budget travelers beware.", "Dial into its live music Indianapolis is home to a vibrant nightlife scene, especially live, local music. Try Slippery Noodle Inn, Indiana’s oldest continuingly operating bar in its original location.", "You don't need a rental car Another pro for Indianapolis: The city is very walkable, especially the downtown area, where you'll probably spend most of your time. Instead of a car, rent a bike. You'll save a bundle and enjoy a more intimate view of Indy's treasures.  ", "Check with the visitors bureau Visit Indy offers coupons for attractions, restaurants and hotel packages on its website. Consult its site and sign up for its pass, delivered to mobile devices for daily deals texts (no app to download).", "Ditch the airport taxi; take the shuttle instead The Go Express Travel shuttle is an express service that transports visitors between the airport and downtown Indy for just $13 one-way.", "Replace your rental car The Indiana Pacers Bikeshare is better for your body and more affordable. Over 500 gold bikes at popular locations that are available for 30-minutes trips, starting at a $1 a trip and 15 cents a minute.", "It's no secret that beef is big in Indianapolis (especially at St. Elmo Steakhouse, an American Classic by the James Beard Foundation), but there's more to this city than meat and potatoes. Indy's dining scene has greatly evolved over the past decade and is quickly becoming a city foodies will relish exploring. Whether you're looking for farm-to-table, Cajun, Italian, Thai, Latin or anything in between, you'll likely find it.", "For breakfast, locals and critics recommend you start at Cafe Patachou with one of its cooked-to-order omelets. When lunchtime rolls around, you'll have your pick of casual eateries, but Shapiro's Delicatessen (get the pastrami sandwich with a side of the matzo ball soup) and Yats (don't pass up the chili cheese étouffée with crawfish) are Hoosier favorites.", "If you're not in the mood for a steak dinner, grab an outdoor table at Mama Carolla’s Old Italian Restaurant and see why locals consider it one of the most romantic places to eat.", "Bluebeard (which borrows its moniker from Kurt Vonnegut's novel of the same name) is another favorite among locals and visitors. Situated in the historic Holy Rosary neighborhood in a renovated 1920s-era factory warehouse, Bluebeard serves up a menu of contemporary American cuisine with seasonal and local ingredients.", "And then there's the beer. Indianapolis is all-in with craft beer so you're likely to find something to suit your palate. A good place to start is the first brew pub in Indy, Broad Ripple Brew Pub. Or how about sipping a beer in church at St. Joseph Brewery and Public House (a former Catholic church). With the Indy Craft Pass (available at Visit Indy), adults can sample brews across 35 different locations, get exclusive deals and even some swag.", "Indianapolis hosted the 2012 Super Bowl, and was only the fourth cold-weather city to do so in the game's history. Here, a picture of Super Bowl Village on Georgia Street."]}