{"name": "Galapagos Islands", "description": ["With its untamed terrain and notoriously fearless creatures – from sea lions to seagoing lizards – the isolated isles of the Galápagos lure those looking for exhilarating encounters in the wild. After all, where else can you observe giant tortoises grazing on tall blades of grass, short-feathered penguins waddling along the equator or blue-footed boobies conducting their unique mating ritual, all unbothered by the presence of onlookers? More than 100 years after Charles Darwin visited during his legendary voyage aboard the HMS Beagle, adventurers continue to use his footsteps as a guide for their own extraordinary journeys.", "The Galápagos archipelago sits approximately 600 miles west of mainland Ecuador and comprises 234 isolated islands, islets, and rocks, warranting plenty of exploration. But with so much to see and do across this remote string of islands, you'll have to be selective about which islands you choose to discover. To get acquainted with the Galápagos' famous dome-shaped tortoises, head to El Chato Tortoise Reserve or Rancho Primicias on Santa Cruz Island. If you're keen to delve into the history of giant tortoises, witness conservation initiatives, and grasp the captive breeding endeavors for endangered turtle species, consider visiting the Tortoise Trail in the Galápagos National Park in Santa Cruz. Additionally, don't miss the chance to see the iconic Lonesome George, whose preserved body is a poignant reminder of the importance of preventing species extinction. Afterward, trek east to the Charles Darwin Research Station to learn more about Darwin's work. If you would prefer a rendezvous with sea lions, head to San Cristóbal Island, where the cheery mammals engage in barking conversations along chalky white sands. And for a more serious adrenaline rush, head to Isabela Island to hike the active and imposing Sierra Negra volcano. Wherever your Galápagos adventure takes you, don't forget to bring your camera.", "The best time to explore the Galápagos Islands is from December to May. While the islands are excellent year-round, these months offer temperatures ranging from the low 70s to mid-80s, making pleasant conditions for hiking and wildlife-spotting. And though this season experiences frequent (but short) showers, the sun shines brightly on most days. Between June and November, the Humboldt Current, a current that runs northwest along South America's west coast, ushers in cooler temperatures and nutrient-rich water that attracts rare fish and birds. Albatrosses are exclusively found on Española Island in the Galápagos, and they can be observed there only between April and December. In August, Galápagos Penguins begin their migration from Isabela and Fernandina islands to central islands such as Bartholomew. Additionally, during these months, the region experiences longer rain showers and stronger winds, resulting in rougher seas.", "To minimize the ecological impact on this fragile ecosystem, strict regulations are in place, including guidelines for site visits, allowable activity lengths and maximum passenger limits. You'll need to book several months in advance to secure a spot, regardless of your preferred travel dates.", "Dive into shoulder seasons The \"warm phase\" (December to May) offers sun-soaked days and inviting ocean temps, while the \"dry phase\" (June to November) brings vibrant wildlife interactions, from bustling sea mammals to seabird chicks. For nature lovers, the \"dry phase\" is unbeatable.", "You need a TCT The Galápagos government requires all tourists to purchase a Transit Control Card, which helps monitor tourist time on the islands. You can fill out your information online in advance or do so at the airports in Quito, Guayaquil and Cuenca. The fee is $20, payable in cash at the airport. Keep the card safe during your trip; you'll need to present it upon departure.", "You have to pay to play In order to tour Galápagos National Park (which occupies nearly the entire archipelago), foreign tourists not residing in Ecuador must pay an entrance fee. Individuals 12 years and older pay $100, while those younger than 12 pay $50. This entrance fee bolsters sustainable human development and vital conservation efforts in the region.", "Prepare for sun The sun scorches the Galápagos Islands, and shade is hard to come by. Protect yourself with sunglasses, a hat and lots of sunscreen. A sun shirt wouldn't hurt, either.", "Respect the Galápagos Code The islands aren't just a breathtaking destination but a national park and a World Heritage Site. As a visitor, you're entrusted with their care. The Galápagos National Park Directorate has set forth 14 crucial rules to ensure we all help preserve this natural wonder. Before your adventure, familiarize yourself with the guidelines.", "Embrace the digital detox With its pristine beauty, the Galápagos is also a testament to life off the beaten digital path. Be prepared for limited internet access and unstable cellphone coverage. Embrace this opportunity to disconnect and immerse yourself in the wonders of nature.", "Visit in the offseason If you plan a trip in October, November or between February and May, you'll find significantly lower costs. You'll still want to book a few months in advance to ensure availability (this is true of no matter the time of year you book).", "Plan daytrips Though cruises are a remarkable way to experience the Galápagos Islands, they often come attached to exorbitant price tags. You'll find a handful of affordable expedition options available in Puerto Ayora, Puerto Villamil and Puerto Baquerizo Moreno. Plus, you can pick and choose tours based on your interests.", "Get your fill of free attractions Though an entry fee applies to visit Galápagos  National Park, many of San Cristóbal Island and Santa Cruz Island's top attractions, including the Giant Tortoise Breeding Centers overseen by the Galápagos National Park Directorate and the Charles Darwin Research Center do not charge an additional entrance fee.", "Maximize your first moments There's a wealth of activities in San Cristóbal and Baltra, the two places where you're likely to fly into. Visit Los Gemelos (the Lava Tunnels) or ranches hosting giant tortoises prior to visiting another location.", "Ever since Panamanian bishop Tomás de Berlanga accidentally stumbled upon this isolated archipelago in 1535, the Galápagos Islands have entertained a bevy of visitors, from pirates and whalers to scientists and tourists. But the most iconic Galápagos visitor of all was British scientist Charles Darwin, who developed his ground-breaking theory of evolution after his stay in 1835, three years after the islands were claimed by Ecuador.", "In 1959, organized tourism spiked significantly with the establishment of Galápagos National Park. This designation covered nearly 97% of the total land, solidifying its status as one of the most protected and biodiverse natural reserves on the planet. Today, the Galápagos Islands welcome more than 200,000 visitors every year.", "While this tourism boom benefits Ecuador's economy, the eclectic array of species found here – and nowhere else – continue to be threatened. In fact, the remote region became so popular among tourists that the park was declared a World Heritage Site in Danger in 2007. Widespread preservation efforts have reduced imposing threats to the archipelago. It is no longer considered to be \"in danger,\" yet conservationists continue to monitor tourist activity to reduce the damage caused by an ever-expanding human footprint. Travelers can minimize their impact by abiding by park rules and walking along the marked trails. ", "According to the last government census conducted in 2015, the Galápagos Islands were home to roughly 25,000 inhabitants. However, the population has likely grown since then, with estimates suggesting that more than 30,000 people now reside on the islands. Of this population, a significant majority, nearly 20,000 individuals, call Santa Cruz Island their home, making it the most densely populated of the Galápagos Islands. This increase in population presents unique challenges and opportunities for the region, particularly in terms of sustainable development and conservation efforts in this ecologically sensitive and globally significant archipelago.", "The dress code in Galápagos is generally casual: T-shirts, shorts or light trousers are your best choices. Evening dress code is generally quite casual, but it's a good idea to bring along a change of clothes. Given the archipelago's unique equatorial location, it's important for visitors to be mindful of the weather. Packing light layers and wearing ample sunscreen is essential to protect yourself from the strong UV rays. Additionally, comfortable walking shoes are a must if you plan to explore hiking trails. If you're inclined toward underwater adventures like snorkeling or scuba diving, including a wet suit in your luggage is advisable, as are multiple swimsuits. Keep in mind that evenings and higher elevations in the Galápagos Islands can get cooler. Be sure to pack a light jacket or sweater to keep you warm during breezy nights or while exploring the captivating highlands.", "The U.S. dollar is the official currency of the Galápagos. While the island vibe embraces cash for most of its dealings (from boutique hotels to local diners), some establishments welcome Visa and MasterCard. Just a heads up, though – American Express isn't a local favorite. Should your wallet run thin, Banco del Pacífico and Banco Pichincha have your back with ATMs, normally open 24 hours a day.", "The region's most widely spoken language is Spanish, but a growing tourism market has brought English to major isles like Santa Cruz, Isabela and San Cristóbal. Additionally, hotels and local tour companies can connect you with English-speaking nature guides. But if you plan on visiting more remote regions, you may want to learn a few key Spanish words and phrases – such as \"hola\" (hello), \"adios\" (goodbye), \"por favor\" (please) and \"gracias\" (thank you) – to use during your vacation.", "Dining takes on a unique and flavorful character on the islands. Galápagos cuisine echoes the simplicity and rich flavors of mainland Ecuador, featuring staples like potatoes, yucca, plantains and rice. These ingredients come together to create dishes that are light yet incredibly satisfying. Additionally, there's a strong emphasis on locally sourced, fresh seafood, particularly in the handful of restaurants situated in Puerto Ayora, Puerto Villamil and Puerto Baquerizo Moreno.", "One can't-miss item is the Galápagos lobster, a delicacy best enjoyed between September and December when the fishing ban is temporarily lifted. Additionally, indulge in the canchalagua, a mollusk unique to the region, as well as albacore or yellowfin tuna, which grace the menus with their exquisite tastes . Fish enthusiasts can relish dishes featuring camotillo, also known as the white-spotted sand bass; pez brujo, the Pacific spotted scorpionfish; and bacalao rey, the Galápagos golden grouper. If seafood isn't your preference, you'll find dishes with chicken, beef and pork on offer.", "As for breakfast, the day commonly starts with bolones (fried plantains stuffed with cheese and meat) and coffee or freshly squeezed juices like guanabana (or soursop, an acidic yet sweet fruit believed to help fight cancer), tree tomato (a tomato-like fruit known outside South America as tamarillo) and passionfruit. During other mealtimes, expect to see ceviche and fish-based soups like biche (which has a creamy peanut base with a piece of white fish and chopped vegetables) and encebollado (made with tuna, yucca, cilantro, tomatoes and pickled onions) on restaurant menus.", "It's also common for locals and tourists to enjoy typical local dishes on Sundays in the highlands of Santa Cruz and San Cristóbal, particularly in the Bellavista and El Progreso parishes. These dishes often feature hearty stews like secos and aguado, prepared with free-range chicken.", "Many of the Galápagos' islands are home to wild animals, so you should take precautions when exploring the region. You must not touch or feed any animal you see. When snorkeling or diving near sea lions, stay a safe distance from bulls – the larger, more aggressive and very territorial males. Also, do not provoke sharks. When diving, remember to practice safe diving practices like equalizing your ears as you descend and knowing where your scuba buddy and guide are at all times.", "The archipelago is spread across the equator, so you'll need to protect yourself from the sun while visiting. Wearing a hat and lathering on sunscreen (even on areas covered by clothing) is strongly recommended. ", "Packing any essential medications and medical equipment is a must due to the region's limited medical services. While 911 services and local hospitals are available in the islands (and can handle first aid and common medical needs), it's important to note that the region may lack specialist doctors for certain medical conditions. Before your trip, speak with your doctor about any medications and vaccinations needed for diseases present in the area, such as malaria, Zika, dengue and yellow fever. Travelers should consider purchasing comprehensive travel insurance to cover potential medical emergencies or evacuations during their visit.", "Galápagos is generally a safe destination, and thefts aboard tourist boats are extremely rare. The local community values and safeguards visitors, making the archipelago a secure place to explore. However, taking standard precautions to protect your belongings while traveling is always advisable.", "If you will be flying into Quito, Guayaquil or Cuenca before continuing to the Galápagos, keep an eye on your belongings at all times at these airports and in these cities. If you choose to spend a day or two in these cities, it's advisable to stay vigilant (especially on hiking trails and public transportation), as robberies have occurred. Additionally, it's best to avoid hailing taxis on the street and traveling alone, as there have been reports of express kidnappings (sometimes involving taxis) and incidents of harassment, even in tourist areas.", "Before visiting Ecuador, the U.S. State Department strongly advises all Americans sign up for the free Smart Traveler Enrollment Program, which ensures the nearest embassy or consulate is aware of your travels. Additional information about security concerns and how to stay safe in Ecuador is provided on the U.S. State Department's website.", "The best way to get around the Galápagos Islands is by boat. The key islands for island-hopping are Santa Cruz, San Cristóbal and Isabela. You can stay overnight on any of these islands or all three, using them as your starting points for daily excursions. Island-hopping packages usually include both sea and land transportation. You'll want to arrange an organized multiday cruise or boat tour several months in advance; that said, sea journeys aboard luxury liners are often attached to a lofty price tag, especially during the high season (December to May). If you wish to steer clear of the water altogether, you can fly from Baltra (a small island north of Santa Cruz Island) to San Cristóbal Island or Isabela Island.", "You can fly to the Galápagos from Guayaquil's José Joaquín de Olmedo International Airport (GYE), located in mainland Ecuador. If you would prefer to fly to the Galápagos from Quito's Mariscal Sucre International Airport (UIO), plan to stopover in Guayaquil and tack an additional hour onto your flight time. You can also fly from General Eloy Alfaro International Airport (MEC, located in Manta, Ecuador). Airlines EQUAIR, LATAM and Avianca offer flights to Seymour Airport (GPS) and San Cristóbal Airport (SCY). Most cruise operators will arrange to meet you at either airport and transport you to your ship. If you're planning on visiting the islands without a tour guide, it's easy to navigate your way from Baltra to Santa Cruz Island. To reach Puerto Ayora, take the bus or taxi.", "Puerto Baquerizo Moreno (on San Cristobal) and Puerto Villamil (on Isabela) are both within a short drive of San Cristóbal Airport (SCY) and General Villamil Airport (IBB), respectively. However, it's important to note that General Villamil Airport primarily serves small inter-island aircraft and does not have commercial flights.", "Americans will need to present a valid passport before entering Ecuador. U.S. travelers can stay in Ecuador for up to 90 days without obtaining a visa, though the Ecuadorian government requires that you carry proof of identification and a photocopy of your passport at all times. Upon entry into the Galápagos, you'll also need to pay a fee. Adults and children 12 years and older are charged $100, while those younger than 12 pay $50. This fee grants access to Galápagos National Park (which comprises roughly 97% of the archipelago) for the duration of your stay. Sometimes, the cost of your tour or cruise will cover the fee; if that's not the case, you must be prepared to pay in cash upon arrival in the Galápagos. You'll also need to pick up a Transit Control Card, available from the Galápagos Government Council offices at Quito, Guayaquil and Cuenca's airports. Some tour companies will take care of card registration for you, but if you are traveling independently, allot extra time for purchasing a card. Each card costs $20 and must be bought with cash. You'll need to present your passport and Transit Control Card again when you leave. To learn more, visit the U.S. State Department's website."]}