{"name": "Reykjavik", "description": ["First, let's get a few things out on the table. Yes, Reykjavik is in Iceland, which is, in fact, an icy island about half the year. And, yes, Iceland was the culprit in 2010's volcanic eruption fiasco. But, you might not know that in the cold, long winter, Icelanders warm up in this capital's geothermal spas; and away from the city lights, they can drink in the beauty of the aurora borealis. The weather is divine in the summer, and the days are long; you see nearly 24 hours of sunlight on the summer solstice. And volcanoes, like the notorious Eyjafjallajökull, are just one part of Iceland's dramatic and ethereal landscape. There are also gushing waterfalls, awe-inspiring geysers, expansive glaciers, and wide open spaces filled with Icelandic horses and sheep. Plus, Reykjavik boasts a raging nightlife scene and a collection of interesting museums and local shops.", "Iceland's capital and largest city is a prime home base for exploring many of the country's most treasured natural wonders, such as the Golden Circle. If you don't want to plan your own itinerary, consider signing up for one of the best Iceland tours, which are led by knowledgeable locals who take care of all the planning and logistics for you.", "The best time to visit Reykjavik is from June to August. Not only can you enjoy the balmy temps (for Iceland, at least), but you'll also experience long days (think: up to nearly 24 hours of sunlight – a phenomenon dubbed \"midnight sun\"). If you're looking to save some Icelandic króna, you'll be able to do so in the winter, but those who wrestle with seasonal affective disorder might reconsider: the sun only peeks out for four or five hours between December and January.", "Iceland is small Compared to the size of Kentucky, Iceland is only about 40,000 square miles. On a longer trip, you can see some of the highlights of the whole country, including the Blue Lagoon, the Golden Circle, South Iceland, and, from September to mid-March, the aurora borealis.", "Weekdays are the best days for shopping Unless you plan on bargain-hunting at the Kolaportið Flea Market on weekends, shop along downtown thoroughfares like Laugavegur on weekdays when stores generally offer extended opening hours.", "Arrive early for flights Keflavik International Airport is undergoing expansion projects to accommodate more passengers, but in the meantime, expect long check-in lines (in the summer) and crowded gate areas. The airport recommends arriving at least two-and-a-half hours before scheduled departure times.", "Avoid eating at restaurants for every meal Sitting down for multiple meals daily can quickly add up. Grab a pylsur (or hot dog) from one of downtown's carts, or buy grab-and-go pastries, sandwiches, and snacks from a local grocery store to keep your food costs low. Local bakeries like Brauð & Co and Sandholt are outstanding.", "Choose your spa experience wisely Blue Lagoon offers an amazing experience, but a much more cost-effective alternative is to soak in one of Reykjavik's local geothermal pools or hot pots.", "Purchase a Reykjavík City Card Each Reykjavík City Card costs 5,040 to 8,630 Icelandic króna (or $36 to $62) and includes 24, 48 or 72 hours of complimentary access to the National Museum of Iceland and city museums like The Settlement Exhibition and the Árbaer Open Air Museum, plus unlimited rides on the city's Straetó buses.", "Although Iceland is relatively young (it gained full independence from Denmark in 1944), the country boasts one of the world's most celebrated cultures. Settled by Scandinavian immigrants (known as Vikings) and Irish slaves between the ninth and 10th centuries, Iceland continues to celebrate its Viking customs and traditions through the retelling of folktales about elves and trolls.", "Because of its isolated location, Icelandic – Iceland's official language – has hardly changed since the country was settled. However, when American troops were stationed in Iceland during the latter part of World War II, many Icelanders taught themselves English by watching the military base's TV channel. As a result, most Icelanders today speak Icelandic, English and a bit of Danish. Icelandic, therefore, is not necessary to use when visiting, but if you'd like to try speaking the language, here are a few key words and phrases to remember: \"góðan daginn\" (good day), \"skál\" (cheers), \"takk fyrir\" (thank you) and \"bless\" (goodbye).", "When eating at one of Reykjavik's restaurants, you'll notice some dining customs are a bit different. Waitstaff in Iceland, like other parts of Europe, are generally paid more than servers in the U.S., so tipping is not required. What's more, it is customary to get up and pay for your meal at a register (rather than asking for the check). And keep in mind that the Icelandic króna, which equals about one American penny, is the official currency here. Since the króna to U.S. dollar exchange rate fluctuates, be sure to check the current exchange rate before you go.", "As questionable as Icelandic delicacies like rotten shark, sour ram's testicles, sheep's head, minke whale and puffin may sound, you can always trust that New Nordic cuisine will be prepared with fresh and rich ingredients. Local seafood, in particular, is a mainstay in Icelandic fare – fitting of a city surrounded by arctic waters. The city is also known for skyr (a yogurt-like dairy product offered in a variety of flavors), hangikjöt (smoked lamb) and pylsur (hot dogs that are deepened in flavor by lamb meat). And no visit to Reykjavik would be complete without trying Íslensk kjötsúpa (a traditional lamb soup that varies by restaurant, much like a mole sauce in Mexican cuisine or a marinara sauce in Italy). Downtown Reykjavík has turned into a foodie’s paradise over the past decade, where you can find everything from Nepalese cuisine to sushi. ", "If you'd rather grab a quick bite while saving some coin, sample a pylsur with the works (raw and fried onions, slightly spicy mustard, ketchup, and a relish-like sauce made with mayo and capers) at Baejarins Beztu Pylsur. Be prepared to wait in line, though, since this hot dog stand is popular with locals and tourists alike. It has even welcomed American icons like former President Bill Clinton and Kim Kardashian.", "The best ways to get around Reykjavik are by foot, car and tour bus. Although rates are often higher for the best Iceland tours, traveling by tour bus comes without the headaches of driving on unfamiliar and sometimes icy roads. If you'd rather keep your travel expenses low and roam freely without sticking to a set schedule, car hires are likely your best option. Neither, however, is suggested for exploring central Reykjavik, which is small and walkable. Taxis and public transportation are available as well, but taxis are generally more expensive.", "To travel between the city center and Keflavik International Airport (KEF), consider using a local tour bus operator like Gray Line Iceland and the Flybus.", "Americans who wish to enter Iceland must have a U.S. passport that's valid for at least three months past their last day in the country. A return airline ticket is also required, but travelers won't need a visa when staying less than 90 days. Additional information about Iceland's entry and exit requirements is available on the U.S. State Department's website."]}