{"name": "Burlington, VT", "description": ["Burlington thrives on all things offbeat, with a cosmopolitan feel that belies its relatively small population. Pedestrian-only promenade Church Street bustles with local shops, restaurants and street performers, while Burlington breweries turn out some of the most sought-after beers in New England. The two local colleges bring an annual infusion of student energy, filling downtown venues that still sometimes groove to the sounds of Phish (yes, that Phish), a Burlington jam band that remains beloved. The Queen City also makes a great starting point for exploring nearby communities. In historic Shelburne, find lakefront walking at Shelburne Farms then explore eclectic artwork at the Shelburne Museum, where kids (and their adults) can play in a steamship restored to its century-old glory. Head from the Champlain Valley into the Green Mountains to hike through bird-friendly forests or sample creative ice cream at the Waterbury's Ben and Jerry's Factory.", "The best time to visit Burlington may be during the summer months of June, July and August, as they're ideal for exploring the city and surrounding mountains on hiking trails and bike paths. Also scenic is leaf-peeping season, which generally kicks off by the end of September and lasts through late October. Weather can get messy in November, March and April, but that period also brings unbeatable hotel rates and far fewer crowds. Nearby ski areas like Stowe, Bolton Valley Resort and Smuggler's Notch are generally open by mid-November; peak snow season ramps up in December and lasts through February or March. ", "It's a college town Burlington swells with students each fall, and the city's schools – the University of Vermont and Champlain College – help keep the city vibrant.", "Pick up a paper The free local newspaper \"Seven Days\" is a weekly resource for news, dining recommendations and info about the city's ever-changing festival schedule.", "Pack a picnic From the Waterfront to Oakledge Park, Burlington's green spaces are ideal for dining al fresco – stop by City Market Onion River Co-op to pick up local provisions, sandwiches and buffet fare.", "Time your trip Hotel and bed-and-breakfast rates soar in October, when the state fills with leaf peepers seeking peak color. Find lower prices by visiting in November (known as \"stick season\" thanks to bare tree branches and a lack of snow), or the melting, muddy months of March and April.", "Enjoy a free show Many Burlington festivals, including Burlington Discover Jazz Festival and Festival of Fools, feature outdoor shows that are free to all.", "Sure, you can buy a scoop of Ben & Jerry's ice cream at the international chain's Burlington shop, but there's more to Queen City dining than pints of Cherries Garcia. In fact, most locals spend their summers craving maple creemees, instead. The distinctive soft-serve ice cream sweetened with Vermont syrup generally comes spiraled onto cones and is seasonally available at takeout windows and snack bars around the city. Burlington has a wealth of microbreweries, too, many of which serve farm-to-table versions of comforting pub fare – poutine and burgers abound alongside Vermont's classic hazy IPAs. At the high end are James Beard Award–recognized menus of small plates using ingredients sourced from nearby farms; cultivating relationships with growers is the height of gourmet chic in the Burlington food scene. From cheddar to raclette, locally produced cheese is a highlight – look for Vermont's many award-winning cheesemakers listed by name on restaurant menus. Or, think food trucks: The mobile gourmet vendors show up on Church Street Marketplace, the Waterfront and at the South End Get Down, a weekly summer food event with music and jubilant crowds."]}