{"name": "Sedona", "description": ["Sedona is regularly described as one of America's most beautiful places. Nowhere else will you find a landscape as dramatically colorful. The towering red rocks and jagged sandstone buttes matched against an almost always blue sky have beckoned to professional and budding artists for years. Plus, filmmakers have chosen these fiery rock formations in north-central Arizona as the backdrop for such box-office hits as \"3:10 to Yuma,\" \"Broken Arrow\" and \"Midnight Run.\"", "But there's more to Sedona than red rocks and good looks. Over the past few decades, spiritualists have flocked to the region to take advantage of the numerous New Age \"vortexes\" with supposed spirit-balancing powers found here. Still searching for a way to satisfy your yen? Book an afternoon at one of Sedona's many spas. Traditional treatments with a local twist – such as red clay wraps and blue corn body scrubs – followed by a glass of local wine are great ways to relax after a long day spent on the trails. Oh yeah, and did we mention that the area is home to more than 100 hiking trails? Exploring the wilderness via a guided Jeep tour is another popular option. Consider purchasing medical travel insurance if you plan to embark on some of these more active adventures. ", "The best time to visit Sedona is from March to May when the temperatures are warm – but not scorching – and the area is in full bloom. Hikers love this season, as desert flowers add a pop of color to the rust-colored trails. September to November is another ideal time for outdoor activities like Jeep tours and biking thanks to mild weather. Spring and fall are characterized by blue sunny skies and temps ranging from the mid-60s to the low 80s, however, travelers should note that these are the most popular times to visit and room rates are high. If you're looking for cheaper rooms, consider visiting in the winter, when most tourists head farther south for warmer weather. There really is no bad time to visit Sedona, as the weather is pretty great year-round. ", "Bad karma, bad traffic You'll have to focus hard to maintain your synergy; traffic is anything but harmonious. Expect to hit congestion at the \"Y\" – where state routes 179 and 89A intersect – and on many of the roads that offer views of the rocks.", "Shop for authentic Native American goods A hidden find, Kachina House has the largest selection of authentic Native American Hopi Katsinam and Navajo Kachinas, as well as pottery, baskets and jewelry. – Carol Kahn, Contributor, Travel", "Visit in winter Sedona's relatively cooler temperatures generally drive tourist traffic farther south to destinations like Phoenix or Tucson, leaving behind plenty of bargain-friendly room rates.", "Abide by the principles of Leave No Trace When exploring Sedona's natural wonders, keep the seven principles of Leave No Trace in mind, which include properly disposing of waste, sticking to trails and respecting wildlife, among others. ", "Enjoy the scenery You don't have to pay anything to enjoy Sedona's main attraction, the red rocks. While some of the tours may seem tempting, you can avoid the hefty charges by opting for a free hike or a scenic drive instead.", "In Sedona, awe-inspiring views and delectable dishes go hand in hand, so if you're planning to dine at one of the area's best restaurants, prepare to stay awhile and enjoy the jaw-dropping setting. Many of the city's top eateries can be found within its best hotels, including Cress on Oak Creek at L'Auberge de Sedona, SaltRock Southwest Kitchen at Amara Resort and Spa and Che Ah Chi at Enchantment Resort. When you're ready to venture off the resort, you'll find more striking vistas and tasty menus at Mesa Grill (situated right next to the tarmac of the Sedona Airport), Mariposa Latin Inspired Grill, Creekside American Bistro and The Hudson Sedona.", "If it's traditional southwestern flavors you're after, locals and visitors are quick to recommend Tamaliza Cafe, an unassuming cafe revered for its homemade tamales. But make sure you also try Sedona's beloved French and Italian restaurants, specifically Rene at Tlaquepaque and Dahl & DiLuca Ristorante Italiano, which incorporate a southwestern flair into their dishes.", "The best way to get around Sedona is by car. Although the Verde Lynx bus service is useful for getting around downtown, many of the region's trails are located away from the main roads. You can either rent a car at Phoenix's Sky Harbor International Airport (PHX) and drive about 120 miles north to Sedona, or you can hop on any of the numerous Phoenix to Sedona shuttles and rent a car once you arrive in town. Ticket prices for shuttles vary depending on the company; Groome Transportation is a popular shuttle service. Exploring the city via a guided tour is another popular way to get around.", "Before you set out on your trek through Sedona's red rocks, stop at The Hike House for information and tips on area trails and to pick up any gear or snacks for your journey. "]}