{"name": "Corfu", "description": ["Used as the backdrop for epic tales by both Homer and Shakespeare, the island of Corfu (also spelled Korfu or Kerkyra) continues to attract weary travelers looking to escape from the hustle and bustle of everyday life. The sight of its lush green landscape and the scent of olives and citrus from nearby groves is enough to melt away any ounce of stress. And the feel of the sprawling, pebbly beaches beneath your feet or the view of the cerulean waves of the Ionian Sea is enough to make you feel as though you've found paradise.", "The miles of coastline and picturesque beaches are what draws tourists to Corfu each year. Whether you're looking for quiet sands with calm waters or pebbly beaches with plenty of nearby amenities, you'll find it on Corfu. And after a few days of fun in the sun, set aside some time to explore the island's unique historical and religious attractions. Many of the top sights, like the Palaio Frourio (Old Fortress) and the Corfu Museum of Asian Art, are centered around Corfu Town. When you're ready to venture to the western side of the island, one-of-a-kind attractions, such as the Paleokastritsa Monastery and the Corfu Donkey Rescue, will be waiting for you. ", "The best times to visit Corfu are April to May and September to November. Although there is never really a bad season in the Mediterranean, you'll find that winter temperatures are too chilly to swim off the shores of Corfu, while the summer months draw hordes of tourists. The shoulder seasons, however, offer warm, sunny weather and plenty of open (and bargain-priced) hotel rooms, not to mention some exciting special events like Carnival.", "Corfu's rich history influences its culture even today. Art, music and theater still play a huge role in the lives of locals. Known for their hospitality, Greeks are happy to share their traditions with visitors. You'll find plenty of English speakers in the touristy areas of the island, but understanding Greek etiquette will help you interact with residents and blend in better. Body language is key in Greek culture. For example, the hand signal for \"OK\" (using the thumb and index finger) is offensive in Greece. And Greeks indicate \"yes\" with a slight downward nod and \"no\" by a slight upward nod.", "Corfu's currency is the euro. Since the exchange rate fluctuates, check the current exchange rate before traveling. You'll easily find ATMs and banks in the more populated towns, so make sure to inform your bank that you'll be traveling if you plan on taking out cash while on the island. Tip service staff at your own discretion (usually about 10 percent – more if you experience exemplary service). Some establishments might include a service charge, so check your bill before tipping.  ", "Corfu restaurants and tavernas – classic Greek-style pubs – serve traditional Greek food with a twist. Since the island's history includes occupation by the French, British and Italian, you'll find influences mixed in with Greek classics. Expect seafood served in white wine sauce (á la français) alongside spaghetti or accompanied by tzin tzin birra, the island's version of British ginger beer.", "The island also offers a range of restaurants for all budgets. Menus feature plenty of fresh seafood, which is exclusively supplied by local fisherman – meaning it can be pricey. Dishes with grapes, citrus fruits, olives and honey are also popular. If you're visiting a resort, you'll likely stay on property for your meals, but if you've exploring Corfu Town there are plenty of charming, locally owned spots to choose from. Travelers recommend Avli Restaurant  and Spianada Cafe. To dine with stunning ocean views, check out the Corfu Sailing Club Restaurant (located right on the marina) or En Plo. ", "If you're on a budget, you'll be happy to hear classic Greek gyros are a cheap, delicious meal for about 3 euros (less than $5!). Meals at casual restaurants will average about 10 to 20 euros (about $12 to $24) per person while more trendy, upscale restaurants will set you back about 45 euros (about $55) or more per person. To save money, opt to share appetizers (meze or mezethe) instead of ordering separate entrees. ", "Corfu is one of the safest tourist destinations in Europe. Still, make sure to exercise extra care of your belongings in heavily touristed areas and at resorts, where pickpocketing is a problem. ", "The best way to get around Corfu is by bus or on foot. Renting a car is also an option if you're itching to explore the island and want more flexiblility. If you just plan on lounging by the beach your whole vacation or are staying central to Corfu Town, your own two feet should suffice. If you grow weary, the Corfu City Bus is a convenient and affordable option for exploring Corfu Town. The bus also offers routes to the Corfu International Airport (CFU), although it's about a half-mile walk to the station. You can also hail a taxi or hire a car, but it'll cost you. ", "To enter Greece, U.S. travelers must present a passport that has six months of remaining validity on it since Greece is part of the Schengen Agreement. If you're staying for less than 90 days, no tourist visa is required. Visit the U.S. Department of State's website for more information on entry and exit requirements."]}