{"name": "London, England", "description": ["The English writer Samuel Johnson famously said, \"You find no man, at all intellectual, who is willing to leave London. No, Sir, when a man is tired of London, he is tired of life; for there is in London all that life can afford.\" More than two centuries have passed since Johnson's era, but his words still ring true. Life in London is nothing short of invigorating, and travelers find that one visit isn't enough to experience everything this two-millennia-old city has to offer.", "Here, the antiquated clasps hands with the contemporary. You'll find the historic Tower of London and the avant-garde Tate Modern. You can catch both the Bard's works and modern plays at Shakespeare's Globe and its accompanying Sam Wanamaker Playhouse. And while Londoners still praise the power of tea, they now make room for Starbucks and Costa Coffees here and there, and pressed juice too. A current leader in everything from politics and banking to fashion and music, London's culture compass is always attuned to what's next. Discover it all on one of London's best tours.", "The best time to visit London is March through May when the temperatures are mild and the city's parks are green and blooming. However, late spring – along with summer – is also prime tourist season, and hotel and flight prices reflect the surge. You're more likely to find airfare and accommodation deals in the fall and winter though you'll also encounter chilly temperatures. December in London is also an incredibly popular place to be during the holidays, so expect the streets to be crowded with both English and international tourists. And no matter when you travel, you should pack an umbrella: London is notorious for experiencing misty days and showers year-round. If you have any concerns related to the weather, crowds or other unpredictable factors, you might want to consider an international travel insurance policy or a cancel for any reason plan for more extensive coverage.", "Another thing to keep in mind: it's nearly impossible to escape crowds in London. Along with being one of the biggest cities in Europe, London is one of the most popular destinations to visit in the world, so no matter what time of year you go, you're bound to run into lots of tourists.", "Embrace the slang There are a few British phrases and words that can be confusing to first-time American visitors. Study up on the local lingo to prevent being lost in translation.", "Embrace the pub scene Pubs are a big part of British culture, so it's not uncommon to see them busy throughout the week. Many have been around for centuries, so stopping in for a pint doubles as a history lesson.", "Embrace the guidance of a local There are a variety of tours around the city specializing in everything from ghosts to \"Harry Potter.\" There are also a variety of Stonehenge tours, if you're up for a daytrip.", "Find the free attractions Many of London's top things to do, including the National Gallery, the British Museum and Hyde Park, are absolutely free to enjoy (though tickets may need to booked online in advance in some instances).", "Get an Oyster Card London's subway, otherwise known as \"the Tube\" is the easiest way to get around the city, but can add up quickly if you buy tickets daily. Oyster Card fares are not only cheaper, but will make you feel like a local.", "Dine smart Corridors like Brick Lane offer fantastic ethnic food for bargain prices; fish-and-chip shops are a cheap standby (not to mention a cultural must), and takeaway food costs less than dine-in.", "Consider a London Pass This pass covers entry to many of the city's top attractions, including Westminster Abbey, St. Paul's Cathedral and Hampton Court Palace, for one price.", "Aside from a few select phrases and words, Americans find the city accessible because of London's official English language. British people are very polite and quite friendly to tourists, so don't be afraid to ask for directions if you're lost. More often than not Londoners are happy to point you in the right direction, or even offer a recommendation about their city. But keep in mind that the British like order. There is no better example than how you are expected to behave on the Tube (London's subway). Make sure to stand to the right when going up or down escalators. ", "The other side to the Brits, especially among the young adults, is their penchant for drinking. Unlike coffee shops in the U.S., pubs are the prime watering hole for the Brits. Most pubs serve meals and are open the majority of the day, so don't be alarmed if you see people walking in with young children. Once 5 o'clock rolls around, the hunger for a post-work pick me up is rampant in London, and pubs, as well as bars, tend to fill up throughout the week. Expect to see hordes of people congregating outside pubs in the warmer months and some stumbling out nightly at around 9 p.m. Also, since London is one of the fashion capitals of the world, you'll see locals dressed to the nines throughout the city but especially around Oxford Street, where many fashion houses and publications are located. If you ever wanted to go the extra mile with your style game, London is the place to do it.", "London's official currency is the British pound. Since the pound to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. As for tipping, some restaurants and cafes may add a service charge to the bill, upward of 12%. If a service charge is not allotted, it's customary to tip between 10 and 15%, especially if you're in a restaurant. If you're drinking at a pub or wine bar, tipping is discretionary. And in a cab, tip the driver to the nearest pound or about 10% of the cost. Major credit cards are accepted at most restaurants and shops.", "London used to be highly criticized for its heavy and uninspired menu items. Fish and chips (fried fish, often cod, and french fries). Bangers and mash (sausages and mashed potatoes). Mince meat pies. You get the picture. Now, London is hailed as one of the world's best foodie cities. And with its melting pot of cultures, it's not difficult to see why. London offers everything from modern British to Malaysian cuisine.", "To sample the best of the various cuisines London serves up, you need to know where to go. A food tour can be a great way to get your bearings. For Indian food, visit the curry houses on Brick Lane. If you want an authentic high tea experience, book reservations at The Langham, London, The Lanesborough, The Ritz or at Claridge's – but be sure to dress the part. Typically, smart casual attire is appropriate (think: collard shirts and slacks or dresses). If you're all about fine dining, check out Clerkenwell neighborhood. There you'll find St. JOHN, the restaurant that garnered fame for utilizing the full body of meat in its dishes, coined as \"nose-to-tail\" dining.", "If you're one for celebrity chefs, Gordon Ramsay has a number of restaurants in the city, including the three-Michelin-star-rated Restaurant Gordon Ramsay. If you're looking for something a little quirky, try the three-star Michelin-rated brasserie-style sketch, whose bathrooms are egg pods you step inside instead of traditional stalls. There's also Attendant (a small chain of coffeehouses); its Fitzrovia location is housed in what used to be a Victorian restroom. Don't worry, it's immaculate in more ways than one. London also features great rooftop restaurants as well. For a meal with a side of vistas, head up to Sushi Samba or the Duck & Waffle, which is billed as the highest 24-hour restaurant in the U.K. from its 40th-floor perch.", "Sure, haute cuisine is popular in London, but you shouldn't leave without sampling the traditional foods. Along with the traditional bangers and mash and fish and chips (which some argue taste better in pubs that fancy restaurants), you should make time for a traditional English breakfast and Sunday roast. Both are very hearty and a beloved culinary tradition among the Brits. If you're on the go and don't want to buy a (admittedly pricey) sandwich from Pret A Manger, seek out pasty stands. Pasties are savory pastries typically packed with meat, potatoes or some vegetables. Pasties are filling and affordable and conveniently located in the larger train stations in London, such as Waterloo, King's Cross and Victoria stations.", "If you're interested in getting a taste of British life that doesn't include visiting London's top attractions, it's best to grab a drink at a local pub. Pubs serve much of the same drinks found in American bars, but you must try a cider. There are a variety of flavors and brands available from traditional apple-based ciders like Magners or Strongbow to perry, a fermented drink made from pears. Many pubs also serve meals throughout the day. You're likely to find traditional British dishes for a fraction of the price in pubs than you would in sit-down restaurants.", "London is generally a very safe city; however, travelers should take note of several safety tips. The U.S. State Department advises tourists to only use London's licensed black cabs. Unlicensed cab companies and private cars posing as taxis have been known to rip off, mug, or even sexually assault customers. To be safe, travelers should call the taxi company and hire a car directly (hotels can help arrange transportation as well). Travelers should also be wary of pickpockets, who tend to target tourists on the Tube or at popular attractions. The U.S. State Department also strongly advises visitors not to leave drinks unattended in bars and nightclubs, as there have been reports of robbery and rape after drinks have been spiked with illegal substances. For more information, visit the state department's website. In recent years, London has also been the target of several terrorist attacks, five of which occurred in 2017 alone. According to the U.S. Department of State, terrorist groups continue to plot attacks, so increased vigilance is required. Travelers should stay aware of their surroundings, consider enrolling in the Smart Traveler Enrollment Program to receive security messages and follow local media to stay informed.  ", "The best way to get around London is the rapid-transit London Underground, or what locals call \"the Tube.\" You can even take the Tube from Heathrow Airport (LHR) – one of the world's busiest airports – into the city center. This widespread and efficient system stretches throughout London and beyond, and it is relatively easy to navigate. Buying an Oyster card will further simplify your travel since it can be used on the Underground system, as well as on city buses and other forms of transportation. Visitors should also bring a comfortable pair of walking shoes since meandering is the most atmospheric way to traverse the city. If you need a little guidance on where to wander, consult a local by taking one of London's top tours.", "A valid passport is required for U.S. citizens entering the United Kingdom. No tourist visas are required for visits less than six months. If you're planning to travel to other continental European countries, it is recommended that you have six months remaining validity on your passport. For more information, visit the U.S. State Department's website."]}