{"name": "Raleigh", "description": ["Raleigh is proof that the South will rise again. First, it's a smart city. A handful of colleges and universities are spread out on campuses throughout the Greater Raleigh area. And Raleigh is also part of the Research Triangle, a geographical area that includes Durham and Chapel Hill, and a region that's filled with tech jobs and techie people. ", "Second, it's a cool city. A growing city of about half a million residents, the Greater Raleigh area welcomed more than 13 million visitors in 2013. And it's not too surprising why: Raleigh is flooding with entrepreneurial spirit. You'll see it in the numerous craft breweries that speckle this city in central North Carolina and you'll also find it in the explosion of new restaurants and shops downtown or in the trendy Warehouse district.", "Third, it's an aesthetically pleasing city. Along with the cosmopolitan charms of cool coffee shops and independent businesses, Raleigh contains natural splendor. For proof, visitors should look to the lush landscape of the Neuse River Trail or the wooded beauty of Umstead State Park or any of the green spaces that the city has worked hard to protect.", "The best times to visit Raleigh are in the fall and spring. Both seasons feature comfortable temperatures and beautiful foliage, whether it's the vibrant reds and yellows of the fall or the fragrant and colorful blossoms of the spring. Winter tends to be cold, but the excitement of college basketball might mitigate the chilly weather. And summertime is usually characterized by stifling humidity.", "You might not think it, but Raleigh has a storied history. North Carolina was one of America's 13 original colonies, and it is also the birthplace of the first child born to English parents in the new world. Although at the time, what is now Raleigh was part of the Virginia colony, hence the child's given name, Virginia Dare. Later, in 1792, Raleigh was founded to be North Carolina's seat of government.", "Today, Raleigh's personality stems from its past. The city remains the state capital and center for state politics. And its citizens' can-do spirit of yore is still seen in its thriving local businesses and restaurants.  ", "Raleigh is fast becoming a haven for foodies. And chef Ashley Christensen is one of the reasons why. Helming five establishments, including her latest venture Joule Coffee, Christensen is a name that food-loving tourists will probably come across more than once while traveling the city. If you're hunting for North Carolina-style barbecue, you'll find a cache of restaurants awaits you. Clyde Cooper's is one the best-loved choices. To wash it all down, you might try one (or several) of the area's craft breweries: Sample the Hell Yes Ma'am at the Raleigh Brewing Company or the Rickshaw Rye IPA from Crank Arm Brewing. You might also try and snag a table at the much-acclaimed Stanbury and enjoy a starter and main from their inventive, seasonal menu. ", "The best way to get around Raleigh is by car. Although the city does have a free bus system, a car will give travelers the most freedom to explore when and where they want. Taxis also serve both the city and the suburbs.", "To get to Raleigh, you can take a car, a bus, a train or a plane. Both Amtrak and Greyhound have small stations in close proximity to downtown Raleigh. The closest airport is Raleigh-Durham International Airport (RDU), which is located 15 miles northwest of downtown."]}