{"name": "Galveston", "description": ["Galveston is a barrier island on the Texas Gulf Coast, about 50 miles southeast of Houston. This proximity to a city of about 2.3 million makes it a popular (and busy) spot among Houstonians looking for a sea breeze to cut the heat of summer. It also contains a bustling port for cruisers traveling to Mexico or the Caribbean. (Carnival, Royal Caribbean and Disney all offer cruise sailings from Galveston.) But there's more to Galveston than its beaches and convenient cruise port. Galveston has quite a bit to offer visitors – from its Victorian architecture in the East End Historical District and its interesting shops on The Strand to its lineup of museums and its array of seafood-inspired dining establishments. Galveston is also an affordable and family-friendly vacation spot, thanks to its numerous beaches and water parks.", "The best time to visit Galveston is October to November or March to April when the weather is warm, but not sweltering, and accommodation prices are reasonable. Winter is the best time to score a deal on your accommodations, but it will likely be too chilly to enjoy Galveston's beach activities. The months that span May and September constitute Galveston's long summer season, where lodging rates, tourism and temps are at their peak. ", "It's historic The Port of Galveston was founded in 1825, giving it a rich history that can be viewed in its architecture, such as the Bishop's Palace; museums, such as Moody Mansion; and performing arts theaters, such as The Grand 1894 Opera House. Take time to check them out.", "It's great for families The city features an amusement park (Moody Gardens), a large water park (Schlitterbahn) and a highly recommended children's museum.", "Buy the Galveston Island Pass When you choose four or more participating attractions, such as the Galveston Railroad Museum, the Bryan Museum and Moody Mansion, you will save 40% off the retail price with the pass.", "With its island locale, seafood features heavily into Galveston's dining scene. Some of the most popular spots include Yamato Sushi & Steakhouse (try the sushi), Shrimp N Stuff (order the catfish po'boy), BLVD Seafood (get the tacos or the baked oysters) and Gypsy Joynt (sample one of the tasty specialty burgers). ", "When it comes to watering holes, The Spot with its bloody mary menu is a favorite, as are Brews Brothers, Galveston Island Brewing and the Poop Deck dive bar. If you want a fun foodie souvenir for yourself or friends and family, stop by Maceo Spice & Import Co. to stock up on interesting spices, sauces and teas or La King's Confectionary for some saltwater taffy. ", "The best way to get around Galveston is by car, as it offers the most freedom to reach places of interest on your own time. Galveston's Island Transit bus system is another option for getting around, but visitors will have to supplement their night travel with taxis since the bus halts service in the early evening. ", "Most travelers fly into Houston's George Bush Intercontinental Airport (IAH), which is about 70 miles north, or the William P. Hobby Airport (HOU), about 40 miles northwest, and rent a car to drive the remaining hour or so it takes to reach Galveston Island. Alternatively, visitors can take shuttles, such as the Galveston Express, for $30 to $40 for a one-way trip or $60 to $75 for a round-trip journey. "]}