{"name": "Jackson Hole", "description": ["With Grand Teton and Yellowstone National Parks to the north and millions of acres of additional protected, federally managed public land (like national forests and federal wilderness) in every direction, it's no wonder the Jackson Hole valley is globally renowned for its open spaces, wildlife habitats and abundance of outdoor adventure. Beginning in the late 1800s, the valley’s first homesteaders developed a ranching culture, but the high alpine location wasn't conducive to successful large-scale ranching. In the first decades of the 20th century, many of the ranches supplemented their income by working as dude ranches, where wealthy Easterners could visit for a taste of the outdoors and cowboy culture. In the 1960s, Alex Morley and Paul McCollister developed a plan for Jackson Hole Mountain Resort and built a tram to the top of the 10,450-foot-tall Rendezvous Mountain at the south border of Grand Teton National Park. This brought in a new element of outdoor recreation and tourism money.", "Today, the town is known for its arts scene, music and year-round outdoor opportunities like biking, climbing and wildlife watching. Western Wyoming is no longer an off-the-radar destination, even for tourists seeking a luxury getaway, thanks to its modern amenities like upscale resorts, spas and tour services. Yet, even with its fresh and luxurious upgrade, Jackson Hole remains first and foremost the heart of mountain country, with a vast and pristine wilderness.", "The best time to visit Jackson Hole is in the winter or summer, depending on your goals. In winter, lift-served skiing at Jackson Hole Mountain Resort from December through the first week of April is the main activity. The last two weeks of the season often have the best snow, fewest people and cheapest prices. Guided backcountry skiing can go through May. Summer can be very crowded as hiking and biking opportunities, wildflowers and the national parks draw millions of visitors. Lodging rates are at their most expensive, restaurants are crowded, and camping is limited and highly regulated to protect wildlife and the ecosystem. Yet summer also offers art events and gallery walks, rodeo nights, and outdoor concerts and Native American celebrations.", "Wildlife-viewing is a tremendous draw year-round. In fall, migrating animals can be seen crossing the valley. In winter, some elk, bighorn sheep, native mule deer, coyotes, wolves, bison and moose can be seen on the valley floor. In summer, pronghorn return from their winter ground around 150 miles south of the valley, and much of the wildlife migrates to higher elevations. Come in May and June to see newborn animals, and take care for migrating wildlife on the roads in spring and fall. From April to May and October to November, crowds are lowest, but clouds, rain, snow and cold temperatures are still likely. ", "Is it Jackson Hole or Jackson? It’s both. Jackson Hole refers to the entire valley between the Teton and Gros Ventre mountain ranges, a holdover from 1800s fur trapper lingo when valleys were referred to as holes. Jackson is the county seat and largest town.", "You're not alone here Jackson Hole is within the Greater Yellowstone Ecosystem and is a critical habitat for wildlife, including grizzly bears. Research how to give wildlife space and keep yourself safe. Always carry bear spray in spring, summer and fall.", "Use public transit or drive with caution Heavy snowfall and ice on the roads can occur from late October untill May, making road conditions dangerous. Be on the lookout for wildlife crossing the road all year.", "Visit during the off-season Summer is the busiest season, followed by ski tourism in winter. A visit during April and May or October and November can save money, but the chances of inclement weather will be higher.", "Plan ski trips ahead To alleviate crowding, Jackson Hole Mountain Resort limits daily lift ticket sales. Purchasing tickets online at least 14 days in advance secures your spot and saves you up to 10%.", "Consider a vacation rental If you're traveling with a large family or group, several resort-zoned areas in the valley offer vacation condos and home rentals that can be cheaper than booking several hotel rooms.", "Jackson Hole is home to a vibrant and entrepreneurial culinary scene. With modern steakhouses, Italian alpine cuisine, sushi flown in fresh daily, burger bistros and taco joints, as well as sophisticated fine dining ventures, there is an array of excellent options. Fast-food and chain restaurants do exist but are limited. Local artisanal bakeries, coffee roasters, ice cream makers and brewpubs complete the spectrum.", "The majority of restaurants, both casual and upscale, can be found on or within a few blocks of the Town Square. However, recent visitors did comment on the high prices of prepared foods, from dine-in to pizza to even delis. Along Highway 390, colloquially known as the Village Road, there are a few notable clusters of dining establishments, such as in the Aspens. A variety of options can also be found at the base area of Jackson Hole Mountain Resort, including Piste, an on-mountain fine dining bistro with incredible views about two-thirds of the way up the mountain.", "The best way to get around Jackson during a visit is by car. The Jackson Hole Airport (JAC) is located 9 miles north of town and is within the limits of Grand Teton National Park. It is the only airport in a national park in the U.S. because it existed before the park was expanded to the valley floor. On the drive from the airport to town, you may even see animals like elk, moose and pronghorn among the sagebrush of the valley floor. The airport is serviced by major carriers such as United, Delta and American Airlines. Most flights are via Denver and Salt Lake City. Direct flights operate from 11 other cities with varying schedules throughout the year.", "Two highways run through the area: U.S.Highway 26/89/191 runs from north to south through the town of Jackson, while Route 22 heads westward from Jackson. However, winter driving can be treacherous. Wyoming’s Department of Transportation advises winter visitors to be wary of cold-weather driving conditions; ice and heavy snowfall can make these mountain roads dangerous. Wildlife frequently cross the roads, with increased appearances in spring and fall, dawn and dusk hours, and all winter during very deep snow years. Drive with consideration for wildlife safety as well as your own.", "Part of the National Register of Historic Places, the Moulton Barns in the Mormon Row Historic District was once home to Mormon settlers migrating from Idaho in the 1890s."]}