{"name": "Dubrovnik", "description": ["Ever wanted a gorgeous seaside fortress of your own? Picture it: Huge stone walls keeping the lapping sea at bay, while you dine in the safety of your Baroque palace. You can come close to this fantasy with a visit to Dubrovnik, which is straight out of a dream, or if you are a \"Game of Thrones\" fan, right out of the wildly popular TV series. A UNESCO World Heritage Site since 1979, Dubrovnik is surrounded by gorgeous medieval ramparts that have been preserved in their original form and are one of the city's main attractions.", "Often called the Pearl of the Adriatic, this small city on the Dalmatian coast has it all. Travelers from all over the world flock here to experience the rich history preserved in the monuments and buildings, to taste the fantastic local cuisine, to take a few fun daytrips and to bask in the warm waters spilling onto pebble beaches. Snapshots won't do: You have to be here yourself to see what all the fuss is about. ", "The best time to visit Dubrovnik is September and October, when temperatures aren't stifling hot yet most of the cruise ships have abandoned the port. The water remains warm for these two months, so it's a great time to dip into the sea rather than your savings. The peak season, summer, has arguably the nicest weather with average high temperatures fluttering around 80 degrees Fahrenheit. But the small city struggles to meet the demand of the large visitor influx. Correspondently, prices soar. Prices go down from October through April, but so will the temperatures and the beach appeal. ", "The official language in Croatia is Croatian, but many people in Dubrovnik, especially those in the tourist industry and younger Croatians, speak English. To be polite and friendly, it's a good idea to learn a few basics, such as the common greeting: \"good day,\" dobar dan. Other key phrases include \"please,\" molim and \"thank you,\" hvala. Because of the complex relationship between Croatia and Serbia, it's wise to avoid speaking about Croatia and Serbia relations when chatting with locals. ", "The currency in Dubrovnik is the Croatian kuna (HRK). One U.S. dollar is equal to about 6.75 kuna. Since the exchange rate fluctuates, you'll want to check it before you travel. You can exchange currency at the airport, but you might find a better exchange rate in town. Usually, your best bet is to use your ATM card to withdraw money and it's even better if you have one that doesn't charge fees for withdrawing money overseas.", "When it comes to tipping, there's no standard amount and it isn't required, but generally, most service staff – from restaurant servers to taxi drivers – will appreciate at least a symbolic amount, especially as wages aren't too high in Croatia. Rounding up your bill or leaving a 10% tip on a restaurant bill is considered generous. ", "On the whole, Dubrovnik is considered a very safe vacation destination. But, as in any busy city, be wary of potential pickpockets that might target tourists. ", "Naturally, a city on the sea is going to serve a lot of seafood and the region's chefs love to showcase the fresh catches of the day. Mussels, tuna, squid ink risotto and more are staples at many restaurants. Other local specialties include oysters from Mali Ston (a village on Croatia's coast), smoked ham, cheese soaked in oil, octopus salad, zelena menestra (smoked salted pork and cabbage stew), sporchi macaroni (stewed veal chunks and spices), fried sprats and grilled sardines. The best-known wines of the Dubrovnik region include reds from the Pelješac Peninsula and for whites, Pošip from Korcula. Try them all in a flight at D'vino, a popular wine bar in the Old City.", "For Mediterranean dishes with a side of unforgettable views, consider making a reservation at the Above 5 Rooftop Restaurant at the Hotel Stari Grad. You'll pay a pretty penny for a table, but according to recent visitors, the views and the food are worth it. For an equally atmospheric meal that's heavy on seafood, head to Proto, which sits in the heart of old town. If you're on a tight budget but still itching to try some local seafood, Barba earns rave reviews for its \"gourmet fast food\" (think: octopus burgers). And when you need a break from the Dalmatian diet, consider Azur, which describes its \"CroAsian\" menu as Mediterranean with an Asian twist.", "The best way to get around Dubrovnik is on foot. In fact, the entire historic center is only open to pedestrians. To reach the city, many travelers fly into Dubrovnik Airport (DBV), located less than 15 miles southeast of the city. To get to Dubrovnik from the airport, travelers can rent a car, take a taxi or hop on a shuttle bus, which costs 55 kuna (about $8).", "If you're arriving to Dubrovnik via cruise ship, you can take a taxi from the port to the Old City for about 70 kuna (around $10.50) or reach the area by bus. The main bus station is located at the port. Bus tickets cost between 12 and 15 kuna (about $1.50 to $2.25), depending on if you purchase tickets on the bus or at a kiosk.", "For U.S. citizens entering Croatia, a passport that is valid for at least three months beyond the travel departure date is required. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for more information on entry and exit requirements."]}