{"name": "Serengeti National Park", "description": ["\"There's more to see than can ever be seen, more to do than can ever be done.\" When musicians Elton John and Tim Rice wrote the opening tune to Disney's \"The Lion King,\" they were describing the \"Circle of Life.\" But this lyric serves as a fitting description for world-renowned Serengeti National Park. This magnificent game park sprawls across 5,700 square miles of northern Tanzania in East Africa. When American hunter-turned-conservationist Stewart Edward White first set foot in the Serengeti in 1913, he described the journey: \"We walked for miles over burnt out country. ... Then I saw the green trees of the river, walked two miles more and found myself in paradise.\"", "Within the boundaries of the Serengeti, you'll hear thousands of animals: Hyenas cackle as elephants trample well-worn safari roads and hippos splash in watering holes. And at any given time, more than 2,000 lions are poised to pounce on unsuspecting prey, preparing to chase their unlucky target through the seemingly endless waves of golden grass. The scenery rustles with the swift steps of loping giraffes, and tree branches shake with every monkey's movement. But the most magical site you'll behold is The Great Migration, during which White's paradise is drowned by a sea of animals as more than one million wildebeest, zebras and gazelles traverse the Serengeti in search of greener pastures.", "The best times to visit Serengeti National Park are from January to February or from June through September, although you should plan your trip around the movement of The Great Migration. For example, winter is the best time to see the herd in Southern Serengeti, while the Western Corridor and Northern Serengeti are the best places to spend the summer and autumn months. Most safari operators will have a good idea of where the animals are headed and when, and most will adjust their itineraries based on the herd's movement. Temperatures remain relatively constant with daytime highs resting in the 80s. You'll find cooler weather in the Ngorongoro Conservation Area due to its higher elevation. April and May see the most rainfall, and many lodges and camps close for this slower season.", "Prepare for mosquitos Malaria, a mosquito-borne disease that's endemic in many African countries, is prevalent throughout Tanzania. To protect yourself from mosquitos while in the park, bring anti-malarial medication (which can be prescribed by your doctor), wear pants and long-sleeved shirts at night (when mosquitos tend to be more of a nuisance) and bring insect repellent with DEET (a chemical that makes it harder for mosquitos to smell you).", "Pack accordingly Although most international flights will permit travelers to bring suitcases that weigh up to 50 pounds, shorter domestic flights typically allow 25 to 30 pounds per person. So, if you plan on traveling by plane from Kilimanjaro International Airport – the closest international airport to the park that sits just east of Arusha – to the Serengeti, keep your luggage to less than 30 pounds.", "Ignore the rumble in the jungle Your sleep is bound to be disturbed by the occasional lion roaring, but remember that it probably sounds closer than it is. A lion's roar can reach 114 decibels and travel as far as 5 miles.", "Safari your way through the Serengeti You are welcome to drive yourself through the Serengeti, but opting for a safari will save you from car rental fees and gas prices. Plus, most safaris include lodging, food and transport to and from the airstrip.", "Rough it There are several centrally located lodges in the Serengeti that offer all the amenities of a luxury hotel and great views of the park. However, you'll end up paying a pretty penny for a room, so consider pitching a tent at one of the park's nine campsites to conserve your cash. Just remember to obtain permission from the Tanzania National Parks (or TANAPA) before you arrive.", "Be prepared Once you're in the Serengeti, resources are scarce, meaning basics are at a premium, so pack or buy anything you could need – from extra camera batteries to Band-Aids – before you enter the park.", "The official currency here is the Tanzanian Shilling (TZS). One shilling equals less than one American penny, but check the latest exchange rate before you visit. Both the shilling and the U.S. dollar are generally accepted throughout the park, however, you'll get a better deal if you pay with shillings.", "To enter Serengeti National Park, travelers will be charged $25 each per day visited. If you plan on driving in the park, an additional $5 fee per day applies. Entrance fees are typically covered by safari package and travel agent rates. Once inside, tips of $5 to $10 per day are expected for safari drivers and services received at camps and lodges, while it is common practice to leave 10 percent of your total bill as a tip when dining at a lodge restaurant. ATMs are not readily available in the Serengeti, so be sure to take out money before arriving at the park.", "Tourists may see the Serengeti as a natural playground, but members of the indigenous Masai ethnic group see it as home. The Masai are a semi-nomadic people found in Kenya and northern Tanzania. Their brightly colored clothing and distinctive customs – namely, their unique music and dance and intricate jewelry – make them one of Africa's most well-known ethnic groups.", "You're sure to come across the Masai during your visit. Although their official language is Maa (a Nilo-Saharan language), most members of the Masai ethnic group also speak Swahili and English, Tanzania's official languages. Some Swahili phrases that may come in handy are \"jambo\" (hello), \"asante sana\" (thank you), \"Bei gani?\" (How much?), and \"sielewi\" (I don't understand). Your interaction with the Masai people will most likely be a lucrative one for them, as they are very willing to sell you their jewelry and crafts.", "Safari guides speak English as well, and it's imperative that you follow your guide's instructions at all times. The Serengeti houses many animals, and your guide will know how to best handle (or better avoid) dangerous situations. Stay in your vehicle at all times (unless your guide gives you permission to exit) and never try to feed the animals. And to protect against the region's rays and bugs when wildlife spotting, bring safari essentials like bug spray and sunscreen.", "Restaurants are few and far between in Serengeti National Park, but if you want to enjoy a sit-down meal, you're in luck – several of the park's lodges feature one or more on-site restaurants. Serengeti Serena Safari Lodge, for example, has an eatery that specializes in buffet-style meals with traditional safari and Tanzanian fare, such as locally sourced coffee and tea, nyama choma (grilled meats) and ugali (a maize dish that has a porridge-like consistency). And at the Four Seasons Safari Lodge Serengeti, three dining venues are available, including an outdoor terrace with pizza and African-inspired tapas and an indoor buffet with various African and international dishes. Boma Grill, the property's third restaurant, seats guests around an open-air fire pit as they savor African dishes and watch the Masai perform a traditional dance. Many Serengeti lodges will also offer bush dining experiences, where diners can enjoy a private meal in the wild.", "However, most travelers opt to go on safari (most of which cover all meals in tour rates) or purchase food at one of the park's convenience stores to prepare at a campsite. Safari tour operators that provide meals at a lodge or boxed to enjoy picnic-style include Africa Dream Safaris and Serengeti Select Safaris. Keep in mind that some companies charge an additional fee for soft drinks and alcoholic beverages. For budget-conscious travelers, the park sells drinks, snacks and raw meat for grilling at convenience stores in the Seronera River Valley and Naabi Hill.", "The best way to get around Serengeti National Park is by safari. Safari guides know how to best navigate the park's dirt roads and how to find the most fascinating wildlife. Many safari packages also cover transportation to and from the airstrips, food and lodging. If you prefer to travel on your own, you can rent a car (and even hire a driver) at Kilimanjaro International Airport (JRO), which is located about 190 miles east of the park's main entrance, Naabi Hill Gate. Additionally, all five regions of the Serengeti – Northern Serengeti, the Western Corridor, Eastern Serengeti, Central Serengeti and Southern Serengeti – are accessible by air through several regional carriers and nine internal airstrips.", "To enter Tanzania, U.S. citizens must have a valid passport and visitor's visa. Passports must include at least one blank visa page and be valid for a minimum of six months past your arrival date. Visas cost $100 and can be obtained either before your trip at a Tanzanian consulate or upon arrival at any point of entry staffed by immigration officials. Before traveling to the region, the Centers for Disease Control and Prevention recommends receiving vaccinations for hepatitis A and B, rabies and typhoid on top of regular vaccines like polio and measles. Due to the prevalence of mosquitos in the Serengeti, some doctors may also prescribe anti-malarial medication to take before, during and after your trip. And travelers who do not have direct flights from the U.S. or Europe will need to obtain a yellow fever vaccination and present their proof of vaccination when they arrive. For more information about visas and vaccines, visit the U.S. State Department's website and the CDC's website."]}