{"name": "Seville", "description": ["The passion of a flamenco dancer, the dedication of a bullfighting matador and the laid-back indulgence of an afternoon siesta are not merely romanticized memories of a long-ago Spain. These cultural traditions are prominent aspects of life in Seville and throughout the country's southernmost Andalusia region. A city marked by Jewish, Islamic and Christian influences, Seville shows evidence of each religion's presence in its church facades, minarets and centuries-old neighborhoods. Travelers who appreciate a good dose of history between leisurely strolls along narrow streets and relaxed, drawn-out meals will swoon over Seville's cultural offerings.", "Plan to spend your time in Seville indulging in tapas at a street corner cafe or listening to an impromptu guitarist's tunes in a tree-lined plaza. Though the sunshine and easygoing lifestyle may lure you to relax your days away, be sure to make time for visits to the parks, gardens and palaces that showcase the city's complex history and architectural splendor. If you look closely, you'll spot \"NO8DO\" on city buses, benches, bicycle racks and even manhole covers. A rebus for the Spanish phrase \"no me ha dejado,\" NO8DO translates to \"It (Seville) has not abandoned me.\" In a 13th-century conflict between the ruling King Alfonso X and his son Sancho, the latter besieged the city. Seville’s inhabitants remained loyal to the king, and NO8DO (“She has not abandoned me”) was his way of showing his gratitude to the Sevillanos for their loyalty. The ubiquitous use of the rebus around the city clearly shows how its past is still deeply embedded in its present. Commit that slogan to memory because it's likely you'll adapt this mantra yourself; once you've seen the charms of Seville, your experience will stick with you for quite some time.", "The best time to visit Seville is from March to May. During these spring months the temperatures are mild, the rush of tourist traffic hasn't reached summer volume, and the hotels tend to offer lower rates (except during special events). The only downside? It does tend to rain. If you don't mind a shower or two, you'll be rewarded with a busy event calendar; springtime hosts the city's most notable annual festivals like Semana Santa and Feria de Abril. Summers in Seville are some of the warmest in all of Europe, with temperatures often exceeding 100 degrees Fahrenheit. Locals often flee to the nearby beach towns, making the abundance of city tourists more noticeable. In the fall, temperatures cool off and tourist crowds thin out, but the rain returns. The winter months bring relatively cooler weather (highs rarely dip below 60 degrees) and many Sevillanos spend more time indoors.", "Stick to tapas bars Trade large entrees for traditional small plates (known as tapas) that often cost just a few euros each. It won't take too many to fill you up – two or three dishes should do the trick.", "As the capital of Andalusia, Seville sits as the epicenter of southern Spanish culture – that means you'll find mouthwatering tapas, inspired flamenco dancing and sizable legs of jamón serrano (those cured hams hanging in storefront windows). Another important part of the Andalusian routine is the afternoon siesta – a two- to three-hour span of the day (between 2 and 5 p.m.) when most shops, close their doors to patrons. Sevillanos use this time to relax or take a quick snooze and avoid the heat, affording them more energy for later evenings. Though you may find some places open for business in heavily trafficked tourist areas, you should plan to do your shopping outside of this window.", "Spanish is the national language of Spain, but different regions have slightly different dialects. Sevillanos typically drop letters like \"s\" at the end of words when speaking quickly, so it may be difficult for a novice Spanish speaker to understand much of what the locals are saying. Don't get discouraged! Sevillanos are usually friendly, patient and eager to help you learn. English is widely spoken here, but you should still come to Seville armed with some basic Spanish phrases such as: \"Hable despacio, por favor\" (\"Speak slowly, please\"); \"¿Puede ayudarme?\" (\"Can you help me?\"); and \"¿Cuanto cuesta?\" (\"How much does that cost?\").", "Although religious plurality is part of the city's complex past, Seville today is mostly a Roman Catholic community. During Semana Santa – the Holy Week leading up to Easter Sunday – religious devotion is on display with extravagant processions that include Catholic symbols and prayers. People flock from all over the world to witness the religious exhibition, so be prepared for crowds if you visit during the festival.", "In Seville, you'll need euros to get by – but one of the best parts about this southern Spanish city is that you won't need too many. The cost of food, beverages and entertainment is particularly low compared to other European cities: Some of the best tapas can be enjoyed for just 3 to 5 euros (about $3.25 to $5.50) per plate, while many bars serve cervezas (beer) for just 1.50 euros ($1.60). Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops, and Google Pay and Apple Pay are becoming more widely used. Tipping waitstaff in bars and eateries is not expected, although a tip of 5 to 10% is common in very formal restaurants or when dining in large groups.", "It may seem like you can find tapas – or traditional dishes served in small, shareable portions – in just about every major city these days, but the tapas options in Seville are the tried-and-true originals. Plan to try two or three of these varied small plates per meal. Taste favorites like tortilla de patatas (an egg and potato omelette) or venture for more daring options like rabo de toro (oxtail). Many places will have menus in English, but it will be helpful to learn Spanish words like plancha (grilled) and frito (fried) to make sure you're ordering something suitable for your taste. Regardless of where you dine, you'll likely taste lots olive oil; Andalusia is the top exporter of olive oil in the world, and it's frequently showcased in the region's cuisine.", "Don't forget to save room for dessert: Try arroz con leche (rice pudding), tocino del cielo (egg custard topped with caramel) or tortas de aceite (thin biscuits made with olive oil). And if your guilty pleasures lean more toward booze than sweets, be sure to order a Cruzcampo – the hometown beer brewed right in Seville. Tinto de verano is a blend of red wine, lemon-soda and a twist of lemon that is particularly popular among Sevillanos on the hottest summer days.", "Meal times may come as a surprise to those not accustomed to Andalusian culture. Sevillanos enjoy late lunches that usually start around 1:30 p.m. and flow into the 3 to 5 p.m. siesta time frame. Dinners are also traditionally late (think 9 to 11 p.m.) and nightlife continues into the wee hours of the morning.", "Overall, Seville is a fairly safe city with most crime limited to petty theft. Be sure to stay alert both day and night and keep a close eye on your belongings. Like in most Western countries, the food and water in Seville is safe to consume without taking any extra precautions.", "The best way to get around Seville is on foot. While it is the capital of Spain's Andalusia region, Seville is a rather small city, and most of the major attractions, shops and restaurants are within walking distance of one another. Bicycles are another popular mode of transportation: Seville boasts many bike lanes and a popular bike-share program (Sevici). If the distance seems like too much to cover on foot or two wheels, the city is equipped with comprehensive public transportation options, and taxis are easy to find.", "The closest airport to Seville is the Aeropuerto de Sevilla San Pablo (SVQ), which sits about 6 miles northeast of the city center. The airport offers flights to and from many Spanish cities and to select points around Europe. For 5 euros (about $5.50), you can ride Tussam's EA bus line from the airport to the centrally located Plaza de Armas bus station. High-speed trains operated by Renfe and other companies connect Seville's Estación de Santa Justa (located about a mile northeast of El Centro) to Spanish cities like Madrid, Barcelona, Malaga and Granada. You can also get to Seville by bus (via companies like Socibus and Alsa) from major cities in both Spain and Portugal.", "A passport is required for entry into Spain. The passport must be valid for three months beyond your departure date. Tourists from the United States can stay for up to 90 days without a tourist visa. For more information on entry and exit requirements, visit the U.S. Department of State's website.", "Seville's culture is deeply rooted in long-held customs like flamenco dancing, bullfighting and siestas. Enjoy the quiet of a narrow street in late afternoon when many locals have retreated for a bit of R&R."]}