{"name": "Boston", "description": ["Boston is not only a hub for baseball, brownstones and bookish collegiate types. It's also home to America's first large free municipal public library, the first subway system, the first public school and the first public park. To say the city is historic would be an understatement, but this wicked smart college town doesn't linger in the past, either. A well-rounded trip to Boston integrates the classic with the contemporary: Split your time between cherished sites like the Paul Revere House and Faneuil Hall and modern attractions like the Museum of Fine Arts. Venture to Beacon Hill and you'll stumble upon the graceful mansions of yore juxtaposed with chic boutiques and innovative hotels. So, yes, come first for the history, but don't miss out on the opportunity to see the unmistakable Beantown flair. ", "Despite Boston's rough-and-tumble reputation – garnered thanks to Hollywood appearances in gritty films like \"Black Mass,\" \"American Hustle\" and \"The Town\" – but Boston's cool, cosmopolitan personality characterizes its trendy restaurants, urban parks and modern museums. Passionate residents are still rooting for their beloved Red Sox, but they're also venturing to the Rose Fitzgerald Kennedy Greenway for a free yoga class or meandering to the offbeat SoWa Open Market for some antique shopping. So, grab a stool and join them at their favorite pub to chow down on oyster shooters and New England clam chowder, or venture to Back Bay to sip a coffee as you stroll along the trendy Newbury Street. You'll need more than a few days to experience the city's wealth of offerings.", "The best time to visit Boston is from June to October. Mild autumn weather makes touring around on foot a joy. And even though summer brings in swarms of tourists and expensive hotel rates, the sidewalk cafes, baseball games and outdoor concerts make it worth a trip. Winter is chilly, so pack a warm coat and a pair of boots if you decide to see Beantown sprinkled (or immersed) with snow. Another incentive for wintertime: you might catch a great deal on a hotel. If winter is too cold for you but summer and fall's hotel rates fall outside your budget, try visiting at the start of the spring season.", "No cars allowed Sure, tourists are allowed to drive cars around Boston, but why would you want to? Traffic and narrow roads, along with pricey parking, make driving here a nightmare. Take the \"T\" (Boston's subway) or rely on your own two feet.", "Begin at Boston Common The nearly 3-mile-long Freedom Trail is a must-do for first-time visitors. To make the most of your tour, start at Boston Common, the country's oldest public park and a convenient starting point for exploring the city's notable historical attractions.", "Get a local's perspective It can feel a bit daunting to try and hit all of Boston's top attractions on a short visit. For a crash course in Boston history, food and culture, consider signing up for a tour. We've selected the best tours in the city.", "Go to museums when rates are reduced or free The Museum of Fine Arts offers reduced admission after 3 p.m. every Wednesday (you'll pay $5 per person instead of $25 per person), and the Isabella Stewart Gardner Museum gives complimentary entry year-round to visitors named Isabella. Other sights may feature discounted rates on select days of the week, so look for museum deals and plan your visits accordingly.", "Invest in a CityPASS or Go Boston Card Purchasing a Boston CityPASS or Go Boston Card will save you big bucks on some of the city's top attractions. A CityPASS, which costs $64 for adults and $54 for kids, will save you between $41 and $57 per person, while Go Boston Cards (which are available for one to seven days) start at $76 for adults and $51 for children and include unlimited access around 40 attractions.", "One of the most distinct parts of Boston is what is sometimes referred to as \"Boston English,\" a dialect heard in countless movies and TV shows. The \"r\" sound is often dropped from words, so \"car\" becomes \"cah\" and \"Harvard\" becomes \"Hah-vahd.\"", "Boston is also a well-known sports city; it's the home of the Boston Red Sox (it would be best to avoid wearing any Yankees paraphernalia here), the New England Patriots, the Boston Bruins and the Boston Celtics. While you're in the city, be sure to indulge in this culture by catching a game or taking a tour of Fenway Park. And if you're a college sports fan visiting in February, check out the Beanpot, an annual hockey tournament held at the TD Garden between Boston University, Boston College, Harvard University and Northeastern University.", "Beantown also takes pride in its intellectual and academic roots. Around 100 colleges and universities call the Greater Boston area home, including some of the country's most prestigious. After the American Revolution, the city's leaders were determined to make Boston the world's new cradle of civilization. They invested money and brought in scholars to create a city of educated citizens that studied at Harvard University, Boston University, Boston College, Emerson College, Tufts University and the Massachusetts Institute of Technology, to name a few. Today, this impressive collection of schools also keeps the area young and forward-thinking, as Boston has one of the largest student populations in the country.", "Bostonian cuisine has undergone a gastronomical revolution in recent years, with a steady stream of new chefs putting their own spin on tried-and-true city classics like baked beans, fresh seafood and clam \"chowdah\" along with many innovative chefs moving in different directions entirely. A fun sampling of cuisines can be found at Time Out Market, where several of the city’s top chefs have spots.", "Make sure to check out the North End for delicious Italian dishes and pastries like cannolis and rum cakes. Though most locals are loyal to either Mike's Pastry or Modern Pastry on Hanover Street, both offer top-notch sweets. Large international student bodies at universities like Harvard and MIT mean you'll enjoy everything from French to Moroccan fare in Cambridge. For an authentic tapas meal, make your way to the artsy South End neighborhood. Diners can savor Spanish-inspired bites like croquettes, ceviche and chorizo and potato empanadas at Toro, one of the area's most popular tapas eateries. Another South End favorite is The Butcher Shop, where meat-centric entrees steal the spotlight. Or, for a taste of some of Boston's most inventive sushi entrees, venture to O Ya, where you can experience a 20-course chef’s tasting menu.", "Should you crave more traditional New England fare, dine at historic Warren Tavern, where you can find local favorites like clam chowder, fish and chips and shepherd’s pie.  Another beloved establishment is Union Oyster House near Haymarket, where – you guessed it – freshly-shucked oysters have hooked patrons since the restaurant opened its doors in 1826. For a fun and tasty overview of the Boston dining scene, consider taking a food tour.", "Though it's unlikely that you'll encounter any major crime as a Boston visitor, it's still wise to stay aware of your surroundings, especially if you decide to branch away from tourist areas. Like you would in other large cities, keep track of your belongings and stick to well-lit and crowded streets, particularly at night. And be sure to steer clear of vacant subway cars in the evening and avoid visiting urban parks after dark. It's also a good idea to carry extra cash and the number of a reliable cab company, or download a ride-hailing app on your smartphone, if you plan to enjoy a fun night out on the town. Stay especially alert in areas like Dorchester, Roxbury and Mattapan, where reports of crime are not uncommon. All of these neighborhoods are situated south of Boston proper.", "The best way to get around in Boston is by walking. And when your itinerary takes you out of the city center, the second-best mode is the efficient \"T\" subway system, which includes subways, trains and trolleys along five separate lines. You can easily take the Blue Line from Boston Logan International Airport (BOS) to downtown Boston. Cabs are another option: Boston isn't a huge taxi town, but you can find them at several cabstands throughout the city and lining up outside of major hotels. Ride-hailing apps, such as Uber and Lyft, are also popular options. However, we do not suggest renting a car and driving yourself: Narrow, one-way roads and expensive parking make driving an avoidable hassle."]}