{"name": "Burgundy", "description": ["Imagine rolling hills draped in vineyards that gather into quaint villages, magnificently preserved of their medieval charms, and you'll start to picture Burgundy, a glorious region in central-east France. The crown of this fairy-tale region is Dijon, the capital city, which brims with remembrances of the days when the Dukes of Bourgogne used to reside here. Beaune, a walled village surrounded by vineyards, is completely delightful, too – especially since wine tasting is the village's predominant pastime. But enough can't be said for the numerous châteaux and abbeys, the incredible Morvan Regional Natural Park and the gastronomic appeals of the region.", "The best time to visit Burgundy is between September and November when the weather cools and the vineyards feature an array of autumn colors. Winters in Burgundy are cold and dark (average lows hover in the 30s), though December, January and February tend to be the best times to find deals on flights and accommodations. Spring is another sweet shoulder season, while June to August are considered peak season thanks to the warm, dry weather. Keep in mind: Temperatures can vary widely across the region; you'll want to pack layers if you plan to visit multiple towns.", "Burgundy has a rich history that dates back to the 5th century, when the Burgundians – a Scandinavian people from a southern stretch of the Baltic Sea – settled the region. But it was not until the 9th century that the region really started to flourish, with cities like Dijon on the rise and what would be famous works of art and architecture being produced. ", "The official language in Burgundy is French, and though you'll find that many in the tourist industry speak English, it's best to learn a few phrases or even pick up a phrasebook to help you get around. \"Merci\" is thank you and \"s'il vous plaît\" is please. If you're at a loss for words, politely ask the waiter or shop attendant \"Pouvez-vous m'aider?\" (Can you help me?) or \"Parlez-vous anglais?\" (Do you speak English?). Another helpful phrase: \"Excusez-moi\" (Pardon or excuse me). ", "In France, the currency is the euro (1 euro equals about $1.23), and travelers can exchange their dollars for euros at the airport exchange booths or kiosks throughout Burgundy. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. When it comes to tipping, visitors should note that service charges are usually included on restaurant bills, though it is common to round out the bill with a small tip. Tipping hotel staff a euro or two for their services is also customary.", "Burgundy is known for a number of culinary delights, including its famous Dijon mustard, which mustard-maker Jean Naigeon first created back in the 1750s. Boeuf bourguignon, a traditional Burgundy-style beef stew later popularized by famous chef Julia Child, is another staple. And arguably the world's most pungent cheese, Époisses, hails from a Burgundy city by the same name. ", "Many travelers make Dijon their home base since it provides easy access to the towns and villages that spool out from the region's capital. Some of Dijon's traveler-approved eateries include Les Pré aux Clercs, L'Arôme and La Maison des Cariatides for a fancy French meal, and Café de l'Industrie and Café Gourmand for bistro fare. Of course, no matter where you base yourself, you're bound to stumble upon a memorable gastronomic experience thanks to the region's rich ingredients and Michelin-starred chefs. ", "Of course, Burgundy is also a center for winemaking – and there are tens of thousands of acres devoted to vineyards growing chardonnay and pinot noir grapes across Burgundy's Côte de Beaune, Côte de Nuits, Chablis, Côte Chalonnaise and Mâconnais regions. Driving the historic 37-mile Route des Grand Crus is a great way to get an overview of some of the heavyweights, though taking a curated wine tour is another way. If you consider yourself an oenophile, you'll want to take time in Beaune to visit the Musée du Vin to learn about the region's wine-making tools, tradition and art. Beaune's Marché aux Vins is another must-see if you're looking for a more low-key tasting or tour than a full-day wine tour can provide. Tastings start at 9 euros (around $11) per person.", "The best way to get around Burgundy is by car and train. These quick and efficient modes of transportation will get you where you want to go on your own timetable. There are also networks of buses throughout Burgundy, and taxis are an option, too, though they are far from affordable. Cycling is another increasingly popular and scenic means of traveling between villages or wineries. ", "To reach Burgundy, many travelers fly into Paris' Charles de Gaulle Airport (CDG), Paris Orly Airport (ORY) or Lyon-Saint Exupery Airport (LYS), and either take trains to the Burgundy region or rent a car and drive. Burgundy sits about 200 miles southeast of Paris and about 120 miles north of Lyon. If you're hoping to take the train into the region, you'll find a high frequency of trains running from Paris to Dijon, the region's capital. Trains from Paris to Dijon take approximately 90 minutes, with tickets starting at $18. From Dijon, you can hop local trains to other hot spots within the region, including Mâcon, Beaune and Montbard, among others."]}