{"name": "Warsaw", "description": ["Kraków may be known as Poland's cultural capital, but the country's official capital – Warsaw – is just as appealing to culture hounds. After all, this is the city where iconic figures like Marie Curie and Frédéric Chopin grew up. Following a day spent at a music festival or the Copernicus Science Centre, you can explore the historic Old Town neighborhood. Or, soak up Warsaw's rich (and often dark) past at museums like the Warsaw Uprising Museum and the POLIN Museum of the History of Polish Jews. No matter how you fill your day, you can end it with locally made vodkas or hearty traditional fare (think: meat and potatoes) at one of the city's restaurants, bar mleczny (government-subsidized eateries) or street vendors.", "The best time to visit Warsaw is between June and August. Although these months constitute Warsaw's peak season, summer's pleasant temperatures (which hover in the 50s, 60s and 70s) and ample seasonal activities make up for dealing with larger crowds at attractions. If you're sticking to a tight budget, you'll score discounted rates on rooms and flights between December and February (Warsaw's winter) thanks to the region's chilly 20- to 30-degree weather. March to May and September through November (the city's spring and fall seasons) are also cost-effective times to visit, with May and September providing relatively comfortable temps in the high 40s to high 60s.", "Stay in or near Old Town This central neighborhood (and its adjacent districts) boast several top attractions and feature everything from affordable hostels to five-star properties.", "Restroom customs differ here Public restrooms – such as ones found in metro stations and some cafes – generally cost 1 or 2 Polish zloty (or less than $1) to use. Also, keep in mind the symbols used to designate gender-specific bathrooms: Women's restrooms are marked with circles, while men's facilities have triangles.", "The nightlife scene is growing Poland produces about 40 percent of the European Union's vodka, so it's hardly surprising that Poles like to drink. You'll find watering holes and nightclubs throughout Warsaw, especially in trendy neighborhoods like Praga and Powisle.", "Buy a Warsaw Pass If you plan on visiting multiple sights and using public transportation, consider buying an upgraded Warsaw Pass card. These passes, which cost 105 to 219 Polish zloty (or between $29 and $61) per person, cover one to three days of unlimited rides on Warsaw's metro, trams and buses, as well as entrance fees for attractions like the POLIN Museum of the History of Polish Jews and the Copernicus Science Centre.", "Skip traditional restaurant meals Warsaw's street food vendors and bar mleczny (or milk bars, government-subsidized cafeterias that were popular during Poland's communist era) are some of the city's best spots to enjoy cheap, authentic Polish dishes like pierogies (potato-filled dumplings) and zapiekanki (a pizza-like dish made with a baguette half instead of dough).", "Take advantage of free days at museums Most of Warsaw's must-see museums – including the Warsaw Uprising Museum and the Lazienki Królewskie Museum – offer waived admissions on Thursdays or Sundays.", "Warsaw's occupation by Nazi Germany during World War II is one of the darkest periods in the city's history. Many Polish Jews living in the city at the time died while trying to survive in ghettos and death camps or fighting against their oppressors during the Warsaw Ghetto Uprising of 1943. Their suffering during World War II and their far-reaching cultural impact is commemorated at many of Warsaw's museums and monuments, including the POLIN Museum of the History of Polish Jews and the Warsaw Uprising Museum.", "Although Warsaw's historic attractions and ample museums are the main reasons visitors flock to the city, Poland's capital also boasts a lively nightlife scene, especially in up-and-coming neighborhoods like Powisle and Praga. What's more, famous musicians like Frédéric Chopin and Wladyslaw Szpilman once called Warsaw home, so it's hardly surprising that the city hosts an array of music-focused events, including free outdoor piano concerts at the Lazienki Królewskie Museum and various jazz festivals. Famed scientist Marie Curie and art deco artist Tamara de Lempicka also lived in the capital.", "English is spoken by many Poles, so you shouldn't have any issues communicating with locals. However, Poland's official language is Polish, and learning a few basic words and phrases in Polish – like \"czesc\" (hello), \"prosze\" (please), \"dziekuje\" (thank you) and \"do widzenia\" (goodbye) – will likely come in handy.", "Unlike other members of the European Union, Poland uses the Polish zloty as its official currency (1 Polish zloty is equal to $0.28). But, euros are occasionally accepted as a valid form of payment for select tours and at a limited number of stores. Since the Polish zloty (or euro) to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. And keep in mind Poland's tipping etiquette: Leaving a tip is not customary, but if exceptional service is provided, feel free to tip 10 to 15 percent of your bill.", "Warsaw may not be known as a foodie destination, but its dining scene is arguably the best in Poland. Many of the city's best restaurants – including Stolica, Restauracja Polska Rózana and Soul Kitchen Bistro – feature Polish classics like pierogies (a dumpling-like dish that features a potato stuffing) on their menus. Other must-try dishes include zurek (a sour rye soup that's loaded with hard-boiled eggs and sausage) and bigos (a dish made of fried and stewed cabbage, sauerkraut, mushrooms and meats like bacon and kielbasi, grilled sausages). Modern versions of traditional Polish items, meanwhile, can be found at eateries like the Amber Room Restauracja and N31 restaurant&bar.", "For affordable Polish cuisine, Warsaw's street vendors and bar mleczny (or milk bars, government-subsidized eateries that were commonplace during Poland's communist rule) can't be missed. These casual eateries serve popular items like zapiekanka (a baguette half topped with mushrooms, cheese and ketchup) and fasolka po Bretonsku (a stewed version of baked beans) and are located throughout the city. Popular milk bars include Bar Bambino and Prasowy.", "Warsaw also boasts multiple ethnic restaurants that specialize in everything from French to Israeli cuisine. According to recent travelers, some of the city's best ethnic eateries include Maho Restaurant (which serves Turkish fare), InAzia (a Japanese restaurant) and Mr India (where Indian dishes are on the menu).", "Additionally, Warsaw produces nearly half of the European Union's vodka. Visitors ages 18 and older can sample vodkas at many of the city's bars and restaurants, but for an in-depth look at the spirit, consider signing up for a tasting with local tour operators like XperiencePoland and Eat Polska. XperiencePoland's tasting costs 29 euros (roughly $34) per person and includes eight vodka samples and two Polish snacks. Meanwhile, Eat Polska's tasting is 290 Polish zloty (or about $80.50) per person and features six or seven vodka samples, plus five or six food pairings.", "Poland's crime rate is low overall, but theft and pickpocketing (especially at popular attractions and on public transportation) occasionally occur. As such, travelers should keep an eye on their belongings and surroundings at all times. It is also best to avoid public demonstrations, which are fairly common in Poland and can become violent, and to travel with others at night and in crowded areas like Old Town. For more tips on how to stay safe while visiting Warsaw, check out the U.S. State Department's website.", "The best ways to get around Warsaw are on foot and via public transportation. Many top attractions sit within walking distance of one another, while others are easy to reach by metro, tram or bus. Warsaw's public transportation network – operated by Zarzad Transportu Miejskiego – is extensive, offering approximately 200 bus routes and 30 tram, four train and two metro lines. The easiest way to get to central Warsaw from the airport is to use the S2 or S3 train, but once you're downtown, plan on using the metro or trams. Taxis and ride-hailing services are also available, but are not a cost-effective option for traveling longer distances. You may also opt to rent a car, but Warsaw's streets are not the easiest to navigate and offer limited parking in the city center. To get to Warsaw, travelers fly into Warsaw Chopin Airport (WAW), which is about 5 miles south of central Warsaw.", "Americans can visit Poland for up to 90 days without a visa, but you must have a passport that's valid for at least three months after your departure date (though six months validity is recommended). Additionally, you will be required to show proof of sufficient funds and a return airline ticket when you arrive. Visit the U.S. State Department's website to learn more about entry and exit requirements."]}