{"name": "Antibes", "description": ["Antibes, a much beloved vacation spot of everyone from F. Scott Fitzgerald to the Kennedys, is where the glamorous glitterati go to unwind. On the Mediterranean Sea, about halfway between eastern neighbor Nice and western neighbor Cannes, this resort town is one of the Cote d'Azur's more laid-back cities. The flashy yachting crowd enjoys darting around the waves by day and docking their sleek boats at the port by night. Partiers hit the clubs and casinos in nearby Juan-les-Pins; serious sunbathers, gallery hoppers and boutique shoppers swarm this area too. The sandy (or stony, depending on where you are) beaches, which skirt the cerulean Mediterranean, are another draw. And of course, there are those who just want to get away – so they rent a room in a pine tree-shrouded villa like the stunning Hôtel du Cap-Eden Roc and spend their days sunning and snorkeling on the cape, eating fine French fare come evening.", "The best time to visit Antibes is in the fall for its lovely weather and waning crowds and hotel rates. Winter is the low season: This is your best chance to score a decent room rate (though closures around town may put a damper on your trip). Spring is another delightful season, but it's also increasingly popular among tourists. Summer is jam-packed with vacationing Parisians, who drive the already high hotel rates even higher. ", "It is polite to greet everyone you encounter with a friendly \"good day\" (bonjour) upon arrival, and a \"goodbye\" (au revoir) when leaving. Shaking hands is a common way to greet an acquaintance, while it is common amongst friends to double-kiss (faire un bisous) when saying hello and goodbye. Aside from bisous, the French do not interact physically in the same way Americans do. If you are directly addressing someone you do not know well, do so formally by referring to them as Monsieur or Madame until told otherwise.", "Gratuity is generally included in the bill, but it is customary to round the total up or add an extra 5 percent for extraordinary service. A 10 percent tip is acceptable for maid service at a hotel, as well as for taxi drivers. The official currency in France is the euro, and one euro is equal to approximately $1.14 but the euro to U.S. dollar rate often fluctuates, so check the latest exchange rate before you go. If you find yourself short on euros, almost all restaurants and hotels also accept major credit cards. Though if you're headed to the market, you'll want to have euros on hand.", "Antibes is a safe city, but tourists should be wary of petty crime and pickpockets. Always be aware of your surroundings and keep an eye on your belongings. At night, try not to walk alone and if it's late, take a taxi back to your accommodations.", "Classic Mediterranean fare, heavy on seafood, is standard in the area, but everything from pizza to pasta can be found at Antibes' many cafes and restaurants. In the Old Town, as you stroll the picturesque streets, it's easy to find a charming spot to dine.", "One of the most renowned restaurants in Antibes is the award-winning Bacon, which has been popular for more than 60 years. Another hot spot, with amazing views of the Mediterranean, is Les Vieux Murs, which serves local seasonal food. You can easily make a delightful picnic with selections from the Marché Provençal and head to the beach to enjoy it.", "The best way to get around Antibes is on foot, especially if you plan on sticking close to the city's center. The closest airport to Antibes is the Nice Côte d'Azur International Airport (NCE). It takes about 30 minutes to drive from the airport to Antibes. There are plenty of car rental options and many hotels offer complimentary shuttle service, so make sure to ask. A taxi ride from the airport to Antibes will cost between 60 and 70 euros (about $70 to $80). For a cheaper ride, consider hopping on the Vallauris Express 250 bus from the airport.", "A United States passport with at least three months remaining validity is required for you to leave the mainland and to re-enter the country. You must also have at least one blank page for stamps. Travelers can enter France for up to 90 days without a visa. If you plan to stay longer, you must obtain the proper visa from one of the French consulates in the U.S. prior to departure. For more information concerning entry and exit requirements for France, visit the U.S. State Department's website."]}