{"name": "Sonoma", "description": ["Sonoma, a county in Northern California known for its bucolic charms and array of wineries, could also be described as Napa's rustic, less refined, more relaxed sister. Its rolling hills, which rise into the Sonoma Mountains and descend to the Pacific shore, also contain a cache of small cities that are worth a visit: Try Santa Rosa for an urban escape, complete with museums and buzzy restaurants, but pop by Glen Ellen for a slice of small-town Americana. In short, if you want a laid-back introduction to stellar vintages and gorgeous properties, Sonoma – rather than Napa – should be your California wine country destination. If you're only here for a day, consider signing up for a guided tour. A handful of the best California tours feature daylong excursions in Sonoma.", "The best time to visit Sonoma is between June and October when the weather is at its finest; high temps hover in the mid-80s in June and drop into the upper 70s in the second half of October. Unfortunately, this time of year is also when the crowds are the thickest and hotel rates are at their highest. But the good thing is that wineries are open year-round, with the exception of major holidays. For thinner crowds and lower prices, travelers should book their trips between November and May, or aim for the off-season entirely for bottomed-out costs and wineries all to yourself.", "There's a friendly rivalry Sonoma and Napa have something of a sibling spat going on. In fact, Sonoma locals will playfully refer to their northern neighbor just as \"a four-letter word.\"", "Try a brew, too Sonoma's landscape is a patchwork of vineyards, but breweries are also popular. In fact, the region boasts more than 30 brewpubs and craft breweries.", "No need to drink and drive There are plenty of transportation services between wineries, from luxe limos and buses to the quaint Sonoma Valley Wine Trolley.", "Try the off-season Summertime in Sonoma is lovely, but a winter or shoulder-season visit gets you access to the same great grapes for much lower hotel, transportation and winery prices.", "Although Napa wins the most praise for its fine dining establishments, Sonoma contains an array of delicious eateries. On the whole, these establishments are more rustic in ambiance (and that's just the way locals like them). You'll find concentrations of excellent casual restaurants in Healdsburg, downtown Sonoma, and Geyserville.", "Of course, the region is best-known for its wines – especially its zinfandels at places like Ravenswood. But Sonoma is also known for its dozens of breweries, from Petaluma to downtown Sonoma to Santa Rosa, all the way up to Cloverdale. And if you need a shot of espresso after all of those drinks, visitors suggest Sonoma proper for your choice of quite a few quality coffee shops. Visitors should also sample locally made cheeses, olive oils and honeys, which are found throughout the region in various shops and farmers markets.", "The best way to get around Sonoma is by car. It's the most economical (and the most practical) way to traverse this wide swath of Northern California. Still, to fully enjoy days spent winery hopping, it's best to opt for another mode of transport, such as a bicycle, bus or trolley. To get to the region, travelers can fly into the Charles M. Schulz–Sonoma County Airport (STS). Though this airport is small (Avelo Airlines, American Airlines and Alaska Airlines are the only carriers that service it), it's conveniently less than 10 miles north of Santa Rosa in Sonoma County. Meanwhile, San Francisco International Airport (SFO) and Oakland International Airport (OAK) are each 60 to 65 miles south of the region. Amtrak and Greyhound also operate in and out of the area."]}