{"name": "Honolulu - Oahu", "description": ["Oahu blends cosmopolitan luxury and breathtaking scenery more than any other Hawaiian island. The state's capital city, Honolulu, showcases the island's urban appeal. Nearby you'll find a host of cultural and historic sites, from the ornate Iolani Palace to the austere USS Arizona Memorial at the Pearl Harbor National Memorial. In the nearby Waikiki neighborhood, a skyline of high-rises and resorts contrasts with sprawling white sand beaches. For a taste of rural Hawaii, visit the North Shore. Here, you'll find the most brilliant blue waters and meandering hikes. But those three spots aren't Oahu's only must-see locales. Its top-notch restaurants, vibrant cultural events and wild nightlife further showcase this island as a \"Gathering Place\" of Hawaiian culture.", "The best time to visit Oahu is from mid-April to early June or between September and mid-December. During these shoulder seasons, attractions are less crowded, festivals are plentiful and airfare and room rates are at their lowest. Average temperatures comfortably sit in the mid-60s to high 80s year-round, but rain showers are less prevalent from mid-June to August (Oahu's summer season), so tourists flock to the island to take advantage of the sunnier weather. Another popular (and pricey) time to visit is between late December and early April, when surfers head to the North Shore to catch waves or watch professionals compete in various surfing events. ", "Oahu is filled with culture When vacationing here, you'll have access to everything from impressive collections at the Honolulu Museum of Art to authentic Asian fare in Chinatown to Hawaiian music, dances and more during the annual Aloha Festivals.", "Oahu is best seen from the air and sea For a bird's-eye view of the island, sign up for a helicopter tour and meet its aquatic residents on a snorkeling excursion.", "Splurge to save Staying in a hotel in Waikiki might not seem as economical as the quieter options on the North Shore, but affordable properties are available away from the beach. Plus, staying here will make your commute to must-see sites like Waikiki Beach and Diamond Head State Monument much more manageable.", "Limit your transportation expenses Oahu's top attractions are spread throughout the island, but if you bed down at a hotel with free parking or opt for a one-day car rental, you can quickly reach many of them without breaking the bank. For added savings, rely on ride-hailing or airport shuttle services instead of taxis to get to and from the airport.", "Visit in spring or fall Mid-April to early June and September to mid-December may not be as warm (in summer) or ideal for surfing (in winter), but these off-peak months offer thinned crowds and cheaper room rates than peak season.", "Put down the phone Break the law by looking at a phone, tablet or video game while walking in a crosswalk and you'll likely get fined a minimum of $15. Become a repeat offender and you may owe as much as $99 per citation.", "Oahu is one of the centers of Hawaii's arts and culture scene. The island has a large number of music and dance festivals, including the Honolulu Festival and the Aloha Festivals. You can also find many expressions of Polynesian and indigenous Hawaiian culture throughout the island. Be sure to check out the Bernice Pauahi Bishop Museum in Kalihi for a deeper look into the island's native heritage. Also, consider attending a luau, a traditional Hawaiian feast and cultural performance. For a list of luaus offered on Oahu, check out the Hawaii Tourism Authority website.", "English is widely spoken throughout the islands, but you'll also likely hear traditional Hawaiian words while visiting. Hawaiian Pidgin (or Hawaii Creole English, a blend of Hawaiian, Japanese, Filipino, Chinese and Portuguese) is used as well. Indigenous words you should familiarize yourself with include \"aloha\" (which is used to politely greet someone or end a conversation) and \"mahalo\" (thank you).", "It's also important to regard locals as American citizens instead of \"Hawaiians\" or \"Native Islanders.\" While citizens of Oahu cherish their indigenous ancestry, they also take pride in their American heritage. Additionally, residents of the Hawaiian islands generally have a laid-back attitude. Life is slower on Oahu than in most U.S. cities, so remember that customer service can be inefficient at times.", "Although you'll find many familiar American chains on Oahu, you should sample Hawaiian favorites while on the island. Must-try specialties include shave ice (a cold treat flavored with tropical ingredients like coconut and passion fruit) and poke (or marinated raw seafood). Local dishes like kalua pork (which is traditionally wrapped in banana leaves and cooked underground) and loco moco (white rice topped with a hamburger patty, a fried egg and brown gravy), plus a few Asian-inspired bites – such as beef teriyaki and kalbi (or Korean barbecue short ribs) – are also available at many restaurants as part of a plate lunch or on their own. Plate lunches often come with one or two proteins, rice and macaroni salad.", "Two of the island's most popular places to grab a plate lunch include the Rainbow Drive-In (by Waikiki) and L&L Hawaiian Barbecue (which has multiple locations near the city center). For Hawaiian fare that's not served as a plate lunch, travelers recommend dining at Kono's Restaurant, Ono Seafood and Uncle Bo's Pupu Bar & Grill. More upscale (and pricier) options include celebrity chef outposts like Roy's Waikiki, which is helmed by Roy Yamaguchi.", "Oahu is a relatively safe island, but theft is common in tourist areas like Waikiki and Ala Moana. Keeping an eye on your personal belongings is strongly recommended, and valuables should never be left unattended at the beach or inside vehicles. Also, consider bypassing neighborhoods like Kalihi and downtown's Chinatown area when traveling alone or after dark. And remember, electronic devices like phones, tablets and video games are illegal to use when walking in a crosswalk in Honolulu, so leave these items safely stashed to avoid getting a citation.", "If you plan on visiting Oahu, odds are you'll want to spend the bulk of your time enjoying the island's ample outdoor activities. To protect yourself from the sun while hiking, swimming, surfing and more, wear plenty of sunblock. You'll also want to adhere to warnings about swells and currents at local beaches, especially in winter when tides are generally strong. It is best to stick to beaches that have lifeguards. What's more, the Hawaii Tourism Authority advises against standing on coral reefs and suggests looking for dangerous box jellyfish before entering the ocean. For more information about how to stay safe while on Oahu, visit the Hawaii Tourism Authority's website.", "The best way to get around Oahu is by car. And fortunately, the island has some of Hawaii's most reasonable rates for car rentals, particularly at Daniel K. Inouye International Airport (HNL). Located on Oahu's south shore, the airport is conveniently situated about 5 miles away from downtown Honolulu and Pearl Harbor attractions like the Battleship Missouri Memorial and the World War II Valor in the Pacific National Monument. Walking to some locales (think: Waikiki Beach and Ala Moana Center) is another option when staying in Waikiki. You can also take the public bus system or the Waikiki Trolley to get to and from many parts of the island, but these options are slower and may not service some areas. Taxis and ride-hailing services like Uber and Lyft are available as well, but fares can quickly add up.", "If you're looking for transportation to or from the airport, check with your hotel; many resorts offer shuttle service at a fraction of the cost of a cab."]}