{"name": "Milwaukee", "description": ["Because Milwaukee sits almost 100 miles from the great city of Chicago, you might wonder if Wisconsin's largest city is worth the extra journey north? But it is. Sitting on the banks of mighty Lake Michigan, Milwaukee is picturesque. You'll find that many of its more than 85 miles of bike lanes skirt the scenic waterfront. Plus, the city is into the finer things – craft beer, for instance. And while we're on the topic, did you know that Milwaukee is a major beer-producing city? Miller and Pabst Blue Ribbon both got their start here. So did those epic Harley-Davidson motorcycles, examples of which can be found at the Harley-Davidson Museum. The city also boasts loads of ethnic restaurants, and independent shops will plant permanent smiles on culture hounds' faces. (And, in our opinion, these local shops are better than the sleek storefronts along Chicago's Magnificent Mile any day.) ", "Water surrounds you Sitting alongside Lake Michigan's western shore and at the confluence of three rivers (the Menomonee, the Milwaukee and the Kinnickinnic), this sprawling Wisconsin city begs visitors to embrace its aquatic setting. If you want to blend in with the locals, get out and enjoy the ambience of Milwaukee's RiverWalk or take to the water with a rented kayak or paddleboard.", "Temperatures drastically drop in winter Because of its northern location and proximity to Lake Michigan, Milwaukee's temperatures rapidly plummet come winter. Average temps often dip into the teens and 20s and are made worse by strong winds. If you plan to visit in winter, bundle up with an insulated coat, a reliable pair of gloves and a warm hat.", "It's a foodie city Much like nearby Chicago, this Midwestern city is all about food. And with 38% of its residents claiming German ancestry and almost 13% having ties to Poland, it's no wonder Milwaukee residents have grown fond of traditional European cuisine like sausage, beer and cheese.", "Take the trolley With parking garage fees ranging from a few bucks to more than $20 per day, driving around the city can quickly add up. To avoid excessive transportation fees, ditch the car and opt for a ride on The Hop. This streetcar is free to ride.", "Take advantage of discounted museum tickets Many of Milwaukee's museums like the Milwaukee Public Museum and the Milwaukee Art Museum, offer free visits during specific days of the week or month. Others, like the Harley-Davidson Museum, feature discounted rates on select days. Plan your itinerary accordingly to save some coin.", "Sample the beer A visit to Milwaukee wouldn't be complete without sipping on some top-notch beer. Several of the city's breweries, including Miller and the Lakefront Brewery, offer tours for as little as $10 with several beer samples included.", "From hearty comfort classics to authentic German beers and Polish fare, Milwaukee offers plenty of filling dining options to help you get through notoriously cold Midwestern winters. To start, try a world-famous Usinger's bratwurst on downtown Milwaukee's Old World Third Street. Afterward, wash it down with a cold pint at one of several traditional German restaurants, including Mader's and Old German Beer Hall. To sample a variety of local eateries, consider visiting one of the city's food halls, such as the Milwaukee Public Market or Crossroads Collective.", "And for those looking for classic American fare, there are plenty of eateries specializing in just that. Outside of downtown Milwaukee in the Southgate neighborhood, diners can indulge in a homemade frozen custard and a sloppy joe-style hamburger at Leon's Frozen Custard Drive-In. Should you crave an American-style breakfast (with some Old-World flair), stroll over to Blue's Egg – which sits 6 miles west of downtown Milwaukee. And when you're looking for an upscale twist on American comfort food, slow down and enjoy a seven-course meal at Sanford Restaurant, which features entrees like chargrilled elk loin and citrus seared Alaskan halibut.", "But a visit to the largest city in Wisconsin would not be complete without sampling some of the region's delectable cheeses. Although the state proudly produces nearly 3 billion pounds of cheese (which equates to 25% of America's cheese production) annually, in Milwaukee, it's all about the cheese curds. These tasty morsels can be found at a number of Milwaukee restaurants and cheese shops, including Wisconsin Cheese Mart in Westown and West Allis Cheese and Sausage Shoppe in the Historic Third Ward."]}