{"name": "Glasgow", "description": ["Just a few decades ago, Glasgow was a gray, gritty city of dank pubs and homely slums. However, the same dogged Glaswegians that survived years of deterioration kindled a cultural rejuvenation in the '80s and '90s, fanning the flames of urban renewal throughout the city. Today, Glasgow offers a high-intensity clubbing experience; an exceptionally vibrant art community; a live-music scene, which has discovered the likes of Franz Ferdinand and Snow Patrol; and numerous places to shop that range from the Barras Market and vintage shops to the jewelry at Argyll Arcade and designer stores.", "When visiting, be careful not to criticize Glasgow in favor of its eastern neighbor, Edinburgh. Though it's often depicted as the rough-and-tumble sibling of beautiful Edinburgh, Glasgow has its own pictorial side. Art Nouveau architect Charles Rennie Mackintosh left his mark on many of the buildings. And expansive Kelvingrove Park, the cobblestone Ashton Lane and the soaring Glasgow Cathedral are just a few examples of the city's unique and indeed ambient appeal.", "The best time to visit Glasgow is between March and August, when temperatures reach their peak and daylight hours are long. On the flip side, the winters are characterized by bitter cold and short days. Budget airlines, flying from London Heathrow (LHR) or other major hubs, have made Glasgow travel relatively affordable year-round. But to find deals on hotels, you should book a trip over the weekend when business travelers have returned home. No matter what time of year you visit, you'll likely need an umbrella and rain jacket, as precipitation is prevalent year-round.", "Be careful when discussing your preference of Edinburgh/Glasgow at the expense of Glasgow/Edinburgh, as the rivalry between the cities is very real. Edinburgh may be the capital, but Glasgow has the capital – according to proud Glaswegians, that is. Glasgow can boast of not only its own many things to do, but also of those not far away, such as Stirling Castle and Loch Lomond. ", "Like its United Kingdom neighbors, Scotland pays for its pints – and everything else – with the pound. Since the pound to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "As for tipping at restaurants: A 10% tip is usually added to bills, though you should tip 5 to 10% more depending on the service. Leaving nothing extra is commensurate to saying you were poorly served. ", "If you're on the hunt for traditional Scottish specialties, such as haggis served with neeps and tatties (grated sheep's organs and mashed potatoes and turnips) or cullen skink (a soup made of smoked haddock and potatoes), you'll find it in Glasgow. But if you're hoping to branch out from these classic Scottish dishes, you'll be pleasantly surprised at the scope of Glasgow's dining scene.", "Indian fare now ranks among the city's best cuisine (in fact, Glasgow is often voted Britain's \"curry capital\") and deep-fried everything, especially deep-fried pizza, is another Glaswegian forte. The city is also recognized for its vegetarian and vegan fare – PETA UK named Glasgow the most vegan-friendly city in 2013.", "Alchemilla, Bella Vita, Jodandys, MacTassos, Obsession of India, Ox and Finch, Scran and Wee Lochan are among the buzzy and popular restaurants demonstrating the wide variety of cuisine styles on offer in cosmopolitan Glasgow. The city also has numerous spots that are not exclusively or even primarily restuaruants, but which rank as food destinations, such as Mono (also a music venue and record store) and Drygate Brewery.", "A bit grittier than Edinburgh (its eastern counterpart), Glasgow sees its fair share of crime, but most of it is inflamed by drugs or too much alcohol and amongst local Glaswegians. Visitors should avoid potentially volatile Orange marches, which relate to the centuries-old hostility between Protestants and Catholics.", "The best way to get around Glasgow is by foot. Many of the best things to do are located in the city center, and the grid layout makes it very easy to navigate. But several attractions are located on the outskirts, necessitating the use of the public transportation system or a car. Black taxis are also available, and you can hail these on the streets or find them in taxi ranks (or lines) throughout the city center. ", "If you took a plane into Glasgow International Airport (GLA), you can take a train, bus, taxi or rental car the 10 miles into the city center. The easiest way to reach the city center via public transporation is the Glasgow Airport Express service 500 bus, which takes 15 minutes. Tickets cost 8.50 pounds (or about $11) for adults and 4.50 pounds (around $6) for kids.", "You'll need a valid passport to travel to the United Kingdom and to return to the United States. If you're planning to travel on to other countries, your passport may require six months of remaining validity. Note that U.S. citizens do not need a visa unless they plan on staying longer than six months. Visit the U.S. State Department's website for the latest information on the U.K.'s foreign exit and entry requirements."]}