{"name": "Seattle", "description": ["Seattle's laid-back attitude and diverse neighborhoods more than make up for its consistently cloudy weather. Plus, it's home to some of the country's best coffee and a thriving arts scene, plenty of history, culture and – when the weather permits – some exciting outdoor activities. Surrounded by water (and resting between Puget Sound and Lake Washington), the city's favorite outdoor pursuits include kayaking, hiking, camping and whale watching. Not only that, but the nearby Olympic Mountains and the giant Mount Rainier are visible from many spots in the city; ski slopes are just a short drive away. And while travelers often bemoan the weather, there's actually less annual precipitation here than in New York or Boston. Overcast skies rarely stop Seattleites from getting out and exploring the city – and it shouldn't stop you either.", "If you're headed to the Emerald City and not up for strenuous outdoor activities, Seattle still offers plenty to do and see. Art lovers will appreciate the glass-blown pieces at Chihuly Garden and Glass as well as the works on display at the Seattle Art Museum. Maritime enthusiasts can explore Ballard Locks and watch the ships putter by. Several of Seattle's best boat tours even offer an inside look at how the locks operate. Make time to switch gears from boats to brews on a visit here, too. The city boasts dozens of craft breweries and food markets. ", "The best time to visit Seattle is from September to October. Summer marks the city's high season, meaning room rates rise and availability drops, while cold winter weather can deter even the most avid sightseers. Early fall, however, is a sweet spot for tourism: Summer weather lingers as the crowds disperse, leaving plenty of hotel rooms (and lower rates) up for grabs. Meanwhile, spring offers lower lodging rates as well as warmer temps, but you'll likely encounter some rain and cooler breezes. Just remember to pack the appropriate attire to battle chilly winds and yes, the seemingly ever-present drizzle.", "Spare some change Seattle's streets are lined with up-and-coming performers singing for their supper (or just to be heard). Spare some change for the ones that grab your attention.", "Check out the Seattle Weekly This digital publication spotlights special events and performances around the city. It'll come in handy when planning a night on the town.", "Take advantage of the freebies A handful of Seattle's top attractions do not charge admission fees, including Ballard Locks, Olympic Sculpture Park and Discovery Park. Plus, if you time your visit right, you can enjoy free admission at the Museum of Flight and the Seattle Art Museum on the first Thursday evening of every month.", "As one of the Best Foodie Destinations in the country, Seattle restaurants dole out tasty local fare that's often infused with flavors from across the world. Its Pacific Northwest location (surrounded by several bodies of water) allows easy access to fresh seafood like salmon, clams and shellfish. Other Pacific Northwest specialties you'll likely see on the menu or complementing dishes include game meats like moose, caribou and elk, wild mushrooms and fresh berry jams. The city is also home to a large Asian influence that can be seen in everything from sushi to salad. But rest assured, cuisine comes in all forms in this city.", "Meanwhile, Seattle offers a lively beer culture. You can find a cluster of some of the best local breweries just west of Woodland Park Zoo. Closer to downtown, visitors can check out Pike Brewing Company and Cloudburst Brewing Company. And everyone agrees a stop for some grub (or groceries) at the famous Pike Place Market is a must for any visit to Seattle. If you'd like a little help navigating the market, consider signing up for a foodie tour.", "Seattle is a large metropolitan area, so abide by all the precautions you would normally follow in a major city. The University District and Broadway can attract the homeless, and those areas are sometimes intimidating for travelers. In general, tourist areas are routinely patrolled by police and remain safe at night.", "The best way to get around Seattle is by car, especially if you want to explore outside the city. However, be prepared for heavy traffic during rush hour and high prices for parking around downtown and at your hotel, where nightly parking rates can cost as much as $50. You can rent a car at the Seattle-Tacoma International Airport (SEA), which is located about 13 miles south of downtown, but you can avoid a steep rental surcharge if you grab a taxi or the Link light rail into the city and wait to pick up your car until you're in town. Expect to pay between $40 and $55 for a taxi ride into downtown from the airport. If you're only in Seattle for a day or two, consider relying on public transportation. In this case, it may make the most sense to purchase an ORCA card, a reloadable transit pass that allows for unlimited rides on all local public transit, excluding the monorail and ferries."]}