{"name": "Havana, Cuba", "description": ["Cuba is full of life, and Havana is its center stage. Come rain or shine, hardship or prosperity, Havana is always beaming with buoyancy. Whether it's the luminous pastel-colored buildings that dot the centuries-old plazas of Old Havana, the fleet of vintage American cars cruising down its streets or the exuberant locals eager to offer you a cafe or dance, Havana's spirit is contagious and untamable. And with diplomatic ties undergoing historic renovations – some of the country's longstanding socialist policies are falling by the wayside – Habaneros are ready to show the world what they're capable of. Modern paladares, or privately owned restaurants, are opening left and right, cruise ships are docking and dilapidated landmarks are being cleaned up. Once pitied as a city stuck in time, Havana is finally on its way to tomorrow.", "Politics aside, the best way to experience the life and style of Havana is to do as the Cubans do. Start each morning with a cafe Cubano or two, dine alfresco in one of Old Havana's historic plazas, get your feet wet at El Malecón, then dance with the crowds after the sun sets. Seek out mojitos, rum and fun under the sun in Playas de Este, and once you've gotten your fill of the local flavor, acquaint yourself with the country's greats at the Museum of Fine Arts. Don't forget to say goodbye to Hemingway's hideaway on your way out.", "The best time to visit Cuba is between January and February. The island's location in the Caribbean affords warm temperatures year-round, with the average lows in Havana dipping to 65 degrees. Because of its location, there are really only two seasons in Havana: wet and dry. The dry season runs through \"winter\" in Cuba, (November to April) while the wet season (May to October) overlaps with hurricane season, making the likelihood of precipitation very high. But hurricanes in Cuba aren't common and if a storm of any kind were to strike, it would likely happen during August or September. Festivals of all kinds occur year-round. If you want to see Havana at its most colorful, visit in August during Carnival. If you want to see the city at its most political, attend the International Workers' Day at Revolution Square in Havana in May, where a speech is made by the president annually.", "Brush up on your Spanish Some top attractions, including the city's biggest museums, lack exhibits or signs with English translations. Know that the farther you venture away from Old Havana, the less English you're going to encounter.", "One country, two currencies There are two official currencies in Cuba: the Cuban peso (CUP) and the Cuban convertible peso (CUC). Cuban convertible pesos are roughly equivalent to the U.S. dollar and mostly used by visiting tourists.", "Bring cash Some major U.S. credit cards are accepted in Cuba, such as MasterCard and American Express, but if yours isn't, you'll have to bring enough cash to last your entire trip. Keep in mind there is a 10 percent fee to exchange U.S. currency for Cuban currency.", "Don't insult Castro Speech insulting or offending public officials is against the law. Times are definitely changing, but it's best to keep your opinions to yourself.", "Eat off the beaten path Old Havana is undoubtedly the tourist area of the city, and likely the priciest. Venture to the nearby Vedado and Central Havana neighborhoods for discounted meals.", "Stay with locals Cubans can now rent out their rooms or homes (known as casas particulares) to visitors, and their rates are most likely lower than those charged at state-run hotels.", "Although Cuba has faced corrupt leaders and strict regimes throughout the course of its history, Cuban people are as vibrant as they come. Much like the attractive architecture that line the streets of Havana, Cuban culture is both colorful and diverse, with previous occupants coming ashore from Africa, Spain, England and Asia, and other islands in the Caribbean.", "Even though the country's socialist administration is slowly becoming more relaxed, Cubans are still behind on the times compared to the Western world. As of 2015, only 5 percent of Cubans have access to the internet at home, and before 2008, Cubans were not allowed to own computers. In 2013, Cubans were granted permission to sell and purchase new and used cars – the first time since the 1959 revolution. And prior to 2014, restaurants in Cuba were run entirely by the state. Along with North Korea, Coca-Cola cannot be bought or sold in Cuba thanks to a U.S. trade embargo.", "Clearly, Cuba still has some catching up to do, so be patient during your travels. Unfortunately, getting in touch with folks back home isn't as easy as picking up a phone in your hotel room. If you're a Verizon customer, you can make calls, send texts and use data services with an International Travel plan. There are also Wi-Fi hot spots around the city, but service is contingent on how many people are using it, which is usually a lot.", "Getting souvenirs in Cuba can be a bit of a headache, too. In 2015, MasterCard and American Express announced plans to allow use on the island. But credit cards aren't widely accepted yet, especially outside tourist areas. Call your bank before you depart to see if your card is compatible. If not, you'll have to withdraw enough cash in advance to sustain yourself throughout the duration of your stay. It's important to note that Americans can bring back up to $400 of souvenirs and $100 worth of cigars.", "Cuba has two currencies: the Cuban peso (CUP) and the Cuban convertible peso (CUC). The difference between the two is that Cubans are paid and trade in Cuban pesos, while Cuban convertible pesos are dealt to tourists. Not only that, but convertible pesos are worth 25 times more than the Cuban peso. As a result, not all shops and restaurants are created equal if you're a tourist. If you venture outside of Havana, there is a likelihood that businesses won't be able to accept your convertible pesos. Although both currencies are legal across the country, Cubans may not have convertible pesos on hand for change. There's currently a 10 percent tax on United States dollars, so it's best to order other currencies, such as British pounds, euros or Canadian dollars to get a better deal.", "Although there are no required vaccines to visit Cuba, the Centers for Disease Control and Prevention strongly recommends that travelers are updated on their routine vaccines and consider getting a hepatitis A and a typhoid shot for their trip. Both of these illnesses can be contracted through contaminated food and water, which is a likely occurrence in a developing country such as Cuba. Tourists should also drink only bottled water (even when brushing their teeth). For more information, visit the CDC's website.", "The food scene in Cuba is unlike few others in the world, but not in the way you might think. Yes, there are staple dishes and notable places to eat and drink, but like much of the country, food is heavily socialized. Cuba has a tricky history with trade relations and, as a result, food must be rationed. As a visitor, your food won't be rationed, but try not to get disgruntled if meals listed on restaurant menus aren't available. And considering the average Cuban only makes 471 pesos (about $20) per month and is typically rationed five eggs during that same time period, don't be surprised if you find locals staring at you for not finishing your meal.", "Moros y Cristianos, or congris, may be a phrase you hear at restaurants or see on menus, and no, it doesn't mean its literal translation (Moors and Christians). It's actually a combination of black beans and rice served with your choice of meat. Stews made with shredded beef and vegetables (ropa vieja) are also a popular dish to make in the home, as is suckling pig. Fried plantains are a must-try snack, along with Cuban coffee. Cuban coffee is espresso mixed with sugar while brewing. It is so strong that it is served in tiny cups, so don't expect to find anything resembling a Frappuccino here.", "There are two types of restaurants: state-run restaurants and paladares, or private establishments. State-run restaurants primarily cater to Cubans and hold a reputation for offering less than stellar food and service. Paladares, on the other hand, are privately owned eateries housed in residences that tend to offer better food and service. Popular paladares include the French-themed Le Chansonnier, San Cristóbal, which serves Cuban-Creole fusion food, and Atelier. Another iconic eatery lauded by both travel experts and visitors is La Guarida, which was featured in the Oscar-nominated Cuban film, \"Fresa y chocolate\" (\"Strawberry and Chocolate\"). The former movie set became so popular that its owner turned it into a restaurant.", "As the inventor of the mojito and the daiquiri, not to mention world-class rum purveyors, Cuba – especially Havana – thrives come nighttime. If you're a Hemingway fan, stop by El Floridita, home to the writer's favorite daiquiri. If you want more than just a bar, try Fabrica de Arte Cubano, which features multiple bars and has space for an art gallery, a dance club and a concert hall. For strictly dancing, hit up La Casa de la Música in Centro Habana (there are two locations in Havana – stick to the central one). Tropicana is a name that might come up in your research, too. It's not a club, but rather a historic Las Vegas-style cabaret show. No matter what path you choose, make sure to end your night at El Malecón.  ", "The best way to get around Havana is on foot. Many of Havana's most popular attractions, including Habana Vieja, El Malecón and Museo de la Revolución, are less than a mile away from each other. Taxis are both plentiful and a great means of transportation, and one tourists will likely be unable to resist. Those vintage American automobiles you've likely seen in pictures and videos of Havana are actually taxis, and open to tourists to use. Local buses are best left to those fluent in Spanish and although hitchhiking is a perfectly legal and a popular means of getting around the island for Cubans, travel experts strongly advise leaving that to the locals. The best way to get from José Martí International Airport (HAV) to the city's center (Old Havana – located about 15 miles north) is by taxi, which can be found outside the airport terminal.", "There are direct flights from the U.S. to Cuba. Alaska Airlines, Delta, Frontier, Southwest, Spirit and United fly to Havana, though most of the cities that service Havana flights are in Florida.  At present, only one American cruise line, Carnival, is authorized to conduct cruises to Cuba under the people-to-people travel category. And of all Carnival's cruise ships, Fathom is the only one allowed to sail to Cuba, departing from Miami. Royal Caribbean Cruises and Norwegian Cruise Line Holdings, including its three brands Norwegian, Oceania Cruises and Regent Seven Seas Cruises, have recently gotten approval from the Cuban government to conduct cruises from the USA, with itineraries scheduled to start running in April and May 2017.", "At this time, U.S. citizens are not allowed to travel as tourists to Cuba by law. However, there are exceptions. There are currently 12 categories of travel that U.S. citizens must qualify for to obtain permission by the U.S. government to visit Cuba, including educational activities, humanitarian projects and people-to-people travel – the most common type of visa attained by Americans.", "For those authorized, travelers must have a valid U.S. passport and may be required to obtain a visa from the Cuban government. For more information on exit and entry requirements, visit the State Department's website. "]}