{"name": "Adelaide", "description": ["Although its location away from Australia's east coast may make it easy to overlook, Adelaide's plethora of restaurants, bars, festivals and attractions more than justify a visit. This South Australia city is situated along the south coast near Barossa and McLaren Vale, where the country's world-renowned shiraz is made. And at the opening of the adjacent Gulf Saint Vincent, you'll find Kangaroo Island, a strip of land known for its prime wildlife-spotting and picture-perfect surroundings.", "If you don't have the time or means to venture outside the city, don't fret: You'll have plenty to see and do in the heart of Adelaide. Nature lovers will appreciate Adelaide Botanic Garden and the Adelaide Zoo, while foodies can sample cheeses, baked goods and more at the Adelaide Central Market. Meanwhile, shopaholics will enjoy browsing the stores found at Rundle Mall. And those in search of culture should head straight to the Art Gallery of South Australia and the South Australian Museum.", "The best time to visit Adelaide is from March to May and September through November, during the city's fall and spring. During these shoulder seasons, rainfall is rare and daytime temperatures sit in the 60s and 70s. You'll also avoid the crowds and higher prices associated with the area's peak season, which coincides with the summer holidays and Adelaide's festival season. (Note: March, the beginning of Adelaide's autumn, is best avoided if you're hoping to score a deal, since several top events take place at this time.) June to August, the Southern Hemisphere's winter, is a great time to visit if you're on a budget, but you'll encounter Adelaide's coldest temps and increased chances for rain.", "Despite its reputation as a posh city, Adelaide's residents are far from unfriendly, so don't hesitate to ask for directions or strike up a conversation. Additionally, Adelaide boasts a plethora of art- and culture-focused attractions and events, such as the South Australian Museum, OzAsia Festival, Adelaide Fringe and the Art Gallery of South Australia.", "English is the official language in Adelaide and throughout Australia. However, Aussie English features many words and phrases that are not used in the U.S. – like \"g'day\" (hello), \"reckon\" (for sure) and \"ripper\" (great) – so brush up on your Aussie slang before arriving. Also, expect the occasional sarcastic or frank remark. Aussies are known for their dry sense of humor.", "When driving, remember that Aussies drive on the left side of the road. This means pedestrians should always look right, then left and then right again before crossing the street. What's more, Aussies use the metric system when calculating distances, so road signs will be in kilometers and speed signs in kilometers per hour. One kilometer equals a little more than a half-mile. If you hail a taxi, keep in mind Australia's tipping policy. It is not customary to tip cab drivers or restaurant staff unless you receive exceptional service.", "All Australian cities, including Adelaide, use the Australian dollar (which is roughly equal to $0.77). Since currency rates fluctuate, be sure to check the latest exchange rate before you visit.", "Adelaide boasts a diverse dining scene, with everything from casual cafes and pubs to eateries serving Indian, Italian and Thai cuisine. Many of the city's top restaurants – including Andrè's Cucina and Georges on Waymouth – feature Italian or European flavors on their menus. But in Chinatown Adelaide, expect to find the best of Adelaide's Asian offerings. Popular Chinatown eateries include Concubine and Star of Siam.", "Australian dishes are served as well at restaurants like Restaurant Orana, press* food & wine and peel st. Must-try items include pie floaters (meat-filled pastries set atop thickened pea soup) and AB (French fries topped with gyro meat and tomato, barbecue and garlic sauces), both of which are best enjoyed with a pint of beer. Local seafood like oysters, king prawns and King George whiting (a white fish that's often beer-battered and fried) are also commonly found on restaurant menus. For something a little sweeter, try a Kitchener bun (a doughnut-like treat split and filled with fruit jam and whipped cream), buy some homemade chocolates at Haigh's Chocolates or grab a bag of FruChocs (chocolate-covered fruit candies) at a local grocery store. Foodies will also enjoy wandering through the rows of stands found at the Adelaide Central Market.", "If you are of legal drinking age (which is 18 in Australia), you should plan to sample some regional wines while in Adelaide. Considered the wine capital of Australia, Adelaide's surrounding wine regions produce a variety of reds and whites, though shiraz is the highlight of well-known areas like Barossa and McLaren Vale. Should you lack the time or means to venture to the area's vineyards, pay a visit to the National Wine Centre of Australia, Australia's largest tasting room. It sits less than 2 miles northeast of the city center near Adelaide Botanic Garden.", "The best ways to get around Adelaide are on foot and by bus or tram. Walking is ideal for short distances in the central business district, while the free bus and tram services provided by Adelaide Metro – the city's bus, tram and train network – are convenient options for longer trips between downtown locales. What's more, Adelaide's JetExpress bus offers an affordable way to get to and from Adelaide Airport (ADL), but keep in mind it offers limited weekday operating hours. Trains are ideal for commutes to suburban areas, and top attractions situated outside the city center are best reached by car. Taxis and Uber are also available, however, both can be pricey.", "All American visitors entering Australia must have a valid U.S. passport and a tourist visa. For travelers staying less than 90 days, an Electronic Travel Authority (an electronic, label-free visa found on the Australian Government Department of Immigration and Border Protection's website) is required. Some airline and travel agents can apply for an Electronic Travel Authority on your behalf. To learn more about Australian entry and exit requirements, visit the U.S. State Department's website."]}