{"name": "Argentine Patagonia", "description": ["This region in the Andes mountains is nothing if not enchanting. Cobalt lakes, azure-tinted glaciers, emerald trees, and turquoise skies stretch as far as the eye can see. In fact, Argentine Patagonia's vistas are so sweeping that Charles Darwin once described the region as \"boundless.\" Visit Argentina's Lake District and you'll discover villages brushing against snowy mountain peaks. Travel east and you'll find whales gliding through Peninsula Valdés' marine wildlife sanctuary. Venture to Southern Patagonia, and you'll stumble upon deserts extending into rugged estancias (cattle-ranges) and melting glaciers. And, if you continue downward to the Chilean border at Cape Horn, you'll come across an expansive horizon reaching out to Antarctica's frosty edge. Patagonia's beauty knows no bounds.", "But don't let the frontier's vastness fool you: Argentine Patagonia's rapidly developing infrastructure grants visitors easy access to all major attractions. Rustic roads lead to dramatic natural wonders like Perito Moreno Glacier and Mount Fitz Roy. Look around this beautiful landscape and discover a region buzzing with life. Magellanic penguins and albatross mingle in the Punta Tombo wildlife reserve, while history survives on the walls of the Cave of the Hands.", "The best times to visit Argentine Patagonia are October through November (springtime in the southern hemisphere) and December through February (summertime). During these months, the weather is mild, and spectators can view natural attractions in their full splendor. You should make your spring and summer travel arrangements far in advance since visitors flock to Argentina for the optimal hiking conditions. Pack layers to combat Patagonia's heavy winds (especially if you're planning a visit to Southern Patagonia). January and February draw the largest crowds, but October, March and April are also good times for sightseeing, boasting sunshine and temperatures in the 40s, 50s and 60s.", "Argentine Patagonia's recent development has spiked the region's popularity with tourists. Still, Argentine Patagonia has a long way to go before it can compete with other South American hot spots like Buenos Aires and Rio de Janeiro.", "Argentine Patagonia houses an eclectic mix of cultures. In the 19th century, British settlers arrived and shared the land with indigenous tribes, like the Tehuelche and the Mapuche. Today, their descendants do the same. Under the Lake District's snowy mountains, quaint towns are pockets of classic and folk music. In Atlantic Patagonia's more urban and Welsh-infused setting, traditional tea time persists as a part of daily life. And in Southern Patagonia, you'll find an assortment of tourists and locals savoring the fresh air, aquamarine lakes, and towering mountains.", "Although the official language is Spanish, popular lakeside cities welcome thousands of English-speaking tourists each year. Hotels in these locales can connect American and European visitors with English-speaking guides. Travelers note some local tour guides are difficult to understand, so learn a few Spanish phrases. When it comes time to compensate your guide, the official currency is the Argentine peso (ARS). The peso is weak compared to the U.S. dollar: 1 ARS amounts to approximately $0.25 USD.", "Seafood is a staple ingredient in Patagonian cuisine, but not all the food is fishy. Sink your teeth into some parillas (authentic BBQ) and sip some of the delectable wines fermented in Neuquen, a popular province located in Patagonia's Lake District. The cuisine has been influenced by the European palate; tea houses, chocolatiers, and pastry shops thrive here. Patagonians prefer to eat late, so you will find restaurants do not start serving dinner until at least 8 p.m. But most locales will dine closer to 10 p.m. Most restaurants add a small seating fee per person, and as far as tipping goes, 10 percent is considered polite.", "The best ways to get around Argentine Patagonia are by car or plane due to the region's large size. Argentine Patagonia is divided into three regions: the Lake District, Atlantic Patagonia, and Southern Patagonia. You can traverse all three regions by car, but you'll find yourself spending a lot of time on the road. Unless you plan on staying longer than a week, you'll probably have to choose only one or two of these areas to explore. To save time, consider flying between regions. With several airports in all three districts, you can easily hop between cities. Buses are another reliable way to get around.", "To reach Patagonia, you'll want to fly through Buenos Aires Ezeiza International Airport (EZE) and then take a hopper flight to your desired Patagonian city. Alternatively, you could fly into Punta Arenas Airport (PUQ), Chilean Patagonia's main airport, and cross the border into El Calafate in Southern Patagonia. You can also rent a car or take a bus from Buenos Aires to Argentine Patagonia, but this will require at least one additional day of travel.", "A valid passport is required for entry into Argentina, and tourists from the United States can stay for up to 90 days without a visa. Those arriving into Buenos Aires' Ezeiza International Airport (EZE) or Jorge Newbery Airport (AEP) with tourist passports are required to pay a $609 ARS (roughly $140 USD) reciprocity fee upon arrival. For more information on entry and exit requirements, visit the U.S. State Department's website."]}