{"name": "Canary Islands", "description": ["You'd be right in comparing Spain's Canary Islands to a tropical paradise. Located in the North Atlantic Ocean off the southwest coast of Morocco, all seven islands in this archipelago flaunt enviable strips of shoreline that roll out into aquamarine waters. Surfers, windsurfers, scuba divers and sunbathers all flock to different shores to revel in the gnarly waves, vibrant underwater world and soft sands. And if you're visiting some of the bigger islands — namely Gran Canaria, Tenerife and Lanzarote — you'll find the requisite plush resorts. These luxury accommodations boast gourmet restaurants, sprawling golf courses and prime beach access.", "But we'd argue that the Canaries are as much about the four natural parks as they are about beaches and resorts. Take the Parque Nacional del Teide on the island of Tenerife, for instance: It contains the globe's third-largest volcano — and visitors can hike it. Lanzarote houses Timanfaya National Park, where travelers can take camel rides across the almost lunar-looking terrain. Upon discovering this combination of beautiful beaches, luxurious accommodations and out-of-this-world natural parks, you're sure to feel like the cat that swallowed the canary.", "The best times to visit the Canary Islands are between March and May and from September to November. Winter and summer bring loads of tourists, which make accommodations more expensive and more difficult to find. Meanwhile, in spring and fall, the Canaries continue to enjoy the same pleasant weather as the peak seasons, only without the tourist crowds.", "The carnival The Canaries' version of Carnival is second only to Rio de Janiero's. If you're visiting in February, book your hotel several months in advance.", "Stay put The costs for inter-island planes and ferries can add up. Instead of island-hopping, save some coin by soaking in all of the charms of just one island rather than skimming the surface of them all.", "Book early and in a city Most of the budget hotels can be found in the island's big cities like Santa Cruz de Tenerife, Las Palmas and Arrecife. Book your accommodations a few months in advance to secure your spot.", "Even though they're located hundreds of miles from the Iberian Peninsula — and about 70 miles from the northwest coast of Africa — the Canaries are a part of Spain. Residents of the Canary Islands think of themselves as Spanish citizens, just as much as those who live in Madrid.", "The Canaries use the Spanish currency of the euro (€1 EUR). Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops. When it comes to tipping, the Canary Islands also follow Spain suit. While tipping isn't compulsory, the service industry does appreciate it. Rounding up to the nearest euro in a taxi and leaving anywhere from 7 to 13 percent at a restaurant should be sufficient.", "Locals in the Canaries speak Spanish, but you'll find that their accents sound more South American than Spanish. And on the island of La Gomera, some of the locals still speak their native language, Silbo. The deep whistle sound of the Silbo language supposedly carried quite a long way across the island, so natives could communicate from a distance.", "Carnival is a big deal here, as are religious pilgrimages and parades that pay homage to different saints. The parades, known as Romeria, usually end up at a church or religious structure.", "You'll find every cuisine imaginable on Tenerife and Gran Canaria. But if you want try one of the islands' culinary specialties, you should order parrot fish or sea bream, which are usually poached and served with hot sauce and fresh veggies. Sea salted potatoes served with a spicy pepper sauce are another common accompaniment to the main course.", "Many restaurants on Fuerteventura serve up local goat cheese called majorero. And if you find yourself on Lanzarote, you should also sample some wine — the region's grapes are grown in volcanic ash, and labels like Los Bermejos have received high praise from wine experts.  ", "Sunburn is the most likely risk you'll encounter when traveling to the Canaries. Make sure to slather on the sunscreen and hydrate with water, whether you're at the beach or in a national park. You should also guard yourself against the possibility of petty theft, especially in popular tourist areas, by concealing your valuables on your person or even storing them in a hotel safe. Do not bring any valuables to the beach, or if you do, make sure someone is attending them at all times.", "The best ways to get around the Canary Islands are by car and by plane. Although there are bus systems available on all the islands, most don't run frequently enough to be useful to tourists. And the islands' attractions are far too spread out to see completely on foot. A car will enable you to get where you want to go quickly and efficiently. When you want to island hop, a plane is a reliable and efficient way to get around. If you'd rather get around by boat, several companies also offer inter-island ferry services.", "Although all seven islands have airports, the busiest airports are Tenerife South Airport (TFS), Tenerife North Airport (TFN) and Gran Canaria Airport (LPA). At the moment, however, there are no direct flights from the U.S. to the Canary Islands. To reach the islands, you'll have to first make a pit stop at a European airport like Madrid. When it comes to ground transportation, all of the airports offer some combination of taxis, car rental agencies and buses.", "You'll need a U.S. passport that will be valid for a minimum of three months after you return from the Canary Islands. Visit the U.S. State Department's website for the latest information on entry and exit requirements."]}