{"name": "Oaxaca", "description": ["Oaxaca – pronounced wa-HAH-ka – is both the name of this Mexican state and its capital city. Here, you'll find colonial streets lined with shade trees, vibrant markets filled with artisans and mouthwatering aromas drifting from market food stalls and trendy eateries. These days, many claim that Oaxaca is Mexico's newest culinary capital. But that's not to say the city has forgotten its rich history, which dates back to the ancient Zapotecs that once occupied the now preserved ruins at Monte Albán. In fact, many of the handicrafts and recipes, which make Oaxaca such a unique place to visit and shop, have been carried down from generation to generation. ", "There are also abundant opportunities for daytrip excursions – and a host of reliable tour operators to guide you – if you want to stretch your legs for a hike and dip in the mineral baths at Hierve el Agua or wander the agave fields at a Mitla mezcal distillery. ", "The best times to visit Oaxaca are during the months of April to May and September to October. Both spring and fall are characterized by moderate temperatures and fewer tourists. The months between June and August, as well as the holiday season between mid-December and early-January, constitute high season. For the most part, the winter months – November to March – are considered low season, except for the few weeks that fall across the winter holidays. ", "Head up to go north The city slants downward from north to south as you approach the Zócalo, so if you're ever disoriented, heading uphill will take you north.", "Bargain shop If you speak Spanish, talk to the Mexican traders about paying a few less pesos on wares like rugs, ceramics, alebrijes (wooden carvings) and silver jewelry.", "Nosh in the markets Buying some of your meals in the open-air markets, such as Mercado Benito Juarez, will cut down on costs, but make sure that you wash any produce with bottled water to avoid stomach woes.", "What was once home to the thriving Mixtec and Zapotec civilizations is now a thrumming culinary capital with a strong hipster vibe. Its main industry is tourism. ", "Oaxaca's official currency is the peso: 1 peso is equal to roughly 5 cents. Since the Mexican peso to U.S. dollar exchange rate fluctuates, plan to check the conversion rate before you go. You should also keep in mind that not all businesses and restaurants take credit cards, so be sure to check in advance. And when it comes to tipping in \"the land of the seven moles,\" keep in mind that 10 to 15 percent in restaurants and hotels is a good rule of thumb. ", "Spanish is the official language spoken in Oaxaca. As long as you know a few key phrases, such as buenos dias (good morning), por favor (please) and gracias (thank you), you should be able to get around this tourist-friendly city just fine. ", "Oaxaca is considered one of the safest states in Mexico, but as with any big city, it does experience petty crimes. Tourists can keep pickpockets at bay by keeping money tucked away and securely out of sight. ", "Oaxaca has several specialties that no visitor should miss, but a word to the wise: a strong stomach is required. One of those specialties is a chili-based sauce, called mole. In fact, Oaxaca is nicknamed \"The Land of the Seven Moles\" for the many different types of sauce produced here, which can range in color, from black to yellow; in ingredients, from chocolate to almonds; and in heat level, from mild to super spicy. Another Oaxacan specialty is mezcal, which is a spirit similar to tequila, served in a glass rimmed with a concoction of spices and ground worms and lime wedges. ", "And when it comes to a full meal in this foodie capital, travelers say you really can't go wrong. The market stalls are just as delicious as the formal establishments. For breakfast, try Café Casa Oaxaca located on Calle Jazmines, a little more than 2 miles from the Zócalo. A stone's throw from the Templo de Santo Domingo is Oaxacan celebrity chef Alejandro Ruiz's Casa Oaxaca el Restaurante. To sample moles, head to Las Quince Letras, which is just a couple blocks from the Templo de Santo Domingo on Calle Abasolo. And for some cheap-yet-delicious street foods, look no further than Itanoni Flor del Maiz located on a quick taxi ride from central Oaxaca on Avenue Belisario Dominguez.", "The best way to get around Oaxaca is on foot, especially if you're sticking to the tourist areas in downtown Oaxaca. To travel farther afield, buses or taxis are fairly affordable ways of getting around, though keep in mind that they're not known for efficiency. A rental car will give you the flexibility to travel on your own time, yet might not be the best option for someone unfamiliar to the area and the road rules.", "The closest airport is Aeropuerto Internacional de Oaxaca (OAX), which is located about 5 miles south of Oaxaca City. You can reach the city by taxi, bus or rental car. "]}