{"name": "New Orleans", "description": ["New Orleans is known for its European-style architecture, mouthwatering Creole cuisine and all-around good-time vibes. Considered the birthplace of jazz, the city oozes music from every crevice, whether it's blues, rock 'n' roll or zydeco. Music plays a key role in the backbone and spirit of New Orleans. While most people travel to the Southern city for Mardi Gras, a Carnival-type event that features masks, music, floats and merriment, that's not the only party New Orleans hosts. Travelers will find plenty of events and festivals to attend year-round. ", "Post-Hurricane Katrina, the city has had its share of environmental disasters, such as the BP oil spill and Hurricane Isaac, which made the rebuilding of New Orleans challenging, but the city has persevered. Over the past several years, major efforts have been made to restore the distinct districts. Today, Crescent City looks almost as good as new. Start your visit with a walking tour through the French Quarter, where colonial heritage and ghost lore still survive. From here, you can explore the major architectural sites before enjoying a hearty plate of jambalaya and a rowdy evening out. When it's time to turn in for the night, bed down at one of the city's charming bed-and-breakfasts.", "The city is also home to a bustling port. In fact, New Orleans is the sixth-largest cruise port in the U.S. Cruisers can travel to Mexico, the Caribbean or along the Mississppi River to Memphis, Tennessee, on a river cruise. (Carnival, Norweigan, Disney and Viking all offer sailings from New Orleans.)", "The best time to visit New Orleans is from February to May when the weather is comfortably cool and the celebrations are in full swing. If you're not interested in Mardi Gras mania, plan to visit in December or January, when the city is calm and you don't have to worry about making hotel reservations a year in advance. To save on room rates, travel in the summer or fall. Just note that these seasons are known for their stifling heat and humidity, not to mention the threat of hurricanes – making travel insurance a worthy investment for those traveling to New Orleans during this time.", "Avoid Bourbon Street hotels Because this is the epicenter of New Orleans nightlife, there's really no escaping the late-night noise. Unless you're planning to join the party, find a different location to hang your hat.", "Be careful at night Residents are known for their Southern hospitality, but the city itself has a high crime rate. Like in any city, avoid walking alone at night, especially if you're unfamiliar with your surroundings.", "Watch what you eat New Orleans is famous for its rich cuisine, but that combined with hot, humid weather can cause you to feel nauseated. When it comes to dining and snacking, pace yourself.", "Consider a tour For a local's perspective of the city, book a tour. Whether you're looking for a food tour, a swamp tour, a cemetery tour, a ghost tour or a plantation tour, you'll find a variety of experiences to choose from. New Orleans is also a good jumping off point for some the best Louisiana swamp tours.", "Don't stay in the French Quarter As charming as they may be, these hotels are expensive. If you don't want to sacrifice location for price, stay in one of the many bed-and-breakfast accommodations in Faubourg Marigny.", "Check the calendar Hotel rates tend to skyrocket during major events. If you want to save money, reserve a room several months early to ensure the best price, or visit during a break in the festivities.", "Like those who live in other Southern cities, New Orleanians are very friendly. You most likely won't leave this city without having been called \"baby\" at least once in the slow, melodic accent only found here. Likewise, don't be afraid to ask for directions.", "However, many people from New Orleans do not associate themselves with the South, but rather with an identity unlike any other found in the United States. Influenced by numerous cultures – including French, African and Cuban – New Orleans displays a wide variety of tastes and habits. From spicy jambalaya to feisty beats, Voodoo traditions to one of the most renowned Carnivals in the world, New Orleans has a very strong and unique sense of self.", "This city especially exudes the essence of both Cajun and Creole customs. And although they are often referred to interchangeably, the two cultures shouldn't be confused with one another. Today's Cajuns are descendants of the people from the French settlement of Acadia, which was established in the 17th century in Nova Scotia, Canada. Almost 100 years after Acadia was established, it became a British territory and many of its citizens were forced to either renounce Catholicism or swear loyalty to the British Crown or leave. Some inhabitants returned to France, but others headed south to the Caribbean before settling in the French colony of New Orleans. They brought with them traditions from Acadia and the Caribbean, as well as spices, music and their own language known as Cajun French. Cajun French is not a dialect of the French language, but rather a verbal organism of its own.", "The term \"Creole,\" however, refers to people who were born within a Caribbean New World colony, not in Spain or France. Like Cajuns, many Creoles were not originally from New Orleans, but rather from French territories, the West Indies, Central and South America, and the Gulf States region. Creole culture is also heavily influenced by Caribbean traditions, often making it difficult for outsiders to distinguish between Cajun and Creole customs. Creoles also speak their own version of French, which is a combination of French and African dialects, known as Creole French.", "Music is a major part of life in New Orleans, just as it is in the Caribbean. Jazz – which originated in New Orleans around the turn of the 20th century – was the first Creole music style to become nationally renowned. Its far-reaching history is celebrated every year during the New Orleans Jazz & Heritage Festival and Satchmo Summerfest. Zydeco music also originated in the area within the Cajun communities and is now performed widely today in English, Cajun and Creole French (catch a wide range of performances during the annual Louisiana Cajun-Zydeco Festival). Music has infiltrated many different parts of life in this city, including funerals. A New Orleans jazz funeral represents the fact that music is as much a part of death as it is of life.", "Live music can be heard all over the city, but if you're looking to escape the tourist crowds and enjoy a more authentic experience, stray from Bourbon Street and head to one of the many cafes or bars in the Faubourg Marigny district. Speaking of bars, many in New Orleans have no set closing time, and open container laws are lax at best – staying true to the city motto \"Laissez les bon temps rouler\" or \"Let the good times roll.\" But just because this is a city that promotes celebration does not mean that you should be disrespectful.", "New Orleans is the place to forget about your diet and enjoy the rich trifecta of butter, cream and oil. While traditional Southern flavors abound here, New Orleans is most famous for its unique Creole and Cajun cuisines, which feature a combination of French, Spanish, Italian and African cooking elements. Restaurants featuring traditional New Orleans dishes, such as red beans and rice and po'boys – a sub usually filled with meat or fried seafood – can be found throughout the city. Both Cajun and Creole jambalaya (a rice dish made with meat, vegetables and Creole spices) and gumbo (a hearty stew consisting of meat or seafood and vegetables) are also staple entrees on many New Orleans menus. When you're craving something sweet, you'll find that the Big Easy has you covered there, too. Beignets – square pieces of fried dough smothered in powdered sugar – can be found at the one of the city's most famous coffee shops (and a tourist attraction in its own right), Cafe du Monde.", "Many famous chefs – including Emeril Lagasse, Leah Chase and Susan Spicer – own and operate restaurants in the city. The French Quarter is home to numerous Creole restaurants (Li'l Dizzy's Cafe is a perennial favorite), as well as several authentic (but somewhat pricey) French restaurants. According to recent travelers,  Commander's Palace, Bayona, Galatoire's and August are all eateries worth splurging on. Other popular eateries are clustered in the Central Business and Warehouse districts. If you want to mingle with New Orleans residents, dine at the budget-friendly restaurants in Mid-city or Uptown. For a comprehensive sampling of all of the city's mouth-watering cuisine, consider booking a food tour or visiting during one of the Big Easy's food festivals, such as the New Orleans Wine & Food Experience, the Oak Street Po-Boy Festival, the Louisiana Crawfish Festival or COOLinary New Orleans.", "Although New Orleans has come a long way since Hurricane Katrina, several of the city's less central neighborhoods have not yet received the attention they need. Streets farther away from the more tourist-friendly areas suffer from poor lighting and may be unsuitable to visit on foot after dark. When returning to your hotel later in the evening, rely on cabs to avoid getting lost in a strange area. As in any big city, use common sense.", "If you're joining in on the Mardi Gras festivities, make sure to keep a close eye on your valuables, since the streets are generally very crowded. Or better yet, leave your wallets and purses at your accommodation. Instead, just grab some cash and a form of ID and carry them in your front pocket.", "The best ways to get around New Orleans are on foot and by public transportation. The city's neighborhoods are very compact, making them perfect for strolling sightseers. If you don't feel like walking, hop on one of the famous streetcars. Another option is cycling. Since New Orleans is flat, it's easy to get around by bike. You can rent a bike from several companies. Taxis are also available, but you can expect to pay $36 to get from the airport into the Central Business District and the French Quarter. Uber and Lyft are also widely available.", "To get into the city from the Louis Armstrong New Orleans International Airport (MSY) – located about 15 miles west of downtown New Orleans – you can take the Airport Shuttle for $24 per person one way or $44 per person round trip. The shuttle services the downtown and uptown districts as well as the French Quarter. Taxis are also available, but you can expect to pay at least $36 to get from the airport into the Central Business District and the French Quarter. Uber and Lyft are also widely available."]}