{"name": "Prague", "description": ["A prosperous and bustling city, Prague now attracts more tourists than ever. But its picturesque downtown veils both a dark legacy and a resilient past. Dating back to about A.D. 870, Prague has withstood numerous overthrows, invasions, fires and floods. It's this reputation for survival and perseverance that has made the Czech capital so fascinating. Today, its storied churches, narrow streets, daunting hilltop castle and statue-lined bridges create the scene of an urban fairy tale. Even the most jaded traveler would have trouble resisting this city's charms.", "Prague was once a hidden gem, overshadowed by its flashier neighbors to the west. But the city couldn't keep its marvels a secret for too long – now, it's a haven for travelers seeking awe-inspiring experiences at affordable prices. Even today, top attractions – including the famous Charles Bridge and the historic Prague Castle – offer free admission and many hotels offer rooms at a fraction of the cost of other European cities. But this bargain-hunting legacy has a ticking clock on it, so if you're hoping to find a fire-sale price, now's the time to do so.", "The best times to visit Prague are the spring and early fall when the weather is mild and there are fewer crowds. Because of the city's generally chilly climate, the warmer summer months (average high temperatures hover in the low to mid-70s) see the largest influx of tourists – which means higher hotel rates. The spring and early fall, however, offer clear skies, highs ranging from the mid-50s to the upper 60s and much lower room rates. Prague also shines during the festive Christmas season but be warned that the city sees a fair amount of snow and highs don't rise above the mid-30s. ", "Don't forget your dictionary You can find some English-speakers around the more popular tourist districts, but having a Czech dictionary or phrasebook will likely come in handy.", "Stick to the ATM Many businesses will change your U.S. dollars to koruna, Czechia's currency, but you may face fees of up to 10%. Avoid the hassle by using a credit card or withdrawing money from an ATM.", "Keep a watch on your wallet Although Prague is a very safe city for its size, pickpockets are known to hover around tourist hot spots like the Charles Bridge. It's a good idea to carry your valuables in your front pocket or in a bag that can be securely closed.", "Summer somewhere else Warm, sunny weather draws thousands of tourists. And as the number of visitors rises, so do hotel prices. Plan to visit during the cooler months.", "Dodge cabs Unfortunately, the city's taxi drivers have a reputation for overcharging and dishonesty. Although there are a few reputable taxi companies, use public transportation to get around as much as you can.", "Book a tour Guided tours can help you discover the city through the eyes of a local. What's more, many of them are free. We rounded up the 16 Best Prague Tours here.", "Czechia is a Parliamentary Republic that was established in 1993 following the Cold War. But Prague and the Czech state have been important centers of business, government and commerce for centuries. Czech citizens are known for being more formal and reserved than some other European cultures yet friendly, too. In many Prague bars and restaurants, groups can share tables if there is room, even if they don't know each other. After eating, be sure to place your fork and knife side by side on your plate if you want the waiter to take your plate away.", "Czechia uses the koruna and major credit cards are accepted at most establishments throughout Prague. Since the koruna to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Tipping 10 to 15 percent is common practice for good service, but be mindful to hand it directly to your server instead of leaving it on the table. Like many European destinations, local Prague citizens respond kindly to travelers who try the local Czech language, so buy a phrase book before traveling. Some helpful phases, such as \"thank you\" (Dekuji), \"excuse me\" (S dovolením) and even \"do you speak English?\" (Mluvíte anglicky?), will come in handy. ", "Czech cuisine isn't as well-known or sought after as some of its European neighbors, but that doesn't make it any less delicious. In its more than 1,100-year history, the country's fare has been influenced by nearby countries like Germany, Austria and Poland. Typical meals consist of meat – and lots of it – alongside gravy and knedlíky (bread dumplings). This configuration makes up one of the quintessential Czech dishes, svícková, which also includes a vegetable cream sauce, whipped cream and cranberry sauce. You'll also find hearty dishes, such as bramboráky (potato pancakes), which are a popular street food found in neighboring countries. Those with a sweet tooth can find unique Czech dishes like ovocné knedlíky (fresh fruit dumplings topped with curd cheese) and perníky (gingerbread cookies) as well. For a comprehensive overview of the city's dining scene, sign up for a food tour.", "But where Prague culture really shines is its beer. Czechia has frequently been named the top beer-consuming country in the world and for good reason – its beer is top-notch. After all, Pilsners were invented only 60 miles southeast in Pilsen. As such, pub culture is very important. Be mindful that once you start ordering, the drinks will keep coming until you ask your server to stop or to bring the check. As a last resort, place your coaster over your glass.", "Because Prague welcomes hordes of travelers each year, beware of tourist trap restaurants that offer watered-down versions of authentic dishes. Some establishments, such as U Medvídku and Pivovarský Klub, offer traditional dishes along with lots of local beer in bottles and on tap. For even more ambiance, you can have a meal on the outdoor terrace of Mlýnec, which offers one-of-a-kind views of the Charles Bridge. If you're after a more gourmet experience, the Michelin-starred La Degustation Boheme Bourgeoise is sure to satisfy. ", "Prague is generally considered a safe city, especially for one of its size. The main danger to be aware of is pickpockets, who hover around the tourist hot spots like the Astronomical Clock and Charles Bridge. Also, keep an eye out for them when using mass transit. Some taxi drivers have been known to overcharge tourists. Phone for a taxi or go to an authorized taxi stand (they are marked with red and yellow signs) to reduce your chances of being swindled.", "The best way to get around Prague is on foot or by public transportation. Exploring this city on foot is a treat for the eyes, plus many of the most noteworthy attractions are within walking distance of one another. What's more, several of the city's top guided tours are walking tours. There is an extensive public transportation system that includes bus, tram and subway lines.", "To get into the city from the Václav Havel Airport Prague (PRG), you can take the No. 119 bus to Nádraží Veleslavín metro station on the green line (line A) to the city center. You could also spring for a taxi, which will cost you about 450 to 560 koruna (about $20 to $25) to the city center, but be aware that many taxis have a reputation for overcharging. ", "According to the U.S. State Department, American citizens may enter Czechia for up to 90 days without a visa. A valid passport with at least two blank pages and up to six months remaining validity is required for entry and exit. For more information, visit the U.S. State Department's website."]}