{"name": "Jerusalem", "description": ["Jerusalem is suspended between many different crosshairs. First and foremost, it serves as the Holy City for the three primary western religions: Christianity, Judaism, and Islam. The narrow streets and alleyways that make up the labyrinth-like Old City reverberate with the sounds of spirituality. Whispered Hebrew prayers uttered by tefillin-clad Jews at the Western Wall mingle with the hauntingly beautiful Muslim call-to-prayer sounding from Temple Mount. The voices from the Jewish and Muslim quarters are then accompanied by melodic bells sounding from the Christian Church of the Holy Sepulchre. For many visitors, the rumor of a constant Almighty presence suddenly becomes very real; even the most adamant non-believer will find it hard to deny that there's something ethereal about Jerusalem.", "While the image of ancient Jerusalem—a city still ruled by King David and his followers—is what most travelers expect, you'll find instead a destination in flux. Beyond the historic walls of the Old City lies a buzzing metropolis where traditional lifestyles collide with cosmopolitan developments. West Jerusalem is littered with trendy restaurants and bars, while East Jerusalem resonates with the cries of market vendors. The city's diverse offerings have transformed Jerusalem from a pilgrimage spot to a well-rounded vacation destination. So whatever your reason for visiting, you can be sure that this is a city you’ll never forget.", "The best times to visit Jerusalem are April through May and October through November, when the weather is mild and the crowds are thin. However, make sure to cross-check your travel dates with major Jewish celebrations such as the High Holy Days, Sukkot, and Passover. A strong surge of visitor traffic drives hotel prices up during these holidays. Summer is Jerusalem's peak tourism season, despite sweltering daytime temps. Winters boast good deals on hotels, but the weather remains fickle: One day can be sunny and fairly warm, while the next can be rainy and chilly.", "Jerusalem acts as the Holy City by the three major Abrahamic religions: Christianity, Judaism, and Islam. This mingling of spirituality has led to a mélange of culture. For example, you’ll hear a multi-lingual soundtrack on a stroll through the Old City; Hebrew and Arabic are the dominant languages, but you'll also catch whispers of Yiddish and other languages. Many Israelis, especially those working in the food and hospitality industries, also speak English.", "Many Jerusalem residents still fervently following guidelines listed in their bible. You will witness some of these customs during your visit. For example, Jews and Muslims do not eat pork; therefore, if you get a craving for ham and cheese, you'll be out of luck. Many restaurants throughout Jerusalem, particularly in Jewish neighborhoods, maintain a kosher menu, meaning they observe strict religious rules about food consumption and preparation. But chances are that you won't give this a second thought as you thumb through a menu. Also, many businesses (especially in the Old City) close during the weekend to honor the various sabbaths. Jewish establishments close their doors on Friday afternoon and don't open again until Saturday night or Sunday morning. Many Christian businesses are closed on Sundays. All of these businesses—no matter their affiliation—accept Shekels (ILS), Israel's official currency.", "You'll also encounter a variety of clothing styles, from the heavy black attire and wide-brimmed hats worn of Haredi Jews to the lighter, more casual tunics sported of Arab merchants. Keep in mind you should dress more conservatively in Jerusalem. Avoid wearing anything too revealing, especially if you plan to visit the city's religious sites. Note that the ultra-Orthodox neighborhood of Me'a She'arim (just northwest of the Old City) requires extremely conservative attire, such as long sleeves, ankle-length skirts, and covered heads, as well as very modest behavior.", "In the decades of the Israeli-Palestinian conflict, contention over the city’s ownership has resulted in violent outbursts, most notably riots. That said, visitors should not feel threatened, as these incidents usually do not take place in tourist areas. You will likely come across a large number of Israeli soldiers, but don't let that alarm you: Many of these soldiers are tourists, just like you. You may also encounter armed guards performing security screenings at the Old City gates at night.", "The best ways to get around Jerusalem are on foot or by taxi. Many of the city's top attractions are within walking distance of one another inside or just beyond the Old City walls. When you're looking to expand your stomping grounds, taxis are extremely convenient (albeit a little pricey). The transportation company, Egged, provides public bus service within the city and many points around the country. Egged also services Ben Gurion International Airport (TLV), about 38 miles northwest of Jerusalem on the outskirts of Tel Aviv. However, the bus system isn't intuitive for foreign visitors. Travelers usually will have better luck with the new light rail system, which opened in 2011.", "The Israeli government does not require your passport to be valid for at least six months after your arrival, but many airlines do. You will also need to show a return or onward ticket and sufficient proof of funds to enter the country. Expect heightened security screenings at the airport; the Israeli government has been known to deny travelers entry based on background checks. The government will also deny entry to anyone looking to travel to the West Bank or Gaza. You can learn more by visiting the U.S. State Department website."]}