{"name": "Biloxi", "description": ["Perfectly placed to catch a cool breeze from the Gulf Coast, Biloxi, Mississippi, is the playground of the South. Glittering casinos line Beach Boulevard, calling out to your inner gambler; the white sands of Ship Island lure families; and historic sites, such as Beauvoir, beckon to Civil War enthusiasts. The city was hit hard by Hurricane Katrina in 2005 (a related memorial was even constructed), but the Biloxian spirit is resilient, and many local businesses, restaurants and casinos have reopened. So, take a deep breath of that magnolia-sweetened air and saddle up to the card table, Biloxi is ready to play. ", "The best time to visit Biloxi is from November to April, when the city's room rates are affordable and the weather cools off. The city's peak tourist season – May to mid-August – sees highs in just about everything: average temperatures peak around 90 degrees, humidity levels climb to about 75% and hotels inflate their prices to profit off of burgeoning crowds. The city becomes a ghost town starting in late August and continuing into September and October, when hurricanes can wreak havoc on the city.", "It gets H-O-T This Gulf Coast destination gets very humid, especially during the summer. Drink lots of water, and try to stay out of the afternoon sun.  ", "Try the seafood Ignoring the local cuisine would be a shame. This city is home to a world-class crawfish festival, as well as shrimping and oystering industries.", "The city has been revitalized Biloxi suffered severe damage from Hurricane Katrina in 2005 and the Deepwater Horizon oil spill in 2010. It's worked hard over the years to recover, and offers many new and improved things to do.", "Pounce on promotions The casinos often offer deals and discounts on everything from buffets to spa treatments to accommodations. Pull up their websites' promotions page and compare to find the best offers.", "Visit in the offseason Biloxi's offseason is from November to April, when the temperatures dip. It's during this time of year that room rates at the local hotels drop as well.", "Thanks to Biloxi's proximity to the water, the city harvests and serves up plenty of seafood. Crawfish are a Southern specialty, and you'll find some of the best at the popular Taranto's Crawfish restaurant. Though it's situated about 12 miles northwest of the main tourist area, travelers say it's worth the trek to try the \"perfectly spiced\" crawfish, gumbo and po'boys. Mary Mahoney's is another highly regarded seafood stop that earns praise for its fresh fish entrees, friendly staff members and elegant but laid-back ambiance. If you're in the mood for oysters, experts and travelers alike say you have to head to the Half Shell Oyster House to try the various offerings (think everything from charbroiled oysters to raw oysters on the half shell to oysters Rockefeller). In addition to its spot on Lameuse Street (not far from Mary Mahoney's), the local chain, which has several locations throughout the South, also has an outpost in Hard Rock Hotel and Casino Biloxi.", "If you're spending the majority of your time in the casino, you'll find an array of casual and fine dining options there as well. In addition to the Half Shell Oyster House, the Hard Rock is home to a Ruth's Chris Steak House as well as several casual eateries, including its namesake cafe. Meanwhile, the buffet at Beau Rivage earns high marks from recent travelers, as does Thirty-Two, a seafood and steak restaurant in the IP Casino Resort Spa. "]}