{"name": "Ljubljana", "description": ["Slovenia's capital appeals to vacationers seeking a historical, scenic getaway that doesn't break the bank. Located about halfway between the Mediterranean Sea and the Alps, Ljubljana offers a postcard-worthy setting filled with charming architecture, expansive green spaces and bike- and pedestrian-friendly streets. The picturesque Ljubljanica river weaves its way through the Ljubljana Old Town area, where the bulk of the city's can't-miss attractions – which are all free to visit – reside. You can cross the river via stunning bridges like the Dragon Bridge and the Triple Bridge, one of several Ljubljana sights created by Slovenian architect Jože Plecnik. Other old-world locales, such as Ljubljana Cathedral and Prešeren Square, are a short stroll away from the river's banks.", "On warmer days, enjoy a picnic by the river or nearby Lake Bled, on Ljubljana Castle's grounds or in lush Tivoli Park. After a busy day of sightseeing, head to a Slovenian restaurant to savor traditional comfort classics like Idrijski žlikrofi (a potato-, onion-, bacon- and spice-filled pasta served with a meat sauce) or Kranjska klobasa (a sausage similar to what you'd find in Kraków, Poland). Or, make your way to Metelkova mesto for cool art and a superb nightlife scene.", "The best time to visit Ljubljana is from April to May or from September to October. These spring and fall months offer comfortable (albeit occasionally cool) weather for sightseeing, plus lower hotel prices than the peak summer season and the busy winter holidays. June, July and August – Ljubljana's summer months – boast warmer temperatures (think: mid- to high 70s during the day) that attract hordes of tourists, causing accommodation rates to increase and crowds at top attractions to swell. Meanwhile, November through March (or late fall through early spring) sees lower prices at hotels (except around Christmas and New Year's), but daytime temps rarely climb out of the 30s and 40s.", "Although the name \"Ljubljana\" wasn't officially used until 1220, the land that comprises the present-day city was first settled by the Veneti (an early group of people from northeastern Italy) around 1000 B.C. Throughout its history, the area was occupied by multiple ethnic groups – including the Taurisci (a Celtic tribe), the Romans and the Huns – before it became part of Yugoslavia after World War I. Once World War II ended, Slovenia and five other republics formed, with Ljubljana becoming Slovenia's capital. Locals voted for independence on Dec. 23, 1990, which was officially declared on June 25, 1991.", "Ljubljana is known for its stunning mix of architecture, which can partly be attributed to its turbulent history. Following the sack of Emona (the Roman city preceding Ljubljana) by the Huns, much of the region's original Roman structures were destroyed. Ljubljana Castle and other Gothic buildings were constructed in their place during the Middle Ages. Most medieval structures (think: Ljubljana Cathedral) were replaced by or repurposed to become Baroque buildings following the earthquake of 1511. In the early 20th century, ornamental art nouveau structures like the Dragon Bridge were built. And between World War I and World War II, Slovenian architect Jože Plecnik transformed the city by adding numerous structures inspired by ancient Athens, Greece, such as the Triple Bridge.", "Gorgeous architecture is on display throughout the Ljubljana Old Town area, but travelers who want a true taste of the city's artsy side should visit Metelkova mesto. This avant-garde neighborhood is composed of many buildings featuring artwork by both highly regarded and lesser-known Slovenian artists.", "Slovenia's official language is Slovenian, though Hungarian and Italian are also nationally recognized as main languages. Slovenians pride themselves on speaking multiple languages, with more than half able to speak English conversationally. As a result, travelers can get by using English while visiting Ljubljana. Those who want to try speaking Slovenian should remember key words and phrases like \"zdravo\" (hello), \"Ali govorite angleško?\" (Do you speak English?), \"hvala\" (thank you) and \"zbogom\" (goodbye).", "As is the case in other European cities, tipping is not expected in Ljubljana. However, it is customary to round up your bill or leave a 10 percent tip at restaurants when you feel you've received exceptional service. Because Slovenia is part of the European Union, its official currency is the euro. One euro equals about $1.13, but you'll want to check the latest exchange rate before you visit. Credit cards are widely accepted, and ATMs are available throughout the city.", "Sharing borders with Italy, Austria, Hungary and Croatia, Slovenia offers dishes that blend fresh, local ingredients with Italian, German and Eastern European flavors. Regional, savory specialties include Kranjska klobasa (or Carniolan sausage, a sausage similar to Polish kielbasa) and Idrijski žlikrofi (pasta filled with potato, onion, bacon and spices, and served with a meat sauce). For dessert or a sweet treat, try potica (a yeast cake with a tarragon, poppy seed or walnut filling) or Prekmurska gibanica (a moist cake with alternating layers of apple, walnut, poppy seed and cottage cheese).", "If you want a libation to accompany your meal, sip one of 52 kinds of vino from Slovenian's wine regions: Primorje, Podravje and Posavje. Or, go for a homemade brew from one of Ljubljana's craft breweries. For something stronger, try zganje (schnapps). Local versions feature flavors like blueberry, plum, juniper, honey or pear.", "Traditional dishes and a selection of local wines, beers and spirits are on the menus at traveler-approved eateries like Gostilna Na Gradu and Hiša Pod Gradom, as well as Gostilna Slovenija-designated restaurants – 43 local dining establishments deemed authentic by the Slovenian government. Kranjska klobasa and other handheld Slovenian staples are also available at Ljubljana's Central Market and Open Kitchen (\"Odprta kuhna\"), an open-air food market that occurs every Friday from mid-March to October. Additionally, popular dining venues, such as Restavracija Strelec and Monstera bistro, serve Slovenian fare with a contemporary twist. Ljubljana is also home to a few casual, internationally inspired eateries, including highly regarded locales like Zbornica (an American bar and grill), Fari's Delice (a Middle Eastern spot with vegan options) and Pizzeria Trta (with pizzas, pastas and more).", "Overall, Slovenia is a safe country to visit. However, its geographic location means travelers should stay up to date on the news during their stays, since terrorist attacks occasionally occur in Europe. Strikes and protests can also turn violent at times, so it's best to avoid public demonstrations (which primarily take place at Congress Square or outside of government buildings). Some travelers also caution that Metelkova mesto can feel unsafe at night.", "Although the country has low crime levels, petty crimes like purse snatching, pickpocketing, vehicle break-ins and bike theft are common in tourist areas. To avoid falling victim to these crimes, safeguard your belongings and lock your car or bicycle. For more information about how to stay safe while visiting Slovenia, check out the U.S. State Department's website. And to receive security messages during your vacation, sign up for the free Smart Traveler Enrollment Program.", "The best way to get around Ljubljana is to walk, bike or use Kavalirs. All three options are either free or affordable modes of transportation, though walking or biking may not be the most comfortable way to get from one place to another during the chilly winter months. Ljubljana also offers a tourist train and a reliable bus system, but because all of the city's top attractions are situated downtown, paying more to navigate the area by train or bus isn't necessary. Taxis are available as well; however, rates are pricey. Hiring a car is not recommended due to Ljubljana's abundance of cost-effective transportation options. Travelers who want to venture outside the city to Lake Bled can drive or sign up for a fee-based bus tour from Ljubljana.", "To get to Ljubljana, visitors can fly into Ljubljana Jože Pucnik Airport (LJU), which sits about 15 miles north of the city center. Rental cars and taxis are readily available at the airport, or travelers can take an Avtobusna Postaja Ljubljana bus from the airport to central Ljubljana.", "Slovenia's participation in the Schengen Agreement means American tourists can visit the country without a visa as long as their stays last less than 90 days. A passport with three or more months of validity beyond the travel dates is required, though the U.S. State Department recommends those who plan on traveling to other European countries have a passport that's valid for at least six months. Upon arrival in Slovenia, visitors must show proof of a return flight and sufficient funds. Americans who are not staying at a hotel or a company-owned apartment and will be visiting for more than three days will need to also register at a local police station within 72 hours of arrival. Learn more about Slovenia's entry and exit requirements by visiting the U.S. State Department's website."]}