{"name": "Shanghai", "description": ["What has made Shanghai one of the world's most populous cities? It's a modern-day commercial mecca. Shanghai celebrates its prosperity with monuments of industry like the Oriental Pearl TV Tower. Its rapid evolution keeps the skyline changing and the fashions fleeting, meaning that familiarity is one thing that you should kiss goodbye in Shanghai. If you can embrace the unexpected, the radically new and the immense crowds, you're ready to tackle China's most dynamic metropolis.", "However, the towering skyscrapers, incessant traffic, and labyrinth of streets often intimidates visitors. In fact, these features can make Shanghai feel inaccessible and impersonal. To appreciate the city, you must realize that the \"real\" Shanghai is elusive for most people – locals and tourists alike. While here, you must carve out your own Shanghai. Discover your own dining gems in convoluted Zhujiajiao. Find a calm spot along the Bund. Reflect at the Jade Buddha Temple. There are numerous ways to plan your own adventure in Shanghai. So what are you waiting for?", "The best time to visit Shanghai is from October to November. This short autumn season boasts comfortable temperatures and lacks the crowds and rain showers of summer – the peak tourism season. Winter travelers can encounter chilly weather, making urban exploration less enjoyable. The rising temps of spring offer a short sweet spot for travel, as long as you avoid the public holidays. Note that Shanghai is a business-centric city, so hotel rates usually drop over the weekends. ", "In Shanghai, foreign visitors may experience culture shock. Upon reaching Shanghai, travelers are inundated with the urban ills that reside in any mega-metropolis, including crowds, traffic, lines, flashing lights, pollution, crowds, car horns, odors, skyscrapers, dirt and more crowds. At times, catching your breath can be difficult, and you can always be on the run. In this predicament, you have two options: Either embrace the torrent of urbanity or firmly dictate your own pace.", "Whichever way you choose to take in Shanghai, you'll quickly notice that the city's landscape is different. The best way to see this is on the Bund. On one side, you have the most modern of skyscrapers that form the city's renowned skyline. Turn around, however, and you get something completely different. European-style buildings line the Bund's boulevard. And this contrast isn't just present on the Bund, it's everywhere. That's because Shanghai, once a small fishing village, grew into an international port with the help of the British occupation during the Opium War. From there, concessions, or neighborhoods, were set up by the British, French and Americans, bringing about a unique mixture of architecture to the city as well as diversity. This foreign presence is what set up Shangai's tolerance of Western cultures and ideas, helping it become the big business metropolis that it is today. ", "Shanghai is still very diverse, and as such, visitors may struggle with communication. The official language is Mandarin; however, Chinese citizens from across the country arrive with their own regional dialects (and sometimes entirely different languages). That said, English is the predominant second language, and those in the tourism industry will have a working knowledge of it. Be patient when you interact with locals and bring a Mandarin phrase book just in case.", "While Shanghai's restaurants and hotels maintain a relatively higher standard of sanitation compared to other Chinese destinations, drinking tap water is not advised. Even the most reputable restaurants aren't a guarantee. That said, all hot drinks are safe to consume and many restaurants sell water bottles as well. ", "China's official currency is the renminbi; however, amounts are often referred to in terms of \"yuan.\" Yuan is the primary unit of the Renminbi such as the U.S. dollar. Vendors may announce prices in RMBs (the unofficial abbreviation for renminbi) or yuan, but they are actually referring to the same thing. While the current exchange rate is about $1 for 6.60 yuan, the value of the renminbi has been steadily climbing. ", "The best way to navigate Shanghai's robust dining scene is to start in the streets. The city is considered a mecca for its vast and delectable street food. Here, you'll find a menagerie of classic Chinese fare for a fraction of the price (some sit-down restaurants tack on a 10 to 15 percent service charge). Xiaolongbao, or pork soup dumplings, are as traditional as you can get. Eight of these can easily set you back as little as 4 yuan ($0.60), and if you're wondering where the soup is, just take a bite. Noodles are also abundant and come in a wide variety of flavors and styles. Cond you ban mian noodles, or scallion oil noodles, are a simple, traditional noodle dish featuring soy sauce, fried scallions and shrimp. There's also Liang pi, or cold jelly noodles typically mixed with sesame sauce, vinegar, chili oil and toasted peanuts. Those with an adventurous palate should seek out yaxue fensi tang, a hearty duck soup featuring duck blood and its entrails, and shansi leng mian, noodles mixed with eel.", "But if you were to pick one meal to have on the street alone, it should be breakfast. Some of Shanghai's most lauded street food is served only for breakfast. Ci fan taun is by far one of the most popular dishes. Typically eaten for breakfast, ci fan taun is a rice ball stuffed with you tiao (a fried breadstick), chopped pickles, dried pork floss and sometimes ham and eggs. Jian bing is another popular breakfast option, with lines typically starting at 6 a.m. at some stalls. Jian bing are Chinese crepes made with a host of sauces, stuffed with dough, wonton skin or tofu and topped with eggs, pickled greens, scallions and cilantro. There's also cong you bing, or scallion pancakes.", "Those who want to sit will find that Shanghai's restaurants are just as top notch as its street food. Fu 1088 is seen as one of the city's best restaurants. Housed in a 1930s Spanish villa-style house, Fu 1088 serves fine Shanghai-French fusion fare. Peace Mansion is another upscale option that serves Chinese and Western dishes including French, modern Shanghainese and Cantonese. The property also features a beautiful garden outfitted with centuries-old trees, perfect for tea time.", "Tea is an important part of Chinese hospitality and a recommended means of cultural immersion. In Shanghai, visitors can find many teahouses as well as restaurants and hotels that host afternoon tea. It's important to note that tea, like wine, should not be poured all the way to the top of the glass. And if you're using chopsticks, know that there are etiquette rules to follow as well. Do not stick your chopsticks upright in your bowl, but rather keep them together and place them across the bowl, or horizontally on your plate.", "The best way to get around Shanghai is the metro. Immune to traffic (though crowding is inevitable), the metro is a fast and cheap way to travel within the city, and its extensive reach will put you close to all the top attractions and hotels. Taxis are another convenient and useful option, but they'll cost you a bit more. And although buses are abundant (the city boasts nearly 1,000 lines), some lines are marked in Chinese only. Whichever form of transportation you choose for your travel, don't forget to do a little bit of walking. Strolling through Shanghai's larger-than-life cityscape is an awe-inspiring experience and the only way to familiarize yourself with individual neighborhoods. But that doesn't mean walking should be your only way of getting around. Shanghai is China's biggest city and conquering its streets entirely on foot is an impossible feat. ", "Most visitors arriving from overseas travel through Shanghai Pudong International Airport (PVG). The city's main domestic hub is Shanghai Hongqiao International Airport (SHA). The Shanghai Pudong International Airport is located on the eastern edge of the city, nearly 30 miles northeast of the city center. Most visitors coming through this airport either take a cab or the Shanghai Maglev train into downtown. The Shanghai Hongqiao International Airport is stationed just west of downtown; metro line 10, which goes to downtown Shanghai, services this airport.", "In addition to a U.S. passport that's valid for at least six months from your arrival date, Chinese authorities require you to have a government-issued visa indicating the length of your stay. Visas are only available at Chinese embassies and consulates and must be obtained prior to departure. You are not allowed to apply for a visa by mail. It's important to note that tourist visas for China don't cover all of the country's regions. For more information, check out both the U.S. Department of State's website and the Embassy of the People's Republic of China's website."]}