{"name": "Belize", "description": ["Although this small Central American nation spans less than 9,000 square miles – roughly the size of the state of Massachusetts – few places on Earth can match Belize's diverse natural beauty. The barrier reef's turquoise and coral hues contrast with the staggering Maya temples scattered throughout the country's lush rainforests. Plus, it's not just the landscape, the history, culture and people of Belize are just as blended. ", "Belize has spent years concealed underneath the shadows of its Mexican neighbors — Cancún, Cozumel and Tulum. But today, this Central American country beckons visitors with its thatch-roofed jungle lodges, impressive Maya temples, secluded snorkeling and scuba diving havens, and laid-back atmosphere. Sandwiched between Mexico and Guatemala, Belize's eastern shoreline flanks the Caribbean Sea, while its mainland extends into a myriad of wild rainforests to the north, west and south. Facing off against the sun-drenched mainland coast are hundreds of tiny islands known as cayes and atolls. These islets lure travelers with swaying palm trees and cerulean waters.", "Belize's largest island, Ambergris Caye, attracts the most visitors. Stroll through Ambergris Caye by day and you'll find a relaxed beachfront filled with spectacular waterfront sites; by dusk, you'll revel in its vibrant nightlife. Just be sure to save some time on the mainland to unravel Belize's subtle charms. From its luxuriant Maya sites to its sparkling waters, there's plenty to explore in this enchanting coastal country.", "The best time to visit Belize is from late November to mid-May, during the country's dry season. Although this peak season draws thousands of tourists, dealing with crowds is an easy sacrifice to make for warm temperatures, clear skies and easy access to the country's top attractions. You'll probably want to pass on visiting during June and July, when humidity mists the tropical landscape and temps reach triple digits. Expect showers from June to mid-November and strong winds. If you want to beat the rush of tourists and don't mind packing an umbrella, come during the rainy season in September and October. But keep in mind that some establishments shut down during the offseason.", "You don’t need to change your U.S. currency Belize's official currency may be Belizean dollars, but U.S. dollars are widely accepted throughout the country. When traveling to Belize, there's no need to convert all your cash.", "You'll hear multiple languages English is the dominant language here, but you'll likely hear one of Belize's other languages: Spanish, Garifuna, Mayan and Creole.", "Explore the Maya sites in the A.M. Hordes of tourists flock to the temples at midday. Arrive in the morning to avoid long lines, as well as sweltering heat and damp humidity.", "Visit in the rainy season If you don't mind light showers, visit during September or October to capitalize on reduced hotel rates, hardly any beachgoers and fewer crowds at the Maya sites.", "Book a group tour Many excursions in Belize, such as snorkeling and cave tubing, require a certain number of participants. Instead of paying the price of a private tour, you can split the cost with other like-minded travelers and save a fortune.", "Eat like a local While Belize's five-star restaurants are certainly deserving of the recognition, one may argue the local mom and pop shops are just as good, if not tastier. Instead of splurging on a three-figure dinner at your resort, try a local rice and beans or barbecue food stand peppered along the streets.", "Before European colonization, Belize was the heartland of the Maya civilization's vast empire. The region served as a complex trade route between Guatemala and Mexico during the Classic Period (A.D. 250 to 900), and there is also evidence that the country served as a centerpiece for ceremonial practices as well. In present-day Belize, there are 1,400 Maya sites.", "By the mid-17th century, the British Empire usurped the country and brought Creoles (people born in a Caribbean New World colony) and Black Caribbean natives, known as Garifuna. Over time, Creole and Garifuna populations gradually integrated themselves into Belize's culture, creating their own customs while under British rule. Full independence wasn't gained by the country once known as the \"British Honduras\" until 1981.", "Today, Belize is a mixture of cultures. Home to about 440,000 people, the largest ethnic group in the country is the Mestizo people, who are a mix of Maya and European descent. Creoles are the second largest ethnic group, making up about 25% of the population. Smaller ethnic groups include the indigenous Maya descendants of the Yucatec, Mopan and Kekchi tribes, as well as the Garifuna people. The rest of the population consists of people of European, East Indian, Spanish and Mexican descent. Most Belizeans speak English, although you're likely to hear a spattering of Spanish, Garifuna and Creole as well. Since the country is such a melting pot, including expats from Canada, Europe and the U.S., the Belizean people are known for being welcoming and hospitable.", "Although less party-oriented (and more modest) than folks you'll find in Cancún, Belizeans dress casually, even in restaurants. No need for a jacket and tie here. When dining, you'll want to sample Belize's Caribbean and African-influenced seafood dishes, such as conch served with rice and beans, the gumbo-like chimole and the served-cold fish and shrimp ceviche. You'll also want to savor some of the unique fruits found in the country, including sapodilla, soursop, cashew fruits and cacao – the fruit that produces chocolate.", "You should forgo tap water unless it's been purified or boiled and stick with bottled water. The U.S. State Department also recommends getting vaccinations for hepatitis A and typhoid as well as having your vaccinations for tetanus and diphtheria up to date.", "When dining out, the tipping policy is similar to the practice in the U.S. –  anywhere from 10 to 20% is accepted and giving cash is always best. One person you can skip tipping: the cab driver.", "The official currency here is the Belizean dollar (BZD), but U.S. dollars are readily accepted in most places in the country. The exchange rate is locked in at BZ$2 equals $1, so price conversion is fairly easy here. However, it's still a good idea to check what the current exchange rate is before you go.", "Since tourism is the largest sector of the country's economy, most tourist areas are safe, but you should still be alert to petty crimes and pickpockets. The country does have an organized crime problem and violent crime is fairly prevalent, especially in Belize City. Visitors should travel in groups, stay vigilant and take extra precautions (carry a copy of your passport with you and watch your belongings at all times).", "Belize’s cuisine is a vibrant fusion of diverse cultures and flavors, a direct reflection of the country’s rich history and colorful heritage. Drawing influences from the Maya, Creole, Garifuna, Mestizo and other cultures, the culinary scene results in a delicious and eye-opening experience.", "A major component of Belize’s traditional cuisine is its use of fresh and local ingredients. With the abundance of tropical food, spices, vegetables and seafood, Belize offers a wide range of flavors to foodies of any level. Coconut, plantains and cassava are staples in many dishes. The unofficial dish has always been rice and beans, a lunch dish often accompanied by potato salad, stew chicken and fried plantain slices. ", "What makes Belize’s culinary scene interesting is the diversity in food one encounters depending on which region they’re in. Travelers in the north will enjoy corn-based dishes, such as tamales and dukunu; moving farther south, they’ll have the privilege of tasting spice-ridden soups such as hudut or sere. Of course, the islands offer the most scrumptious seafood tapas like conch ceviche and lobster – the latter cooked in all its forms.", "Though certain foods are influenced by specific cultures, the entirety of Belize – and its visitors – get to enjoy the eclectic food scene no matter where they are. In fact, some of the most palate-pleasing bites come from the most unassuming places – mom and pop food shacks scattered throughout cities and towns may have travelers doubtful at first due to their rustic facades, but the long lines snaking down their windows is proof enough of the stellar quality of their food. ", "The best ways to get around Belize are by car, water taxi and plane. Taxis and rental cars are the most hassle-free modes of transportation around Belize City. Cabs and cars are also the easiest way to get to and from Belize City's Municipal Airport (TZA) just outside the city center or Philip S.W. Goldson International Airport (PGIA), which is about 10 miles northwest of Belize City in Ladyville. Hopper planes also transport passengers to popular islands like Ambergris Caye and Caye Caulker. Water taxis are the best mode of transportation to access Belize's numerous cayes. Attractions on the mainland are relatively spread out, but Belize itself is a compact country, equipped with commuter buses that transport passengers to popular things to do. However, these buses are typically run-down and routes can be difficult to navigate.", "You'll need a valid passport to visit Belize, and you can stay for up to 30 days without a visa. All tourists and non-Belizean citizens traveling by plane must pay an exit fee of $39.25, which is usually included in airfare. Tourists traveling on a cruise line are charged a $7 entry fee. Visitors exiting Belize at the Mexican or Guatemalan border must pay $15 for a 24-hour visit, and fees for crossing the border increase if the visit exceeds one day. For additional information, visit the U.S. State Department's website."]}