{"name": "Costa Rica", "description": ["To many, Costa Rica's charm lies in its lush rainforests, unspoiled beaches and abundance of wildlife. With breathtaking landscapes and a myriad of creatures – from toucans to monkeys to jaguars – it's easy to see why. Where else can you hike active volcanoes, zip line through cloud-covered rainforests and surf warm, turquoise waters within the span of just a few days? In this compact but diverse tropical paradise, exhilarating outdoor activities are abundant. Nature-seekers will roam thick jungles while beachgoers will sprawl across the powdery sands. It's hard not to admire all the splendors this \"Rich Coast\" has to offer.", "However, for others, this small Latin American country has a different appeal: it's a relaxed way of life. Residents – known as Ticos – often recite the catchphrase \"pura vida\" (or \"pure life\"). This guiding philosophy can be observed from Costa Rica's central cosmopolitan capital of San José all the way to the sandy Atlantic and Pacific coasts. To truly immerse yourself in the good life, kick back and admire the awe-inspiring scenery. Surround yourself with graceful butterflies at La Paz Waterfall Gardens, hike along the monumental Arenal Volcano, mingle with locals at Puerto Viejo de Talamanca, or simply sit in a hammock under a palm tree along the Nicoya Peninsula.", "The best time to visit Costa Rica is from December to April (the dry season). This peak tourist season boasts plenty of sunshine making it an ideal time for exploring rainforests and lounging on beaches. That said, the dry season is the most popular (and expensive) time to visit. Luckily the U.S. dollar goes a long way in Costa Rica no matter the season. You'll have to book your room and tour reservations three months in advance to secure a spot. If you don't mind getting a little wet, visit between May and November when prices are at their lowest. During July and August, rain showers pause briefly, and Costa Rica's forests burst with green foliage.", "While planning your trip, keep in mind that the weather varies by region. In the thick forests of the Caribbean Sea coast and Northern Plains, expect high humidity and temperatures ranging between the 70s and high 80s year-round. Conversely, in the North Pacific, prepare for lower humidity levels, but temperatures that often soar into the 90s during Costa Rica's dry months.", "Pack an umbrella Even if you're planning to visit during Costa Rica's dry season (December to April), don't count on continuous sunshine. Showers can occur year-round.", "Bring small bills The U.S. dollar is widely accepted in Costa Rica. It's to your advantage to bring American money, particularly small bills for purchasing souvenirs and tipping.", "Ask to see the ICT card You'll be approached by guides offering their services at many of Costa Rica's natural attractions. To ensure you're hiring a professional guide, ask to see their ICT card, which is issued by the Costa Rican Tourism Board. This will ensure you're receiving guide services that have been vetted by the government and meet sustainability standards. You can also opt for one of the best tours in Costa Rica to ensure you're being led by a professional.", "Bring a reusable water bottle Tap water is safe to drink in Costa Rica, and in some national parks, you'll be prohibited from bringing in single-use plastic. Respect the country's commitment to sustainability by packing a reusable water bottle.", "Don't rent a car at the airport Most car rental companies at Costa Rica's airports add a 13% charge to their rates. It's best to reserve a car ahead of time from a company located in the heart of town rather than the airport.", "For better rates, exchange at the airport The exchange rate is generally better in Costa Rica for American dollars. While you'll want to bring a few Costa Rican colóns with you for small purchases upon arrival, exchange the bulk of your cash once you're in the country or withdraw local currency from an ATM.", "Make sure the meter is running Taxi drivers have a reputation for charging extra by not switching the meter on. As soon as you step into a taxi, either check that the meter is running or negotiate a flat rate with the driver to avoid a scam.", "Costa Rican residents (los Costarricenses or \"Ticos\") are known for their pleasant and easygoing nature. Always warm, welcoming and living life to the fullest, Ticos often greet each other with a hearty \"Pura Vida!\" (meaning \"pure life\"). Don't be alarmed by their benevolence and eagerness to please guests. To blend in, just reciprocate with kindness and embrace their positive philosophy.", "The official language here is Spanish; however, you'll find English-speakers in popular tourist areas. But using some key phrases, such as \"por favor\" (\"please\") and \"gracias\" (\"thank you\"), is a polite gesture that goes a long way.", "Dressing in casual clothing coincides with the laid-back Costa Rican lifestyle. You'll want to pack loose-fitting clothing and sturdy hiking shoes if you're planning to explore the country's rustic wildlife reserves, volcanoes and parks. You'll also want to lather up with sunscreen and insect repellent, as mosquitoes and other critters swarm Costa Rica's damp rainforests.", "Coffee beans are commonly associated with Costa Rica. You're also likely to spot coffee plantations in the Central Plains; many travelers enjoy taking tours here. However, high-end coffee beans are hard to come by since they are commonly exported rather than sold locally.", "Costa Rica's official currency is the Costa Rican Colón (CRC). Since the CRC to U.S. dollar exchange rate fluctuates, be sure to check what the exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "As far as dining goes, travelers should note that restaurants add gratuity onto the bill. However, tipping extra is not uncommon; if the service is stellar, leave an additional tip. For tour guides and drivers, plan to dole out about $10 per day.", "In Costa Rica, you'll face few safety concerns. However, in congested San José, you'll want to keep an eye on your belongings and your rental car. Pickpocketing and car theft are common in heavily trafficked tourist areas. If you're leaving your car parked in any of the unofficial lots near the national parks, you'll want to conceal any valuables and lock your car, according to past visitors.", "With its tropical temperatures, Costa Rican cuisine features an abundance of exotic fruits (especially pejibayes – a type of savory fruit) and vegetables, and depending on what part of the country you are in, lots of fresh fish. Black beans and rice are a staple and are a part of almost every traditional meal. Of course, Costa Rica is famous for its coffee beans (though much of it is exported), but you shouldn't leave without trying a cup.", "Common dishes you will see on menus include gallo pinto (rice and beans), ceviche (fish marinated in lemon juice), pati (pastry dough stuffed with curried beef and onions) and agua dulce (warm melted sugarcane). If you visit San José, don't miss the Central Market, which opened in 1880, and is the largest market in the city, with more than 200 shops, stalls and small restaurants. Taking a food tour in San José is a great way to get a taste for the country's unique markets and flavors.", "The best way to get around Costa Rica is by car. Having your own set of wheels gives you the freedom to explore at your leisure. If you're hoping to save money, using public transportation is a good option as there are a variety of routes to popular tourist towns and destinations that depart from the country's capital, San José.", "For a hassle-free means of getting to downtown San José from the Juan Santamaría International Airport (SJO), you'll want to flag a taxi. Official taxis at the airport are orange. If you're planning to explore Guanacaste and the Nicoya Peninsula in the northwest region of Costa Rica, you can easily hail a taxi from the Daniel Oduber Quirós International Airport (LIR), aka the Guanacaste airport.", "U.S. citizens traveling to Costa Rica will need a passport that is valid for the length of their stay in Costa Rica. Many airlines also require travelers to have a round-trip ticket before boarding flights to Costa Rica to ward off fines imposed by Costa Rican immigration. Travelers should expect to pay a $29 airport departure tax. Visitors can pay the fee upon arrival in Costa Rica or before departure. Check to see if the fee was included in the price of your airline ticket, as some airlines do add this in. However, it is highly recommended to pay in advance as lines can get long at the airport. If you're planning to stay longer than 90 days, you are required to apply for an extension to the Office of Temporary Permits. To learn more, visit the U.S. State Department website."]}