{"name": "San Francisco", "description": ["A jumbled collage of colorful neighborhoods and beautiful views, San Francisco draws those free-spirited types who have an eye for edgy art, a taste for imaginative cuisine and a zeal for adventure. It's really not surprising that songwriter Tony Bennett left his heart here: The city boasts jaw-dropping sights, world-class cuisine, cozy cafes and plenty of booming nightlife venues – there's no shortage of ways to stay busy here. Spend an hour or two sunning yourself alongside sea lions on the bay, admiring the views of the city from Twin Peaks, or strolling along the Marina. And for the quintessential San Franciscan experience, enjoy a ride on a cable car or hop on a boat tour for a cruise beneath the Golden Gate Bridge.", "Often described as Los Angeles' more refined northern cousin, cool and compact San Francisco takes the big-city buzz exuded by its southern counterpart and melds it with a sense of small-town charm. Here, you'll discover a patchwork of culture flourishing throughout San Francisco's many vibrant quarters. Follow the crowds to the touristy Fisherman's Wharf area (which offers spectacular views of Alcatraz) before heading along the bay to the Presidio for a glimpse of the famous Golden Gate Bridge. But don't forget to save time for The Mission, the Haight and the Castro for exposure to all of the different varieties of the San Francisco lifestyle. And when you're ready for a break from the city, join one of San Francisco's best wine tours for a relaxing day trip.", "The best time to visit San Francisco is from September to November. Believe it or not, fall offers some of the city's warmest temperatures year-round, not to mention fewer crowds than summer. Spring is another good time to visit thanks to its mild temperatures and lack of rain (compared to other parts of California). The Golden Gate City witnesses a surge in tourism during the summer as people head west in search of sun, sand and surf. However, the fluctuating climate can quickly trounce a day at the beach. Those looking for the perfect seaside getaway should consider a trip to Los Angeles where the sunshine lasts year-round. Meanwhile, winter in San Francisco draws bargain-hunters with the promise of lower hotel rates and fewer people. If you decide to travel in the wintertime, protect yourself from the chilly temperatures with plenty of layers.", "Bring a jacket The weather in San Francisco is fickle. Just because it's warm and sunny when you start your day doesn't mean damp fog and brisk winds won't settle in later on.", "Get ready to hike San Francisco is built on incredibly large hills. Even if you're taking public transportation or have a car, you're likely to run into a hill at lease once (especially on one of the city's walking tours), so pack the proper footwear.", "Be mindful of downtown residents San Francisco not only shelters one of the largest populations of homeless people in the U.S., but the city also has one of the worst drug problems as well. These often coincide and can be seen very clearly in parts of downtown San Francisco.", "Take a tour It can feel overwhelming to try and experience all that San Francisco has to offer. To make the most of your trip, consider signing up for a guided tour.", "Plan a day trip The famous wine regions of Napa and Sonoma sit a little more than an hour north of the city. If you don't have your own set of wheels, book one of San Francisco's best wine tours.", "Forget about summer Hotels welcome a large number of hopeful sun-seekers during the summer, causing room rates to rise rather dramatically. You'll find plenty of deals if you book during the cooler months.", "Reconsider that big-name hotel Hotel chains in major areas like downtown, SoMa and Fisherman's Wharf are just waiting to take your money. You'll find much better rates at smaller bed-and-breakfasts and independent hotels in Nob Hill and the Marina District.", "Forget the car Having a car in San Francisco will be an expensive hassle. Many hotels charge hefty fees for valet parking, and some don't even offer self-parking. Stick to public transportation and you'll save loads of dough. And if you'd rather let someone else do the driving, consider signing up for one of San Francisco's best bus tours.", "San Francisco is one of the most progressive cities in the United States, with historical ties to the hippie and gay rights movements. The city is also among the most diverse in the United States, with distinct Hispanic, Chinese and European traditions represented in a host of arts and music festivals, as well as an oftentimes grandiose display of architecture.", "To match its love for progressiveness and diversity, San Francisco also prides itself on its environmental sustainability efforts. Composting is mandatory for all city residents, and the Bay Area remains host to an abundant amount of nonprofit environmental organizations.", "San Franciscans also love the outdoors, and the city's lush parks (including Golden Gate Park) and proximity to excellent natural wonders (including Yosemite National Park) make it one of the most enviable cities for adventure travelers.", "San Francisco's dining scene is diverse in its culinary offerings, featuring both casual and upscale establishments as well as cuisine from around the world, helping it earn the distinction of one of the best foodie cities in the USA. Here you can find a bevy of Michelin-star establishments (it is one of only four cities in the U.S. to have a Michelin guide), coffee shops, as well as neighborhoods made famous for their international offerings, including North Beach (Italian), The Mission (Mexican) and Chinatown (Chinese), among others. But what makes San Francisco particularly stand out is commitment to utilizing what's available, instead of what they can get. Here, the option to source ingredients locally is not so much a question but rather an expectation among the culinary community. ", "San Franciscans are crazy about their local bounty and you should be too. In fact, stopping at a farmers market is a cultural experience here. There are more than 50 available in the Bay Area alone. The farmers market at the Ferry Building Marketplace acts as a microcosm of the city's culinary identity. The market works to showcase only small, regional producers and is frequented by more than 200 of the city's chefs, including Alice Waters of Chez Panisse, a pioneer of the farm-to-table movement. ", "You could spend days trying to navigate San Francisco's vast dining scene, but it moves pretty fast. The next big place to eat may not be the same a couple weeks later (in 2014, there was a new restaurant opening every week). That said, there are some establishments that have stood the test of time. You may want to opt for a classic bread bowl with clam chowder at Boudin's (the original creator of SF's famous sourdough), or visit the heavily lauded Tartine Bakery for this Bay Area classic. Speaking of sweet treats, Bi-Rite Creamery's ice cream and Golden Gate Bakery's egg tarts are said to be some of the city's best desserts. ", "For coffee, Peets Coffee & Tea started in the Bay Area, though Philz Coffee gets much more love from locals. If you're more into beer, a visit to the Anchor Brewing Company is a must. There's Chinatown, but there's also Japantown in the Western Addition (one of three remaining in the continental United States). The Richmond is also said to be a top spot for Asian cuisine while the Mission is renowned for its Mexican food, specifically its burritos. Depending on who you ask, La Taqueria is said to have San Francisco's best burrito, though if you're cruising 24th street, you're likely to run into numerous neighborhood gems. For an overview of they city's ever-evolving dining scene (and the chance to sample some delicious eats along the way), sign up for a guided tour.", "Like any major city, San Francisco has its share of rough spots. The city's progressive reputation and lax drug laws have attracted a large homeless population, who panhandle throughout the main tourist areas and in San Francisco's downtown area. Violent crime against tourists remains rare, but out-of-towners can be the victims of theft, especially those unaware of their surroundings. When riding on public transportation, always keep hold of your belongings. Don't walk alone at night, and don't carry large sums of cash while you're in the city. Avoid the SoMa and Tenderloin areas at night; both are known for high incidence of crime.", "The best ways to get around San Francisco are on foot and by using public transportation. Most of the popular attractions are within walking distance of the city center, and the large municipal transportation system (called the Muni) operates bus and streetcar lines, leaving little need for your own set of wheels. The city's famous cable cars (also operated by Muni) and bus tours are a more entertaining, albeit slower, way to see the city. To get into town from the San Francisco International Airport (SFO), you can use the Bay Area Rapid Transit (known among locals as the BART) commuter rail, or you can take a taxi for around $46 to $66, depending on your final destination and the state of traffic at the time.", "Until 1964, the Golden Gate Bridge was the longest suspension bridge in the world. Now, it's the second-longest suspension bridge in the United States and the 11th-longest suspension bridge in the world."]}