{"name": "Tallahassee", "description": ["Home to some impressive antebellum architecture, an extensive Native American mission and a notable museum chronicling Florida's past, Tallahassee thrives on history. This northwestern Florida city was named the state capital in 1824 because of its prime location between two major cities: St. Augustine and Pensacola. Nearly 200 years later, Tallahassee is still a literal and figurative go-between. Nowadays, it sits between the hip, sizzling city of Miami Beach and the slow-paced, old-world charm of the state's more well-known southern hot spots. The state capital is also about 100 miles northeast of Panama City Beach, a popular spring break spot; 250 miles northwest of Daytona Beach, home of the Daytona 500; and 260 miles northwest of Orlando, where multiple theme parks are located. Tallahassee, therefore, is ideal for both visitors hoping to learn more about Florida history and vacationers looking to stay in a central jumping-off point while exploring popular neighboring cities.", "The best time to visit Tallahassee is anytime, really. There is no high or low season when it comes to room rates or flight deals, and the city is far enough away from the coast that it doesn't have the spring break appeal of other Panhandle locales. However, you should know that temperatures fluctuate between the low 40s and mid-60s in winter and the low 70s and low 90s in summer. And the area's lodging availability is largely determined by the school calendar: Rooms fill up quickly for football weekends, homecoming and graduation.", "It's a college town Every fall, you'll find both tourists and residents filling the football bleachers to cheer for the Florida State Seminoles or the Florida A&M Rattlers. Travelers also flock to both stadiums to watch each team's world-famous marching band perform.", "It's still southern South Florida's constantly evolving and ultra-hip cities might have made you forget where you are, but Tallahassee still boasts Southern politesse. Slow down and enjoy Tally's laid-back pace and small-town vibe.", "It's difficult to navigate by bus Even though the city's StarMetro bus system services several downtown attractions, venturing outside of the city, including to and from the Tallahassee International Airport, is not possible by bus. To visit other cities and attractions not in downtown Tallahassee, travelers should plan on renting a car.", "Avoid college football weekends Nightly hotel rates drastically increase during the weekends of FSU home football games and special events like graduation. To avoid paying these inflated rates, check the university's calendar before you book.", "Bring your student ID Students and those traveling with kids should bring school IDs when visiting Florida's capital. Many of Tallahassee's museums offer discounted admission rates for high school and college students.", "Stay downtown If you're not planning on renting a car (although we recommend you do), stay at a downtown hotel so you can save on cab fare and walk to many of the city's attractions, including the Florida Historic Capitol Museum and the Museum of Florida History.", "Like many other southern cities, casual American cuisine dominates the Tallahassee dining scene. However, because seafood reigns supreme in Florida, many Tallahassee eateries also offer a variety of fresh seafood dishes. For oysters and hush puppies, swing by the Shell Oyster Bar, a hole in the wall, cash-only eatery with friendly servers and excellent (albeit mostly fried) food. ", "Locals and visitors alike rave about the laid-back eatery Kool Beanz Cafe, which cooks up funky American dishes like the mojo spiced chicken, country fried chicken and linguine with crawdads (or crawfish as they're more commonly known outside of the South). Kool Beanz also offers a sizable beer and wine menu.", "Another local favorite is Wells Brothers Bar and Grill, a popular burger joint known for its specialty burgers, which range from the roasted red pepper and bacon-topped \"The Panhandler\" to the peanut butter and bacon-covered \"PB&J.\" For those looking to blend in with the locals, try \"The Gator-Hater,\" a classic burger with bacon and cheese that pays homage to Tallahassee's own Florida State University. Wells Brothers also offers pizza, salads and other casual fare for those looking for something different than a burger.", "For a more upscale menu with a chic atmosphere to match, try The Edison, which showcases Florida regional cuisine in a former power station. Cypress Restaurant, another fine dining favorite, features local seafood like diver scallops and grouper paella alongside cuts of steak.", "The best way to get around Tallahassee is by car. While the StarMetro bus system runs weekday and weekend routes to most downtown locations, many of the area's top attractions, as well as the surrounding cities, are only accessible via car. Even the Tallahassee International Airport (TLH), which is located about 7 miles southwest of downtown, can only be easily reached via car. "]}