{"name": "Newport, RI", "description": ["Hugging the southern tip of Rhode Island's Aquidneck Island, Newport is a ritzy weekend escape for all sorts. Girlfriends flit through the upscale shops that line Thames Street, while sailing crews take over Narragansett Bay in preparation for one of the many regattas. And like every other New England seaside destination, this port town is happy to provide a simple seafood lunch and a day at the beach. But what really calls tourists to Newport is the architecture: The 19th-century summer \"cottages\" on the shore and the colonial-era buildings downtown give the city an Old World, blue blood appearance.", "The mega-rich have moved on, leaving their mansions open for public tours and bed-and-breakfast stays, but you'll still spend a pretty penny for a weekend here. Newport's affinity for special occasion getaways (think bachelorette weekends and second honeymoons) drives prices up. But this port town's simple, seashore elegance is still worth the splurge. ", "The best time to visit Newport is between March and May and from September to November. In May (the end of the spring season) and September (the start of the autumn season), mild temperatures and few rain showers mean you'll have ideal weather for exploring the city's famous mansions. Plus, you'll avoid summer's swarms of tourists and high hotel rates. Once wintertime rolls around, expect chilly temperatures and plenty of snow. But if you can weather the low temps, you'll be rewarded with Newport's best hotel deals.", "Sip the Storm Newport Storm beer is a favorite with Newportonians and visitors alike. You'll see posters for this local brew plastered all over town. And brewery tours are free.", "Plan ahead for mansion tours The Breakers, Rough Point, the Marble House and other historic homes in the area do not allow strollers inside, so if you're traveling with children, be sure to leave the stroller behind.", "Skip the summer Like most New England waterfront destinations, Newport is stuffed to the gills with tourists in the summer months, making everything from parking to pricing difficult to swallow. Consider visiting in the shoulder season instead.", "Look for Discover Newport deals For savings on attractions and accommodations, check out the Newport tourism board's list of getaway packages and last-minute deals.", "Buy two- or five-house tickets for mansion tours If you plan on visiting more than one historic home in Newport, consider purchasing a two- or five-house tour ticket. Two-house tickets will save you $6, while five-house tickets include five house tours for $1 more than the cost of two individual tickets.", "With Narragansett Bay to the west and Easton Bay to the east, it's hardly surprising that Newport's dining scene focuses mainly on seafood. Regional seafood specialties include stuffies (or stuffed quahog clams), Rhode Island clam chowder (which has a clear broth unlike the clam chowders found in Manhattan and New England) and Rhode Island-style calamari (breaded and fried squid rings served with hot peppers). Newport eateries like Brick Alley Pub, The Port Seafood Grill & Bar and Midtown Oyster Bar all receive high marks for their seafood offerings.", "Other specialty Rhode Island items are also available in Newport. Johnnycakes (or flat cornmeal pancakes) can be tried at Bishop's 4th Street Diner. Apple-centric staples like apple cider, apple butter and apple pie (which use apples picked from some of New England's apple orchards) are sold throughout the city. And no visit to Newport would be complete without trying a glass of coffee milk. The milk and coffee syrup concoction is the official state drink of Rhode Island.", "The easiest way to get around Newport is on foot and by trolley. Many of the city's top hotels are located within walking distance of downtown Newport, and popular attractions like the Cliff Walk and Newport's historic mansions can be reached by the city's trolley. To get to and from T.F. Green Airport (PVD), visitors can drive, take a taxi or ride one of the city's buses. However, due to limited street parking (especially during the peak summer season), driving is not recommended."]}