{"name": "Oklahoma City", "description": ["Oklahoma City, the largest city in the state of Oklahoma, may prove surprising to some visitors who are only familiar with its western heritage. For instance, did you know the city is home to one of two museums in the U.S. dedicated to osteology (the study of the skeletal form)? Or that it hosts a museum all about the banjo? Or that it boasts one of the largest collections of Dale Chihuly glass in the world? Or that the shopping cart was invented here? That last one may not be as impressive, but it serves as a reminder of the city's appreciation for its (sometimes quirky) history.", "For a look at the culture and Wild West ideals that shaped OKC, head to the National Cowboy & Western Heritage Museum. Care to snag your own pair of cowboy boots? Take a trip to Stockyards City, home to the Oklahoma National Stock Yards, the world's largest feeder and stocker cattle market, where live cattle auctions still take place every Monday. And for a moving tribute to the victims of the 1995 Oklahoma City bombing, pay a visit to the museum and memorial, which uses interactive exhibits to spotlight how future generations can harness hope and resilience in the aftermath of tragedy. ", "Plan a fall trip The best time to visit Oklahoma City is between September and November, when the weather is mild. Summertime highs can soar past 90 degrees, making it uncomfortable to tour some of the city's outdoor attractions. Meanwhile, winter temperatures can dip below freezing.", "Saddle up Did you know OKC is known as the Horse Show Capital of the World? It hosts more national and international equine championship events than any other city across the globe. If you're looking for affordable family fun, consider attending one its many horse shows. You can find a list of events on the Visit OKC website.", "District-hop OKC is home to a variety of neighborhood districts that offer a peek into its past. Head to the Asian District for some of the city's best Vietnamese food, or the Paseo Arts District, home to more than 70 artists and a bevy of shops, bars and restaurants.", "Rely on your own two feet Many of the city's top attractions, including the Oklahoma City Museum of Art and the Oklahoma City National Memorial and Museum, are located within the downtown area, making it unnecessary to rent a car.", "Score discounts and deals Visit OKC offers lodging and attractions deals and discounts on its website. Check to see if any align with your trip dates or plans.", "Visit in the winter Temperatures and lodging rates fall come winter thanks to chilly 40-degree temps. For a dose of warmth, head to the Crystal Bridge Conservatory at the Myriad Botanical Gardens, which houses a variety of tropical and desert plants, as well as a waterfall.", "When deciding where to dine in Oklahoma City, you should use its diverse districts as your guide. It may come as a surprise, but OKC is home to a large Vietnamese population, which was the result of an influx of immigrants in the 1970s. You'll find a variety of Vietnamese restaurants in the Asian District, including local favorite Pho Ca Dao. If you venture a few blocks north of the Asian District, you'll find Sushi Neko, popular for its Japanese robata. ", "If you want to experience a bit of OKC history, head to Stockyards City for a meal at Cattlemen's Steakhouse, the oldest continuously operating restaurant in Oklahoma City. The historic eatery has hosted the likes of Reba McEntire, John Wayne, Ronald Reagan and George H. W. Bush. You'll encounter even more history in the Deep Deuce neighborhood, which once served as the epicenter for the city's African American population and its blossoming music scene. Slaughter's Hall, a bar and deli, celebrates the district's past with live jazz every week. For something a little more eclectic in Deep Deuce, head to Anchor Down, a gourmet corn dog eatery housed in a repurposed shipping container.", "And if you're on the hunt for a trendy atmosphere with a revered menu, you can't go wrong with a meal at Paseo Grill in the Paseo Arts District or Broadway 10 Bar & Chophouse in Automobile Alley. After the sun sets, head to Bricktown for the bustling nightlife."]}