{"name": "Madison, WI", "description": ["Despite being the home of the Wisconsin state Capitol and the flagship campus of the University of Wisconsin System, Madison maintains a small-town atmosphere. Though it's perhaps best known as the setting for the University of Wisconsin-Madison campus, the city is so much more than a hub of higher learning. Consistently ranked as one of the country's best places to live, Madison appeals to visitors and longtime residents alike with its five lakes, 200 miles of biking and hiking trails, and hip food and drink scene. ", "Though it's often overshadowed by more cosmopolitan cities to the east like Milwaukee and Chicago, the capital of America's Dairyland offers an ideal escape, especially for budget-minded families. Not only are many of the top attractions free, they're also kid-friendly: The Henry Vilas Zoo, the Olbrich Botanical Gardens and the University of Wisconsin-Madison Arboretum are all must-sees for those traveling with little ones. Meanwhile, culture hounds and foodies will be equally satisfied with a stroll down State Street thanks to the variety of museums and eateries everywhere from the university campus to the buzzing Capitol Square. No matter how you spend your days exploring, you'll want to cap off an evening (or two) watching the sunset with a brat and a pitcher of beer at the Memorial Union Terrace.", "The best times to visit Madison are from May to August and September to November. Similar to other Midwestern cities, Madison experiences all four seasons. But if you're not a fan of chilly temperatures and heavy snowfall, you'll likely want to avoid the city from December to April. During the summer months, Madison is much quieter since most of the university's more than 40,000 students have gone home. Plus, the pleasant 80-degree temperatures are perfect for enjoying the Memorial Union Terrace and the water activities on Lake Mendota. If you want to experience the city at its most vibrant, plan a fall trip when university classes are in session, students are on campus and Camp Randall Stadium is filled to the brim with passionate Badger fans on football game days. ", "Consider flying into Milwaukee Madison's Dane County Regional Airport (MSN) is small and only operates nonstop flights from 20-plus U.S. cities. If you're having trouble finding a nonstop flight or want more options, consider flying in and out of Milwaukee's General Mitchell International Airport (MKE). The international airport sits about 85 miles east of Madison and offers a variety of shuttle services to Madison, along with car rental options. ", "Avoid a winter visit Heavy snowfall and frigid, below-freezing temperatures can make a winter trip to Madison unpleasant. Though you'll likely score the lowest accommodation rates of the year, you'll have to sacrifice experiencing some of the city's top outdoor attractions.  \n ", "Indulge in cheese and beer Wisconsin isn't called America's Dairyland for nothing. You'll find deep-fried, beer-battered cheese curds on menus at eateries throughout the city. For the ultimate Wisconsin experience, pair your order of cheese curds with a pint of Spotted Cow farmhouse ale. ", "Take advantage of free attractions and events Admission to some of the city's top attractions, including the Henry Vilas Zoo, the Olbrich Botanical Gardens and the Chazen Museum of Art, is free. There's also no ticket required to attend some of the city's best annual events, including Concerts on the Square and the Dane County Farmers' Market.", "Dine near campus For budget-friendly meals, eat near the university campus. You'll find a collection of food trucks congregating at lunch on the Library Mall (near the University Book Store where State Street begins) and several fast-casual eateries along State Street that cater to the student budget. The closer you are to Capitol Square, the more expensive the restaurants tend to be.", "Explore on two wheels instead of four Madison is considered the bike capital of the Midwest, boasting more than 200 miles of biking and hiking trails. For help finding the best trails, consult the City of Madison website. Along with traditional bike rental shops, the city is also home to a bike-share system, Madison BCycle. "]}