{"name": "Bryce Canyon National Park", "description": ["Located in southwestern Utah, Bryce Canyon National Park occupies an otherworldly landscape composed of a dozen amphitheaters, or horseshoe-shaped canyons, on an eroded escarpment of the Paunsaugunt Plateau. The whimsical formations of limestone rock, created by erosion and rain, are entrancing to visitors who love to explore the slot canyons, windows, fins and, most notably, the tall, skinny spires called hoodoos. In fact, Bryce Canyon National Park boasts more hoodoos than any other place in the world. With elevations reaching 9,115 feet, Bryce offers about 150 miles of visibility on a clear day. Plus, since it's exposed to very little light pollution, the park offers optimal conditions for stargazing. In fact, in 2019 the International Dark-Sky Association designated Bryce Canyon an International Dark Sky Park. ", "The best time to visit Bryce National Park is May through September. Not only does this period offer the warmest weather of the year, it also yields plenty of ranger activities. October through April offers its own charms, too. There are fewer people, cooler temperatures and the fall foliage and wildflowers can be stunning. In the winter, the park is transformed by snow and visitors can go cross-country skiing and snowshoeing. But remember: Because of its high elevation, the weather at Bryce Canyon in the fall, winter and spring can be quite variable. It's a good idea to check the current conditions on the National Weather Service website before your visit. ", "Note: Bryce National Park is open 24 hours a day, year-round, but from October through May, some roads, campgrounds and other visitor facilities are closed or operate on reduced hours.", "Pay to play A vehicle pass to the park costs $35; an individual pass – for a pedestrian on a bicycle or on foot – costs $20. Each pass is valid for seven consecutive days.", "Wear proper footwear The National Park Service says visitors wearing the wrong shoes or boots (those not designed for hiking) is the number one cause for injuries and the top reason for rescues in the park.", "Park your car If visiting between mid-April and October, park your car and hop on the park's free shuttle. It reduces congestion in the park, allows you to sightsee and saves you from having to find a space in busy lots. Plus, your entrance fee covers unlimited use of the shuttle.", "Check the status Trails may close at any time due to unsafe conditions (think: rock slides, heavy rainfall, freezing temperatures and mud slides). Look at the park's current conditions to see if trails are closed before you hike.", "Visit on an entrance-free day All national parks offer free admission days during the year. You can expect free entry on Martin Luther King, Jr. Day (January) and Veterans Day (November). Find the complete list on the NPS website. ", "Pack a picnic There are several places to enjoy a picnic, so plan ahead and bring your own meal. You'll find picnic tables at the North Campground, Sunset Point, the General Store, Rainbow Point, Whiteman Bench, Yovimpa Point and Mile 4.5 of the park road. ", "The Lodge at Bryce Canyon, which is generally open from late March through early November, is the only lodging in the park. Here, visitors can eat at the restaurant, which serves breakfast, lunch and dinner. Menu items include seared salmon, sandwiches, burgers, noodles salads and bison stew. A menu for children is available as well. Also on-site is Valhalla Pizzeria, which serves up Italian cuisine.", "The General Store, located near the North Campground, offers grab-and-go items, such as pizza, salads and sandwiches, that can be eaten on the porch or at picnic tables. Meanwhile, the grocery section sells fresh, frozen and canned foods, as well as soda, water, coffee and beer. ", "You'll find more options on the outskirts of the park, including the popular Stone Hearth Grille, Ruby's Inn Cowboy's Buffet & Steak Room and Ebenezer's Barn and Grill.  ", "Most injuries at Bryce Canyon National Park can be avoided with proper preparation, common sense and caution. This includes wearing the right shoes, being aware of the weather and driving safely. As in any natural setting, never approach, startle or feed any wild animal you encounter. Observe wildlife from a distance, and make sure you have food contained properly.", "Though lightning is a year-round danger at Bryce Canyon National Park, it's especially threatening during the summer. Storms are most common in July, August and September but can happen any time of the year. To avoid injury, follow the NPS' rule of thumb, \"when thunder roars, go indoors.\" If you can hear thunder, that means lightning is within 10 miles. Head to a shelter or your vehicle immediately.", "As on any hike, preparation is key. Wear hiking boots with good ankle support and \"lug\" traction; don't climb or slide on cliffs (it's dangerous, as well as illegal); bring plenty of water to avert dehydration; stay on the trail; and wear a hat and sunscreen. It's important to remember that at Bryce Canyon National Park, elevations can reach 9,115 feet and Bryce's trails start at the top, which means you'll be returning uphill. ", "The best way to get around Bryce Canyon National Park is by shuttle and car. The park's free shuttle system operates from April through late October. If you're visiting outside those months, a car is the best way to get around. To reach the park, you'll need to have your own car since there is no public transportation to the park.", "Many visitors fly into McCarran International Airport (LAS) in Las Vegas or Salt Lake City International Airport (SLC), which are both located about 270 miles from the park. Car rentals are abundant at the airports and in the surrounding areas."]}