{"name": "Seychelles", "description": ["When the going gets tough, the tough get going — and the rest of us conjure our ideal escape, dreaming of a remote island with crowd-free sands, bright blue waters and a tranquil aura. But when you're ready to turn that dream into a reality, set your sights on Seychelles, a cluster of 115 islands peppering the Indian Ocean off the eastern coast of Africa. You may have caught sight of the scenery here before: The seemingly endless white beaches, giant boulders and swaying palms are the stuff of postcards, television commercials and desktop backgrounds. And while you're lounging along these famous shorelines, it's likely that the only other life forms you'll encounter will be the islands' colorful birds and humongous tortoises.", "The Seychelles islands are often referred to in two separate groups. Most travelers limit their exploration to the 43 Inner Islands, basing themselves on one of the group's three main isles. Mahé is the largest, home to the Seychellois capital, Victoria, as well as the famed Anse Intendance beach. Praslin, the second largest of the primary islands, also boasts several acclaimed shorelines, not to mention Vallée de Mai. And then there's La Digue, a quiet island where bicycles reign supreme and the sands of Anse Source d'Argent beach remain unspoiled. Charter a private yacht further out to sea and you'll likely stumble across one of the 72 Outer Islands, low-lying, sandy cays ruled by wildlife. It doesn't get more remote than that.", "The best times to visit Seychelles are April, May, October and November. These months represent the transition times between the hot and humid northwest trade winds (from November through March) and the cooler southeast trade winds that define April through October. A visit during these shoulder months offers more mild conditions ideal for sunbathing, wildlife watching and scuba diving. No matter when you visit, you'll encounter temperatures averaging in the 80s. But by frequenting the islands in the spring and fall, you'll also avoid the heavy tourist crowds that descend on the islands in December, January, July and August.", "Comprising 115 islands located off the eastern coast of Africa, the Republic of Seychelles (or simply Seychelles) was first settled by the French in 1770, who maintained ownership of the islands until 1814. Following the passage of the Treaty of Paris, Seychelles relinquished to Britain, which governed Seychelles until the archipelago achieved independence in 1976. In their short history as settled territory, the Seychelles islands have welcomed people of varying nationalities — European, of course, but also African and Asian — all of whom have left their imprint on Seychelles' culture.", "The island nation recognizes three official languages: English, French and French-based Seselwa Creole. Many Seychellois can also speak Italian or German, meaning there's no shortage of ways to communicate with islanders. You'll also recognize international influences in the islands' art and architecture; houses are reminiscent of Europe's Victorian era, seafood is prepared with hints of Asian and French cuisine, and Creole-style music and dance is infused with European, African and Malagasy melodies and movements.", "The price of most services — like hotel stays, taxi rides and meals at restaurants — already includes a 5 to 10 percent tip, although you're welcome to leave more if you wish. The official currency of the Seychelles islands is the Seychellois rupee (SCR), which is equal to about 6 American cents. However, credit cards and major currencies, such as the British pound, the euro and the U.S. dollar are all acceptable forms of payment. If you decide to use the Seychellois rupee throughout your stay, you'll find plenty of establishments that offer currency exchange services. But to avoid being scammed (or charged with a crime), only change your money at banks, hotel cashiers or the exchange bureau at Seychelles International Airport (SEZ). It is illegal to exchange currency with an unlicensed operator.", "Other than the occasional faux moneychanger, Seychelles is a relatively safe place to visit, though you should use common sense when it comes to your personal belongings and any late-night walkabouts. The sun actually poses the largest threat to unsuspecting visitors. Because of the Seychelles islands' location just south of the equator, you'll need to prepare yourself for powerful rays. Make sure that you are diligent about applying sunscreen and drinking water. It also doesn't hurt to bring a hat and some shades.", "While visiting Seychelles, you should be careful to leave the islands as pristine as you found them. Do not take shells from nature reserves or marine parks and do not disturb the wild flora and fauna.", "The best way to get around Seychelles depends on where you're based: Bus service is commendable on both Mahé and Praslin, while visitors to tiny, flat La Digue would benefit most from a bicycle. If you're planning to travel between islands, Seychelles' ferry services are both convenient and reliable. Taxis can also be found on all three of Seychelles' main islands (though less easily on La Digue), and serve as the most convenient way to get from Seychelles International Airport (SEZ) on Mahé's east coast to Victoria and other destinations around the island. You'll find airports on Praslin and several other smaller islands, which are serviced by Air Seychelles and a few other airlines offering inter-island transportation.", "In order to enter Seychelles, you must present a valid passport, an onward or return ticket and proof of accommodation and sufficient funds. If you are traveling through another African country on your way to Seychelles, you may be required to present proof of yellow fever vaccination if you travel through an infected area within six days prior to arriving in Seychelles. For more information, visit the U.S. State Department website."]}