{"name": "Arches National Park", "description": ["Traveling to Arches National Park is like visiting another planet, one with thousands of natural sandstone arches, red rocks and landforms in amazing configurations, and light that seems to change every moment. The way the shadows play across the arches makes the park especially intriguing for photographers, who are drawn to capturing its enchanting vistas at dawn and dusk in particular. But Arches National Park is not just a shutterbug's paradise.", "Sitting 5 miles northwest of Moab, Utah, the park boasts 26 miles of scenic road and hikes for every level of fitness. Hikers can choose from a wide variety of trails, from short 20-minute walks to Balanced Rock and the Double Arch, to more remote and challenging treks through the Fiery Furnace and up to Delicate Arch. When you need to come back down to Earth, simply look up: the Colorado Plateau is home to some of the darkest skies in the contiguous United States, yielding impressive views of the Milky Way.", "The best time to visit Arches National Park is April through May and September through October, when daytime temperatures average about 60 to 80 degrees. In the summer, temperatures can exceed 100 degrees, which can make exploring the park's trails very uncomfortable. In late summer, violent storm cells often cause flash floods, which can be quite dangerous if you get caught unaware. Winter can be a lovely time to visit, with fewer crowds, though occasional snow and ice can make trails slippery. In addition, there are no ranger programs offered at that time. However, the visitor center is open daily.", "Pay to play A vehicle pass to the park costs $30; an individual pass – for a pedestrian on a bicycle or on foot – costs $15. Each pass is valid for seven consecutive days. To save some time at the entrance gate, pay your admission fee in advance online. Just make sure you print the receipt and bring it with you.", "Go early or late If you want to avoid a long wait at the park entrance, arrive between 7 and 8 a.m. or between 3 and 5 p.m. (or even earlier or later on weekends).", "Expect parking headaches With more than 1.5 million annual visitors, Arches is a busy park. In high season (May to October), expect limited parking at the park's top attractions.", "Strategize If you're limited on time, the National Park Service recommends driving to the Windows Section or the Delicate Arch, two of the park's most popular attractions.", "Visit on an entrance-free day All national parks offer free admission on select days of the year, including Martin Luther King Jr. Day, the first day of National Park Week (in April) and Veterans Day, among others.", "Camp out With campsites starting at $25 a night, roughing it can save you a bundle. The Devils Garden Campground is 18 miles from the park entrance. Book well in advance, though, as spaces fill up fast.", "Pack a picnic There are several areas to picnic in the park, including next to the visitor center, across the road from Balanced Rock and at the Delicate Arch Viewpoint. These have picnic tables and restrooms nearby. Some also have fire grates. ", "There are no restaurants or lodges in Arches National Park, so you'll need to bring your own food or plan to dine in neighboring Moab, Utah, about 5 miles from the park entrance. There are several places to picnic throughout the park, so plan ahead if you want to eat with Arches as your backdrop. You’ll find tables near the visitor center, the Delicate Arch Viewpoint and across the road from Balanced Rock.", "All types of cuisine, from American to Thai, can be found in Moab. For a casual meal, the Moab Diner and Ice Cream Shoppe is a local favorite thanks to its burgers, shakes and reasonable prices. Love Muffin Cafe is also a great place to grab a quick bite before heading to the park in the mornning. Another highly recommended restaurant is the Desert Bistro, located in a charming converted adobe house. The menu changes regularly with the season, but diners can count on seafood flown in from the coast (east or west), handmade pastas and organic meats. Meanwhile, the Moab Brewery is a fun spot to try a local brew and dine on pub food.", "Arches is full of hiking trails that range in difficulty. Some trails require scrambling up rocks or walking along slick surfaces, so be sure to wear proper footwear with enough grip to keep you from slipping. Some hikes, specifically in the Fiery Furnace area, are only accessible with a ranger-guided tour or with an indiviudal permit for safety reasons. Do not attempt to hike this trail without permission. If you're planning a nighttime hike or stargazing excursion, be sure to pack flashlights and warm clothing.", "Daytime temperatures in southern Utah can often exceed 100 degrees in the summer months, so it's important to pack enough water on your hiking trips. The sun is also incredibly strong in the summer, so sunscreen and hats are necessities as well. Most trails in the park are open yearround, but in the event of snow during the winter months, be sure to abide by trail closures and only hike where the park allows.  ", "The park is home to an array of small animals, including lizards and small mammals. However, hikers should also stay alert for the occasional bobcats or mountain lions. Desert animals usually come out at night, so stay aware of your surroundings if you're in the park after dark.\n ", "The best way to get around Arches National Park is by car. There is no public transportation inside Arches National Park, though commercial tours are offered by companies in Moab, Utah, which sits about 5 miles southeast of the park entrance. Visitors can also ride bikes in the park, though there are no bike lanes or shoulders, so this is more of an option for experienced cyclists. The entrance to the park is north of the town of Moab.", "Most travelers fly into Canyonlands Field Airport (CNY), about 14 miles north of the park entrance; Grand Junction Regional Airport (GJT), about 110 miles east of the park entrance in Colorado; or Salt Lake City International Airport (SLC), about 230 miles north of the park entrance. Rental cars are readily available at all airports."]}