{"name": "Williamsburg", "description": ["For such a historical town, Williamsburg is fairly new. It wasn't until the 20th century that the downtown area of this Virginia Peninsula city was restored. Now you can tread the same steps that our Founding Fathers once took – in fact, in Williamsburg, you just might even find yourself trekking alongside those men (or at least, alongside some talented, costumed interpreters acting out their parts). The area isn't a novelty, though. Instead, Williamsburg and nearby locales like Jamestown and Yorktown are breathing monuments to some of the best-known figures of our colonial history. Patrick Henry, George Washington, John Smith, Pocahontas and more – and they all receive their due.", "Give yourself timeThere are a surprising amount of things to do in this small town and you won't want to rush your history lessons or amusement park fun.", "Buy a combo pass Several attractions in this city have steep daily admission fees. However, if you're in town for a few days, you should buy a combo pack so you can visit multiple historical sites and amusement parks – and save some coin.", "Skip the summer visit Williamsburg can get packed when schools are out during the summer. Consider visiting in the fall, winter or early spring to avoid the hordes of families with kids.", "Ride the ferry The Jamestown Ferry is free to ride, a hit with kids and gives you a great vantage point of the shoreline from the James River. The ferry travels between Jamestown and Scotland, on the southern riverbank.", "Whether you're interested in sampling Colonial fare or trying something more modern from the city's growing culinary scene, you'll find plenty of restaurants to pique your interest in Williamsburg. Several 18th-century-style taverns dish out authentic meals and comfort food from the traditional (such as prime rib, ale marinated beef and herb roasted chicken) to the more unique (like peanut soup and Colonial game pie). King's Arm Tavern and Shields Tavern earn kudos for their wonderful atmospheres, variety of dishes and authentic tavern feel.", "When it comes to modern fare, visitors and locals say a few restaurants hit the mark. The Fat Canary wins over diners with its tasty seasonal dishes and fine wine; Food for Thought is praised for its inventive menu of American classics; and A Chef's Kitchen impresses foodies with its upscale fixed-price, five-course dining experience (Champagne and paired wines included)."]}