{"name": "Boulder", "description": ["Although it's practically a suburb of Denver, Boulder seems worlds away from its Mile High comrade. A university town stuck in a '60s mindset, Boulder has welcomed every conceivable trend – from alternative healthcare to fad diets – and a perpetual love for nature has made bicycles the choice mode of transportation. Though the city is known less fondly by more conservative Coloradoans as \"The People's Republic of Boulder\" and \"28 square miles surrounded by reality,\" those who live here (or visit frequently) do so for the love of urban parks, crisp mountain air and a free-spirited ambiance. Come for a spot of herbal tea, a quality education and a strong helping of liberalism.", "While granola-lovers are common characters in this town, Boulder appeals to a much broader public with its thriving arts scene, trendy shops, bubbling breweries and cozy cafes. Hikers can stretch their legs along the Boulder Creek Path or on the trail to the Flatirons, while more leisurely strollers can get their exercise while perusing the shops at the Pearl Street Mall. And like most college towns, Boulder boasts a bevy of bars and brewpubs (many located near the University of Colorado) coming to life once the sun sets.", "The best times to visit Boulder are January to March and June to August. Although the city can be pleasurable at any time of year (its high elevation ensures a mild climate), Boulder's winter and summer seasons experience the most consistently enviable weather and numerous festivals. Winter can be cold, but ample amounts of fresh powder dumped on nearby mountains call to skiers and snowboarders. And though the summer months often see temperatures in the high 80s, cooler air in the mountains makes for some great hiking conditions. The spring and fall are much less predictable, with rain showers punctuating otherwise temperate days and overnight chills leaving layers of frost on the mountains. Whenever you decide to visit, plan to dress in layers so you're ready for all temperatures.", "Get outside Boulder is surrounded by more than 31,000 acres of recreational parks and nature preserves. You would be remiss if you didn't spend some time in the great outdoors.", "Don't forget a jacket Weather can be fickle no matter the season. And if you're planning to spend some time in the Rockies, you should note that mountain temperatures are generally 15 to 20 degrees cooler than in town.", "Come hungry Boulder's young, hip vibe is a draw for budding restaurateurs. The city overflows with trendy eateries serving everything from bulging burritos to gourmet organic cuisine.", "Two wheels are better than four Renting a bike is often much cheaper than renting a car. Plus, you won't have to worry about finding (or paying for) parking. You'll find a variety of bike rental companies in and around the Pearl Street Mall.", "Lay your head in Denver Boulder's hotel options are limited, so you'll have a better shot finding budget-friendly room rates in nearby Denver. Public transportation makes it easy to travel between the two towns.", "Satisfy your appetite on University Hill Most of the restaurants in this area cater to a student budget, so you're bound to find some cheap eats here. You can also save on midday meals by picking up some fresh local ingredients at the farmers market and going the picnic route.", "Boulder excels at offering an active vacation full of calorie-burning activities. Luckily, it also excels at providing visitors plenty of delicious ways to refuel after a day tackling the mountains. Once dubbed \"America's Foodiest Town\" by Bon Appétit Magazine, Boulder boasts an award-winning dining scene helmed by James Beard Award winners, along with \"Top Chef\" and Food Network contestants. True to the city's nature-obsessed ethos, many of the restaurants in Boulder plate farm-to-table cuisine (Blackbelly Market is a favorite), and it's a label you'll likely see many eateries around town proudly sport. Vegans, vegetarians and those on a gluten-free diet, rejoice! Boulder also knows how to cater to your dietary restrictions (Shine Restaurant & Gathering Place, in particular).", "To start your day, head to The Buff Restaurant, one of the most popular breakfast spots in the city. If you're looking for a more eclectic menu, head to the Boulder Dushanbe Teahouse. An attraction in itself, the ornate teahouse was originally built in Dushanbe, Tajikistan, as a gift to its sister city, Boulder. It was sent to the city as a symbol of friendship and cultural exploration. On the hunt for cheap eats? Start your search near the University of Colorado Boulder campus, which caters to a student budget (The Sink is a favorite for its burgers).", "If your taste buds and your wallet are ready for something a bit more upscale, Pizzeria Locale, the next door Frasca Food & Wine and Mediterranean Restaurant are all high up on local foodies' lists.", "The best ways to get around Boulder are by bike and bus. Bike paths and trails meander throughout the city and nearby parks, and you can rent your own set of wheels for between $40 and $60 a day at local bike shops. If you grow weary, the Regional Transportation District operates extensive bus and shuttle routes throughout the city. Getting to Boulder may seem like a feat: The city does not have its own airport, meaning visitors must pass through Denver. But making your way to Boulder from the Denver International Airport (DEN) – located about 45 miles southeast of the city – is actually easy. You can ride RTD (at $9 one-way, this is the cheapest, yet most time-consuming option) or hop on the SuperShuttle or Green Ride Boulder. Cabs and rental cars are also available at the airport, but one-way taxi rides cost a flat rate of $88.57 and you'll have to grapple with limited parking if you decide to drive."]}