{"description": ["When travelers think of Louisiana vacation destinations, New Orleans is likely the first place that comes to mind. But about 80 miles northwest sits the state's capital that's equally rich in attractions, history and culture. French explorers named the city Baton Rouge in the early 1700s after coming across reddened cypress poles that local Native American tribes used to designate hunting grounds (\"red stick\" literally translates to baton rouge in French). Today, locals still refer to the city as \"The Red Stick,\" and there's a commemorative Red Stick sculpture on Southern University and A&M College's campus.", "Along with Southern University, Baton Rouge is also home to Louisiana State University. Known for its memorable football game days, LSU also boasts a live mascot – Mike the Tiger – which travelers can visit before or after attending a game at Tiger Stadium. Those more interested in history will have their pick of not one but two capitol buildings and can even step back in time for a glimpse at what life was like centuries ago with a visit to the LSU Rural Life Museum. Baton Rouge may not have the flash of its southern sibling, but it will still deliver on Cajun cuisine, unique history and raucous Mardi Gras celebrations. Plus, it's within easy driving distance of some of the best Louisiana swamp tours.", "The best time to visit Baton Rouge is March through May and September through November. The spring and fall months offer highs in the 70s and 80s and plenty of events. Winters here are mild, with high temperatures hovering in the mid-60s and lows that rarely dip below the 40-degree range. Plus, the city hosts a variety of holiday-themed events around Christmas, as well as its annual Mardi Gras celebration in February. Nightly average hotel prices remain consistently below $200 throughout the year, but do see a slight increase in the fall, in part thanks to football game days at the city's two major universities, Louisiana State University and Southern University and A&M College.", "Mardi Gras is big here, too Though the celebration in New Orleans gets most of the attention, Mardi Gras in Baton Rouge is equally momentous. In addition to a variety of parades, restaurants, food trucks and bakeries around the city join in on the celebration by selling king cakes. If you're looking to avoid the hubbub, don't plan a February visit.", "Time your visit for crawfish season While in Louisiana, sampling some local crawfish is a must. Crawfish season typically spans from November to July, but you'll enjoy the best crawfish from late February through May.", "Pack your purple and gold If you're planning to attend a football game at Tiger Stadium, make sure you're wearing the home team's colors. If you're looking for a prime tailgate spot, head to the LSU Parade Ground.", "Consider a daytrip If you're interested in learning more about Louisiana's swamps, consider signing up for one of the best Louisiana swamp tours. Many are within a quick drive of Baton Rouge and offer a glimpse at local flora and fauna unique to the state.", "Ride the trolley The Capitol Park Trolley Service is a free shuttle that offers transportation weekdays from 10:30 a.m. to 2:30 p.m. Trolleys run every eight minutes and provide service to many of the city's top attractions, including the USS Kidd, the Old Governor's Mansion and the Louisiana State Capitol.", "Take advantage of First Free Sundays Several of the city's museums, including the USS Kidd and the Louisiana Art and Science Museum, offer free admission on the first Sunday of every month.", "Consider flying into New Orleans If flights into Baton Rouge Metropolitan Airport are too expensive, consider looking at flights in and out of Louis Armstrong New Orleans International Airport, which is located about 70 miles southeast of Baton Rouge.", "The exterior of Louisiana's Old State Capitol resembles a medieval fortress and is accented with towers, stained-glass windows and a cast-iron spiral staircase."]}