{"name": "Rome", "description": ["Rome, the city of seven hills, enjoyed a mythic beginning. Romulus and Remus – twin brothers who were nursed by a she-wolf and fathered by a war god – reportedly founded the Eternal City. And although historians are a little skeptical about this epic entry into the world, most travelers are absolutely certain that there is something magical about Rome. Whether it's the mystery of nearby Vatican City or the ghosts of the Colosseum, an afternoon caffè on Piazza Navona or a piled-high plate of pasta at a trattoria, Rome is sure to enchant.", "Italy's capital city, Rome is also known for a history that dates back to the eras of Octavian, Julius Caesar and Hadrian, among others. Left behind are structures like the Pantheon, the Roman Forum and dozens of churches, among other historic gems. Art enthusiasts will relish the trove of art housed at the Vatican Museums, and foodies will enjoy the splendid Italian fare, not to mention the gelato. And though its momentous past is the focus for many vacationers, Rome is also a fast-paced, modern and relevant city, with gleaming designer storefronts, sleek hotels and cutting-edge restaurants.", "The best time to visit Rome is from October to April when most of the tourist crowds have dissipated and room rates are lower. Although you'll need a warm coat, weather this time of year hardly ever dips below freezing. For warmer weather – without throngs of tourists and the sweltering humidity – come in May or September. High average temperatures flit between the mid-70s and the lower 80s.", "Il conto, per favore If you need the bill at a restaurant, be persistent yet pleasant in asking. Life moves slower in Rome, so asking for your check once doesn't necessarily mean it's on the way.", "Speak Italiano When in Rome, do as the Romans do and at least try to speak a little Italian. \"Hello\" is ciao, \"please\" is per favore and \"thank you\" is grazie.", "Take a tour Overwhelmed by the amount of things to see and do in Italy's capital? Consider taking a guided tour for a crash course in Roman life and culture.", "Buy the Roma Pass This money-saving pass gives you free or reduced admission to museums, discounts on certain exhibits, and free travel on public transportation for up to three days.", "Visit on Sunday The Vatican Museums are free to visit the last Sunday of the month, while state-run sights, such as Musei Capitolini and the Colosseum, offer free entry the first Sunday of the month.", "Trying to look like a resident isn't difficult, especially if your own wardrobe is filled with high-end designer labels. Men wear immaculately cut suits. On the streets, snug jeans and fitted shirts are the norm for both men and women.", "Rome's official currency is the euro. Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops. ", "The official language in Rome is Italian, and while it's advisable to learn a few phrases – ciao for hello; addio for goodbye; per favore for please, among others – most tourist-facing institutions, whether hotels or attractions, will have people that can communicate in English.", "Rome is overflowing with restaurants, from trattorias that cook up family recipes spanning generations to fusion restaurants that plate up the latest culinary trend. Don't miss out on Roman specialties – such as artichokes, which are so beloved they have a protected status from the European Union. Try them at Rome's Nonna Betta. Cacio e Pepe is a simple pasta dish flavored with Pecorino Romano cheese and black pepper, and it originated in Rome. If you add smoked pork jowl and egg, you get another Roman pasta dish, carbonara. ", "Although the Lazio province – the region in which Rome sits – doesn't produce the world-renowned wines of other parts of the country, Rome nonetheless overflows with wine. Try a glass or two at popular wine bars, such as Enoteca il Goccetto, Cul De Sac or Trimani Enoteca – or with your meal at just about any of Roma's restaurants. ", "Coffee is an art in Rome, and to enjoy one of the best espresso drinks, try out the Caffe Sant'Eustachio, established in 1938, or the Antigua Tazza d'Oro near the Pantheon. ", "If you're looking to dine at Michelin-rated establishments, you'll have quite a few options. La Pergola, housed inside the luxe Rome Cavalieri Hotel, has three stars, while Il Pagliaccio, which serves up a modern twist on traditional Italian dishes, has two stars. ", "For a more rustic, homestyle (not to mention cheaper) dining experience, visitors might want to try out Casa Manco for pizza and Pane e Salame for sandwiches, among several thousand other establishments. If you have limited time in Rome and are interested in a culinary crash course, consider signing up for a food tour. Most tours last several hours and include tastings at a variety of local shops and restaurants. Popular operators include, Cook With Us in Rome, Eating Italy Food Tours and LivItaly Tours.", "As always, visitors should use common sense when traveling and watch out for pickpockets on public transportation or in and around heavily touristed attractions. Due to an increased number of terrorist attacks in Europe in recent years, the U.S. State Department advises travelers to be on alert in tourist locations, transit hubs and markets.", "The best way to get around Rome is on foot. And because many of the best attractions are clustered together in traffic-free zones, walking makes the most sense. However, some places, like Vatican City, are pretty far from the central historic district, necessitating the use of the metro or a taxi. A nonstop express train (the Leonardo Express) can take you from the Leonardo da Vinci-Fiumicino Airport (FCO) to the Rome Termini railway station in a little more than 30 minutes; one-way tickets cost 14 euros (about $17). Buses are also available, but these aren't recommended because of crowded conditions aboard and heavy traffic outside. If you must bring a car to Rome, you should park it as soon as possible once you enter the city limits. Otherwise, you'll find heavy traffic, impatient drivers and pedestrian-only areas make driving around virtually impossible.", "A passport with at least six months of remaining validity is required for United States citizens traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements."]}