{"name": "Milan", "description": ["If easygoing Italy is what you're looking for, book a vacation in Tuscany or Sicily. Milan, like New York City or London, is go-go-go. Home to Italy's stock exchange and fashion week, plus a hot nightlife, Milan is very much like many other major international cities. Still, there are subtle differences: For one, calcio (soccer) – the city goes crazy for it, especially at San Siro stadium. Milan also contains some awe-inspiring examples of Italian art and architecture – from \"The Last Supper\" mural to the magnificent Duomo. And it has creative genius, from its inventive furniture makers to its fashion design. So, if you want to shop and party till you drop, enjoy some cultural masterworks and nosh on Italian treats from cappuccino and biscotti to sparkling wines and risottos, Milano is the place for you.", "The best times to visit Milan are April to May or September to October. These spring and fall months straddle the city's manic peak tourism season, and they also escape the summer's sweltering temperatures. The months between November and March constitute the offseason and are characterized by high average temps in the 40s and 50s, fog and fewer holiday tourists.", "Beware of pushy vendors Groups of aggressive salespeople – congregated around popular landmarks or metro stops – will try and badger you into buying their souvenirs. Say a loud, firm \"no,\" and walk on quickly.", "Skip fashion week Unless fashion is your passion, avoid these weeks in February and September – and opt for a less crowded (and inexpensive) time to visit.", "Walk when you can Milan is pretty big, but some of its biggest attractions, including the Duomo, Galleria Vittorio Emanuelle II, Ambrosiana Library & Picture Gallery are less than a half-mile from one another. \"The Last Supper\" is a mile away from the Duomo.", "Indulge in aperitivo Aperitivos are happy hours for Milanese. Order signature Milanese cocktails for less, including negronis or spritz, which is a blend of prosecco, soda water and a fruity aperitif.", "Don't stay by the Duomo The Duomo is undoubtedly the city center for both locals and tourists. Accommodations here will always be more expensive, so consider bedding down in other neighborhoods to save some money.", "Milan is the antithesis of what many imagine an Italian city to be. Despite their notoriously large crowds, Florence and Venice are the kind of destinations teeming with so much beauty, it would be a crime not to slow down and revel in their unmatched scenery. Rome's good looks afford it the same status, but due to its large size, adds a hearty dose of hustle and bustle into its intoxicating mix. But despite being Italy's cultural capital, and biggest city, Rome is not an industry center the same way that Milan is. Milan acts as the country's finance and fashion capital. Here, business takes center stage in a way that it doesn't in other Italian cities. Thus, you can expect a much faster pace of life here.", "Aside from its business savvy, Milan brims with cafes selling espressos, tucked away trattorias serving delectable pastas, gelaterias and plenty of cultural landmarks, such as the beautiful Duomo, \"The Last Supper\" and the Teatro Alla Scala, considered one of the most beautiful opera houses in the world. The city also has one of the most successful soccer teams in the world, A.C. Milan. Like the rest of Italy, the spoken language is Italian and the currency here is the euro. Check the exchange rate before you go, as it can fluctuate. Italians don't tip, as a service charge is usually added to a restaurant bill. However, if you are at a fine dining restaurant or really enjoyed your meal, 10% is sufficient.", "While in Milan, you'll no doubt find plenty of pasta, espresso, gelato and pizza, but you'll also want to sample Milanese cuisine. Similar to other regions in Italy, including the Amalfi Coast and Naples, Milan has its own culinary identity that features specialty dishes native to the region. The most important dish is Milanese risotto or risotto alla Milanese. It's unique primarily for one ingredient: saffron. It is said that the artist, not chef, who created it wanted to make his risotto more appealing to his guests, so he added the saffron to turn it yellow. ", "Another must-try dish in Milan, which is often accompanied by saffron risotto, is the ossobuco, a flavorful veal shank. After being fried in onions and butter, the veal shank is left to marinate for hours in a simmering tomato broth accompanied by vegetables and white wine. Another popular veal dish to try is cotoletta. It may look a lot like Wiener schnitzel and that's because it might actually be. The history on whether it was invented by the Milanese or the Austrians isn't completely clear. Regardless, you can dig into this pan-fried, buttery- and bread crumbed-goodness most places in Milan. ", "Whether you're an omnivore or carnivore, don't skimp on the bread or cheese here. The Lombardy region, for which Milan calls home, is known for its cheeses, specifically gorgonzola, mascarpone and Grana Padano, similar to Parmigiano-Reggiano. For breads, there is michetta, a star-shaped white bread often referred to by the Italians as the bread of the Milanese. There's also the panettone, a dessert bread made with candied fruits typically consumed during the holidays. And while here, don't forget to order a Negroni cocktail. This famous gin-, Campari- and –vermouth cocktail, garnished with an orange peel, was invented in Milan, particularly at the Bar Basso. ", "The best way to get around Milan is by the efficient (and inexpensive) public transportation system called the ATM. This system of subways, buses and trams is extensive and affordable. Metered taxis are another good option, though they can get expensive if you use them as your sole form of transportation. If your hotel is near the Duomo, which is considered the city's center, you might just want to walk, as lots of other attractions and amenities can be found blocks away. Driving in Milan, as in other major European cities, is not recommended because of traffic and parking that is both expensive and limited. ", "Two airports serve Milan: The Milan Malpensa Airport (MXP) is a little more than 30 miles northeast, and it welcomes in most international flights; the Milan Linate Airport (LIN) is only about 5 miles from the city center, but it handles fewer flights (some European, but mostly domestic). To get to the city center from Milan Malpensa, you can take the Malpensa Express for 20 euros, or about $ 22 (for a round-trip ticket). From Linate, there isn't a train that goes into the city. Instead, take the No. 73 bus to get into the city. Taxis are another option, but an expensive one. Expect to pay between 40 to 80 euros (about $47.85 to $95.70) from Linate (depending on your destination) and 110 euros (about $121) from Malpensa to get to the city center.", "U.S. News Insider Tip: Milan’s trams, some of which are nearly a century old, are a must-see. Catch tram No. 1 in front of Sforza Castle and you’ll ride along one of Milan’s most beautiful streets to see La Scala, the Arco della Pace and more. – Nneya Richards", "A passport with at least six months of remaining validity is required for United States citizens traveling outside the mainland by air or sea, as well as for U.S. citizens trying to re-enter the country. U.S. citizens do not need a visa unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on foreign exit and entry requirements."]}