{"name": "Guadeloupe", "description": ["There's no doubt Guadeloupe possesses a certain je ne sais quoi – a spark that separates its sunwashed coasts from other Caribbean getaways. Sparkling white- and black-sand beaches extend into calm, cerulean waters, and verdant forests border the imposing La Soufrière volcano. And just a few miles south, quaint villages welcome visitors to centuries-old distilleries and remote sugar plantations. Put simply, Guadeloupe features an unspoiled natural setting with rustic charms. But that's not all this picturesque cluster of islands has to offer. Where else can you savor the sweet aroma of sugar and rum wafting through the air, taste tantalizing French-Creole flavors and lay your towel down along untouched stretches of sandy bliss?", "But before you soak up Guadeloupe's sun and splendor, you'll need to get oriented. Guadeloupe's \"mainland\" constitutes two distinct islands: Basse-Terre (which is also the name of the region's capital city) and Grande-Terre (the islands' luxurious resort haven), which together form the shape of a butterfly. Basse-Terre comprises the western wing; Grande-Terre makes up the eastern wing. Marie-Galante, La Désirade, and Les Saintes form a cluster of outer islands surrounding Basse-Terre and Grande-Terre. Each isle is secluded, enchanting and worthy of a daytrip. But if you're only visiting for a few days, don't miss your chance to indulge in a zesty lambi (conch) dish or sail around the islands' arresting archipelago.", "The best time to visit Guadeloupe is from December to May, when the weather remains warm and dry and daily highs rest in the mid-80s. Though pleasant temperatures last year-round, August and September's hurricane season can threaten your travel plans. And June, July, October and November's frequent showers and high humidity can put a damper on sightseeing. That said, if you don't mind the rain, you're likely to find significantly reduced room rates and fewer tourists at the end of November as the showers start to subside.", "Guadeloupeans are known for their friendly demeanor and hospitality toward visitors, but you might encounter some language barriers outside of regular tourist spots. Like Martinique, Guadeloupe's official language is French, but many Guadeloupeans speak French Creole as well. While there are English speakers at the resorts and other popular tourist areas, brushing up on your French and packing along a phrasebook can help topple the language barrier. Learning simple French terms, such as \"bonjour\" (\"good day\") and \"parlez-vous anglais?\" (\"do you speak English?\") will serve you well.", "You'll also want to be mindful of wearing revealing swimwear or clothes beyond the shore as it could be offensive to Guadeloupe's more traditional older generation.", "As part of the French West Indies, Guadeloupe falls under the French monetary system, making the euro the island's official currency. U.S. dollars are not accepted at most places, and some ATMs do not accept foreign bank cards. Plan ahead by exchanging money before your trip or visit a trusted currency exchange at the airport. If you run out of cash during your trip, your hotel concierge should be able to direct you to a reputable exchange center.", "When it comes to tipping, restaurants generally add 15% in gratuity plus tax to the bill, so there's no need to leave extra. Hotels typically tack on a 10% to 15% service charge, but for particularly attentive staff, it's standard to leave an additional 10%.", "Naturally, Guadeloupe is heaven for seafood lovers, but there are plenty of cuisines to please every appetite. Many spots specialize in French and Creole dishes, with a focus on using lots of spices and local fish and produce. Looks for dishes, such as accras (fritters made from cod or vegetables), callaloo (an herb soup made with bacon and a spinach-like leaf), migan (bananas and breadfruit), along with classics like moules et frites (mussels in broth served with French fries), on local menus.", "You'll also want to seek out bokit, a deep-fried naan-like bread stuffed with meat and vegetables and served with a refreshing hand-mixed coconut sorbet. Another sweet treat is tourment d'amour, which is a traditional tart made with coconut, banana or guava tart. It gets its name from wives of Les Saintes sailors, who made them while waiting for the return of their husbands at sea. And, of course, imbibe in a locally made rum to wash it all down with.", "The best way to get around Guadeloupe is by car, which you can easily pick up at Pointe-à-Pitre International Airport (PTP) in Grande-Terre's main city, as well as at popular resort areas. Another option is hailing a taxi, which you can do from the airport or major resort hubs. However, having your own set of wheels makes it easier to explore Guadeloupe's main islands, Grande-Terre and Basse-Terre. If you're planning to island-hop to Les Saintes, Marie-Galante and La Désirade, you'll need to catch a ferry from Pointe-à-Pitre.", "Whether you're arriving by air or by sea, you'll need a valid passport with at least six months of remaining validity and a return ticket or proof of continued travel to enter Guadeloupe. For more information, visit the U.S. Department of State's website."]}