{"name": "St. Barts", "description": ["There's no doubt that the French Caribbean island of St. Barthélemy (or St. Barts) is in vogue with A-listers and yachters alike, and oftentimes appears out of reach for the average traveler. But it's far from snooty – if the sight of those free-roaming iguanas is any proof – and it's also more accessible than you might think. Careful and early planning will ensure that your island getaway is priced on par with other Caribbean destinations.  ", "The island is ideal for those seeking a Euro-themed utopia with plenty of stunning beaches, upscale hotels, private villas and trendy restaurants. Those looking for an island with exciting nightlife and offshore activities should check out St. Barts' cousins, Martinique or St. Martin, for more diversions. ", "The best time to visit St. Barts is from April to June. These three months fall in a more affordable sweet spot just after the über-expensive winter and before the storm-prone fall. Temperatures don't vary much – they're usually somewhere between the low 70s and low 90s all year – but there is considerably more rain in September, October and November. Showers are infrequent in winter and early spring, but you'll pay handsomely for the privilege of visiting during this time.", "Prepare for a long journey There are no direct flights from the U.S. to St. Barts' main airport, Gustaf III Airport (SBH). From your departure point, you'll likely fly into St. Martin's Princess Juliana International Airport (SXM) before hopping on a small plane to St. Barts. You can also board a ferry in St. Martin if you'd rather arrive by sea.", "You'll need four wheels If you want to explore all the beaches and trails that the island has to offer, you'll need to rent a car. Taxis are few, and ride-hailing services are nonexistent. There are multiple car rental agencies at the airport and many hotels or vacation rental agencies will reserve cars for you. Any valid foreign driver's license is acceptable to drive on the island.", "Fill up during the week There are only two gas stations on all of St. Barts, and both are closed on Sundays. If you're driving on \"E,\" handle your business before the week's end.", "Pack a picnic You won't find cafe culture here (too expensive), but you will find picnicking is all the rage. Upon arrival, you should swing by the Marché U grocery store that's close to the airport to stock up on American and European food favorites. Or, consider stopping by a bakery, such as the popular La Petite Colombe, for breakfast pastries and to-go sandwiches.", "Prior to Christopher Columbus making landfall on St. Barts in 1493, it's believed that St. Barts was inhabited by Eastern Caribbean Arawak Indians. They called the island \"Ouanalao.\" Upon his arrival, Columbus named the island \"Saint Barthélemy\" in honor of his younger brother, Bartholomew. Several of the island's ritziest hotels nod to the explorer's influence in either their names (such as Hotel Christopher) or their accommodations (such as the Eden Rock - St Barths, which offers a sprawling, 2,200-square-foot room called the Christopher Columbus Signature Suite).", "During the centuries that followed Columbus' arrival, the island was controlled by both Swedish and British rulers before becoming a French overseas collectivity (the equivalent of statehood from France) in 1946. Cultural and architectural influences from these periods can be found throughout the island. Fast-forward to the last two decades: The population has grown to nearly 10,000 residents and the island is now known as a popular luxury getaway, especially for honeymooners.", "Many visitors to St. Barts don't stray from their luxurious resorts, but there are many villages for curious travelers to explore. Since the island is still a French territory, the euro is the most widely accepted form of payment. To view the most up-to-date exchange rate, check here before you go. French is the official language of the island, but most residents speak English, too. Most local restaurants will include a 15% service charge on your check, but it's still common to leave an additional 10% tip for attentive service. To do so, leave the tip on the table and not as an extra charge on your credit card.", "Some of the best restaurants on St. Barts are found at the upscale hotels or resorts scattered across the island. St. Barts' brand of Caribbean cuisine blends Creole flavors, exotic local fruits and fresh seafood with traditional French cooking techniques (and lots of French chefs).Venture to different resorts along the coast, from Sand Bar at Eden Rock (the No.1 Best Hotel in St. Barts) to Le Toiny Restaurant at Hotel Le Toiny, for a luxurious dining experience in an open-air setting.", "For a more local, but no less lavish, meal, try Tamarin (built around a more than 100-year-old tamarind tree) near Grand Saline Beach or Nikki Beach for its popular brunch. If you're in search of some bargain eats, try Le Select or L'Entracte in Gustavia. ", "U.S. citizens will need a passport that is valid for at least six months beyond the departure date to enter the French West Indies; a visa is not required unless you plan to stay more than 90 days. One blank page is required for entry. Visit the U.S. State Department's website for the latest information on foreign entry and exit requirements."]}