{"name": "Fairbanks", "description": ["Fairbanks, a gateway to northern Alaska and the Arctic region, is known as the land of the midnight sun, boasting endless daylight hours in the summer. Winter is another matter, but intrepid travelers in search of the northern lights will want to brave the minimal daylight and frigid temperatures for this spectacular nature show. ", "For an overview of the region's history, its Athabascan natives and its flora and fauna, start at the Morris Thompson Cultural and Visitor Center. Also home to the official visitor center, the cultural center offers local maps, information on things to do and historic artifacts. For more on the area's gold rush heritage, head to Pioneer Park. Dying to meet Rudolph's relatives? Travel a bit out of town to the family-owned Running Reindeer Ranch and take a guided nature walk as you learn more about Santa's sleigh mates. And at the end of a long day exploring, treat yourself to a meal at one of Fairbanks' riverfront restaurants for some Alaskan salmon and king crab. Or, meet the locals at their favorite watering hole, HooDoo Brewing Company.", "The best time to visit Fairbanks is from July to August. Shoulder seasons, including May to June and August through September, are also ideal. Although peak season brings the highest accommodation rates and the largest crowds of the year, it also welcomes the warmest weather, with average temperatures between 60 and 80 degrees. You can save money and still enjoy pleasant, cool climes in the late spring and early fall. For the lowest rates, visit during the offseason, which begins after Labor Day and runs through Memorial Day. If your main objective is to see the northern lights, the late fall and winter are peak viewing times.", "Check for winter closures Most cruises and tours operate from mid-May to mid-September, and many attractions close or have limited hours in the winter season.", "Visit in the shoulder season Save up to 25% on hotel rooms (and enjoy moderate weather) by visiting from mid-May to mid-June or mid-August to mid-September.", "Take advantage of free attractions The Morris Thompson Cultural and Visitors Center offers exhibits, stage shows and more, while the Georgeson Botanical Gardens are perfect for a relaxing stroll.", "Although Fairbanks may not be at the top of a foodie tour list, the city offers a range of culinary options, from fine dining to family diners. Start your day at McCafferty's, a downtown coffee shop and true Fairbanks original that serves freshly roasted coffee, as well as sandwiches, small plates and cakes. The independent shop also features local artwork and hosts live music twice a week. And although its name may suggest otherwise, The Cookie Jar wins diners over with its home-cooked breakfasts featuring American comfort fare. The bakery-turned-diner is also known for its cookies, cinnamon roll wreaths and delectable muffins, but the Food Network's \"Diners, Drive-Ins and Dives\" raved about its prime rib au jus dinners. ", "For casual lunches and dinners, locals say Lemongrass Thai Cuisine is one of the city's best Asian restaurants, serving up authentic curries and noodle pad thai from Chiang Mai. For lunch or dinner with a view, the riverside Pike's Landing – part of the Pike's Waterfront Lodge – boasts an inviting patio that fills up quickly on warm days for its famous Sunday brunch, while Chena's Alaskan Grill at the Riverfront Edge Resort offers a contemporary take on Alaskan fare with dishes that incorporate local ingredients like reindeer and king crab. ", "End the day with an elegant dinner at Lavelle's Bistro, a French-inspired fine dining restaurant that specializes in Alaska-grown ingredients. Try the roasted duck or the porterhouse-style pork steak accompanied by one of the many wines on hand. For fine food in a rustic setting, the gold rush-era Pump House offers a period dining room overlooking the river and specializes in Alaskan seafood, including fresh salmon. Its Senator Saloon is known as \"The World's Most Northern Oyster Bar,\" offering a wide variety of fresh oysters flown in daily on Alaska Airlines.", "The best way to get around Fairbanks is by car or by using MACS Transit, the city's bus system. Many visitors arrive in Fairbanks by train, although most fly into Fairbanks International Airport (FAI), which sits just 5 miles southwest of downtown and is accessible by MACS Transit's yellow line. The airport is serviced by a handful of major carriers (including Alaska Airlines and Delta Air Lines), as well as several small Alaskan carriers. "]}