{"name": "Boise", "description": ["Idaho's capital city – and most populous one – might surprise you. Downtown Boise is urban, with its local shops, concept restaurants and an ever-increasing number of wine bars and breweries, but it's also rugged. Locals here are active, whether on the 20-some mile Boise River Greenbelt, skiing down the slopes at nearby Bogus Basin or hiking the many trails that spool out from the city. ", "Boise, or the City of Trees, also has its fair share of history as part of the Oregon Trail. Pioneers forded the Snake River back in the early 1800s just south of the city. Basque immigrants – the descendants of whom still reside in Boise – have also left their mark on the city in the form of food, festivals and more. If you want a vacation that meshes outdoorsy pursuits with an awesome urbanite food and culture scene (at an affordable price), Boise might just be the spot for you.", "The best time to visit Boise is between March and May when the temperatures are ideal for enjoying Boise's outdoor activities, though powder hounds will beg to differ – saying that winter is the best time to enjoy the nearby ski slopes. The months between September and November are another moderate shoulder season, while June, July and August experience high temps in the 80s and 90s.", "It's Basque country Boise is home to a large population of Basque descendants, and their influence is reflected in the Basque Block neighborhood, The Basque Marketplace and even a museum.", "It's an active city Whether it's jogging the Boise River Greenbelt or mountain biking or skiing (depending on the season) at Bogus Basin Mountain Recreation Center, any Boise trip will likely include lots of active endeavors.", "It's becoming a foodie city Innovative local restaurants are opening all the time in downtown Boise, and the city also offers almost two dozen breweries and 25 and counting wineries within close proximity.", "Enjoy the free attractions Fill your itinerary with attractions like the Boise River Greenbelt and Kathryn Albertson Park, which don't charge entrance fees.", "Travel in the fall Autumn tends to be a great time to score deals on airfare and accommodations, plus the changing leaves also makes it a beautiful time to visit Boise.", "Boise has an up-and-coming food scene that's been compared to new culinary darlings like Portland, Oregon, and Seattle. To get a taste of some of the city's top establishments, visitors should consider booking a food and walking tour with Indulge Boise Food Tours, which wins praise from recent visitors for its mix of tasty stops and knowledgeable guides. For breakfast, recent Boise visitors recommend Guru Donuts, Bacon or Waffle Me Up. Coffee shops are popular here, too. Some of the best include, Flying M Coffee and District Coffee House. ", "If you're on the hunt for a larger meal, Mai Thai and Boise Fry Co. are two lunch favorites. And for a fine dining experience, travelers should try Chandlers steakhouse, home to the famous 10-minute martini. For those that would rather explore on their own, heading to Eighth Street in downtown Boise is a great place to start since it hosts many of the city's culinary heavyweights. For beer, the Bittercreek Alehouse is a smart choice and for wine, Cinder is a must-do, according to recent visitors. Here, you'll find varieties from the nearby Snake River Valley. Visit Idaho offers a more complete guide to Boise's booming brewery scene. And for more information on the area's top wineries, check out our things to do. ", "Boise is home to a vibrant population of Basque immigrants, and The Basque Marketplace, located in downtown Boise on Grove Street, is the place to try their take on paella and tapas, as well as pick up some gourmet foods and even take cooking classes.", "The best way to get around downtown Boise is by foot, as it is an extremely walkable city, but if you plan to explore further afield, a car offers visitors more flexibility for traveling. Boise does have a bus service, called Valley Ride, but its routes might not be convenient to all points of interest on a timely basis. The city also encourages cycling through its bike-share program, and visitors can also get around via taxi or ride-hailing services like Uber or Lyft. You can also rent one of the many electric scooters found practically on every corner."]}