{"name": "Cabo San Lucas", "description": ["Cabo San Lucas first beckoned to Hollywood's elite in the 1940s. The town's rather seedy reputation changed as world-class resorts took up residence here, in the neighboring village of San José del Cabo and along the 20-mile stretch of highway that connects the two (known as \"the Corridor\"). The construction of an international airport in the 1980s made it easier for travelers from all over to hop a nonstop flight to the \"Los Cabos\" area.", "These days, this destination on the southernmost tip of Baja California is still known for its decadence – just take a look at the sprawling golf courses or deluxe villas. But the elitist pretense has dwindled: Days in the spa are just as coveted as evenings at a beachside watering hole. One sprawling sanctuary boasts as much as 40,000 square feet of treatment rooms and facilities. And there's a good chance that you'll see celebutantes and college freshmen sunning themselves side by side on the same stretch of sand.", "The best time to visit Cabo is from May to June, when the wintertime crowds have gone home and the summertime storms have yet to hit. October and November are also nice months for a vacation, but you'll need to begin your hotel search early if you want to save money. It could be that your motivation for visiting is not the beach: If you're into whale watching, plan to visit between mid-December and mid-April. If you like to fish, look to come in the late summer or fall (October is the most popular period). Keep in mind: Pacific hurricane season runs from mid-May to November. Though Cabo typically only experiences tropical storms during the hurricane season, the city has seen hurricanes make landfall in the region. It's best to consider an international travel insurance policy regardless.", "Cabo is great for sport fishers Local catches include marlin, tuna and dorado. And remember, practicing \"catch & release\" is strongly encouraged in these waters.", "Cabo is great for whale-watchers If you're visiting in winter, you should take a sunset catamaran cruise around Land's End. This is a great spot and time of day to spot gray whales.", "Skip the all-inclusive While all-inclusive accommodations are normally a way to save money, this might not be the case in Cabo due to additional hotel taxes. You'll save money dining off-property.", "Inquire about the shuttle Some hotels offer airport shuttle service for an additional fee. The cost varies, but it will undoubtedly be cheaper than taking a taxi.", "Just say no Vendors often peddle their crafts in tourist areas. Learn to say a firm but polite, \"No, gracias.\" If you think you'll be too tempted, avoid popular spots like Playa del Amor during the midday cruise ship rush.", "Many workers in Cabo's tourism industry speak English, so you can get by with limited Spanish. Many of the stores and restaurants have an Americanized feel, especially in the city center's chain restaurants. Nevertheless, it may be both helpful and respectful to know some basic Spanish vocabulary, such as hello (hola), goodbye (adios), please (por favor), and thank you (gracias).", "Cabo's official currency is the Mexican peso, though U.S. dollars are widely accepted here as well. You're better off converting your cash to pesos, however, as the return exchange rate is unfavorable and even if you pay in U.S. dollars, you'll receive change in pesos. The U.S. dollar-to-peso exchange rate varies, so be sure to check what it is before you go.", "And when it comes to dress code, keep in mind that standard beachwear is permissible during the day; dressy casual is preferred for upscale restaurants and nightclubs.", "Cabo San Lucas has a special affinity for seafood, but restaurants featuring European and North American cuisines also attract travelers. Dining is generally expensive, but you can find cheaper eats and more fascinating cultural experiences if you try some of the hole-in-the-wall taco joints (taquerias) located downtown or along the hotel corridor.", "Over the years as the area has increased in popularity, Cabo San Lucas and San José del Cabo have started to draw more and more acclaimed chefs (and their innovative menus) to Mexico. Some popular spots to try include Suviche Restaurant by Jean-Georges Vongerichten, located within the One&Only Palmilla Resort, which plates sushi and ceviche; Flora's Field Kitchen, which offers farm-to-table meals; and Tadd Chapman's Don Sanchez, which dishes out traditional Mexican fare with innovative flair. For a special occasion meal, consider El Farallon at the Resort at Pedregal for its oceanfront perch. If you're looking for a more casual but still tasty authentic Mexican meal, head to one of Cabo's smaller hot spots, such as Edith's, Mi Casa, Tiki Cabo San Lucas or Hacienda Cocina y Cantina.", "Cabo's spike in tourism has also caused a rise in crime. Both cities have been affected by the drug trade – and have seen some accompanying violence – but the main tourist areas are relatively safe. Travelers should be vigilant about their belongings, though. Pickpocketing is common in heavily visited areas, and those looking to take a drive along the Transpeninsular Highway should be vigilant after dark when highway robberies have been reported to happen. The U.S. State Department's website urges travelers to exercise caution. If you plan to swim, warning flags on beaches should be taken seriously. If black or red warning flags are up, do not enter the water and you should never swim alone.", "The best way to get around Cabo San Lucas is on foot or by car. Sites are clustered within the downtown area, though some vacationers opt for a ride on the scenic water taxi to get from the downtown marina to the best beaches. The only trouble is that you can't walk between the Cabo San Lucas and San José del Cabo; you'll need to drive yourself or take a taxi along the Corridor. Just don't venture too far off the beaten path – there have been reports of car thefts in outlying areas. Car rental agencies have set up camp in Los Cabos International Airport (SJD), which sits roughly 25 miles northeast of Cabo San Lucas and 7 miles north of San José del Cabo.", "Taxi rides from the airport to Cabo San Lucas can be pricey. Check with your hotel to see if they offer a shuttle service, or consider pre-booking with an independent company. You may have to share the ride with other passengers, but you'll save a bundle. Past travelers provided favorable reviews for Cabo Shuttle Services, All Ways Cabo Transportation and Airport Baja Transfers.", "You'll need a passport that's valid for six months after your visit to enter Mexico. The paper FMM Tourist Card traditionally issued upon arrival has been phased out at certain Mexico airports, Los Cabos included. You will now receive a passport stamp. For more information on entry and exit requirements, visit the U.S. State Department's website."]}