{"name": "Grenada", "description": ["It isn't the cost of the airfare or the caliber of the hotel that you'll remember most about your trip to Grenada. It's the kaleidoscope of reds, yellows, and greens that characterize St. George's harbor (arguably the most beautiful in the Caribbean) and how they're reflected in the cerulean water. It's the sound of the waves lapping against Grand Anse's soft sands that echoes in your ears long after the sun goes down. It's the aroma of nutmeg and vanilla that wafts through Market Square and throughout the islands' spice plantations. It's the warm sensation you feel in your stomach and on your tongue after sampling the River Antoine Distillery's 150-proof rum. Grenada isn't just meant to be seen; it's meant to be savored.", "Americans have long overlooked Grenada (pronounced gre-NAY-da), opting for showier, resort-laden islands. But Yanks, take a hint from the Brits who have spent many a winter here: Grenada is worth visiting. Sure, this part of the Windward Islands doesn't feature the sprawling all-inclusives or glitzy nightclubs of St. Lucia or Barbados; in fact, you may even be hard-pressed to find a fellow American here. But that's the key to Grenada's charm.", "The best time to visit Grenada is December. This single month is sandwiched between the departure of the rainy season and the arrival of the winter crowds, making this the best time of year to score both sunshine and sales. Like the rest of the Caribbean, Grenada experiences a surge in tourism from January through April, when the weather in the U.S. and the U.K. is at its gloomiest. You can expect both airfare and room rates to rise during this peak season. Summer and fall usher in regular rainfall and the constant threat of hurricanes, but if you're willing to risk a bout of bad weather, you'll find hotel rates discounted up to 40 percent.", "Prepare to island-hop Several islands make up this independent Commonwealth realm. Though the island of Grenada steals most of the spotlight, the smaller islands of Carriacou and Petit Martinique do draw some crowds. The other, much smaller islands are only accessible by private boat.", "Let old conflicts lie Yes, the U.S. did invade Grenada back in the 1980s, but Grenadians hold no grudge. Americans visiting Grenada will experience the same warm welcome as any other traveler.", "Enjoy the rum while you can Once you've tasted the libations produced at the River Antoine Rum Distillery, you may be tempted to bring some back to the States. But if you do buy a bottle, you'll have to polish it off before you leave: This 150-proof alcohol has been deemed \"too flammable\" to carry on board.", "Visit during the sweet shoulder season Winter and spring are too crowded, and summer is too rainy, but late fall is just right. For the best weather and the best rates, plan to visit Grenada in late October or November.", "Stay along Grand Anse You can save big on transportation if you base yourself on Grand Anse Beach. Hotels here are within walking distance of the ocean, and minibuses serve this area (and St. George's). Plus, if you visit during the off-season, you'll find these popular rooms discounted by up to 40 percent.", "Indulge in local cuisine You won't cause too much damage to your pocketbook if you stick to local fare because so many ingredients are produced here. Be sure to save some room for an \"oil down,\" an aromatic stew comprised of meat or seafood, veggies, spices, and coconut milk.", "Grenada – once governed by France and Britain – today stands as an independent Commonwealth of the U.K. and is known for its laid-back attitude. Despite past diplomatic conflicts (President Ronald Reagan invaded the islands in 1983 to quell a Marxist coup), Americans will feel more than welcome here. English is the official language and is commonly used by public officials and members of the tourism industry. Some locals speak Creole English, a mixture of several African dialects, English and French.", "Grenada's fusion of French, British, African and Caribbean cultures is due in part to its history of slavery. In the late 18th century, Britain began importing enslaved Africans to harvest crops across the island's plantations, including the Belmont Estate. Between 1795 and 1796, a plantation owner named Julien Fedon – the son of a freed Black slave and a French jeweler – formed a revolution, during which half of Grenada's 28,000 slaves openly fought for their freedom. Slavery in Grenada ended in 1834, though it took a few years for all slaves to be freed.", "Visitors should feel relatively safe when exploring Grenada, although crimes against tourists – most notably robberies – do happen. To be safe, store your valuables in a secure place at the hotel and take taxis to avoid walking alone at night. If you're planning to rent a car, keep your wits about you on the road; there is a lot of pedestrian traffic, and car accidents are common.", "The official currency in Grenada is the Eastern Caribbean dollar (XCD), which is equal to roughly 40 cents in U.S. dollars (USD). However, U.S. dollars are widely accepted; just don't forget to check the currency being quoted before handing over your cash.", "The best way to get around Grenada is by car. Unless you're planning to spend all of your time in Grand Anse Beach or St. George's, you'll need your own set of wheels. Public minibuses do provide transportation around the main island, but service is fairly limited. You can rent a car at Maurice Bishop International Airport (GND)—formerly Point Salines International Airport—on the southwestern tip of Grenada Island or at one of the agencies located in St. George's and around Grand Anse Beach. Taxis are also plentiful, but frequent use can leave a sizeable dent in your wallet.", "American citizens will need a valid passport to enter Grenada. A visa is not required for stays up to 90 days. For more information, visit the U.S. State Department website."]}