{"name": "Bermuda", "description": ["A visit to Bermuda means that there's a good chance you'll see men milling about the capital city of Hamilton dressed in crisp and prim business shirts, tucked neatly into seemingly casual short trousers. Their \"Bermuda shorts\" fit well into the mystique surrounding these lonely islands of the Atlantic – islands that hold tight to their British customs, elegance and etiquette, but still know how to let loose under the subtropical sun.", "Usually, people who visit Bermuda are looking for a little luxury. Top activities include spa treatments and afternoon tee times. Need a break from the golf clubs or a change of pace after your facial? Try stretching out on the dazzling pink sand at Elbow Beach or Horseshoe Bay Beach, strolling past the old-time buildings in historic St. George or polishing up on your naval history at the National Museum of Bermuda. These islands don't put on a pretense of being \"hip,\" but they do offer a charming old-school sophistication that's hard to find anywhere else.", "The best time to visit Bermuda is in March or April, when the temperate weather becomes pleasant for beach bathing (though not quite warm enough yet for swimming). Hotel prices during these months aren't as high as they are in Bermuda's busy season, from May to October. If you're more interested in golf, plan your trip for the wintertime. Unlike the Caribbean, Bermuda is relatively cool in the winter, so you'll score the greatest discounts at hotels and enjoy fewer crowds at top attractions. ", "There's more than one Bermuda Most people think of Bermuda as one island, but in reality, it's an archipelago of more than 100. Tourist activity is largely concentrated on the largest island, which is the \"Bermuda\" most are familiar with.", "Bermuda is not the Caribbean Calling Bermuda \"Caribbean\" has confused a lot of travelers. In reality, these islands are located 600 miles off the coast of North Carolina.", "U.S. dollars are accepted Bermuda is certainly expensive, but its dollar is on par with the U.S. dollar, which is widely accepted. Save yourself some trouble and pay for everything in American bills.", "Bundle up Bermuda only experiences beach weather for half the year. Sites like St. George and the Unfinished Church are perfect to visit in the chillier (and cheaper) winter season, when temperatures hover in the mid-60s.", "Opt for \"AP\" Dining out in Bermuda is expensive, but some hotels offer rate plans that include some or all of your meals. An \"AP,\" or American Plan, typically includes all three meals in the cost of your room and board.", "Arrive early Bermuda is only a two- or three-hour plane ride from many spots on the East Coast, so you might not lose an entire day in travel time. Book an early morning flight to enjoy your first (full) day on the island.", "Bermuda is a blend of British, American and West Indian traditions and cultures. The island has mixed its elusive past to create its own customs. Bermuda shorts are the norm here, even during business hours, but it's best to pair them with a jacket for tea time or the dinner hour. Wearing a bathing suit – or even flip flops – anywhere besides the beach is frowned upon. ", "Considering that its islands are surrounded by the Atlantic Ocean on all sides, Bermuda has the inside edge on quality seafood. Fish chowder (with a dash of sherry), codfish cakes and spiny lobster are island favorites. But its remote location at sea also means almost all other ingredients are imported in, and at a premium – Bermuda restaurants are universally described as expensive.", "Dining on the islands is sometimes more formal than on other destinations, so you should call ahead to find out the dress code. Most visitors dine in the central parishes where there are more dining options. Hamilton's Front Street and its neighboring streets are your safest bet, with a range of options, including old-school Bermudian cuisine, European menus with fresh and local ingredients, and Indian or Thai options for those who like a bit of spice.", "At the seafood eateries, try local delicacies like Bermudian wahoo (a type of white fish), lobster or rockfish. Still, no visit to Bermuda is complete without trying some of its famous rum. Try a rum swizzle at the world-famous Swizzle Inn Pub & Restaurant or a dark 'n' stormy at any bar on the island.", "Crime against tourists is fairly minimal in Bermuda, but petty theft does happen. The capital, Hamilton, is where most of the crime occurs, however, law enforcement has cracked down and installed surveillance cameras throughout the city and in all major tourist areas in recent years. As with any travel, be sure to leave treasured items at home. The valuables that you do bring with you should be secured in the hotel safe. Rented mopeds are sometimes stolen; make sure to always lock your scooter before leaving it unattended.", "The best way to get around Bermuda is on a bus. You don't have the option of renting a car here, and maneuvering on a motorbike could be fun or deadly, depending on your perspective. Taxis pretty much have a monopoly on getting you from Bermuda L.F. Wade International Airport (BDA) to your hotel, but this budget-killing option for sightseeing is not your best bet. Fortunately, the buses are reliable and affordable, and they stop at many of the top attractions. Still, if the bus isn't quite your style, electric two-seater vehicles called Twizys are another option; they are easier (and safer) to master than scooters.", "Additionally, many people arrive in Bermuda on a cruise ship. Most dock in Hamilton, though there are a few that anchor around St. George's or the Royal Navy Dockyard. Taxi drivers are waiting at all the docks to show you around, or you could rent a motorbike or Twizy to move around on your own.", "You'll need a valid passport to travel to Bermuda and you'll have to present proof of return flights or continuing travels. There is also a departure tax air travelers and cruise ship passengers must pay (it's likely already bundled into the cost of your fare). Occasionally, officials will also ask to see proof of sufficient funds to cover your visiting expenses. Visiting yachts need customs, immigration and health clearance at St. George's port to visit Bermuda, and yachters should expect a passenger tax. Visit the State Department's website for the latest information on foreign entry and exit requirements."]}