{"name": "Miami", "description": ["Take a number of diverse cultures, add a strong dose of the arts and a splash of ocean water, and you have Miami. Looking at the fantastic art museums and the blossoming gastronomical scene, you might find it hard to believe that just a century ago, this colorful Floridian city was covered in swampland. Once developers rushed into the area, one of the most popular tourist destinations and spectacular city skylines in the country was born. Today, with South Beach before you and the Everglades behind you, you can walk through the bustling streets past historical homes with Spanish words and Caribbean music floating into your ears.", "This mini melting pot has preserved multicultural neighborhoods like famous Little Havana as enclaves for unique traditions to thrive. United, they form an electric network – Miami. Its reputation for vibrant nightlife and extravagant parties is realized in Miami Beach, a barrier island to the east of the mainland. Meanwhile, the down-to-earth city proper cultivates an artsy vibe. For a taste of Miami Beach, sign up for one of the city's best boat tours, where you'll be able to marvel at the glitzy skyline from the water on a boat tour or via parasail.", "The best time to visit Miami is between March and May. During these months, you'll be able to enjoy daily temperatures in the 70s for non-peak rates, while the rest of the country is still defrosting. The year-round tropical climate and partying ways of nearby Miami Beach mean tourists – lots of tourists – from northern states, South America, Europe, Asia, anywhere and everywhere year-round. And when there are special events, the city sees even more visitors and higher hotel rates. For the best chance of scoring deals, book around the city-wide events or during the sweltering summer months.", "Labels, labels, labels Miami residents are infatuated with names – of famous people and designer clothes. This obsession carries over to their thoroughfares as well, so remember: \"avenues\" run north to south and \"streets\" go east to west.", "Cars, cars, cars They will be everywhere, and you will probably be in one for some time. Gridlock can halt your progress, so move about while the Miamians are at work.", "Flippers, fins and scales Miami is home to a variety of wildlife, from alligators and snakes, to killer whales and dolphins. The famous Flipper resided at Miami's Seaquarium, which still houses many dolphins. For an exciting trip with a chance to view dolphins, rent a Jet Ski, And tour the Everglades by boat if you want to get up close and personal with the reptiles.", "Cruises, cruises, cruises Numerous cruise lines operate out of Miami, often sailing to the Bahamas, elsewhere in Florida and the eastern and western Caribbean. Check out the top cruises from Miami »", "Don't try to keep up Miami residents are probably a year ahead of you in all the trends. So, keep your credit cards safely in your wallet and shop at the mall when you get home.", "Blood-thirsty competition Temperatures climb and hotel rates fall in the hot, damp summer. And although the beaches will be less crowded, you'll have to compete with mosquitoes for the sandy terrain.", "Seek shelter inland The accommodations farther from the beaches will offer lower rates. Coconut Grove is an excellent inland option for finding more affordable digs.", "Take a boat tour If you don't have the cash to charter your own private boat, there are plenty of public boat tours in Miami that will allow you to enjoy the water. Not a fan of the water? Plenty of other guided tours on land are also available.", "As a favorite getaway spot for celebrities and the well-to-do, Miami's atmosphere is slightly more posh than some of the smaller coastal cities, such as Destin or Fort Lauderdale. Visitors should be prepared to look their best, especially when dining out or partaking in the nightlife in nearby Miami Beach. ", "But there's another side of this town that is heavily influenced by Latin culture. A large portion of the city's population is made up of people from Cuba, Puerto Rico and Haiti. Because of this influx of immigrants, Spanish is widely spoken here – particularly in neighborhoods like Little Havana – and you might hear a bit of French Creole as well. Latin culture has also had a big influence on Miami's nightlife scene, with many establishments featuring Latin music and dance.", "With its mix of cultures and larger than life persona, it's no wonder that there's also a vibrant art scene in the greater Miami area. From multiple art museums that fit every taste to numerous galleries of contemporary and modern art, there is no shortage of creativity in this city. People flock to the city in December for the popular Art Basel show.", "Largely an international city, cuisine from all over the world can be found in Miami. Quickly becoming a haven for foodies, mainstays like Cuban and Peruvian cuisine mingle with classic American comfort food and Japanese sushi. With its waterfront location, fresh seafood isn't hard to come by either. ", "Many restaurants have a history in the community, dating back decades, such as the authentic Cuban food found at Versailles Restaurant and the fresh, sustainable seafood at Garcias Seafood Grille and Fish Market. Or venture to Little Haiti for a taste of the Caribbean at Chef Creole's. Note that some of the more casual spots only take cash. ", "Other spots like Secreto combine Latin, European and Asian flavors to create something that's distinctly Miamian. If you're looking for dining that's a bit more upscale, look no further than the hotel restaurants that line the downtown area. Highly rated by experts and locals, restaurants like La Mar by Gaston Acurio at the Mandarin Oriental, Miami or Area 31 at the Kimpton Epic Miami offer the fine dining experience with spectacular views. ", "Miami is a big city, so it's best to keep safety in mind at all times, even when you're in your hotel. Always carry a map (or have one downloaded on your phone) and stay away from unfamiliar areas at night. As in any large city, keep an eye on your personal items at all times, especially if you're out on the town. Do not carry wallets in back pockets and keep a firm grasp on any purses or bags you may have with you. Like in most major cities, Miami does feature a few transients who generally panhandle in the more touristy parts of town. Some experts recommend avoiding the downtown area at night. While it's a bustling part of town during the day, it empties out after hours and can get somewhat seedy.", "Miami weather can also be cause for concern. Keep an eye on the forecast for hurricane or tropical storm warnings. If you do happen to experience a hurricane, stay indoors and listen to the radio or television for up-to-date emergency information. After the storm has passed, avoid downed power lines and flooded streets. Experts also advise caution when walking around, since debris such as broken glass can be hard to spot.", "The best way to get around Miami is by car. Having your own wheels will give you the freedom to roam the streets and neighborhoods as you please. Note that the roads are on a grid and broken up into quadrants by the east-to-west Flagler Street and north-to-south Miami Avenue. Street numbers increase as you travel farther away. Also, convenient parking is the norm here. Taxis or ride-hailing services are another option; however, your wallet won't thank you for hailing them so often. The mammoth Miami International Airport (MIA) hosts a fleet of rental car agencies. Several free public transportation options are also available, including the trolley and Metromover. These can be viable options if you're planning to base yourself downtown. And as with most big cities, bike-share and scooter programs are another option for exploring short distances.", "When flying into south Florida (which includes West Palm Beach, Fort Lauderdale and Greater Miami), you have several options. The Miami airport is the largest and right next to downtown, but some tourists prefer flying into the less-hectic Fort Lauderdale International Airport (FLL), renting a car and then driving the 25 miles to the city. There are also several regional airports scattered throughout south Florida."]}