{"description": ["Known as the \"Live Music Capital of the World,\" Austin boasts more live music venues per capita than anywhere else in the nation. It has witnessed the early careers of several famous musicians, including Stevie Ray Vaughan, Janis Joplin and The Chicks. Despite significant growth in recent years, Austin maintains a quirky, laid-back atmosphere that you won't find in other Texan cities. Outsiders tend to see the city as a home base for wacky characters, but Austinites revel in their eccentricity and proudly flaunt the city's motto, \"Keep Austin Weird.\"", "Aside from its buzzing live music and nightlife scenes, the main reason to visit is to enjoy the outdoors. With an average of about 300 sunny days per year and large swaths of green space like Zilker Metropolitan Park many experts consider Austin one of the Best Places to Live in America. It's probably because there's something here for everybody: Whether you're a history buff (LBJ's library is here as well as the Lone Star State-sized Texas State History Museum) an art lover (Blanton Museum of Art), a sports fan (University of Texas at Austin football) or a budding musician (Sixth Street). After your visit, you might be asking: Why don't I live here?", "The best times to visit Austin are September to November or March to May, when 70s and 80s are the anticipated daytime temperatures. As temperatures climb into the mid- to high 90s with high humidity, the Texan summer (June through August) is barely tolerable for unaccustomed visitors. Winter (December to February) is relatively mild and dry, with temperatures that hover in the low to mid-60s. Festivals are an integral part of Austin's culture. If your travel plans are flexible, then plan on attending a festival that interests you – just be prepared for inflated lodging rates.", "Yes, you're in the \"Live Music Capital of the World\" The sweet notes of undiscovered musicians pour out onto Sixth Street from almost every bar every evening. Plus, many of the top guided tours make stops at some of the city's best local music venues. Don't miss out on a critical part of Austin's culture.", "Yes, you're in a college town Home to the University of Texas at Austin, the city's pride is its beloved Longhorns. If you can find tickets, go to a sporting event and feel the fervor of the Texas fans.", "Dine on food truck fare Austin is a food truck mecca believed to be home to more than 1,200 mobile food vendors. Skip the pricey sit-down meals in favor of the city's inexpensive food truck fare. ", "Avoid festivals and game days Look out for major citywide events, such as Texas Longhorns home football games and the South by Southwest festival – these can cause hotel room rates to skyrocket.", "Reduce your carbon footprint Walk, bike or use public transit to move about Austin and gain a deeper appreciation of this city's beautiful neighborhoods.", "A city formerly overrun with barbecue joints and chophouses, Austin has since welcomed a more diverse dining scene featuring more upscale restaurants as well as a wide array of international cuisine. However, the traditional barbecue joints continue to thrive alongside sushi bars and European bistros. Many say you'll find the best smoked meats in the city at Lamberts, but head to Stiles Switch BBQ & Brew if you want your barbecue served with a side of craft beer. Unsurprisingly, Tex-Mex is also popular thanks to Austin's proximity to Mexico, which has ushered in the infiltration of south-of-the-border specialties, such as tacos (a city-wide favorite available any time of day), burritos and fajitas. Local establishments recommended by both locals and visitors include Veracruz All Natural, Joe's Bakery & Coffee Shop and La Condesa.", "For a tasty meal on a budget, head straight for one of the city's food trucks. It's estimated that there are more than 1,000 mobile food vendors roaming Austin's streets, so you'll likely have no trouble finding a truck that tantalizes your taste buds. Several websites, including FoodTrailersAustin.com, offer a directory of each trailer's location and cuisine. Pinpointing the best food trucks would be an exhaustive task, but according to visitors and residents, Luke's Inside Out, Churro Co., Thai Kun and Patrizi's are among the top mobile vendors in the city. Tagging along on one of the city's best food tours is another great way to discover the city's top food trucks.", "Along with its impressive food truck scene, Austin's craft beer landscape is equally lauded. Several tour companies, including Austin Brewery Tours and Bike and Brew ATX, offer tours of the city's best breweries, but you can also branch out on your own to popular spots like Austin Beerworks, Jester King Brewery and St. Elmo Brewing Company. And if you're into wine, you're in luck. Austin's proximity to Fredericksburg (which sits about 90 miles west) makes exploring Texas Hill Country wineries easy. Spend a day in Fredericksburg and sign up for a wine tour to make the most of your time.", "Compared to other U.S. cities of its size, Austin is relatively safe for visitors, but it's still necessary to exercise precautions. Make sure to keep your car doors locked and your valuables in a secure location and avoid dimly lit streets after sundown.", "Those who are not used to Texas' climate should be mindful of heat stroke. Common symptoms include dizziness, headache and exhaustion. To prevent illness, wear sunscreen and drink plenty of water.", "Visitors to Austin should be aware that they will be sharing the city with some intimidating creepy-crawlies, including scorpions and snakes. The types of scorpions that are sometimes spotted within the city cannot inflict as much damage as other species, but experts do recommend keeping your distance. If you head out into the countryside, you may encounter rattlesnakes and water moccasins. If you're stung by a scorpion or bitten by a snake, contact a medical professional immediately.", "The best way to get around Austin is by bus and light rail. Some travelers recommend a car; however, the expense and pains of one are enough to encourage many visitors to use Capital Metro – Austin's public transit system. The Route 20 Manor Road/Riverside line connects the downtown area with Austin-Bergstrom International Airport (AUS), where you'll likely be greeted by music as soon as you exit the plane, to the heart of downtown about 10 miles northwest. The minimum taxi fare from the airport to downtown Austin costs $13.30. Amtrak provides train service to the city via the Texas Eagle line."]}