{"name": "Agra", "description": ["If you consider yourself a world traveler, you're bound to make the pilgrimage to Agra. Each year, millions come from around the globe to this (relatively) small city in northern India. \"Why?\" you ask. Two words: Taj Mahal. This famous monument has immortalized the love of an emperor and his wife since its completion in 1648. Epitomizing the ornate Mughal architectural style, the Taj Mahal has made jaws drop and hearts swoon for centuries. ", "However, you're wrong to consider Agra just a one-stop shop. With two additional UNESCO World Heritage sites to its name, the city boasts multiple windows into the past. Unfortunately, India's former capital during the rich Mughal Empire has fallen into a state of disrepair, and its world-class monuments seem to be islands of historical wonder. While you must visit its sites, it's unlikely that you'll to want to reside in Agra for very long.", "The best time to visit Agra is from November through February. That's because this long \"winter\" sees daily temperatures ranging from the 70s to low 80s. While prices and tourist volume will be high, you'll avoid heavy rains and unbearable heat present during the spring and summer months. Monsoon season begins in July, with rain pouring down upon Agra through September, and the months of April, May, and June witness temperatures well above 100 degrees Fahrenheit. ", "Agra's sites welcome thousands (and the Taj Mahal millions) of tourists each year, and the city's residents have learned to capitalize on the traffic. It's very important when in Agra to exercise caution as it's very easy to be taken advantage of, scammed, and in some cases, assaulted. It's best to trust only official representatives while here, including those working at attractions, train stations or your hotel. And make sure the representative you choose to talk to is physically in a ticket stand or office at that attraction or train station and not someone who just says so on the street. Be mindful of your belongings at all times. The State Department reports that some people have had their purse straps cut or the bottom of their bags slit open at the bottom. ", "You will definitely want to stay at a quality hotel in Agra. While it might be tempting to save a few hundred rupees, it's important to note that India is a developing country. Accommodations at finer hotels offer quality Western amenities as well as food you can trust. That's not to say budget accommodations won't offer basic amenities or safe food, but standards of cleanliness are different here. You don't want to fall victim to Delhi belly, which is akin to traveler's diarrhea. Wherever you end up staying, always drink bottled water. Also avoid foods that aren't cooked, such as fruit or produce, from a street vendor or dishes that require water for preparation. Your best bet is to eat close to top attractions as those experience lots of tourists. As for street food, as long as you can see the ingredients in front of you and you can watch all of them being cooked from start to finish, your belly will be good. But while here, don't ask for beef. In Hinduism, cows are considered holy. So much so that you'll find them walking the streets like humans around India. ", "With all of the historical sites Agra has to offer, you will probably be approached by \"tour guides\" on the street or in front of attractions, especially the Taj Mahal. They may try to tempt you with \"discounted\" or \"cheap\" tour prices or even admission fees; however, you need to assume everything they tell you is false. It's common for Western travelers to be offered services or goods for prices 10 times that of the fair amount. If you don't have a pre-booked tour and are interested in one, seek help from your hotel or ask for more information at the attraction. The Uttar Pradesh State Tourism Development Corporation offers tours by licensed guides and partners with top sites, such as the Agra Fort and the Taj Mahal.", "It's important to know that India has recently seen a surge in gender violence, including sexual assault. Women should not travel alone to Agra nor walk around the streets or take transport by themselves at any time, especially at night. It's also important to know that Hepatitis A and Typhoid are a big risk among foreign travelers. The Centers for Disease Control and Prevention advises travelers get a Hepatitis A and Typhoid vaccination if they don't already have one before traveling to India. Consult the CDC's website for more information. ", "English is widely spoken in Agra. The official language is Hindi, however, considering India's history with the British as well as the influx of tourism Agra sees, you likely won't have an issue with regards to communication. India's official currency is the Indian rupee (INR). One American dollar equates to about 64 Indian rupees. ", "India's cuisine is vast, to say the least. The country's cookbook is composed of national favorites heard around the world (think: curry, tikka masala and naan), as well as plenty of lesser-known regional favorites. To put things into perspective, India is composed of 29 states, each of which are equipped with their own cooking techniques and delicacies. Uttar Pradesh, Agra's state, is no different. In Agra though, the most notable dish isn't a dish at all. Petha is a regional candy that is famous to Agra and you can find it just about everywhere. Petha is made of sugar syrup and predominately flavored with pumpkin, though other spices and flavors are often added, including coconut, mango, or saffron, to name a few. Another popular dessert is jalebi, fried cake batter dipped into sugar syrup.", "For a real meal, turn to kakori kebab, a famed dish of Uttar Pradesh. Kakori is made up of minced lamb meat mixed with spices and cooked over a charcoal fire. Kakori Kebabs are part of the larger Mughlai cuisine, which refers to dishes consumed by ancient royals, the same who commissioned monuments, such as the Agra Fort and Taj Mahal. Shami kebabs are another popular lamb kebab served in patty form and filled with red onion, chili and mint leaves. If you don't like lamb, there's still a kebab for you. Gulnaar kababs use chicken and are blended with tomatoes and spices. Paratha, a flatbread, is another delectable Mughlai dish that is pan fried, stuffed with veggies and accompanied with chutneys and other sauces. For breakfast, make sure to try bedai – fried, airy bread served with potato stew and a spoonful of curd.", "Speaking of street food, it is possible to indulge and not get sick. But take heed: It's best to buy street food nearest top attractions, as those are used to catering to tourists. While scouting street vendors, watch where the crowds go. If you see tourists – and more importantly – locals pass up certain food stalls, follow their lead. Avoid buying fruits and vegetables on the street, as well as stalls selling drinks that aren't bottled. If you're looking for some lassi (a yogurt-based smoothie), it's best to get it in a restaurant. That goes for meat-based dishes as well. If you stick to meat-free dishes that you can see fully cooked in front of you (in a clean environment), you should be able to avoid any gastrointestinal discomfort.", "The best way to get around Agra is by auto-rickshaw. They can navigate the city streets at a startling pace and are reasonably priced. Air-conditioned taxis can be more expensive than auto-rickshaws, but considering the very low conversion rate, you can probably get away with taking a taxi or two here or there. Walking between top attractions just isn't possible due to the distance.", "Most travelers fly into Delhi's Indira Gandhi International Airport (DEL) and then hop a train to Agra. Multiple trains pass through the Agra Cantt train station from the New Delhi train station daily. It's best to inquire about tickets from your hotel before your trip or to book online in advance. You can do this by visiting Cleartrip.com or IRCTC.co.in. IRCTC is a part of Indian Railways that handles online booking for train tickets. To book via IRCTC, you'll have to register on the site to be able to purchase your tickets. Travelers say the registration is a hassle, as you have to input information that appears to only apply to Indian residents (such as an Indian phone number and postal code). Visitors advise inputting your information regardless because once you select your nationality, you will be prompted to contact an email address that will help you complete your verification. Once you've completed this step, a representative will get back to you and then you'll be able to complete registration and purchase tickets.", "To complete a purchase from Cleartrip, you must have an IRCTC username. You can also go to the New Delhi train station to purchase tickets at the international tourism offices located inside, but with the high volume of people that use Indian Railways daily (23 million), you could be shut out. The length of journeys depends on the train, though if you're able, spring for the Gatimaan Express. This is currently India's fastest train, getting passengers from New Delhi to Agra in less than two hours. ", "American travelers must have a U.S. passport and a tourist visa upon entry to India. The passport must be valid for six months beyond the date of your visa application. Visas are available through the Indian embassy and consulates throughout the United States. You can also obtain a visa through Cox & Kings Global Services, a visa contractor serviced by the Indian government. Requirements for the visa change frequently and are difficult to pin down. Take the necessary precautions by bringing all the requested documents and additional copies. For more information, check out the U.S. Department of State's website."]}