{"name": "Galway", "description": ["County Galway, located on the western side of Ireland, is a land of rugged beauty, home to the stunning Cliffs of Moher, the fabulous Wild Atlantic Way route and the romantic Aran Islands. Most visitors use Galway City, a lively university town, as their base. From here, many of the best Ireland tours bring travelers to these must-see natural wonders. With such a youthful vibe, the city is home to a great nightlife scene, with pubs, theaters and, of course, music. The summer brings fantastic festivals, including the Galway International Arts Festival and Galway International Oyster Festival. ", "In 2014, Galway became one of just five UNESCO Cities of Film and it was named the European Capital of Culture 2020. It is also where the famous Irish Claddagh ring, composed of two hands clasped around a heart with a crown above it (symbolizing love, friendship and loyalty), was designed more than 400 years ago. And as Galway is Ireland's only bilingual city (20% of residents speak Irish or Gaelic), it's a great place to hear the language. ", "The best time visit Galway is between July and October. Not only is the weather perfect for touring the city's outdoor attractions, but there's also a full event calendar. Expect mild high temperatures in the mid-60s; and plan to pack layers if you're hoping to visit the area's coastal attractions, such as the Cliffs of Moher, where there is little to shield you from the wind. Spring and fall are considered the \"midseason\" for tourists, and visitors will find great bargains for accommodations. Winter can be chilly, with temperatures that dip into the mid-30s. ", "Visit the Galway Discover Ireland Centre Expert guides can help you make the most of your time in town with advice and tips. You can find it on Forster Street in the city center.", "Take a free walking tour with the Galway Civic Trust This free, guided tour begins at the Hall of the Red Earl in Druid Lane (off Quay Street) from May to September, every Tuesday and Thursday at 2 p.m. and covers the medieval history of the city.", "The official currency in the Republic of Ireland is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates often, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops.", "As for tipping, all industries in Ireland have a mandated minimum wage so tipping isn't a large part of the culture. Some restaurants will add a service charge of 10 to 15 percent to the bill, so no tip is expected. If there is no service charge, it's customary to tip 10 to 15 percent. Taxi drivers don't expect a tip, but many travelers will round the bill up to the nearest euro or leave 5 percent if the driver was especially hospitable. One place to never worry about tipping? The pub. ", "Galway, with its location on the water and its proximity to local farms, is blessed with an abundance of fresh foods. Like most cities in Ireland, it has its fair share of excellent pubs, but there are also plenty of restaurants to appeal to every appetite.", "For an upscale Irish food experience, The Pig's Ear is well-regarded by critics and visitors alike. It features dishes like Earl Grey tea-cured Irish salmon, shepherd's pie and other favorites, but in an elegant and refined way. Ard Bia at Nimmos is widely heralded as one of the city's best dining spots. Located in an 18th-century building next to the Spanish Arch, it offers a wide range of dishes inspired by local ingredients. A West Coast monkfish stew, red lentil cakes and hand-rolled tagliatelle are just some of the options on the wide-ranging menu. And in a city filled with historic pubs, Tigh Neachtain might be Galway's most famous. Serving up drinks since 1894, this pub is a cozy spot filled with diverse patrons and is known for its strong music scene. When the weather's nice, many visitors enjoy people-watching from Tigh Neachtain's patio on Quay Street.\n ", "The best way to get around Galway is by foot. There are lots of tiny streets and pedestrian-only areas, so it's easy to get anywhere within the central business district on your own two feet. Another convenient, inexpensive option is the city's bike-share program. However, if you're hoping to explore the Wild Atlantic Way or the Cliffs of Moher on your own, you may want to rent a car. If you'd rather let someone else do the driving, you'll find several tour companies offer sightseeing packages, several of which are featured in our list of the best Ireland tours. What's more, the city's bus system, Bus Éireann offers seasonal service to some of the more far-flung attractions, including the Cliffs of Moher.", "The closest airport to Galway is Shannon Airport (SNN), which sits about 60 miles south of Galway. Bus Éireann provides service from Shannon Airport to Galway; tickets start at 60 euros (about $72) per adult. Major car rental companies, such as Hertz, Avis and Europcar, are also available for hire at the airport. Dublin Airport (DUB) is another option that's located approximately 130 miles east of Galway. Bus Éireann, along with a handful of other operators, also offers service from Dublin to Galway. Ireland West Airport Knock (NOC) is another option about 60 miles north of Galway, though it offers limited daily arrivals and departures from cities like London and Liverpool. From Knock, you can rent a car or hop on Bus Éireann to Galway. If you're looking for a more scenic route, consider taking the train from Dublin to Galway, which takes about 2 ½ hours. Irish Rail runs trips several times a day. Fares start at 16.99 euros (around $20) for adults when you book online. ", "U.S. citizens will need to show a valid passport upon arrival in Ireland. Passports must be valid for the duration of your stay, but validity for six months after your arrival date is recommended. Visas are not required for business or tourism trips, unless trips extend beyond three months. For more information on entry and exit requirements, visit the State Department's website. "]}