{"name": "San Jose", "description": ["San Jose has quietly gone about the business of developing and expanding to become larger in both size and population than its northern neighbor, San Francisco. This sprawling capital of Silicon Valley even skirts the misty overcast and rain that characterizes the Bay Area. On the surface, greater San Jose hosts cookie-cutter housing developments, tech company parks and commercial subdivisions that stretch along the city's main arteries. But San Jose is turning into more than just the playground of tech nerds. Look around downtown and you'll find a little character – sites like the San Jose Museum of Art displays pieces by California artists and The Tech Interactive features hands-on exhibits for the budding software engineer. Venues like the SAP Center (home of the San Jose Sharks, the city's NHL team) and California Theatre bring in world-class performers. And with a theme park and a trendy shopping street, California's original capital is shaping up to be fun for the whole family.", "The best time to visit San Jose is during its shoulder seasons from April to May or September to October. Winter offers budget-friendly escapes with festive cheer, while spring brings pleasant weather and fewer crowds. Summer festivals pair well with abundant sunshine, and fall ushers in cooler temperatures and outdoor adventures.", "Plan a road trip San Jose is close to the beaches of Santa Cruz (about 30 miles), the sights of San Francisco Bay Area (almost 50 miles), the luxuries of Monterey (around 70 miles) and the vineyards of Napa Valley (about 85 miles). Each place is less than a two-hour drive away.", "Sample the vino You might be outside of Napa, but you're still in one of California's prized wine-producing areas. If you have time, make your way to one of the local wineries, such as Testarossa Winery in Los Gatos or Mountain Winery in Saratoga.", "Use public transportation San Jose is a large city, but it is relatively easy to get around. The Santa Clara Valley Transportation Authority (VTA) operates a light rail system and buses. You can also rent bikes or scooters to get around.", "Rely on your own two feet Many of the city's top attractions, including the Tech Museum of Innovation, the Children's Discovery Museum and the Cathedral Basilica of St. Joseph, are located in downtown San Jose, making it easy to explore without racking up parking fees or taxi fares.", "Purchase theme park tickets online If you're planning a trip to California's Great America, buy your tickets online in advance. You could save as much as $20 per ticket.", "Stay outside the city center Since the downtown area is such a business hub, hotels tend to fill up quickly. For more options (and more reasonable rates), consider bedding down outside the city center.", "San Jose's dining scene has long been overshadowed by San Francisco, home of trendy restaurants and innovative chefs. And while it's true San Jose may not register on every foodie's list, the city does offer a distinct culinary landscape that serves as a reflection of its diverse population (a majority of which is Hispanic and Asian).", "If you're hoping to get acquainted with some of the city's local food vendors (or just need a quick, casual bite to eat), head to the San Pedro Square Market in downtown San Jose. The market features more than 20 vendors selling everything from coffee and pizza to home goods; plus indoor and outdoor seating is available. According to reviewers, this is a great place for groups since it offers a variety of options to suit different tastes.", "Because San Jose sees a high volume of business travelers, steakhouses (many of them chains) make up a large part of the dining scene. Favorites include The Grill on the Alley, LB Steak and Morton's. For a wider variety of menus, head to Santana Row, where Mexican, Italian, Asian and French flavors are well represented. And if you're celebrating a special occasion (or prepared to splurge), consider making a reservation at Le Papillon, one of the city's top French eateries. On the opposite end of the spectrum, cheap eats can be found near San Jose State University's campus, less than a mile east of downtown."]}