{"name": "Juneau", "description": ["Juneau is a pit stop for most travelers. Cruise ships pull into harbor, dump their passengers at the dock and allow them to wander around town for a few hours. However, the astute vacationer will see Alaska's capital city as a gateway to Mother Nature. While the seriously intrepid may venture to Glacier Bay National Park and Admiralty Island National Monument, less-experienced nature lovers will find incredible scenery right in Juneau's backyard at Mendenhall Glacier and Tracy Arm Fjord, which are easliy reached via the best Alaska tours. This small town (with only about 30,000 residents) is no longer fueled by mining, fur trading and whaling; outdoor enthusiasts are the economic driving forces here. And now, the citizens of Juneau brandish cheap souvenirs rather than hunting equipment. But don't take the bait: The best souvenirs will be the priceless photos you shoot with your own camera. Juneau's majestic setting leaves many in utter awe.", "The best time to visit Juneau is between May and August. You'll have to compete with hordes of cruise passengers at the area's top attractions, but the days will be long and sunny. Plus, these months correspond with whale migration season, meaning you're guaranteed to see some activity in the water. Many businesses and popular attractions close after the summer season, but if you're not afraid of the cold, a trip in the offseason (September through April) could save you a bundle on airfare, lodging and souvenirs. ", "A kitsch capital For such a small town, Juneau has a tremendous amount of cheap tourist shops clustered where the cruise ships dock. If you are looking for souvenirs, purchase them at stores that are not in the ships' shadows.", "Bring a jacket Alaska can be chilly, even in summer when highs hover in the mid-60s. Pack a jacket for the brisk evenings and hikes that take you to higher elevations.", "Sail on a small ship If you're seeing Juneau (and other parts of Alaska) by cruise ship, book your trip on a small ship. Big ships can't get you as close to glaciers and wildlife. You'll find plenty of cruise deals here.", "Plan your own excursion Cruise ship excursions are frequently overpriced and booked for the sake of convenience. But if you do a little legwork and preliminary research, you can save a lot of money by booking with a local tour operator.", "Take a free history lesson Pick up a free walking tour map from any visitors center and learn about the major locations that played a part in the history of Juneau.", "Skip the helicopter tour Seeing Juneau's stunning landscape from the air is breathtaking, but it's also the most expensive type of tour you can book. Plus, they're typically shorter than land-based tours.", "If Juneau is nothing more than a quick port stop, you may not have much time to experience the city's dining scene. But you should capitalize on this opportunity to enjoy a fresh meal off your cruise ship. Thanks to Juneau's location, fresh seafood and game meat are on the menus of most local eateries. Tracy's King Crab Shack is favorite for residents and visitors. As you might've guessed from the name, its menu is mostly devoted to locally caught Alaskan crab, so if you're hoping to sample a wider selection of local seafood and produce, head to SALT. Both the atmosphere and dishes here are upscale (think filet mignon, Alaskan halibut, scallop pasta), something recent diners appreciated. The Rookery Café is another Juneau eatery that prides itself on using local ingredients with a menu that changes three to four times each week.", "For a comprehensive crash course in Juneau's food scene, consider signing up for a Juneau Food Tour. The 2 ½-hour walking tour is guided by a local and includes samples at some of the city's best restaurants (including SALT and Tracy's King Crab Shack). During the tour, you'll have the chance to nosh on local favorites like Alaskan king crab, smoked salmon dip and Alaskan cod tacos.", "Juneau may be small, but its surrounding landscape packs a huge punch. And with the amount of hiking opportunities, visitors are continually stunned by its scenery."]}