{"name": "Bahamas", "description": ["The roughly 700 islands that make up the Bahamas lure millions of visitors to this paradise's white sandy shores, duty-free shops, fishing and scuba diving excursions and luxurious accommodations each year. Families that flock here tend to indulge in the diversions of Atlantis, Paradise Island and other mega resorts, but this diverse island chain also offers a range of activities away from the hotel zone. Nature enthusiasts can explore pristine protected areas like the Leon Levy Native Plant Preserve (on Eleuthera) and Lucayan National Park (on Grand Bahama Island) or take it easy at one of the country's many beaches or private islands. Meanwhile, history buffs can explore the ruins and artifacts from the colonial era and indigenous peoples like the Lucayan Indians. Plus, with cruise deals available year-round, it's no wonder why the Bahamas is such a popular vacation destination.", "The best time to visit the Bahamas is from mid-December to mid-April, the country's peak season. Though temperatures here are great year-round (they rarely dip below 60 degrees), the islands fall within the hurricane belt, so hurricanes may be a factor between June 1 and Nov. 30 (the Atlantic hurricane season). Most of these months (plus May) also fall within the region's rainy season, which can leave you with fewer days spent enjoying the islands' outdoor activities. But keep in mind that mid-December to mid-April's sublime weather attracts hordes of tourists, so prices will be at their highest and crowds at their thickest during these months.", "Eat Bahamian food Skip the expensive resort restaurants and head to local eateries for a more authentic experience. Don't miss out on the Johnny cakes, deep-fried conch fritters and Bahamian rock lobster.", "Consider visiting outside of peak season Resorts and hotels will be your biggest expense once you get to the islands. If you want to save up to 60% on your accommodations, consider visiting outside of winter. ", "Bahamians are friendly, warm and relaxed people. They’re known to be very welcoming and are happy to educate visitors about the islands. Many of the islands’ residents were descendants of West African slaves while some others emigrated here from England to escape the Puritan movement during the 16th century. It’s these two cultures that have shaped the larger Bahamian culture that exists today.", "Junkanoo is the yearly festival that celebrates Bahamaian culture to its fullest. Although the exact history of Junkanoo is unkown, rumor has it that a West African tribe chief wanted to hold an event to celebrate his people despite being under enslavement. The festival started out comparatively modest but has grown to include elaborate dance routines, lively music and colorful costumes. The main event takes place between the day after Christmas and New Year’s Day each year, but an additional celebration occurs every summer. To find out more about both Junkanoo festivals, check out our When to Visit.", "The Bahamian dollar’s value is equal to the U.S. dollar, and both currencies are widely accepted throughout the country. If you do decide to use the local currency, keep in mind that vendors will give you change in Bahamian dollars, not U.S. dollars. Most restaurants and bars automatically add gratuity of about 15% to bills, but if there is no gratuity fee, 15% is considered standard among all service workers. Like U.S. currency, credit cards are widely expected, however, the Bahamas tourism board suggests bringing some cash if you decide to explore the more remote Out Islands.", "Atlantis, Paradise Island, Sandals Emerald Bay and other upscale Bahamian hotels and resorts offer a number of restaurants, but these establishments don’t predominantly serve Bahamian fare, and dishes are often pricey. To eat well and like a resident you’ll have to venture outside the hotel district. The islands are renowned for their Johnny cakes (a sweet, cake-like bread) and peas and rice (a side dish that combines rice with pigeon peas), but seafood is prominent on most restaurant menus. Local staples include boiled and fried grouper; conch served in chowder, as a raw salad and in deep-fried fritters; and broiled and steamed rock lobster. Sweet treats like guava duff (a guava-filled pastry topped with rum or brandy butter sauce) and rum cake (a cake that is topped with a delectable rum sauce) are also available at many eateries.", "Visitors will find highly regarded restaurants on many Bahamian islands, but travelers say some of the country’s best cuisine is offered at casual pubs and bars on New Providence Island, Grand Bahama Island and Eleuthera. A few local favorites include Pirate Republic Brewing and The Bearded Clam Sports Bar in Nassau; Rum Runners Bar and Da Conch Man in Freeport and Budda Snack Shack and Sandbar Bar & Grill in Spanish Wells. For a more upscale experience, diners suggest checking out Nassau's Cafe Matisse and Freeport's Flying Fish.", "Various beers, wines and spirits are served throughout the Bahamas, but no visit would be complete without trying some of the country's rum. New Providence Island’s John Watling's Distillery is considered one of the country's best places to sample the liquor and learn more about the rum-making process. And unlike the U.S., the drinking age here is 18.", "The crime rate is high on many Bahamian islands, especially on New Providence, Paradise and Grand Bahama islands. Sexual assault and armed robberies have been reported in the \"Over the Hill\" area, which starts south of Shirley Street in downtown Nassau. These types of crimes, however, don't tend to occur in tourist areas, though sexual assaults have occured against tourists who have used Jet Ski operators on Paradise and New Providence islands. It's important to know that commercial reacreational watercraft, including tours, are not regularly regulated, so boats or water sports equipment may not be up-to-date. Regardless of where you will be staying on the island, it's still a good idea to keep your belongings safe, leave valuables in your hotel room and stay alert at all times. For more information about security concerns and safety tips for the Bahamas, visit the U.S. State Department's website.", "The best way to get around the Bahamas is by car, whether that’s a rental or taxi. If you’re staying at a big resort and plan to remain on-site for the majority of your trip, then taking a taxi to off-site attractions is more cost effective than shelling out money for a rental. (Rideshare apps like Uber and Lyft are not available in the Bahamas.) On the flipside, if you are looking to do a lot of sightseeing beyond your accommodations, renting a car will be more convenient and budget friendly. There is public transportation (jitney buses) available on some of the islands, but they have garnered a reputation of not being the most reliable, which could put a wrench in your plans, especially if you have a set itinerary for your trip.", "The islands' biggest airports are Nassau's Lynden Pindling International Airport (LPIA), Grand Bahama International Airport (FPO) and Exuma International Airport (GGT). If you are looking to travel between Bahamian islands, there are a handful of domestic airlines available that can service your inter-island needs. And in some Out Islands, you can also simply island hop by boat to get to your destination. ", "A valid passport and proof of your departure date are required for all citizens of the United States traveling to the Bahamas by air or sea. If you travel on a cruise that departs from and returns to a U.S. port, any Western Hemisphere Travel Initiative document (such as a passport card or a U.S. military identification card) is accepted as proof of identity. However, bringing a passport is strongly advised in case of an unforeseen emergency. You won't need a visa for stays lasting less than 90 days. To learn more about entry and exit requirements, visit the U.S. Department of State's website."]}