{"name": "Asheville, NC", "description": ["Quaint mountain town. Hipster haven. Beer City, USA. College town. Bluegrass mecca. Culinary destination. Try as you might, it's impossible to give Asheville just one label. Located in western North Carolina just off the Blue Ridge Parkway, the city is an unexpected gem, where a vibrant arts scene intertwines with Southern traditions and beautiful scenery. It's safe to say, no matter what your interests, Asheville has something to offer you.", "While history buffs get lost on the grounds of the Biltmore Estate, epicureans can sample from a culinary smorgasbord and tantalize their taste buds at one of the city's many breweries. Culture hounds can wander through the River Arts District while adventure seekers go full-throttle hiking, biking, zip lining or whitewater rafting in one of the numerous parks and forests. Asheville meshes these personalities together to make something uniquely its own, with an identity that is always evolving, but somehow stays true to its roots.", "The best times to visit Asheville are from April to June and September to early November, when temperatures hover between the upper 50s and the mid-70s – ideal weather for exploring the blooms in spring and the foliage in the fall. But with a temperate climate that doesn’t see much snow and rarely exceeds 90 degrees, there’s really not a bad time to visit Asheville. During the summer months, even an elevation of more than 2,000 feet can't shield the mountain city from the increased humidity. Luckily, it's not as intense as other parts of the Southeast, making the summer a popular time for travelers to escape the higher temps of nearby cities. Winter brings colder temperatures, but Asheville doesn't see much snowfall, although surrounding mountains could be snowcapped. ", "Pack layers Locals will tell you it’s possible to experience all four seasons in one day. In the spring, you can wake up to sweater weather and end the day twirling in a tank dress at the drum circle.", "Appoint a designated driver All those beer flights will leave you unable to drive. Either select a designated driver in your group or call a taxi, a car service or Uber.", "Consider a short-term rental Properties are popping up all over Asheville for about half the price of hotels. Find one close to downtown or immerse yourself in the natural surroundings with a rental that’s close to a good hike or two. The city is also chock full of one-of-a-kind bed-and-breakfasts.", "Foodies flock to Asheville for its award-winning, elevated Appalachian fare and soulful, slow-smoked barbecue. Over the past decade, chefs from all over the country have flocked to Asheville to stake their claim in the mountain town, with several of the top restaurants receiving recognition from the James Beard Awards and several publications, including Bon Appétit and Food & Wine. While you'll still find Southern staples like Carolina-style barbecue at places like 12 Bones Smokehouse, the culinary inspiration in a city with more than 100 independent restaurants spreads far and wide. You'll likely find locally sourced ingredients and menus that frequently change. ", "While there's no shortage of gastronomic offerings, Asheville is also proud of its Beer City USA reputation. Highland Brewing Company became the first city brewery to open its doors back in 1994. Since then, the number of local microbreweries has skyrocketed, and even attracted some big name brands like Sierra Nevada and New Belgium, both of which opened their East Coast brewing headquarters in the Asheville area.", "The best way to get around Asheville is by car. While the downtown area is compact enough for exploring on foot, you'll want your own set of wheels to reach the many nature trails and attractions outside of the city. Asheville also offers an affordable bus system, but arrival and departure times are infrequent. If you're not in the mood to drive, you can always call a taxi, Uber or Lyft. The city is served by the Asheville Regional Airport (AVL), servicing major carriers like American Airlines, United Airlines and Delta and offering nonstop flights from several hubs, such as Baltimore, Atlanta, New York and Chicago. The closest major airports are Greenville-Spartanburg International Airport (GSP) (65 miles south), Charlotte Douglas International Airport (CLT) to the east and McGhee Tyson Airport (TYS) in Knoxville, Tennessee, to the west (both about 125 miles away)."]}