{"name": "Bali", "description": ["Known as the \"Island of the Gods\" for its devotion to Hinduism – best seen in its many temples, scattered across the whole island – Bali is something of a heaven on earth. Smoking volcanoes wrapped in green canopies, sandy shores fading into turquoise waters and cascading waterfalls surrounded by jungle make up the landscape here, and it rarely disappoints.", "There's something for everyone in this lush, exotic paradise – from luxury travelers who come for the oceanfront resorts to adventurers looking to scale one of several volcanoes (including the famous Mount Batur, in Kintamani). In the south, resort towns such as Kuta, Seminyak, Canggu and Uluwatu boast buzzing nightlife, trendy beach clubs and world-class surfing, while the north offers plenty for culture vultures and those looking to see less touristy spots.", "The best time to visit Bali is between April and October, during the dry season, when you can expect warm, sunny days and low humidity. The offseason (from November to March) can be a great time to travel if you want to escape the crowds; downpours are often heavy but short-lived. Thanks to Bali's location close to the equator, in the southern hemisphere, daytime temperatures hover around the low 80s year-round, with only humidity and precipitation patterns changing. The lack of rain during the summer season makes Bali more comfortable for beachgoers.", "Check out remote neighbors The Gili Islands are about a 90-minute speedboat ride from Bali's east coast and offer pristine sands and zero traffic. There are no motorized vehicles, so you can cycle around on two wheels or hop on a horse and cart to explore.", "Know culinary favorites In southern Bali, seafood is king. In central Bali, the local specialty is babi guling, or suckling pig slow-roasted on an open fire. You'll also find nasi goreng (fried rice with chicken and egg), mie goreng (stir-fried noodles) and chicken sate (satay) with peanut sauce on almost every local menu.", "Nyepi is Bali's most important Hindu holiday Nyepi, or the \"Day of Silence\", marks the Balinese New Year, which falls in mid-March. On the day itself, everyone stays inside and is expected to remain silent. Businesses, schools, roads and the airport close for 24 hours. It's a magical, spiritual experience, with exuberant parades and festivities throughout the island in the days leading up to it.", "Book a local guest house Bali's luxury resorts and big-name brands can be pricey, but local guest houses and homestays often offer excellent value for money, so it's worth widening your search.", "Eat at warungs Bali has plenty in the way of fancy beach clubs and high-end restaurants (which still offer excellent value compared to the U.S.), but if you want to save a little more, look for warungs. These are small, family-owned cafes/restaurants that normally offer lower prices.", "As an island in Indonesia, the official (and dominant) language in Bali is Indonesian. However, you'll still hear Balinese (a Malayo-Polynesian language) being spoken by some locals. Because international tourism plays a key role in Bali's economy, English is widely spoken in larger towns and cities. That means you shouldn't have a problem getting around, buying souvenirs or ordering food.", "The currency in Bali is the Indonesian rupiah. Since the rupiah to U.S. dollar exchange rate fluctuates, be sure to check the current exchange rate before you go. For reference, $1 is equal to approximately 15,500 rupiahs.", "In terms of religion, Bali is unique among the Indonesian islands, which are mostly Islamic. Hinduism is the predominant religion in Bali. Most of the temples found here are sacred Hindu sites, so be respectful of the customs you'll witness, such as praying in pools of water. To get a sense for the island's unique religion, it's well worth visiting some of Bali's temples.", "Bali's cuisine scene is heavily Indonesian, with Chinese and Indian influences. Most dishes include rice, vegetables and meat or fish – and plenty of spice. Many meals feature base gede – a spice paste that usually consists of garlic, red chilies, nutmeg, turmeric, coriander, ginger, shrimp paste, coconut oil and bay leaves. There are several standout dishes that travelers should sample. Nasi goreng (fried rice with egg and chicken), mie goreng (fried noodles) and gado-gado (vegetables and tofu in peanut sauce) feature on almost every Indonesian menu. Order babi guling (turning pig) and you'll get a plate of tender roasted meat that's also crispy and caramelized. Bebek betutu is a spice-rubbed, slow-roasted duck often cooked in banana leaves. The satay (or sate) in Bali includes strips of chicken, pork, fish or tofu placed on skewers and grilled over a hot flame, usually served with peanut sauce.", "When it comes to restaurants, local warungs – family-run, affordable eateries – are the best places to find classic Indonesian dishes, while restaurants along the coast dish out casual meals with beautiful beach views. For upscale, international cuisine, there are plenty of great restaurants in and around the main resort areas – especially Ubud, Kuta, Seminyak, Canggu and Uluwatu. Expect everything from Japanese and Indian to Mexican and Italian, with prices at a fraction of what you'd pay back home.", "The best way to get around Bali is by hired car or scooter. Hiring a car and driver grants you the freedom of roaming around the island without the hassle of having to drive yourself. Traveling by scooter is also very popular – but take care on the busy roads, and be prepared to weave through chaotic traffic (especially around the southerly resort towns of Kuta, Canggu and Seminyak). Alternatively, car and scooter taxis are easy to come by and relatively cheap, especially in the south, and can be booked on the Grab or Gojek apps. If you're visiting neighboring islands such as Nusa Penida, Nusa Lembongan and the Gilis, there are speedboats and ferries from Bali ports including Sanur and Padangbai.", "Most travelers arrive through I Gusti Ngurah Rai International Airport (DPS), which is located between Kuta and Jimbaran on the island's southern tip. To reach your hotel, check in advance to see if there's a complimentary resort shuttle available. Some hotels also provide private transportation for a fee. If you plan to take a taxi, you'll prepay your fare at the airport's taxi counter. Fares range widely depending on your destination, but expect to pay around 120,000 to 150,000 rupiahs ($8 to $10) if you're going to Kuta or Seminyak and around 300,000 rupiahs (about $20) if you're going to Ubud.", "Your U.S. passport must be valid for at least six months from when you enter the country and have at least two blank passport pages. You need a visa to enter Indonesia; you can get a 30-day visitor visa on arrival at the airport in Bali for 500,000 rupiahs (around $32). The temporary visa applies to tourist and short business trips only. If you are coming to Indonesia for more than 30 days, you either need to apply for a special visa prior to arrival, or extend the visa once in the country (local agencies in the main resort towns can arrange this). For more information, check out the U.S. Department of State's website."]}