{"name": "Glacier National Park", "description": ["Named for the remnants of glaciers from the ice age, Glacier National Park is located on the border of Canada and Montana. It is often called the \"Crown of the Continent,\" because of its dizzying array of natural beauty. A favorite spot among hikers, the park features a variety of trails for all skill levels, ranging from the easy Trail of the Cedars (home to towering and beautiful cedars) to the challenging Grinnell Glacier (which offers sweeping views). What's more, the park boasts more than 700 lakes, numerous waterfalls and two mountain ranges, spread across more than 1 million acres that shelter a variety of wildlife. ", "Aside from its breathtaking geological features, it's also home to a fair amount of history. The Going-to-the-Sun Road – a scenic, 50-mile drive through the park – is a National Historic Landmark and an engineering marvel that offers spectacular views, as well as access to popular hiking trails. Plus, many of the park's lodges, chalets and hotels were constructed by the Great Northern Railway in the early 20th century and are on the National Register of Historic Places. Care to visit a UNESCO World Heritage Site? You'll find that here, too: the Waterton-Glacier International Peace Park.", "The best time to visit Glacier National Park is in July and August. This is the peak season for visitors, with daytime temperatures averaging in the low 80s and nighttime temps dipping into the 40s (pack layers, as well as a good rain jacket). You may even see snow in June and July in the higher elevations; the east side of the park tends to be cooler and windier than the west side. The east side is also drier, while the valleys in the west see most of the rainfall. Although lodging rates and entrance fees will be higher during peak season, most facilities will be open and the complimentary shuttle service will be running. You'll also experience fewer road and trail closures than in the fall, winter and spring months. The park is open 365 days a year.", "Pack smart for hiking Essential items for the trail include warm clothing, sturdy footwear, water, snacks and bear spray, which is sold at the park's camp stores or online.", "Stay away from wildlife Do not approach bears, mountain lions or any wild animals. Report bear or mountain lion sightings to the nearest ranger, visitor center or by calling the park hotline.", "Check for closures Roads, visitor centers and entire portions of the park often close during the winter season or during inclement weather, so check the park website before you head out.", "Fill up the tank Gas is not available anywhere in the park, or along the famous Going-to-the-Sun Road. However, you will find stations in towns just outside the park.", "Visit in the offseason Lodging prices and park entrance fees are at their highest during the peak summer season. Plan a winter trip (November to April) for the lowest rates. Vehicle entrance fees are valid for seven days and cost $35 (or $25 from November to April).", "Take advantage of fee-free days The National Park Service waives admission fees on select holidays and national park celebrations (such as the first day of National Park Week). Check the NPS website to see if any align with your trip.", "Rough it Campsite fees cost $10 to $23 per night for full-service campgrounds – a fraction of the nightly rate at nearby lodges and hotels. Glacier National Park offers 13 drive-in campgrounds, five camp stores and a variety of backcountry options.", "The developed areas of the park – Lake McDonald, Apgar, Many Glacier and Rising Sun – offer lodging and dining options, but visitors should always pack food and drinks, as these are not necessarily accessible from many of the park's roads and trails. Also note that restaurants are only open during peak season from late June through Labor Day. ", "Eddie's Café & Mercantile at Apgar offers breakfast, lunch and dinner, as well as an ice cream shop and a gift shop with camp supplies and souvenirs. The menu features classics like sandwiches and salads, alongside some regional favorites, including bison burgers, and the patio overlooks Lake McDonald. The Lake McDonald Lodge features three dining options: Russell's Fireside Dining Room offers breakfast, lunch and dinner, and both Lucke's Lounge and Jammer Joe's Grill & Pizzeria serve lunch and dinner. Try the elk burger at Russell's accompanied by a Montana craft brew. Lucke's also offers a traditional menu of soups, salads and sandwiches, while Jammer Joe's is a kid favorite, serving up pizza, sandwiches, soups, salads and an all-you-can-eat lunch buffet. ", "The Ptarmigan Dining Room at Many Glacier Hotel doesn't take reservations, but it's worth the wait to dine on locally sourced ingredients served in a continental fine dining style, set off by the panoramic lake views. The menu features seared duck breast and grilled salmon, as well as classics like Cobb salad and burgers. The hotel's Swiss Lounge offers light fare from lunch to late night: think Montana-style bar food from bison chili to sausage platters complete with pretzel chips. At the Rising Sun Motor Inn & Cabins, Two Dog Flats Grill dishes out American comfort food.", "Before you leave, you'll want to sample huckleberries, a staple Montana treat. These little berries are a cousin of blueberries, but are less sweet. At the shops in and around the park, you'll likely find a variety of huckleberry items like candies, syrups and preserves. Alternatively, several area restaurants have huckleberry on the menu as a sandwich spread or a drizzle on cheesecake. And if you're willing to take a drive, travelers say you can't go wrong with a huckleberry bear claw at Polebridge Mercantile in the North Fork area.", "As with most national parks, your primary safety concern has less to do with threats from your fellow travelers and more to do with the elements and wildlife. ", "Unless you're near a lodge or visitor center, you'll find very few facilities in the park. Plan to fill up the gas tank before you enter the park (there are no gas stations located within Glacier). You'll also want to carry a map (which you can find at any one of the visitor centers), as you cannot rely on cell service within the park. ", "Unless you are very familiar with the area, never hike or camp alone. Always carry plenty of food and water with you if you're hiking. Stay alert to avoid steep terrain and be especially careful near any of the park's lakes or streams. According to the National Park Service, water is the No. 1 cause of fatalities in the park. Wildlife, especially bears and mountain lions, can be another safety concern. Never approach animals, make plenty of noise when hiking, carry bear spray and secure your food and garbage. For more information on safety tips, consult the NPS website.", "The best way to get around Glacier National Park is by car or by using one of the park's shuttle services. If you're arriving by car, Highway 2 runs along the southern edge of the park, while Highway 89 offers access on the east side. Glacier Park International Airport (FCA), located about 25 miles south of the park and about 10 miles northeast of the city of Kalispell, is serviced by multiple airlines including Delta, United, Alaska and Allegiant. The airport offers rental cars from several major companies. There are also several shuttles and transport services that run from the airport."]}