{"name": "Lisbon", "description": ["Often overlooked for its popular European cousins, Lisbon specializes in lulling tourists into its laid-back charm. Perched atop seven hills, its alleyways wind between colorful, centuries-old buildings. Fanciful St. George's Castle peeks out to the skyline, lending an Old World-mystery to the burgeoning cosmopolitan city. And despite the modern sleek buildings that are slowly rising throughout the city, village life holds strong.", "But there's more to Lisbon than lazing about in coffee shops nibbling pastéis de nata (custard tarts) all day: From exploring the Fado clubs in Bairro Alto to taking in the view at the top of the Santa Justa Elevator; from laying out at the Cascais beaches to treasure hunting at the historic Feira da Ladra flea market; from gazing at the gargantuan displays at the Oceanarium to gorging on bacalhau (salted cod); Portugal's coastal capital is rich with opportunity.", "The best time to visit Lisbon is either from March to May or September to October, because the weather is still warm, hotel rates are cheaper and there are fewer crowds than in summer. In those seasons, you might also be able to squeeze in a few beach days. The summer sees hot temperatures and crowded shores. Winters in Lisbon are warm for Europe, with the lows dipping into the mid-40s.", "Prepare your greeting Lisboetas are known to be quite open, and they often greet people with a kiss on each cheek. But if you're feeling shy, offer your hand for a shake and they'll understand.", "Procrastinate on supper Meals are served later here than in northern Europe. Lunch typically starts after 1 p.m. and dinner after 8 p.m. Eating dinner at 7 p.m. is a sure way to meet only tourists.", "Lisbon is a workout The city is very hilly, making it not as easily walkable as its flatter, European counterparts like London or Paris. Even if you like walking, have a transportation backup plan just in case you tire out.", "Get a Lisboa Card These cards offer free use of all the city's public transport and free or reduced ticket prices to many of the major attractions. They can be purchased at tourist information outlets or on the Lisboa Card website for 24-, 48- and 72-hour increments.", "Stay in a pension A pensão (pension) is like a guest house, with separate rooms and sometimes an adjoining bathroom to share with your neighbors. Rates are more than reasonable, especially since guest houses are usually located close to the attractions without the pricey hotel rates.", "Sightsee on Sundays Museums and many other attractions, including the Belem Tower and Monastery of St. Jerome, are free the first Sunday of each month. Additionally, many museums are closed on Mondays, so keep that in mind when planning your itinerary.", "Lisbon is a popular travel destination, but it's far less overrun than European tourist meccas in Italy, France and neighboring Spain. This makes it easier to find yourself among residents – even in popular tourist neighborhoods. Your neighbor in the cafe is more likely to be reading a Diario de Noticias (a popular local newspaper) than a Lonely Planet guide. If you're comfortable speaking Portuguese or have at least packed a phrasebook, feel free to strike up a conversation or two. Those who do will quickly see the overall hospitality instilled within the Portuguese people, and find their kindness just as unique as any neighborhood or monument in the city.", "Lisboetas follow the Mediterranean clock: Meals are later than in northern Europe, but not necessarily as late as in Spain. Lunch typically starts after 1 p.m. and dinner after 8 p.m. Landing a 7 p.m. dinner reservation is a sure way to meet only tourists. The official currency is the euro (EUR). Since the euro to U.S. dollar exchange rate fluctuates, be sure to check what the current exchange rate is before you go. Major credit cards are accepted at most restaurants and shops. Like the rest of Europe, tipping isn't standard and depending on where you go, may yield strange looks. ", "Lisbon is among the easiest cities in Europe to find a good, affordable meal. This is true for breakfast, lunch, dinner and any meal in between – even in many tourist districts. If you're on a budget, it's possible to experience the best of traditional Portuguese food for less than 30 euros per day, per person. For a veritable smorgasbord of all the city's cuisines, head to Time Out Market. Located in the Mercado da Ribeira at Cais do Sodre, the food hall is filled to the brim with a variety of vendors selling everything from sushi to wine to Iberico ham. You'll encounter crowds anytime you go, but past visitors said it's worth it.", "Lisbon also has a cosmopolitan restaurant scene, and you can find just about any type of cuisine around town. For Portuguese haute cuisine accompanied by two Michelin stars, try Belcanto; for a family-run seafood joint, try Cervejaria Ramiro. The Portuguese have cultivated a rich seafood diet, and you can find fish and shellfish on most lunch and dinner menus. Bacalhau (salted cod) is an especially popular traditional Portuguese dish. But it's an acquired taste, so you might want to consider a backup option if you're not feeling adventurous.", "Another Lisbon specialty to try? Pasteis de nata. These tasty custard-filled pastries are everywhere in Lisbon. Eaten for breakfast, an afternoon snack, or both, pasteis de nata are full of sugar and satisfaction. The most famous ones can be found at the Pasteis de Belém  (in the district of the same name), which began selling them 200 years ago. Lisbon also has its own alcoholic drink – ginjinha – a fortified wine made with cherries and sugar. For short, you can call it \"ginja,\" and you should try it at the hole-in-the-wall A Ginjinha near the Rossio metro station.", "Discerning foodies in the know also rave about the city's Chinese food. Called Chinês clandestinos, these restaurants are mostly family-run outposts that are set up in the homes of local Chinese residents. You'll find them stowed within apartments in Mouraria, the city's immigrant enclave. Most don't have names and are only identifiable by their addresses. Keep your eyes peeled if you're in the area of Rua do Benformoso, Rua da Guia or and Rua do Capelão.", "When it comes to coffee, the Portuguese know how to enjoy it more than just about anyone else. Whether in the morning or afternoon, you can find Lisboetas packed into cafes. Don't assume cafes or \"coffee shops\" are necessarily limited to coffee, however: Affordable wine, beer, pastries and even full meals are available. It's pretty easy to find a beer for less than 1 euro, for example, even in some touristy cafes.", "Crime against tourists has gone beyond pickpocketing to violent muggings. Some also report the existence of violent gangs and lackadaisical police. Be on your guard when traveling at night, especially around some of the top attractions and in Lisbon's outskirts. You should also be wary of pulling money out of ATMs; if you can avoid it, refrain from visiting ATMs at night.", "Be wary of northern Lisbon at night, especially around Intendente and Martin Moniz. These areas are well-known for hosting a rougher crowd along with some brothels.", "The best way to get around Lisbon is on foot and by public transport. Your own two feet are a great way to see the sights – just keep in mind that climbing this city's hilly streets on foot can be quite the workout. For a change of pace (and to catch your breath), consider using buses, trams, the metro and elevators. One word of caution: Lisbon's Tram 28 and the Santa Justa Elevator double as attractions, so expect crowds. For a quicker journey, consider a taxi. Just know that during rush hour, you'll be sitting in your cab for a while thanks to all the traffic. Taxis are especially abundant at the Lisbon Portela Airport (LIS), located about 3 miles north of the downtown tourist districts. Rides between the airport and the city center generally cost 10 to 15 euros (about $12 to $19). There is also a subway station at the airport with a direct line to the city center. The Aeroporto – Saldanha line will transport you to downtown Lisbon in about 20 minutes.", "A passport with at least three months remaining validity is required for entry into Portugal. Tourists from the United States can stay for up to 90 days without a tourist visa. For more information on entry and exit requirements, visit the U.S. Department of State's website."]}