{"name": "Martinique", "description": ["Stunning beaches border tropical rainforests and towering cathedrals share skyline with an imposing volcano. Tourists and residents crowd the store-lined streets and restaurant-filled back alleys of Fort-de-France, while a few miles north, foliage dampens the sounds of bird tweets and hikers. In a word: Martinique. If you want to hit the beach one day then get the adrenaline pumping the next, you'll find that this island offers both – and does both well.", "Of course there's a catch. The fine dining, luxury resorts and impeccable sand don't come cheap. Vacations to the area are notoriously expensive, especially during the winter. And as an overseas region of France, Martinique's currency is the euro, so your U.S. dollars won't go as far. Still, this island has a storied history, a French-tinted cosmopolitan culture and a varied landscape unparalleled anywhere else in the Caribbean, so there's a good chance that your experience here will exceed your vacation budget.", "The best time to visit Martinique is in May. Temperatures stay consistent in the 80s throughout the year, but there is a chance of hurricanes in summer and fall. Planning a trip for late spring will ensure you squeeze your vacation in before the worst storms hit, and that you also avoid the crowds and marked-up prices of the island's peak season, from December to April.", "The major hurdle that visitors face when visiting this island is the language barrier. Martinique's official language is French, but many island residents speak Creole as well. Although it's possible to find English speakers in the tourist districts, you should bring a French dictionary or phrasebook; you'll be received more warmly if you attempt to speak the language.", "Martinique also falls under the French monetary system, making the euro (EUR) the island's official currency. Money can be exchanged at Change Caraïbes Bank, which can be found at either the Aimé Césaire International Airport or in the island's capital, Fort-de-France. Change Caraïbes banks offer better currency exchange rates than hotels.", "When it comes to tipping, all Martinique restaurants include a 15-percent service charge in the bill. But it is acceptable to add a bit more if the service was particularly good, especially if you plan to frequent the establishment.", "Visitors staying in all-inclusive resorts won't have to worry about finding a restaurant, but if you're on your own, you'll find the most popular restaurants in Fort-de-France. Food on Martinique is some of the best of the Caribbean, but it can be very expensive. Many restaurants offer a prix fixe tourist menu, which often includes several courses and a drink for about the price of one entrée off the regular menu.", "Martinique's cuisine is a rich fusion of French, African and Creole flavors with seafood taking the spotlight. Fishy favorites, such as conch, crab and lobster, have been given a French edge in creamy sauces and crispy gratins, accompanied by local sweet potatoes and plantain-like tubers. Travelers with a spicy palate should try a dash of chien sauce, made from onions, hot peppers, shallots, oil and vinegar.", "Mont Pelée doesn't erupt often (the last time reported was 1929), but when it does, the aftermath can be devastating. Travelers visiting an area with an active volcano should wear long pants and sleeves when in the vicinity, and avoid rivers or low-lying regions in the immediate area. Extremely brave tourists sometimes visit the village of Le Morne Rouge to climb the sides of Mont Pelée, but experts strongly recommend you take a guided tour instead. In the case of emergency, evacuate as guided by authorities.", "The best way to get around Martinique is in a car (either your rental or a cab). Even if you intend to spend most of your trip on the beach, you'll at least need to take a cab from Martinique Aimé Césaire International Airport (FDF) to either downtown Fort-de-France or the island's resort areas. Using a taxi for sightseeing, however, is a true budget crusher. Instead, rent a vehicle and begin exploring on your own. For a break from the driving, consider taking a pleasant vedette (ferry) ride between the east coast's marinas. ", "You can stay for up to 90 days in Martinique with a U.S. passport with six months validity and one blank passport page (extended stays require a visa), but you'll need to present your return flight ticket when you arrive on the island. For more information, visit the U.S. State Department's website."]}