{"name": "Des Moines", "description": ["For many travelers, Des Moines may register more as a conference location than a vacation hot spot. But Iowa's capital city – the fastest-growing metro region in the Midwest – deserves your consideration for your next family getaway. Though you may lured by some of the city's flashier neighbors to the east (namely, Chicago), you'll find that Des Moines offers many of the attractions and Midwestern charm at a fraction of the price.", "If year-round affordability doesn't intrigue you, perhaps some of the city's star attractions will. Not only is Des Moines home to a striking state capitol building, but it also boasts more than 800 miles of biking trails, nearly 20 breweries and one of the country's best farmers markets. While families spend their days marveling at the animals at the Blank Park Zoo or slipping down waterslides at Adventureland Resort, couples can sip local vino at area wineries, tour the $40 million sculpture park or peruse local boutiques in the city's East Village neighborhood.", "The best time to visit Des Moines is from June through August. Thanks to the summer season's warm temperatures that rest in the mid-80s, conditions are perfect for enjoying the city's outdoor pursuits like walks around Gray's Lake and bike rides along the High Trestle Trail. A fall visit is equally attractive thanks to an abundance of leaf-peeping opportunities, but as soon as the winter chill sets in come December, you'll likely spend little time outside. Similar to its Midwestern neighbors, Des Moines is slow to warm up in spring, with high temperatures ranging from the high 40s in March to the low 70s in May. No matter what time of year you visit, you'll enjoy affordable hotel and airfare prices.", "Sample local vino There are a number of wineries within a quick drive of downtown Des Moines, including Jasper Winery, Covered Bridges Winery and Summerset Winery.", "Walk or bike around downtown If you're planning to stick to the city center, you won't need a rental car to get around as most attractions are concentrated within the downtown core. If your feet need a break, make use of the city's bike-share program, Des Moines BCycle.", "Take a tour of the covered bridges Did you know that Madison County is the Covered Bridge Capital of Iowa? In fact, it boasts the largest group of covered bridges in one area in the western half of the Mississippi Valley. What's more, they inspired the 1992 novel \"The Bridges of Madison County.\" Find information on each bridge's location on the Madison County Chamber of Commerce website.", "Ride the D-Line This free shuttle runs a loop in the downtown area every 10 minutes on weekdays from 6:30 a.m. to 6 p.m. and on Saturdays from 10 a.m. to 5 p.m. From the shuttle's stops, you can easily walk to top attractions like the Iowa State Capitol and the John and Mary Pappajohn Sculpture Park, among others.", "Enjoy the freebies Several of the city's top attractions, including the Science Center of Iowa, the Pappajohn Sculpture Park and the Iowa State Capitol, are free to visit.", "For an escape to the tropics while in Des Moines, head to the conservatory at the Greater Des Moines Botanical Garden. At its highest point, the conservatory stands 80 feet tall and measures 150 feet wide."]}