{"name": "Kyoto", "description": ["Cherry blossom petals caught on a breeze, the burble of a water fountain permeating the silence of a peaceful rock garden, a pair of elegantly dressed geisha flitting between wooden tea houses ... Kyoto is the Japan of the past, the Japan of your imagination. Standing as Japan's capital from A.D. 794 to 1868, Kyoto has thrived as a hub for Japanese culture, art and education. Given the city's respect for its history, it's not surprising that millions of people visit Kyoto each year for a snapshot of imperial Japan.", "But no matter where you point your lens, modern-day Japan is sure to make it into the frame. Centuries-old Shinto shrines and pagodas share the city with the headquarters of companies like Nintendo and electronics manufacturer Kyocera. Kyoto's blend of ancient and contemporary makes it a vibrant city that certainly isn't stuck in the past.", "The best times to visit Kyoto are from March to May and from September to November when the weather is the mildest. However, the blooming cherry blossoms in spring and the vibrant fall foliage are big tourist draws, so be prepared for higher hotel rates and fewer vacancies. Crowds do wane a bit in the summer and winter, but June's sticky humidity and January's chilly temperatures are too uncomfortable for some travelers.", "Don't get \"templed out\" There are thousands of shrines and temples in Kyoto. To better appreciate their splendor, intersperse temple visits with other attractions so they don't all blend together.", "Consider a ryokan Ryokan, or traditional Japanese inns, can offer a more authentic experience than some of the high-end luxury hotels that dot the city. Though they be missing a few of the amenities and facilities common to western-style accommodations, they offer attentive service garden views and Japanese-style breakfast, among other perks.", "Travel in the winter You may miss out on spring's cherry blossoms and autumn's changing foliage, but a decline in hotel and flight rates might make up for it.", "Spring for a kaiseki lunch Kyoto's signature haute-cuisine, kaiseki, is a must-try, but it can cost a small fortune at night. Instead, follow the locals to a kaiseki restaurant at lunchtime for a set menu at a more manageable price.", "Walk! Public transportation costs in Kyoto can add up quickly, so bring a pair of comfortable shoes and plan to amble (or cycle). (Tetsugaku-no-michi, the Philosopher's Walk, in Higashiyama is especially pleasant for strolling.)", "Being the epicenter of Japan's cultural heritage, Kyoto is certainly geared toward tourists. However, that doesn't mean that the city is an amusement park – locals are still deeply rooted in customary Japanese etiquette and visitors should respect the rules. For example, you may be asked to remove your shoes or stow your umbrella upon entering a house, temple or shrine. Photography, eating and drinking are often prohibited within these structures, and it is polite to be silent while in a temple's vicinity.", "Photography is also a touchy subject when it comes to geisha in Gion. You can recognize geisha by their colorful traditional kimonos, elaborate hairstyles, white-painted faces and red lips. Remember that geisha are neither prostitutes (as many westerners believe) nor theme park mascots. These women are respected entertainers and keepers of ancient Japanese traditions. If you must photograph them, do so from a respectful distance or with explicit permission.", "The official language in Kyoto is Japanese. However, you might hear some people in Kyoto use the Kansai dialect, which is regarded as a more elegant and formal version of the language. It diverges from common Japanese in a few ways. For example, \"thank you,\" in the Kansai dialect is \"ookini,\" while in standard Japanese it's \"arigato.\" When meeting new people, it is customary to bow, though handshakes are becoming more commonplace. If you are visiting someone's home, Japanese custom dictates you should bring a gift (a small token from your home country is usually acceptable).", "Kyoto's official currency is Japanese yen (JPY). One American dollar (USD) equals about 110 yen (JPY), but you'll want to check the current exchange rate before you visit. And while your daily budget in Kyoto may have to be a little higher than in other cities, you won't have to worry about tipping, since it is not customary here.", "Kyoto is famous for its kaiseki ryori style of dining, a traditional and formal way of eating; shojin ryori, composed strictly of vegetarian dishes and inspired by the diet of Buddhist monks; obanzai (Kyoto home-style cooking); and other popular Japanese fare such as ramen, sushi and udon. And, as in any large city, there is a variety of international cuisines. For those looking to try a kaiseki meal, head to the Pontocho and Gion districts of Kyoto. Budget travelers beware: Traditional kaiseki dinners can be expensive. To enjoy a kaiseki meal without blowing your budget, consider a breakfast or lunch instead. Kaiseki restaurants often offer a sample of their dinner selections at half the price for breakfast or lunch.", "Tofu, a local Kyoto specialty, is a common ingredient in shojin ryori and can be found in many local restaurants. Look for yudofu, soft tofu simmered with vegetables in broth on menus, a very popular dish. Meanwhile, foodies shouldn't miss the Nishiki Market in central Kyoto to see and sample all sorts of local delicacies, including tsukemono (Japanese pickles), wagashi (Japanese confections) and plenty of fresh fish.", "While you're enjoying your meal, keep a few etiquette rules in mind: Never pass food with chopsticks or use them to point at things on the table; passing food with chopsticks is a big faux pas only reserved for funeral rituals. Equally rude: sticking your chopsticks vertically into a bowl of rice. If you're done with your chopsticks, simply place them sideways on your plate.", "The best way to get around Kyoto is by bus and on foot. The abundance of English-language signs and announcements make Kyoto's bus systems easy for visitors to navigate. But all those bus fares can add up, so put on some comfortable shoes and get ready to do some strolling as well. The city's subway can also come in handy, but its two lines don't have the breadth and scope of the bus system. Taxis are also a viable transportation option, especially at night.", "Most travelers fly into Osaka's Kansai International Airport (KIX), which is just 60 miles southwest of Kyoto. The fastest and most direct way to get from Kansai International Airport to Kyoto is to take the JR West Airport Express HARUKA train. The trip takes about 75 minutes and costs 3,600 yen (about $32). Alternatively, you can take MK Taxi's Skygate Shuttle from the airport to Kyoto for 4,200 yen (about $37) per person (just remember to book your shuttle at least two days in advance), however because it is a shared service, it can be more time-consuming than if you were to take the train."]}