{"name": "Buenos Aires", "description": ["Skirting the border of Argentina and Uruguay, Buenos Aires entices visitors with its blend of Creole, immigrant and heavily European-influenced culture. Featuring wide boulevards, neoclassical architecture and a cache of avant-garde museums, it's obvious why this city has the nickname \"the Paris of South America.\" A lesser-known nickname among tourists, but well-known among porteños (the city's residents) is la Ciudad de la Furia (the City of the Fury). This second nickname alludes to a city that has come out of a brutal dictatorship, dealt with hyperinflation and weathered political uncertainty; all of which made porteños resilient, highly creative and extremely family centered as a result. Get to know them by visiting Buenos Aires' colorful art-laden barrios (neighborhoods), its world-class fútbol (soccer) stadiums or stopping by one of the many cafes to have a conversation with a local over a café con leche (coffee with milk) and medialunas (croissant-like pastries). They won't mind. Porteños are very chatty.", "Get to know the city even more by attending a sultry show of tango, the dance this city birthed. Shop myriad antique shops and vintage clothing stores in San Telmo, where shopkeepers have as much personalities as their wares and meander through Recoleta Cemetery, a maze of stories mixed with marble art. Catch a horse race at the Palermo Hippodrome, and explore the National Museum of Fine Arts. Wander with your significant other through Palermo's Rose Garden Walk (Paseo del Rosedal), and, at least once on your trip, stay up all night drinking wine with a friend to truly tap into the late-night culture of Buenos Aires.", "The best time to visit Buenos Aires is from April to June (fall) or from September to November (spring). These sweet shoulder seasons usher in mild temperatures, thin crowds and colorful foliage. Fall and spring also boast reasonable hotel prices. During January and February – Buenos Aires' summertime and peak tourist season – crowds as well as hotel room rates start to swell. While this season remains a popular time to visit, temperatures often rise into the high 80s and a muggy heat hangs in the air. The offseason starts in June, then has a small high season in July before becoming offseason again in August. This time of the year is usually filled with rainy days, cold winter temps and fewer tourists (though Argentine winter school vacations bring a spate of national tourists for part of July).", "Don't expect tango sessions to start until 3 a.m. The nightlife here tends to start later (much later), so if you came to dance, you should schedule an afternoon nap. This is not the case for tango dinner shows though.", "Do leisurely sip your coffee Just as their European counterparts, Argentineans enjoy their time spent at cafes. Waiters will not rush you, and you can spend hours at a table.", "Do not pull money out of ATMs. ATMs can charge you the official rate, plus hefty service fees, while using credit or debit cards or withdrawing cash from Western Union will give you money at the Electronic Payment Market (MEP) rate, a preferential exchange rate that people with foreign cards can access (about double the official rate).", "Bring large bills to exchange. Go to a cueva (an unofficial exchange house) to get the blue dollar exchange rate, and bring $100 bills, as you will get a lower rate for smaller bills. \"Blue dollar\" is what the unofficial (or \"black market\") rate is called in Argentina. While it might sound seedy, this is a very common practice that many locals and tourists in-the-know utilize to get the best rate.", "Bring your savvy bargain-hunting skills Instead of hitting the racks of the upscale shopping districts in Recoleta, visit the eclectic secondhand stores in San Telmo (called feria americanas) for better deals and fun vintage finds. Carry bills, as many shops will give a 10% discount if you pay in cash.", "Bring your dancing shoes Instead of paying to watch a tango performance, check out one of the milongas (dance halls) where you can partake in classes or watch locals heat up the dance floor.", "Porteños (the Spanish term for Buenos Aires residents) can be both welcoming and blunt. Their European heritage (heightened by the influx of Italian, Spanish and other European immigrants who flocked to Argentina during the late 1800s and early 1900s) distinguishes porteños even from other Argentines, as well as other Latin American populations, like Brazilians. There are a few cultural cues you'll want to keep in mind. Spanish is the spoken language here, but rather than calling it español, Argentine's call it castellano, and speak with a distinctive \"sh\" sound when pronouncing \"y\"s and double \"l\"s. Luckily for English-speaking visitors, most porteños comprehend key English phrases and will try to communicate with Anglophone travelers (if you stay on their good side). Making an effort to speak the language by using simple phrases such as \"buen día\" (\"good morning\") and \"gracias\" (\"thank you\") will go a long way.", "Another traditional custom you'll pick up on is how locals greet one another. Instead of shaking hands, Argentines acknowledge each other with a kiss on the side of the cheek. Porteños also don't shy away from maintaining direct eye contact during conversation, and as a sign of respect, visitors should do the same. Some visitors find Argentines' intense gaze off-putting particularly when men stare at women as they walk past. Female travelers might also experience piropos (catcalls or vulgar, flirtatious comments). Should you find yourself in a situation where someone is giving you unwanted attention, ignore them and walk way.", "When heading out for a night on the town, know that meals and evening entertainment start later than in the United States. For an authentic experience, you won't want to sit down for dinner until about 10 p.m. When deciding on what to eat, you'll have your pick from Buenos Aires' many cuisines, including: creative micro gastronomy, pastas and pizzas, multiple kinds of steak perfectly cooked on parrillas (grills), and a world of pastries. During the day, savor a café con leche (coffee with milk) and medialunas (croissant-like pastries) at one of the city's European-style cafés or opt for a cold brew at one of its many specialty coffee shops. Note that it's customary to tip 10% in restaurants.", "Argentina uses the Argentine peso (ARS), which is much weaker than the United States dollar. Due to a complicated economic situation and governmental monetary controls, Argentina has parallel exchange rates. The Electronic Payment Market (MEP) rate is what you get if you use your Visa, Mastercard or American Express cards to pay for things in Argentina. The official rate is what you get for cash if you go to an official exchange house, and the blue rate is what you get for your cash, if you go to an unofficial exchange house. One U.S. dollar is equal to about 692 Argentine pesos at the MEP rate, 347 Argentine pesos at the official rate and 740 at the blue rate. Another way to access the MEP rate is to wire yourself money via a service like Western Union or Moneygram, then pick up the cash at a branch location in Buenos Aires. Keep in mind that because of the situation, exchange rates and prices for goods and services fluctuate wildly.", "Cuisine in Buenos Aires draws from the country's indigenous heritage, as well as creole and immigrant roots. Though Argentina's famous for its wine, mate, a highly-caffeinated loose-leaf tea drunk in a gourd with a filtered straw, is the true national beverage shared in homes, parks and sporting events. All kinds of meats – from choripans (sausage sandwiches) at an asadao (barbeque) to multiple kinds of steaks at parillas (steakhouses), and panchos (hot dogs) sold at kioscos – are being cooked at all hours of the day here. However, Buenos Aires has seen a boom of vegetarian and vegan offerings, from high-end restaurants experimenting with mushroom \"steaks\" to enterprising students selling vegan empanadas at street fairs.", "Argentines also love coffee, carbs and craft beer. Classic cafes with old school waiters can be found throughout the city, but specialty coffee shops, featuring single-origin beans and skilled baristas, are on the rise. Pizza, pasta and ham sandwiches are mainstays of the local diet – but don't expect any type of spice, as most porteños can't palate it. Craft beer bars are found throughout the city, but the food a visitor must try is dulce de leche, a spread made of caramelized milk used to make alfajores (cookie sandwiches), adorn cakes or (to be really Argentine) just eaten directly out of the jar with a spoon.", "The best way to get around Buenos Aires is by the subte (subway). The subte is quick, affordable and easy to navigate with maps, usually plastered on the wall of each subway carriage. Bus lines are also efficient, and easy to navigate via the apps Google Maps, Como Llego or Moovit. Ride-hail apps, like Uber and Cabify, are convenient to use in the city, as are taxis (which are often cheaper than ride-hailing). Look for black and yellow radio taxis, which are metered. With an efficient public transportation system, many ride-hailing options, and an abundance of taxis, there's no need to rent a car in Buenos Aires (especially as driving in the city is highly stressful).", "Buenos Aires' major airport, Ezeiza Ministro Pistarini (EZE), has many international carriers and sits 20 miles outside of the city center. There are several direct flights offered daily between major U.S. cities such as New York, Miami and Houston. Domestic flights often fly through Jorge Newberry Airport (AEP), which is located in the neighborhood of Palermo. While some visitors may opt to hop on a Tienda León bus (which runs roughly every hour between the city and both airports), taxis or ride-hailing apps are the most hassle-free means of getting into town.", "A valid passport is required for U.S. residents traveling to Buenos Aires. U.S. citizens do not need a visa, unless they plan on staying longer than 90 days. Visit the U.S. State Department's website for the latest information on entry and exit requirements."]}