{"name": "Orlando", "description": ["There's no other city in the United States – the world, even – that celebrates the spirit of childhood quite like Orlando, Florida. The feeling that you get when you catch the light off EPCOT's Spaceship Earth (found in Walt Disney World Resort, of course); or from your first sip of Butterbeer in Hogsmeade or Diagon Alley (located inside Universal Orlando Resort); or when you witness the soaring heights of Shamu's aerobatics (during the  Orca Encounter water show at SeaWorld Orlando) – all prove that being a kid is about your state of mind, not age. The notion that only young ones will enjoy this city's charms is just that – a notion. In reality, Orlando has a little of this and a little of that to appeal to all ages and there's more to do here than visit theme parks. The subtropical climate is great for golfing and the downtown city landscape is too attractive not to explore.", "The best time to visit Orlando is from March to May. That's the time of year you'll find the most pleasant weather (high 50s to high 80s most days) and agreeable prices on travel and lodging (excluding holiday weekends and school breaks). Likewise, September to mid-November offers comfortable temperatures and reasonable airfare and hotel rates; however, autumn makes up the most active part of Florida's hurricane season, which falls between June and November. Summertime is the worst season to plan a trip to the area – that's when the state's heat and humidity are borderline unbearable and hotels take advantage of the school break to drive up room rates. Prices are also at a premium between late November and February when families flock to the region to visit grandparents and celebrate the holidays.", "You'll need a water bottle You'd be surprised to learn how many people walk around all day in Orlando's parks without stopping to hydrate. Remember to drink plenty of water and while you're at it, regularly apply sunscreen.", "You'll need a rental car That is, unless you brought your own set of wheels to explore Orlando. The city's top things to do are spread out, so walking isn't an option and taking a taxi or Lyft everywhere quickly adds up.", "Visit in the fall It almost goes without saying that Orlando and Walt Disney World are the busiest during school recesses, so consider pulling your kids out of classes at the start of the school year to score lower rates.", "Bundle your fun If you're planning to spend a few days at Walt Disney World, remember that some of the resort's bundle deals include admission to one or several parks and meal plans.", "Buy combo tickets To save some money on attractions, upgrade to multipark or multiday tickets, which can be bought for reduced rates on sites like Reserve Direct Orlando and BestOfOrlando.com.", "Orlando's popularity with domestic and international tourists is reflected in its varied dining scene. Though American fast-food joints and restaurant chains are prevalent throughout the Greater Orlando area, everything from Japanese to Italian is served here. Popular American eateries include the Waldorf Astoria Orlando's Bull & Bear steakhouse and Eddie V's Prime Seafood, while Seito Sushi & New Japanese and NYPD Pizza are must-try locales for sushi and pizza. For a more upscale atmosphere, dine at Chatham's Place Restaurant or Disney's Grand Floridian Resort & Spa's Victoria & Albert's.", "Latin American fare is also noticeably present in Orlando. But unlike South Florida's cuisine, which features many Cuban dishes, Orlando's menus are more commonly filled with Puerto Rican staples like mofongo (fried and mashed green plantains with onion, garlic and olive oil topped with a protein like shrimp or pork), arroz con gandules (rice mixed with pigeon peas, pork and vegetables) and pastelón (a dish similar to lasagna that's made with mashed sweet plantains and ground beef). Other Latin American cuisines, such as Venezuelan and Spanish, are also represented on many restaurant menus. To sample some of Orlando's best Latin-inspired bites, check out Q'Kenan Restaurant, Melao Bakery and Padrino's Cuban Cuisine.", "If a stay at Universal Orlando Resort or Walt Disney World Resort is part of your Orlando visit, odds are you'll want to dine at Universal CityWalk or Disney Springs. These dining, shopping and entertainment complexes offer an array of cuisines, including Irish, Southern and Cuban. But meals served in both properties' eateries are pricey (for those who don't have resort dining plans), and tables are hard to come by, so finalize dining reservations well in advance for popular places like Antojitos Authentic Mexican Food, Morimoto Asia and The Boathouse.", "The best way to get around Orlando is with a car, but the best way to get around each theme park is on foot. Orlando's top things to do, as well as its hotels, sprawl across the city – not to mention the fact that Walt Disney World Resort is actually in two different cities, Bay Lake and Lake Buena Vista (just outside of Orlando proper). You can rent cars in Orlando, but you can also find them at Orlando International Airport (MCO). And if you're a guest at one of Disney's accommodations, MCO offers ground transportation services (i.e., bus, shuttle van, taxi and limousine) to get you to the Disney Resorts area. However, once you're inside a park, your own two feet are the best way to get from one ride to the next. And after a long day, Disney offers a host of free options for moving between the parks and hotels, including bus, monorail and ferry boat routes. Universal Orlando Resort's accommodations also offer complimentary bus and water taxi services to get around the property."]}