{"name": "Reno", "description": ["Las Vegas' dazzling lights have outshined its northwestern neighbor, \"The Biggest Little City in the World,\" for several decades. But Reno has evolved, offering its visitors a broader spectrum of entertainment than it did in the past, especially for nongambling travelers. Now, there's a lively arts scene lining the downtown area's Riverwalk, which boasts dozens of independently owned galleries, boutiques, restaurants and more. Reno has a burgeoning art scene with a museum featuring a permanent collection and rotating exhibits as well as numerous pieces of public art, including more than 100 outdoor murals in the Midtown area. Active travelers will want to book a stay at Whitney Peak Hotel, a boutique hotel that boasts the world's tallest artificial climbing wall (plus, it's a nonsmoking and nongambling establishment). And for those visiting with the environment in mind, several hotels have adopted eco-friendly initiatives, including one that uses geothermal energy produced on its property. The city is also a gateway to a range of outdoor activities. With the ski resorts of Lake Tahoe about 40 miles south and the hiking trails of the Sierra Nevada Mountains to the west and south, active travelers will find no shortage of heart-pumping activities. ", "But despite a citywide revitalization that's attracting tech startups and big data companies (take a stroll along Startup Row – on First Street between Virginia and Washington streets – to see what we mean), Reno remains first and foremost a gambler's destination. It can't compare to the glamour of Sin City, but Reno does offer a bevy of slot machines and table games, all-you-can-eat buffets, cabaret shows and more for those who come to test Lady Luck. ", "The best times to visit Reno are April to May and October to November. That's when you'll find pleasant weather and few crowds. But there's a reason why so many travelers head to Reno during the summer and winter: The city's proximity to the lake, beaches and ski slopes of Lake Tahoe make it an ideal place to explore the outdoors. No matter what season you decide to go, consider visiting during the week. On Fridays, Saturdays and Sundays throughout the year, hotels raise their prices and fill to the brim with weekend gamblers and visitors.", "It's still a gambling town Though new developments and a rebranding effort have distanced Reno from its sleazy past, the city remains true to its roots. You'll find most of its casinos concentrated downtown.", "It's a college town Aside from boasting a beautiful campus, the University of Nevada, Reno also provides a host of events for visitors, including Division I athletics and art exhibitions. The university hosts Reno's annual jazz festival.", "It's great for nature lovers The gorgeous landscapes of Lake Tahoe often overshadow Reno, but outdoor enthusiasts take note: the Biggest Little City features a few natural wonders of its own, including the Truckee River and Mount Rose.", "Rent wisely Only rent a car for the days you plan to spend outside the city. You can rely on public transportation while moving around town. Additionally, city buses have racks that can accommodate multiple bikes, and some shops in the city offer bike rentals.", "Set a budget One of the easiest ways to spend too much is to put too much faith in the cards while gambling. Establish your cut-off amount before you sit down to the table.", "Much like Vegas, Reno boasts plenty of all-you-can-eat buffets and upscale steakhouses, but it also offers some unique local eateries serving farm-fresh dishes. If you're craving a nice steak dinner, head to Atlantis Steakhouse at Atlantis Casino Resort Spa. It's one of the city's top-rated restaurants, along with the Bimini Steakhouse at Peppermill Casino.", "When you need a break from casino dining, locals and visitors suggest trying Wild River Grille, a contemporary restaurant on the Riverwalk known for its seafood, pasta and unique meat dishes such as elk medallions. Or, if you're in search of some healthy, light fare after too many steaks and buffets, head to Great Full Gardens. If its name didn't give it away, Great Full Gardens features a menu of healthy dishes, many that are gluten-free or vegan. Plus, many of the ingredients come from local farms, as well as the restaurant's own greenhouse. For sauces and soups made on-site and fare featuring fresh ingredients, consider the Stone House Cafe, which is situated in a 1900s stone house with a large outdoor patio.", "Another foodie area to consider exploring is the Midtown District. Thanks to the work of small business owners, this neighborhood just across the Truckee River from downtown Reno underwent a revitalization that welcomed in restaurants (try Two Chicks and Brothers Barbeque), microbreweries (Brasserie Saint James and Wonder Aleworks) and a sophisticated speakeasy specializing in rare whiskeys (Death and Taxes). The area is home to several Mexican restaurants (including El Adobe Café, Mari Chuy’s Mexican Kitchen and Si Amigos), among other lounges, eateries and coffee shops."]}