{"name": "Great Smoky Mountains National Park", "description": ["Great Smoky Mountains National Park spans both Tennessee and North Carolina, with the border running through the center of the 522,427-acre tract. The mountains have a long history of human settlers from the prehistoric Paleo Indians to 19th-century European settlers. Today, more than 10 million people visit the park each year to enjoy scenic drives to Cades Cove or along the Roaring Fork Motor Nature Trail and outdoor activities like hiking, biking and fishing. Pack a picnic for stunning hikes to Abrams or Rainbow Falls, or bike the Cades Cove Loop on Wednesdays between May and September when the road is closed to traffic. Explore the historic gristmill and Cable Mill at the Cades Cove Visitor Center or stop by Sugarlands Visitor Center to see wildlife exhibits, view a film about the park and pick up unique souvenirs at the gift shop.", "The best times to visit Great Smoky Mountains National Park are the summer (June, July and August) and the fall. July is the busiest month of the summer season while October weekends draw those in search of autumn foliage. Since the park has a diverse topography with elevations ranging from 875 feet to more than 6,000 feet, temperatures can vary by up to 20 degrees from the base to the mountaintop so pack layers and a rain jacket no matter what time of year you visit. Summer is hot with temperatures ranging from the mid-60s in the higher elevations to the high 80s in lower elevations. Winters in the higher elevations can see temps drop into the mid-30s, as well as road closures due to snow, although the lower elevations enjoy a more mild climate with winter temperatures in the 50s. Fall foliage displays usually begin in mid-September, when the summer crowds are gone and the lodging rates are low, making it a great time to visit. However, you'll see higher rates for crisp fall October weekends. Most of the annual snowfall occurs from January to March. Early spring (March to May) also sees fewer crowds and lower lodging rates. Although the park is open daily year-round, some visitor centers, campgrounds and historic attractions close during the winter months.", "Check for road and trail closures Roads and trails often close for inclement weather or bear sightings, so check the National Park Service website for updates.", "Do not approach or feed bears Always carry bear spray while hiking and if camping, follow the rules for keeping food and waste in bear-proof containers.", "The early bird gets the worm Many of the parking lots at the most popular trailheads fill up quickly, especially between the hours of 10 a.m. to 6 p.m., so try to go early in the morning or at off-peak times.", "Be prepared for limited facilities The visitor centers feature snack and beverage vending machines and the only accommodations in the park (aside from campgrounds) is a hike-in lodge atop Mount LeConte. The LeConte Lodge is open from mid-March through mid-November and advance reservations are required.", "Bring your own groceries Groceries, firewood, batteries and other supplies for camping are more expensive at the park's camp stores, so plan ahead and bring as many items as you can from home or visit a grocery store in a nearby town.", "There are no restaurants in the park itself, although the Cades Cove Campground Store has a snack bar that serves some breakfast items, sandwiches and wraps, soup, chili, pizza, soft serve ice cream and fountain drinks. The store also sells limited grocery and camping items. Vending machines are located at the Elkmont Campground, the Sugarlands and Oconaluftee visitor centers and at both riding stables. ", "On the Tennessee side of the park, shops, restaurants, gas stations and grocery stores are located in the nearby communities of Gatlinburg and Townsend, while on the North Carolina side of the park, visitors can find those services in Cherokee.", "The best way to get around Great Smoky Mountains National Park is by car. The park does not offer any guided tours and there is no public transportation to the park from the major cities in the area, so plan to bring your own vehicle. Bicycles are prohibited on all park trails, except the Gatlinburg Trail, the Oconaluftee River Trail and the lower Deep Creek Trail. ", "On the Tennessee side, the nearest airport – less than 25 miles northwest of the park – is McGhee Tyson (TYS) just south of Knoxville. In North Carolina, the closest airport is the Asheville Regional Airport (AVL), about 60 miles east of the Cherokee entrance. Both airports offer car rentals. There are three main entrances to the park, two in Tennessee (Gatlinburg and Townsend) and one in North Carolina (Cherokee)."]}