{"name": "Montreal", "description": ["Two words of friendly greeting capture the essence of Montréal: \"Bonjour, hi.\" When you hear them, you’ll know the person you’re meeting is bilingual, like most folks here. The people of Montréal are both fiercely proud of the city’s French heritage, culture and language, and welcoming to non-French-speaking visitors. The local architecture reflects a mix of the Old and New Worlds. Its unique skyline mingles 19th-century Beaux-Arts structures with 21st-century contemporary gems. Historic stone houses are now home to funky fusion restaurants. And languages from around the world can be heard on the street, along with the “rolled r” of native French speakers. Rainbow banners fly alongside Canada’s red and white maple leaf flag, while traditional French and Italian pastries are sold next door to distinctly sweet Montréal-style bagels. Just when you thought you'd seen it all, a short escalator ride takes you down to RÉSO, Montréal's huge Underground City.", "This versatile city's top attractions range from world-class museums to bustling outdoor marketplaces. Start your journey along the ancient cobblestone streets of Vieux-Montréal. Here, you can explore historic cathedrals or grab a cappuccino at one of the traditional French cafes along Rue Saint Paul. Head to Greene Avenue and Westmount Square for an afternoon of high-end shopping or hike up to Mount Royal Park for a boat ride. Just make sure to save some energy for the evening. Montréal – especially Saint-Laurent Boulevard between Mile End and the Plateau – has a lively nightlife scene that parties on until the wee hours of the morning.", "The best time to visit Montréal is from March to May and from September to November, when the weather is mild and hotel vacancies are plentiful. But aside from fluctuating accommodation rates, you'll discover that there really isn't a bad time to vacation here. Warm summer temperatures make exploring on foot enjoyable, while the heated Underground City makes walking downtown more pleasant during the winter. If you are drawn to the temperate summer months, make sure to book well in advance for the best rate: Montréal hosts numerous popular festivals during patio season.", "Montréal is bilingual Almost 80% of Montréalers speak both English and French, and almost 30% are trilingual, a higher percentage than you’ll find in any major Canadian city. Even so, you may find it handy to bring a phrasebook or download the Google Translate smartphone app for menu items or signage on your trip.", "Prepare for cold weather This city is no stranger to winter weather. Between December and March, temperatures range from an average low of 10 degrees Fahrenheit to a high, if you can call it that, of 24 degrees. The real issue is the high humidity and the biting wind that blows off the St. Lawrence River, which makes it feel much colder. Pack plenty of warm clothes and sturdy winter boots during winter months.", "Leave the car behind Although parking is cheap, gas prices are not. For the most part, the expansive public transportation system will get you where you need to go.", "Travel during the shoulder seasons Early spring and late fall are quieter times for Montréal, meaning hotels and restaurants are not as crowded, spring flowers are blooming or fall colors are at their best.", "Rely on your own two feet Montréal is a very walkable city, especially if you explore it by neighborhood. If your feet grow weary, public transportation is both convenient and cheap.", "Montréal is located in the French-speaking province of Quebec. Although you won't have any trouble finding English speakers here, you may want to come prepared with a few French phrases such as \"bonjour\" (hello), \"s'il vous plaît\" (please) and \"merci\" (thank you).", "The official currency in Canada is the Canadian dollar, which is roughly equal to $0.75 U.S. dollars. When it comes to most other cultural factors, including dress, restaurant and tipping etiquette, Montréal does not differ too greatly from major American cities.", "Like the French, Montréalers pride themselves on top-notch cuisine. Although the traditional French influence still reigns supreme, Montréal's dining scene has broadened over the past few years and Portuguese, Thai, Moroccan, Indian, Mexican and numerous other international dishes are now easy to find. Whether you're looking for steak frites or sushi, a taste of Paris or a little surprise of je ne sais quoi, Montréal has it all.", "If you're looking for Canadian staples, you'll find those available as well, including poutine (french fries topped with cheese curds and gravy), or warm maple syrup poured over ice and rolled up on a popsicle stick. Montréal-specific specialties include mile high smoked meat sandwiches (try Schwartz's) and sweet bagels boiled in honey infused water (which some say rival even those from New York City). Fairmount Bagel and St-Viateur Bagel Shop have been duking it out for the title of the city's best bagels for generations.", "If it's a bit of traditional French cuisine that you're craving, head to Vieux-Montréal, where many of the historic buildings now house French bistros and restaurants (restos). Italian restaurants and steak houses can be found on almost every corner here too. If you're looking for a more contemporary take on traditional favorites, try one of the upscale neighborhoods like the Golden Mile where chef-driven restaurants have become major foodie hubs over the past several years. For Greek, German, Mexican, Portuguese food and more, take a stroll through the Mile End neighborhood just north of Parc du Mont-Royal, home to a wide array of international eateries as well as some of the best pastry shops in town.", "Montréal is safer than most U.S. and European cities of similar size. But it's still necessary to exercise common sense, especially after sundown. Avoid walking alone at night and keep an eye on your valuables. Nightlife hot spots, such as Rue St-Denis and Rue Ste-Catherine, can sometimes draw rowdier crowds. Montréalers are generally very tolerating of all lifestyles and forms of discrimination are rare.  Political demonstrations do take place, but they are not frequent.", "The best way to get around Montréal is on foot. Montréal is a very walkable city, but if your feet grow weary, the Montréal Métro and bus are both cost-efficient and easy to use. If biking is more your style, pick up a public rental at BIXI racks around town.", "A public shuttle bus (No. 747) runs between downtown and the Montréal–Pierre Elliott Trudeau International Airport (YUL) 24 hours a day. There are two routes into the city. One drops visitors off downtown, making 11 stops along the way. The other is a straight shot to the Lionel-Groulx station, where you can hop on a métro train to your desired destination. Rides cost CA$11 (roughly $8) per person. You can also take a cab from the airport to downtown, which will cost CA$49.45 (around $36) before midnight and CA$56.70 (around $41) between midnight and 5 a.m.", "A passport is required for citizens of the United States to travel to Montréal, and to re-enter the country. If you are planning to drive, you must produce a passport, passport card or NEXUS card that allows expedited border crossings for both private and commercial travelers through Canadian and U.S. border controls. For more information, visit the U.S. State Department website."]}